{
    "0": {
        "link": "/wiki/James_Jackson_Hough",
        "title": "James Jackson Hough",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Gainesville",
        "county": "Sumter County",
        "paragraph": "James Jackson \"Jack\" Hough[pronunciation?] (July 19, 1945 – February 7, 2019) was an American businessman and philanthropist from Gainesville, Georgia.  He founded the company MSE Branded Foods and was its President and CEO for 23 years.[1]  Hough was successful in using the company to establish food courts at airports, colleges, and malls.[2]  Born in Decatur, Alabama, he had served in the U.S. Air Force. He received his bachelor's degree in accounting from University of Alabama.\nHough was shot to death in a pharmacy parking lot on February 7, 2019.[3]\nThis article about a philanthropic or charitable organization in the United States is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder"
        ]
    },
    "1": {
        "link": "/wiki/Gary_G._Yerkey",
        "title": "Gary G. Yerkey",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Chicago",
        "county": "Baldwin County",
        "paragraph": "\nGary G. Yerkey, born in Chicago, is an American author and journalist currently based in Washington, D.C., contributing to The Christian Science Monitor and other publications.[1][2][3]\nA graduate of Ripon College with B.A. in philosophy, he later undertook post-graduate work at the American University of Beirut and spent more than a decade in Europe and the Middle East, reporting for Time Life, ABC News, The Christian Science Monitor, the International Herald Tribune and other U.S. news organizations. He was also a staff reporter for Bloomberg BNA covering Congress and the Executive Branch. He has reported from India, Morocco, Malaysia, China, Singapore, Colombia, Canada, Poland, Latvia, Estonia and many other countries and has interviewed and written profiles of dozens of famous and not-so-famous individuals—from influential jazz drummer Art Taylor to civil rights movement icon John Lewis and award-winning Mexican poet and environmental activist Homero Aridjis.  He has also served in the United States Air Force and is a former pilot.\nIn 2015, he was among the \"foot soldiers\" of the civil rights movement who received the Congressional Gold Medal—the nation's highest civilian award—for their participation in the 1965 Selma to Montgomery marches, led by John Lewis and Martin Luther King Jr.[4]\n",
        "type": []
    },
    "2": {
        "link": "/wiki/Lynching_of_George_Meadows",
        "title": "Lynching of George Meadows",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Jefferson County",
        "county": "Jefferson County",
        "paragraph": "\nGeorge Meadows was an African American man who was lynched on January 15, 1889, in Jefferson County, Alabama, United States.[1]\nOn January 14, 1889, a white woman reported that she had been raped and her son killed by an African American man.[2] Over 400 white coal miners formed themselves into groups and brought several black men to the woman, who was unable to identify any of them as the alleged criminal. The next day, the miners brought Meadows, a new arrival to the area, and after a brief investigation, determined him to be guilty.[2] The woman begged the mob not to lynch Meadows, as she was unsure if he was the criminal, but the mob went forward with the lynching and killed him near the Pratt mines. Following his death, his body was shot multiple times and left in public view by an undertaker. Meadows was later buried in a paupers' grave in what is now Lane Park in Birmingham, Alabama.[3]\n",
        "type": [
            "murder",
            "rape",
            "lynching"
        ]
    },
    "3": {
        "link": "/wiki/Emantic_Fitzgerald_Bradford_Jr.",
        "title": "Killing of Emantic Fitzgerald Bradford Jr.",
        "date": "November 22, 2018 (2018-11-22)",
        "year": "2018",
        "location": "Riverchase Galleria, Hoover, Alabama",
        "state": "Alabama",
        "place": "Hoover",
        "county": "Jefferson County",
        "paragraph": "\nOn November 22, 2018, Emantic Fitzgerald Bradford Jr., an African-American man, was shot three times from behind and killed by Hoover police officer David Alexander on the night of Thanksgiving, at the Riverchase Galleria shopping mall in Hoover, Alabama.[2] Police responded to a shooting at the mall where two people were shot.[3]  Another African-American man suspected in the first shooting was arrested in Georgia a week later and charged in the shooting of one of those injured. Bradford was holding a legally owned weapon when shot and was not involved in the prior shooting incident, although near the crime scene.[4][5] The shooting of Bradford was immediately controversial, and was condemned by the Alabama National Association for the Advancement of Colored People (NAACP) as an example of racially biased policing.[6]\nEmantic \"EJ\" Fitzgerald Bradford Jr., of Hueytown, Alabama, was 21 years old. He was born on June 18, 1997.[1] He attended Holy Family Cristo Rey High School in Birmingham and earned his diploma through the General Educational Development (GED) program.[7] Bradford had enlisted in the U.S. Army in 2017 and completed basic training, and was on leave in August 2018 before completing advanced individual training.[8] Bradford worked full-time and was a caretaker for his father, a former correctional officer, with cancer.[9]\n",
        "type": [
            "shooting",
            "killing"
        ]
    },
    "4": {
        "link": "/wiki/Syd_Jones",
        "title": "Syd Jones",
        "date": "June 25, 1915Birmingham, Alabama, United States",
        "year": "1915",
        "location": "",
        "state": "Alabama",
        "place": "Monterey",
        "county": "Butler County",
        "paragraph": "Syd Jones (died June 25, 1915) was a self-confessed American serial killer who admitted to 13 murders in several states, starting from sometime in the 1900s and ending in 1914. He was executed for murdering a fellow convict, while serving a life sentence for another murder.[1]\nMuch of Jones' life, including his date of birth, remains a mystery. It is presumed that he was a native to Alabama, and that at one point he served for the 10th Cavalry Regiment.[2] While stationed in Monterey, California, he allegedly shot and killed one of his victims, a deputy sheriff named W. S. Moseley. Jones was given life imprisonment for a murder.[3]\nHe then proceeded to murder a fellow convict, most likely Cleave Waters, for which he was given the death penalty. On the day of his execution, he left a note in his cell, confessing to 13 murders and naming his victims as follows:[3]\n",
        "type": [
            "murder"
        ]
    },
    "5": {
        "link": "/wiki/Daniel_Lee_Siebert",
        "title": "Daniel Lee Siebert",
        "date": "April 22, 2008(2008-04-22) (aged 53) Holman Correctional Facility, Atmore, Alabama, U.S.",
        "year": "2008",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "Daniel Lee Siebert (June 17, 1954 – April 22, 2008) was an American serial killer  on Alabama's death row. He was convicted of three murders and confessed to at least five. During questioning he indicated that he was responsible for at least 12 deaths. Siebert died on April 22, 2008 in Holman Prison near Atmore of complications from cancer.[1]\nSiebert's first known killing took place in Las Vegas, Nevada. He was convicted of manslaughter.[2]\nSiebert was charged with the 1985 murders of two women in Los Angeles, California.[3]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "6": {
        "link": "/wiki/Alexander_Boyd_(county_solicitor)",
        "title": "Alexander Boyd (county solicitor)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Eutaw",
        "county": "Greene County",
        "paragraph": "Alexander Boyd (September 8, 1834 – March 31, 1870) was notable as the Republican County Solicitor and Register in Chancery of Greene County, Alabama in 1870 during Reconstruction who was murdered by a lynching party of Ku Klux Klan members. He was fatally shot on March 31, 1870 in Eutaw, the county seat. The Klan members apparently intended to hang him in the square in a public lynching, to demonstrate their power during this period and their threat to Republicans.[1]\nBoyd fiercely resisted their taking him from his hotel room. In the armed confrontation, he was shot and killed there. As was typical of most Klan attacks, his murderers were never brought to justice. That same night, prominent black Republican James Martin was shot and killed at his home in Union, Alabama, also in Greene County.[1]\nBoyd was born in South Carolina, and later lived in Alabama. He was among thousands of Klan victims who were killed or wounded in Alabama and other Southern states during the Reconstruction era. The Klan's primary targets were freedmen and free blacks from the North, but they also attacked and intimidated white Republican officeholders, teachers, and other freedman sympathizers.\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "7": {
        "link": "/wiki/Shooting_of_Bernard_Whitehurst",
        "title": "Shooting of Bernard Whitehurst",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Bernard Whitehurst, Jr. was shot in the back and killed on December 2, 1975 by Donald Foster, a Montgomery, Alabama police officer who said he thought Whitehurst was the suspect in the robbery of a neighborhood grocery store.[1][2][3] In a subsequent  cover-up, police officers planted a gun on him.[1][4] The initial police report said that Whitehurst fired a gun at the officers, and the police returned fire.[4] There was no autopsy and the body was quickly embalmed before the family was contacted;[5] the coroner relied on police reports that Whitehurst was killed by a bullet fired through the chest.[5]\nSix months later, after an investigation by the local newspaper and local attorney Donald Watkins raised questions about the facts of the case, the District Attorney ordered the body to be exhumed and an autopsy performed, which showed that Whitehurst had been shot in the back.[5] A perjury indictment was issued for three police officers.[4][5][6]\nEight police officers were forced to resign or were terminated.[4] No police officer was convicted of a crime.[4] The attempted cover-up led to the resignation of the mayor and the Director of Public Safety.\n",
        "type": [
            "robber",
            "robbery",
            "shooting"
        ]
    },
    "8": {
        "link": "/wiki/Raymond_Eugene_Brown",
        "title": "Raymond Eugene Brown",
        "date": "2008 (aged 61/62) Alabama, U.S.",
        "year": "2008",
        "location": "",
        "state": "Alabama",
        "place": "Ashland",
        "county": "Clay County",
        "paragraph": "Raymond Eugene Brown (January 11, 1946 – 2008) was an American serial killer and rapist who killed his live-in girlfriend and her daughter in 1987, shortly after being paroled for the triple murder of three relatives in 1960, when he was 14. He was sentenced to death for the latter murders, and died on death row in 2008.\nRaymond Eugene Brown was born on January 11, 1946, in Ashland, Alabama, one of four boys born to Marvin and Emma Lou Brown. According to relatives and friends, he had a normal upbringing and happy childhood, regularly visited church and did not exhibit any worrying behavior. Brown attended the Clay County High School in his hometown, where he played for the junior varsity football team.[1] He excelled in sports and was considered popular at school, with most acquaintances describing him in a positive manner.[2]\nOn the late evening of October 1, 1960, Brown broke into a home occupied by three relatives (31-year-old aunt Berta Mae Martin; 63-year-old grandmother Ethel Ogle and 82-year-old disabled great-grandmother Everlena Ogle) via an unlocked back door, with the aim of stealing money to buy himself some cleats.[1] While searching the house, he came across his aunt, who had awoken to investigate the noise coming from the kitchen. Upon being found out, Brown assaulted Martin and stabbed her a total of 123 times with a kitchen knife.[1]\n",
        "type": [
            "murder",
            "rape",
            "assault"
        ]
    },
    "9": {
        "link": "/wiki/Sheyann_Webb",
        "title": "Sheyann Webb",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "Sheyann Webb-Christburg (born February 17, 1956) is a civil rights activist known as Martin Luther King Jr.'s \"Smallest Freedom Fighter\" and co-author of the book Selma, Lord, Selma. As a nine-year-old, Webb took part in the first attempt at the Selma to Montgomery march across the Edmund Pettus Bridge on March 7, 1965, known as Bloody Sunday.\nWebb was born on February 17, 1956, in Selma, Alabama, to John and Betty Webb. She grew up in a family of eight children. As a child, she attended the segregated public schools of Dallas County, Alabama until she was one of the first black children to integrate an all-white school[1] where she was pushed down stairs, called derogatory names,  and spit on.\nIn January, 1965,[2] enticed by an uncommon scenario for Alabama in the 1960s, Webb and her friend Rachel West followed a group of both black and white people into Brown's Chapel AME Church and took part in their first civil rights meeting. Webb became passionate about this activism and began skipping school and sneaking out of her house at night to attend meetings and/or demonstrations,[1] despite her parents' warnings. She even brought home freedom fighters, like James Reeb, to stay at her house as an attempt to avoid being punished.[1]\n",
        "type": []
    },
    "10": {
        "link": "/wiki/1920_Alabama_coal_strike",
        "title": "1920 Alabama coal strike",
        "date": "September 7, 1920 – February, 1921",
        "year": "1920",
        "location": "Walker County, Alabama",
        "state": "Alabama",
        "place": "Walker County",
        "county": "Walker County",
        "paragraph": "John L. Lewis\nThomas Kilby\nThe 1920 Alabama coal strike, or the Alabama miners' strike,[1] was a statewide strike of the United Mine Workers of America against coal mine operators.  The strike was marked by racial violence, and ended in significant defeat for the union and organized labor in Alabama.[2]\n",
        "type": []
    },
    "11": {
        "link": "/wiki/Jimmy_%22Orion%22_Ellis",
        "title": "Jimmy \"Orion\" Ellis",
        "date": "December 12, 1998(1998-12-12) (aged 53) Selma, Alabama, United States",
        "year": "1998",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "James Hodges Ellis (born James Hughes Bell, February 26, 1945 – December 12, 1998), who used the stage name Orion at times in his career, was an American singer. His voice was similar to Elvis Presley's, a fact which he and his record company played upon, making some believe that some of his recordings were by Presley, or even that Presley had not died in 1977. Ellis appeared with many artists, including Loretta Lynn, Jerry Lee Lewis, Tammy Wynette, Ricky Skaggs, Lee Greenwood, Gary Morris, and the Oak Ridge Boys.\nEllis was born in either Pascagoula, Mississippi,[2] Orrville, Alabama,[3] or Washington, D.C.,[1] United States, into a single parent home. His birth certificate states the mother was a secretary named Gladys Bell, and the father was Vernon (no surname).[4] Aged two, he moved with his mother to Birmingham, Alabama, where he was put up for adoption and, aged four, was adopted by R. F. and Mary Faye (nee Hodges) Ellis.[1] He attended Orrville High School, where he excelled in baseball, football and basketball. After winning a state fair competition, his first professional performance was in a Demon's Den nightclub in Albany, Georgia. Ellis entered Middle Georgia College on an athletic scholarship, then transferred to Livingston State University.[1]\nAt the start of his music career, Ellis sang in nightclubs and, in 1964, released a single, \"Don’t Count Your Chickens Before They Hatch,\" for a small Georgia label, Dradco.[5] His vocals closely resembled those of Elvis Presley, and in 1969 Shelby Singleton, who had acquired the rights to Sun Records' back catalog, other than Presley's recordings for the label, released a single of Ellis' recordings of Presley's early songs, \"That's All Right (Mama)\" and \"Blue Moon of Kentucky\". The label credited the recordings simply to \"?\", and it was rumored that they were alternate takes from Presley sessions (despite featuring an electric rather than string bass).[3]\n",
        "type": []
    },
    "12": {
        "link": "/wiki/Jeremiah_Reeves",
        "title": "Jeremiah Reeves",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Jeremiah Reeves (1935 – March 28, 1958) was a 22-year-old African American, a former jazz drummer, who was unjustly executed by the state of Alabama by electrocution after being convicted of raping a white woman in 1952. At the time of the events, Reeves was 16 years old, working as a grocery delivery boy; at his trial, he denied having had sex with the white woman. His sentence and execution were considered unjust, outsize for the crime, and a large protest had formed by the time he was executed, after appeals.\nJeremiah Reeves was a 16-year-old respected senior in the segregated high school, a talented jazz drummer in a band. He was also working as a grocery delivery boy in Montgomery, Alabama when he was indicted in 1952 for the rape of a white woman.[1][2] He was indicted, then quickly convicted at a two-day trial by an all-white jury that deliberated less than a half-hour; the judge imposed a death sentence. Members of the African-American community were outraged at the sentence, as they knew that not only were white men seldom prosecuted for rape of black women, but they never received the death sentence for such crimes.\nAccording to the memoir by Rev. Martin Luther King Jr., he spent much time on the Reeves case. Black people were outraged by the injustice of the sentence in the case. Reeves retracted his confession, which was derived under duress. After his arrest, police strapped the terrified 16 year old Reeves to an electric chair and threatened to electrocute him unless he confessed to raping Mabel Ann Crowder as well as the reported rapes of white women that had occurred that summer.[3] He denied for the rest of his life having had any relations with the white woman.[2]\n",
        "type": [
            "rape"
        ]
    },
    "13": {
        "link": "/wiki/Rube_Burrow",
        "title": "Rube Burrow",
        "date": "October 9, 1890(1890-10-09) (aged 34) Linden, Alabama",
        "year": "1890",
        "location": "",
        "state": "Alabama",
        "place": "Linden",
        "county": "Marengo County",
        "paragraph": "Reuben Houston Burrow (December 11, 1855 – October 9, 1890), better known as Rube Burrow, was an infamous train-robber and outlaw in the Southern and Southwestern United States. During the final years of the American frontier, he became one of the most infamous and hunted men in the Old West since Jesse James. From 1886 to 1890, he and his gang robbed express trains in Alabama, Arkansas, Louisiana, the Indian Territory and Texas while pursued by hundreds of lawmen throughout the southern half of the United States, including the Pinkerton National Detective Agency.\nBorn in Lamar County, Alabama on December 11, 1855, Rube Burrow worked on the family farm in Alabama until the age of 18 when he moved to Stephenville, Texas to work on his uncle's ranch. By all accounts, Burrow fully intended to become a rancher by saving up enough money to buy a farm, marry and start a family.[1] He attempted farming but his wife, Virginia Catherine Alverson Burrow, died of yellow fever in 1881, leaving him to care for two small children. He remarried in 1884 and moved to Alexander, Texas, but when his crops failed he turned to robbing trains with his brother Jim in 1886.[2]\nHis unexpected turn to crime occurred on December 11, 1886 when he and his brother Jim teamed with W.L Brock, Leonard Brock, Henderson Brumley, and Nep Thornton[2] to rob the Denver & Fort Worth Express while returning from a trip to the Indian Territory. Burrow and the other men waited at the train depot at Bellevue, Texas until the train arrived. Drawing their guns at the crew, in full view of the passengers, they entered the train, but were only able to collect $300 (the Fort Worth Daily Gazette reported the loss of $100 and ten to fifteen watches[3]) as the passengers were able to hide most of their valuables by the time the outlaws passed through. In one of the cars, a U.S. Army sergeant of 24th Infantry Regiment (United States)[3] and two privates were escorting two deserters in shackles. The passengers were able to persuade the sergeant not to fire at the outlaws, however he was later censured for cowardice by his superiors following. Meanwhile, Burrow had already begun planning his next holdup.[1]\n",
        "type": [
            "robber"
        ]
    },
    "14": {
        "link": "/wiki/Spider_Martin",
        "title": "Spider Martin",
        "date": "April 8, 2003(2003-04-08) (aged 64) Blount Springs, Alabama",
        "year": "2003",
        "location": "",
        "state": "Alabama",
        "place": "Blount Springs",
        "county": "Blount County",
        "paragraph": "James \"Spider\" Martin (April 1, 1939 – April 8, 2003) was an American photographer known for his work documenting the American Civil Rights Movement in 1965, specifically Bloody Sunday and other incidents from the Selma to Montgomery marches.[1][2]\nMartin was born in Fairfield, Alabama. He was slightly built at 5 feet 2 inches (1.57 m) tall and 125 pounds (57 kg), and though he would climb trees and church towers to get a different angle for his photographs,[2] his nickname \"Spider\" dates back to his school days at Hueytown High, where a reporter described him as moving \"like a spider\" during one of his touchdown runs on the football field.[3]\nWhilst working as a photographer for The Birmingham News[4] he was assigned to cover the death of Jimmie Lee Jackson in February 1965;[3] one month later, he created a notable photograph of the civil rights era, entitled Two Minute Warning, during the 1965 Selma Voting Rights Movement.[5] His photograph showed Alabama state troopers about to attack the first peaceful Selma to Montgomery march with batons and tear gas just after it had crossed the Edmund Pettus Bridge from Selma into Dallas County on 7 March 1965.[6] Hosea Williams and John Lewis were leading the planned 54-mile (87 km) march to the Alabama State Capitol in protest at unfair treatment of African Americans and discriminatory voting rights practices.[2] The incident, known as Bloody Sunday, the media coverage of it and the national outcry that ensued, were influential in the course of civil rights in the U.S. Speaking about the effect of photography on the Civil Rights Movement, Martin Luther King Jr. said, \"Spider, we could have marched, we could have protested forever, but if it weren't for guys like you, it would have been for nothing. The whole world saw your pictures. That's why the Voting Rights Act was passed.\"[3][7]\n",
        "type": []
    },
    "15": {
        "link": "/wiki/Donald_Broadnax",
        "title": "Donald Broadnax",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nDonald Broadnax (born January 1, 1961)[1] is an American serial killer. Originally convicted and sentenced to 99 years imprisonment for fatally shooting a friend in Birmingham, Alabama in 1977, he was released on work release in 1996, whereupon he murdered his wife and her grandson. For the latter crime, Broadnax was convicted and sentenced to death, and is currently awaiting execution.\nIn August 1977, the 16-year-old Broadnax got into an argument with his friend, 19-year-old Gregory Manson, in the Elyton Village public housing community. In the midst of their scuffle, Broadnax pulled out a gun and fired six shots at Manson, who fell to the ground. After emptying out his clip, Broadnax reloaded and fired three more shots into Manson's body, before finally leaving the crime scene.[2] Approximately three months later, he was arrested and charged with first-degree murder. The following year, he was convicted and sentenced to 99 years imprisonment, with a chance of parole after serving several years.\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "16": {
        "link": "/wiki/James_Reeb",
        "title": "James Reeb",
        "date": "March 11, 1965(1965-03-11) (aged 38) Selma, Alabama, U.S.",
        "year": "1965",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "James Joseph Reeb (January 1, 1927 – March 11, 1965) was an American Unitarian Universalist minister, pastor, and activist during the civil rights movement in Washington, D.C. and Boston, Massachusetts. While participating in the Selma to Montgomery marches actions in Selma, Alabama, in 1965, he was murdered by white segregationists, dying of head injuries in the hospital two days after being severely beaten. Three men were tried for Reeb's murder but were acquitted by an all-white jury. His murder remains officially unsolved.\nReeb was born on January 1, 1927, in Wichita, Kansas, to Mae (Fox) and Harry Reeb.[1][2] He was raised in Kansas and Casper, Wyoming.[3]  He attended Natrona County High School and graduated in 1945, after which he joined the Army despite the fact that his commitment to the ministry made him exempt from service. After basic training, he was sent to Anchorage, Alaska, as a clerk typist for the headquarters of Special Troops. He was honorably discharged eighteen months later in December 1946 as Technical Sergeant, Third Class.[4] After his time in the Army, Reeb continued his schooling. Initially, he attended classes in his home town at Casper Junior College, before moving on to St. Olaf College, in 1947, where he received his A.B. cum laude in 1950.[5] He then entered Princeton Theological Seminary in Princeton, New Jersey,[6] where he earned his B.D. in 1953.[4] Three days later, Reeb was ordained a Presbyterian minister at the First Presbyterian Church of Casper.[7] After this he accepted a position at the Philadelphia General Hospital as Chaplain to Hospitals for the Philadelphia Presbyter. To become a more effective counselor, he went back to school, enrolling at Conwell School of Theology, where he earned an S.T.M. in Pastoral Counseling in 1955.[4]\nAs a scholar of theology, Reeb grew away from traditionalist Presbyterian teachings and was drawn to the Unitarian Universalist church.[7] In March 1957, he resigned his Presbyterian Chaplaincy and contacted the American Unitarian Association about transferring his fellowship from Presbyterian to Unitarian. Reeb appreciated the church's emphasis on social action,[8] and he became active in the civil rights movement during the 1960s.[3]\n",
        "type": [
            "murder"
        ]
    },
    "17": {
        "link": "/wiki/Abraham_Joshua_Heschel",
        "title": "Abraham Joshua Heschel",
        "date": "December 23, 1972(1972-12-23) (aged 65) New York City, New York, U.S.",
        "year": "1972",
        "location": "",
        "state": "",
        "place": "Warsaw",
        "county": "Sumter County",
        "paragraph": "\nAbraham Joshua Heschel (January 11, 1907 – December 23, 1972) was a Polish-born American rabbi and one of the leading Jewish theologians and Jewish philosophers of the 20th century. Heschel, a professor of Jewish mysticism at the Jewish Theological Seminary of America, authored a number of widely read books on Jewish philosophy and was a leader in the civil rights movement.[1][2]\nAbraham Joshua Heschel was born in Warsaw in 1907 as the youngest of six children of Moshe Mordechai Heschel and Reizel Perlow Heschel.[3] He was descended from preeminent European rabbis on both sides of his family.[4] His paternal great-great-grandfather and namesake was Rebbe Avraham Yehoshua Heshel of Apt in present-day Poland. His mother was also a descendant of Avraham Yehoshua Heshel and other Hasidic dynasties. His siblings were Sarah, Dvora Miriam, Esther Sima, Gittel, and Jacob. Their father Moshe died of influenza in 1916 when Abraham was nine. He was tutored by a Gerrer Hasid who introduced him to the thought of Rabbi Menachem Mendel of Kotzk.[5]\n",
        "type": []
    },
    "18": {
        "link": "/wiki/Selma_(film)",
        "title": "Selma (film)",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nSelma is a 2014 historical drama film directed by Ava DuVernay and written by Paul Webb. It is based on the 1965 Selma to Montgomery voting rights marches initiated and directed by James Bevel[5][6] and led by Martin Luther King Jr., Hosea Williams, and John Lewis. The film stars actors David Oyelowo as King, Tom Wilkinson as President Lyndon B. Johnson, Tim Roth as George Wallace, Carmen Ejogo as Coretta Scott King, and Common as Bevel.\nSelma premiered at the American Film Institute Festival on November 11, 2014, began a limited US release on December 25, and expanded into wide theatrical release on January 9, 2015, two months before the 50th anniversary of the march. The film was re-released on March 20, 2015 in honor of the 50th anniversary of the historical march.\n",
        "type": []
    },
    "19": {
        "link": "/wiki/Maples_v._Thomas",
        "title": "Maples v. Thomas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "Maples v. Thomas, 565 U.S. 266 (2012), is a United States Supreme Court ruling in which the Court ruled 7–2 that Cory R. Maples, who had been convicted of murdering two people and faced a possible death sentence, should get another opportunity in court because his lawyers at Sullivan & Cromwell had abandoned him.[1]\nJustices Antonin Scalia and Clarence Thomas dissented from the Court's holding, arguing that the procedural default shouldn't be excused.\nIn 1997 Cory Maples was convicted of murder in Alabama and sentenced to death. Alabama does not provide death row inmates with lawyers to appeal their convictions and sentences so they must rely on pro bono lawyers to represent them.  Two lawyers from the New York law firm of Sullivan & Cromwell agreed to represent Maples free of charge. Those lawyers later quit the law firm and when the Alabama court sent copies of a ruling in Maples' case to the firm's mail room, the law firm returned the copies unopened. The law firm never notified the court or the mail room that new lawyers had taken over the case.  Because this information was never received the deadline for appeal was missed.\n",
        "type": [
            "murder"
        ]
    },
    "20": {
        "link": "/wiki/Doyle_Hamm",
        "title": "Doyle Hamm",
        "date": "November 28, 2021(2021-11-28) (aged 64) Holman Correctional Facility, Atmore, Alabama, U.S.",
        "year": "2021",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "Doyle Lee Hamm (February 14, 1957 – November 28, 2021) was an American death row inmate in Alabama, who was convicted and sentenced to death for the 1987 murder of Patrick Cunningham, whom he killed while committing a robbery. While on death row, Hamm developed lymphatic cancer, which made it difficult to impossible to achieve the venous access necessary to administer the drugs used in lethal injections. Despite months of warning by Hamm's attorney and human rights observers and a decades' long legal battle, the Alabama Department of Corrections attempted to execute Hamm on February 22, 2018. The unsuccessful execution attempt lasted nearly three hours and drew international attention. In March 2018, Hamm and the state of Alabama reached a confidential settlement, the terms of which precluded a second execution attempt, giving Hamm a de facto sentence of life in prison without the possibility of parole, although his sentence was not formally commuted. Hamm remained in prison until his death from cancer-related complications in 2021.\nHamm was born on February 14, 1957,[1] and grew up in northwest Alabama and was the tenth of twelve children.[2] While he was growing up, Hamm's father and each of his six older brothers spent time in jail.[2] In an interview, one of Hamm's sisters described their childhood home as “constant hell all the time” and recalled that her father told his children that “If you don’t go out and steal, then you’re not a Hamm.”[2] From an early age, Hamm struggled in school. Tests and report cards indicated that, in the fifth grade, Hamm was still reading at a first-grade level.[2] Hamm dropped out of school during the ninth grade and began abusing drugs and alcohol.[2]\nAt the age of twenty, Hamm was arrested and charged with robbery after a drunken fight in a bar parking lot. Hamm entered a guilty plea and was sentenced to five years in prison.[2] Years later, the alleged victim confessed that no robbery had ever taken place and Hamm's court-appointed attorney admitted that he had been “too busy and overworked to give this case the time and attention it needed.”[2] Hamm was arrested other times for burglary, assault, and grand larceny.\n",
        "type": [
            "assault",
            "robbery",
            "burglary",
            "murder",
            "robber"
        ]
    },
    "21": {
        "link": "/wiki/Walter_Hill_(serial_killer)",
        "title": "Walter Hill (serial killer)",
        "date": "May 2, 1997(1997-05-02) (aged 62) Holman Correctional Facility, Atmore, Alabama, U.S.",
        "year": "1997",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "Walter Hill (February 7, 1935 – May 2, 1997) was an American serial killer who killed five people between 1952 and 1977. He was convicted of capital murder, sentenced to death, and executed at Holman Correctional Facility in Alabama in 1997.\nHill claimed to be a native of Jamaica, but court records indicate that he was born in Midway, Alabama.[1] He was born on February 7, 1935.[2][3]\nIn 1952, Hill, then 17, beat a man named Sam Atmore to death with a board in Adamsville, Alabama.[1] He pleaded guilty to second degree murder and was sentenced to 10 years in prison. Hill was sent to Atmore State Prison Farm.[4][5] Shortly before he was transferred, Hill escaped from jail, but was quickly recaptured.[6]\n",
        "type": [
            "murder"
        ]
    },
    "22": {
        "link": "/wiki/Shonelle_Jackson",
        "title": "Shonelle Jackson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Shonelle Andre Jackson (born May 30, 1978)[1] is an American prison inmate currently on Alabama's death row. In 1997, at the age of 19, Jackson was arrested for the murder of Lefrick Moore that occurred during the commission of a robbery in Montgomery, Alabama.[2]  During the investigation, Jackson initially told detectives that he did not know the three other co-defendants, and was not present at the time of the murder. Montgomery Police Detective Andrew Signore, having learned from the other defendants that just before the murder, Jackson had purchased a soft drink from a local drive-thru, informed him that his fingerprints were found on a Dairy Queen cup located inside the victim's stolen vehicle.  At the time, Detective Signore did not know if any latent fingerprints had been discovered on the cup but advanced this deception to encourage Jackson to admit to knowing the other defendants and being present with them at some point during the night of the murder.  Jackson then admitted that he knew the other defendants and had been with them earlier in the day before the murder.  He then asked to amend his statement a third time to admit he was present at the time of the murder and was armed with a .380 handgun.[3] Following a jury trial, he was found guilty of capital murder. In sentencing Jackson, the presiding judge, William Gordon, overrode the jury's unanimous recommendation of a life sentence and instead imposed the death sentence. Judicial override of a jury's sentencing recommendation is permitted under Alabama law. Later, in a sworn deposition, juror Jan Burkes expressed uncertainty that Jackson, one of four defendants charged with this crime, fired the shot that killed Moore.[4][5]\n\nThis United States biographical article related to crime is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder",
            "robbery",
            "robber"
        ]
    },
    "23": {
        "link": "/wiki/How_Long,_Not_Long",
        "title": "How Long, Not Long",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "\"How Long, Not Long\" is the popular name given to the public speech delivered by Martin Luther King Jr. on the steps of the State Capitol in Montgomery, Alabama. Martin Luther King Jr. delivered this speech after the completion of the Selma to Montgomery March on March 25, 1965.[1] The speech is also known as \"Our God Is Marching On!\"[2]\n\nThis civil rights movement–related article is a stub. You can help Wikipedia by expanding it.",
        "type": []
    },
    "24": {
        "link": "/wiki/Jim_Letherer",
        "title": "Jim Letherer",
        "date": "December 18, 2001(2001-12-18) (aged 67) Saginaw, Michigan",
        "year": "2001",
        "location": "",
        "state": "Alabama",
        "place": "Saginaw",
        "county": "Shelby County",
        "paragraph": "James M. Letherer (December 30, 1933 – December 18, 2001), born and died in Saginaw, Michigan,[1][2] better known as Jim Letherer, was an American civil rights activist.[3][4]  He walked on crutches the entire 54 miles of the 1965 Selma to Montgomery march for voting rights, and in 1966 walked with Martin Luther King Jr. in James Meredith's Mississippi March Against Fear.[3][5] Letherer lost his right leg to cancer when he was ten years old.[6][7] Letherer has received honors by the Selma to Montgomery Interpretive Center Museum in Alabama, which hosts a life-size statue of him.\nWith a big heart and a tenacious spirit, he trooped with King and fellow marchers in many a Deep South protest despite not having his right leg from birth. During the 1965 Selma to Montgomery march, Letherer – who used crutches – helped keep spirits high by unswervingly shouting out cadence for his remaining leg, by chanting, \"Left, left, left!\"[8] He received mention and a verse in a book by Pete Seeger:\n",
        "type": []
    },
    "25": {
        "link": "/wiki/Powell_v._Alabama",
        "title": "Powell v. Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Scottsboro",
        "county": "Jackson County",
        "paragraph": "Powell v. Alabama, 287 U.S. 45 (1932), was a landmark United States Supreme Court decision in which the Court reversed the convictions of nine young black men for allegedly raping two white women on a freight train near Scottsboro, Alabama. The majority of the Court reasoned that the right to retain and be represented by a lawyer was fundamental to a fair trial and that at least in some circumstances, the trial judge must inform a defendant of this right. In addition, if the defendant cannot afford a lawyer, the court must appoint one sufficiently far in advance of trial to permit the lawyer to prepare adequately for the trial.\nPowell was the first time the Court had reversed a state criminal conviction for a violation of a criminal procedural provision of the United States Bill of Rights.[1] In effect, it held that the Fourteenth Amendment Due Process Clause included at least part of the right to counsel referred to in the Sixth Amendment, making that much of the Bill of Rights binding on the states. Before Powell, the Court had reversed state criminal convictions only for racial discrimination in jury selection — a practice that violated the Equal Protection Clause of the Fourteenth Amendment.[1]\nIn March 1931, nine black men—Charlie Weems, Ozie Powell, Clarence Norris, Olen Montgomery, Willie Roberson, Haywood Patterson, Andrew (Andy) Wright, Leroy (Roy) Wright and Eugene Williams, later known as the Scottsboro Boys—were accused of raping two young white women, Ruby Bates and Victoria Price.\n",
        "type": []
    },
    "26": {
        "link": "/wiki/Birmingham_riot_of_1963",
        "title": "Birmingham riot of 1963",
        "date": "May 11, 1963",
        "year": "1963",
        "location": "Birmingham, Alabama, United States",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nEvents\nCity of Birmingham\n",
        "type": [
            "riot"
        ]
    },
    "27": {
        "link": "/wiki/C._T._Vivian",
        "title": "C. T. Vivian",
        "date": "July 17, 2020(2020-07-17) (aged 95) Atlanta, Georgia, U.S.",
        "year": "2020",
        "location": "",
        "state": "",
        "place": "Atlanta",
        "county": "Montgomery County",
        "paragraph": "\nCordy Tindell Vivian (July 30, 1924 – July 17, 2020) was an American minister, author, and close friend and lieutenant of Martin Luther King Jr. during the civil rights movement.[1] Vivian resided in Atlanta, Georgia, and founded the C. T. Vivian Leadership Institute, Inc. He was a member of the Alpha Phi Alpha fraternity.[2]\nSenator Barack Obama, speaking at Selma's Brown Chapel on the March 2007, anniversary of the 1965 Selma to Montgomery marches, referred to Vivian in his opening remarks in the words of Martin L. King Jr. as \"the greatest preacher to ever live.\"[3]\n",
        "type": []
    },
    "28": {
        "link": "/wiki/List_of_people_executed_in_Alabama",
        "title": "List of people executed in Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "\nThe following is a list of people executed by the U.S. state of Alabama since 1983. All of the 70 people (69 men and 1 woman) have been executed at the Holman Correctional Facility, near Atmore, Alabama. All executions since December 2002 have been by lethal injection. In 2021, the Alabama Department of Corrections announced it had constructed a facility at Holman to carry out executions by means of nitrogen hypoxia.[1]\nPrior to 1983, an 18-year moratorium on executions was observed under the direction of the Supreme Court of the United States. Alabama previously executed 153 people between 1927 and 1965.[2]\n",
        "type": []
    },
    "29": {
        "link": "/wiki/Capital_punishment_in_Alabama",
        "title": "Capital punishment in Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "\nCapital punishment in Alabama is a legal penalty. The state has the highest per capita capital sentencing rate in the United States. In some years, its courts impose more death sentences than Texas, a state that has a population five times as large.[1] However, Texas has a higher rate of executions both in absolute terms and per capita.[2]\nWhen the prosecution seeks the death penalty, the sentence is decided by the jury and at least 10 jurors must concur.\n",
        "type": []
    },
    "30": {
        "link": "/wiki/William_E._Donaldson_Correctional_Facility",
        "title": "William E. Donaldson Correctional Facility",
        "date": "",
        "year": "",
        "location": "Bessemer, Alabama",
        "state": "Alabama",
        "place": "Bessemer",
        "county": "Jefferson County",
        "paragraph": "William E. Donaldson Correctional Facility is an Alabama Department of Corrections prison for men located in unincorporated Jefferson County, Alabama, near Bessemer.[1] It came to national prominence after the Casey White prison escape.\nThe prison opened as the West Jefferson Correctional Facility in 1982.[1] On January 12, 1990, corrections officer William E. Donaldson was stabbed and killed by an inmate. The prison was later renamed in honor of officer Donaldson.[citation needed] Originally the prison had a capacity for 700 inmates in dormitory housing and 16 inmates in individual prison cells; the capacity increased as expansions opened.[1]\nIn 1996, according to Joe Hopper, the commissioner of the Alabama Department of Corrections, the system's prison guard shortage was the most acute at Donaldson during that year. In that year the prison housed around 1,400 prisoners, with 207 prison guards watching them.[2]\n",
        "type": []
    },
    "31": {
        "link": "/wiki/Joseph_Ellwanger",
        "title": "Joseph Ellwanger",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nJoseph W. Ellwanger Jr. (born February 18, 1934) is a Lutheran pastor, author, and civil rights activist. He was a key figure in the Civil Rights Movement in Birmingham, Alabama, and the only white religious leader included in strategy meetings with Martin Luther King Jr.[1]\nBorn in 1934, Ellwanger spent part of his childhood in Selma, Alabama, where his father was a pastor and president of Alabama Lutheran Academy and College. Ellwanger graduated from Concordia Seminary in St. Louis, Missouri.[2]\n",
        "type": []
    },
    "32": {
        "link": "/wiki/Bobby_Frank_Cherry",
        "title": "Bobby Frank Cherry",
        "date": "November 18, 2004(2004-11-18) (aged 74) Kilby Correctional Facility, Mt. Meigs, Alabama, U.S.",
        "year": "2004",
        "location": "",
        "state": "Alabama",
        "place": "Mt. Meigs",
        "county": "Montgomery County",
        "paragraph": "Bobby Frank Cherry (June 20, 1930 – November 18, 2004) was an American white supremacist, terrorist, and Klansman who was convicted of murder in 2002 for his role in the 16th Street Baptist Church bombing in 1963. The bombing killed four young African-American girls (Carole Robertson, Cynthia Wesley, Addie Mae Collins, and Denise McNair) and injured more than 20 other people.\nBobby Frank Cherry was born on June 20, 1930, in Mineral Springs, a neighborhood of Clanton, Alabama. He was born on the same day as Thomas Edwin Blanton Jr., but 8 years earlier. He joined the United States Marine Corps as a youth, where he gained expertise in demolitions and working with explosives. After his time with the Marines, Cherry worked a series of low-paying jobs, including a long stint as a truck driver.\nCherry had a wife, Virginia, at the time of the bombing. He and Virginia Cherry had seven children together. Their marriage was tumultuous and, at times, violent.[1] Bobby Cherry expected deference from his wife and children, using beatings to enforce his authority.[1] Virginia Cherry died of cancer in 1968. After her death, Bobby Cherry placed the children in the Gateway Mercy Home Orphanage and with relatives. He eventually remarried four times, including to third wife Willadean Brogdon; Brogdon would later testify at Cherry's trial that he had bragged about his role in the church bombing.\n",
        "type": [
            "murder",
            "mass murder",
            "terrorist"
        ]
    },
    "33": {
        "link": "/wiki/Valhermoso_Springs_shooting",
        "title": "Valhermoso Springs, Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Valhermoso Springs",
        "county": "Morgan County",
        "paragraph": "Valhermoso Springs is an unincorporated community in Morgan County, Alabama, United States. Valhermoso Springs is located on Alabama State Route 36, 6.7 miles (10.8 km) east-northeast of Somerville.[2] Valhermoso Springs has a post office with ZIP code 35775.[3]\nOn June 4, 2020, police received 9-1-1 calls about shots being fired at Talucah Road. Upon responding, they found a house on fire. When the flames were extinguished, the bodies of three females, four males, and a dog were discovered; all of them had suffered gunshot wounds. Police announced the incident was a targeted attack, and by the next day, all seven victims were identified.[4][5] On June 22, two suspects, John Michael Legg, 19, and Frederic Allen Rogers, 22, were arrested in a silver Dodge Charger in Stayton, Oregon, 15 miles (24 km) southeast of Salem, during a traffic stop, and both face capital murder charges. Legg and Rogers were allegedly motivated by an internal dispute in a club in which they and three of the victims were members.[6][7]\n\n",
        "type": [
            "murder"
        ]
    },
    "34": {
        "link": "/wiki/Dallas_County_Voters_League",
        "title": "Dallas County Voters League",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Dallas County",
        "county": "Dallas County",
        "paragraph": "\nThe Dallas County Voters League (DCVL) was a local organization in Dallas County, Alabama, which contains the city of Selma, that sought to register black voters during the late 1950s and early 1960s.[1]\nThe organization was founded in the 1920s by Charles J. Adams, a postal service employee and civil rights organizer who was also the local representative of the NAACP.[2][3] After he moved to Detroit, he was replaced by Sam Boynton, the husband of Amelia Boynton.[3]\n",
        "type": []
    },
    "35": {
        "link": "/wiki/2013_Alabama_bunker_hostage_crisis",
        "title": "2013 Alabama bunker hostage crisis",
        "date": "January 29, 2013 – February 4, 2013 c. 3:30 p.m.[1] – 3:12 p.m. (CST)",
        "year": "2013",
        "location": "Midland City, Alabama, U.S.",
        "state": "Alabama",
        "place": "Midland City",
        "county": "Dale County",
        "paragraph": "\nOn January 29, 2013, a hostage crisis, lasting almost seven days, began in the Wiregrass Region near U.S. Highway 231 in Midland City, Alabama. Jimmy Lee Dykes, a 65-year-old Vietnam War-era veteran, boarded a Dale County school bus, killed the driver, and took a five-year-old boy hostage. On the afternoon of February 4, law enforcement agents entered the bunker, killed Dykes, and rescued the child.[3]\nJust after 3:30 p.m.,[1] Dykes boarded a Dale County school bus that was stopped in Midland City and told the driver that he wanted to take two children, six and eight years old, both boys,[4] from the bus. The school bus driver, 66-year-old Charles Albert Poland, Jr., refused to let him take the children and challenged Dykes to shoot him.[4] He blocked access to the aisle of the bus while Dykes continued to argue with him.\n",
        "type": [
            "murder"
        ]
    },
    "36": {
        "link": "/wiki/Lynching_of_Jim_McMillan",
        "title": "Lynching of Jim McMillan",
        "date": "June 18, 1919Bibb County, Alabama",
        "year": "1919",
        "location": "",
        "state": "Alabama",
        "place": "Bibb County",
        "county": "Bibb County",
        "paragraph": "Jim McMillan was lynched in Bibb County, Alabama on June 18, 1919.\nRacial tension in the Woodstock and Green Pond communities of Bibb County, Alabama worsened over the summer of 1919. Individuals terrorized the black community in southern Bibb County, around Woodstock.[1] The events culminated in a white mob seizing Jim McMillan and taking him into the Alabama bush. He was forced onto a stump and the mob shot him to death.[2][3][4][5]\nSheriff R. H. Wood arrested four Bibb County farmers in response to the lynching: J. Blankenshlp, James D. Oglesby, Elisha Green and Tom Russell. They were charged with murder and held in jail in Centreville, Alabama.[2] A special grand jury was summoned by B. F. Miller.[2] on June 23, 1919.[6] [4] [5]\n",
        "type": [
            "murder",
            "riot",
            "lynching"
        ]
    },
    "37": {
        "link": "/wiki/Will_Reynolds",
        "title": "Will Reynolds",
        "date": "April 6, 1902",
        "year": "1902",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "William Reynolds was an American mass murderer who shot nine people, seven of them fatally, in Tuscumbia, Alabama, United States on April 6, 1902, before being shot dead himself.[1][2][3][4][5][6][7]\nPolice arrived at Reynolds' home in Tuscumbia's black neighborhood to arrest him on a charge of obtaining property under false pretenses. According to the Richmond Planet, Reynolds opened fire immediately on the sheriff and deputy who came to the door, killing both. He barricaded himself in the house and a posse was assembled. In the ensuing gun battle, Reynolds killed seven more white men.[8] After four hours, the posse set fire to the house in which he was barricaded and, in attempting to escape, Reynolds was shot to death.[9] A total of three houses were burned down.[8]\nWith the sheriff and five deputies of the Colbert County Sheriff's Department among those killed, this was the deadliest incident in Alabama law enforcement history.[10]\n",
        "type": [
            "murder",
            "mass murder",
            "killing"
        ]
    },
    "38": {
        "link": "/wiki/Shooting_of_Johnny_Robinson",
        "title": "Shooting of Johnny Robinson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "Johnny Robinson (1947–1963) was a young African-American teenager who, at age 16, was shot and killed by a police officer in the unrest following the 16th Street Baptist Church bombing in Birmingham, Alabama. Robinson and several others were allegedly throwing rocks at a car draped with a Confederate flag. A Birmingham police officer, Jack Parker, who was riding in the back seat of a police car, shot and killed Robinson. Parker was never indicted for the killing and claimed that he had only fired a warning shot, and that a stray pellet must have killed Robinson.[1]\nJohnny Robinson was born in 1947 and had a difficult upbringing in Birmingham, as the city had seen 50 racially driven bombings from 1945 to 1963. He was the oldest of three children and attended the Alberta Shields School. A few years prior to his death, Robinson's father was murdered by a neighbor, leaving his mother alone to raise her children in a city fraught with racial violence.[2] Robinson had a juvenile record. At 13 years old he was arrested on suspicion of burglary and grand larceny.[3]\nEarly on Sunday morning, September 15, 1963, a Ku Klux Klan member placed a bomb with a timing device under the side steps of the 16th Street Baptist Church, which had served as the headquarters for the Birmingham Children's Crusade during April and early May.[4] Two hundred worshipers were expected in the church that day and after the bomb detonated in the late morning, three 14-year-old girls and an 11-year-old girl were found killed, with twenty-two wounded. The incident prompted civil unrest that was further provoked by the shooting deaths of two young black men that day: 16-year-old Johnny Robinson, and 13-year-old Virgil Ware.\n",
        "type": [
            "rape",
            "burglary",
            "killing",
            "murder",
            "shooting"
        ]
    },
    "39": {
        "link": "/wiki/Madison_v._Alabama",
        "title": "Madison v. Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Madison",
        "county": "Madison County",
        "paragraph": "Madison v. Alabama, 586 U.S. ___ (2019), was a United States Supreme Court case regarding the Eighth Amendment to the United States Constitution, barring cruel and unusual punishment. The case deals with whether the Eighth Amendment prohibits executing a person for a crime they do not remember.\nVernon Madison (August 22, 1950 – February 22, 2020)[1] shot police officer Julius Schulte twice in the back of the head in Mobile, Alabama in April 1985. Schulte was mediating a domestic disturbance between Madison and his ex-girlfriend; Madison also shot and injured her. Madison was an inmate at Holman Correctional Facility from September 1985 up until his death on February 22, 2020[2][3][4][5]\nThree trials were held, as the convictions from the first two were overturned: the first because prosecutors unconstitutionally excluded black people from the jury and the second because they introduced evidence improperly. In the third trial, the jury decided on a sentence of life in prison, but the judge Ferrill McRae[6] overruled them and gave Madison a sentence of death in 1994.[2][4]\n",
        "type": []
    },
    "40": {
        "link": "/wiki/Thomas_Haughey",
        "title": "Thomas Haughey",
        "date": "August 5, 1869(1869-08-05) (aged 42–43) Courtland, Alabama, U.S.",
        "year": "1869",
        "location": "",
        "state": "Alabama",
        "place": "Courtland",
        "county": "Lawrence County",
        "paragraph": "Thomas Haughey (1826 – August 5, 1869) was a U.S. Representative from Alabama.\nBorn in Glasgow, Scotland, Haughey received a limited education. He immigrated with his father to the United States, where they settled in New York City. In 1841, he moved to Jefferson County, Alabama. While teaching in St. Clair County, he studied medicine. Haughey attended New Orleans Medical College and graduated as both a physician and surgeon in 1858, starting a medical practice in Elyton.\nDuring the onset of the Civil War, Haughey was against both war and secession and was sympathetic to the North and the plight of slaves. He did not hide his views and joined the Union League, but soon fled to Kentucky due to threats to his safety. Once there, he joined the Union Army's 3rd Regiment Tennessee Volunteer Infantry as a surgeon, serving from January 1862 to his honorable discharge on February 23, 1865 when the regiment was mustered out.\n",
        "type": [
            "murder"
        ]
    },
    "41": {
        "link": "/wiki/Jim_Clark_(sheriff)",
        "title": "Jim Clark (sheriff)",
        "date": "June 4, 2007(2007-06-04) (aged 84) Elba, Alabama, U.S.",
        "year": "2007",
        "location": "",
        "state": "Alabama",
        "place": "Elba",
        "county": "Coffee County",
        "paragraph": "\nJames Gardner Clark, Jr. (September 17, 1922 – June 4, 2007)[1] was the sheriff of Dallas County, Alabama, United States from 1955 to 1966. He was one of the officials responsible for the violent arrests of civil rights protestors during the Selma to Montgomery marches of 1965, and is remembered as a racist whose brutal tactics included using cattle prods against unarmed civil rights supporters.[2][3]\nJim Clark was born in Alabama, the son of Ettie Lee and James Gardner Clark.[4][5] He served with the U.S. Army Air Force in the Aleutian Islands during World War II. Clark was a cattle rancher when his lifelong friend, Alabama Governor Jim Folsom, appointed him as sheriff in 1955.[1] He married and later divorced Louise Clark, with whom he had five children, Jimmy Clark, Jeff Clark, Johnny Clark, Joanna Clark Miller and Jan Clark Buster .[4]\n",
        "type": []
    },
    "42": {
        "link": "/wiki/Brian_Baldwin",
        "title": "Brian Baldwin",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Charlotte",
        "county": "Mobile County",
        "paragraph": "Brian Keith Baldwin (July 16, 1958 – June 18, 1999)[1] was an African-American man from Charlotte, North Carolina, United States of America, who was executed in 1999 in Alabama. Many believe that he was wrongfully convicted and sentenced for the 1977 murder of a young white woman in Monroe County of that state. The only evidence against Baldwin in the murder was his own confession, which he later retracted. He said that it was coerced by the local police in Wilcox County, Alabama, where he was arrested; they beat and tortured him under interrogation.[2] A 1985 letter by his co-defendant Edward Dean Horsley surfaced in 1996, after Horsley had been executed for first-degree murder in the case. He wrote that he had acted alone in the rape and murder of Naomi Rolon, and that Baldwin had not known of her death.\nDeath penalty opponents regard this case as one in which racial bias contributed to the wrongful conviction by an all-white jury of an 18-year-old black man, in a county that was 46% black in population. Further, they believe he was executed despite evidence that he did not commit Rolon's murder.[3] The appeals process was marked by conflicts of interest, as the presiding judge at Baldwin's trial also ruled on the appeals, against common practice. Before Baldwin's execution in 1999, leading political and religious figures petitioned Governor Don Siegelman for clemency on his behalf. Siegelman refused, saying that although he was \"deeply troubled by some of the matters raised,\" he wrote \"this matter does not rise to a level that warrants clemency.\"[4]\nBrian Keith Baldwin was born in Charlotte, North Carolina in 1958.[1][5] As a teenager, he got into trouble with the law. In March 1977 he was serving time in a juvenile facility in western North Carolina for stealing a car.[4] On March 12, at age 18, he escaped with Edward Dean Horsley, Jr (known as Ed Dean, August 25, 1957 – February 16, 1996),[1] then age 19, who had been convicted of armed robbery, a felony during which a police officer was shot.[4]\n",
        "type": [
            "robbery",
            "rape",
            "torture",
            "murder",
            "robber"
        ]
    },
    "43": {
        "link": "/wiki/Greg_Gunn",
        "title": "Killing of Greg Gunn",
        "date": "February 25, 2016 (2016-02-25)",
        "year": "2016",
        "location": "Montgomery, Alabama, US",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "\nThe killing of Greg Gunn occurred on the morning of February 25, 2016, in Montgomery, Alabama. Gunn, a 58-year-old African-American man,[1] was shot and killed near his home after fleeing from a stop-and-frisk initiated by Aaron Cody Smith, a white police officer. Smith was charged with murder and indicted by a grand jury in 2016. The case came to trial in late 2019 following a change of venue to Ozark, Alabama. Smith was found guilty of manslaughter, and, in January 2020, was sentenced to 14 years in prison.\nGregory Gunn lived with his mother in the Mobile Heights neighborhood in Montgomery, Alabama.[2] The neighborhood had experienced a number of burglaries around the time of the incident. According to Montgomery Police officer Aaron Cody Smith, Gunn matched the description of a burglary suspect: \"dark clothing, black male\".[1]\n",
        "type": [
            "murder",
            "burglary",
            "killing"
        ]
    },
    "44": {
        "link": "/wiki/James_Karales",
        "title": "James Karales",
        "date": "April 1, 2002(2002-04-01) (aged 71) Croton-on-Hudson, New York",
        "year": "2002",
        "location": "",
        "state": "",
        "place": "Hudson",
        "county": "Jefferson County",
        "paragraph": "James H. Karales (July 15, 1930, Canton, Ohio – April 1, 2002, Croton-on-Hudson, N.Y.) was an American photographer and photo-essayist best known for his work with Look magazine from 1960 to 1971. At Look he covered the Civil Rights Movement throughout its duration, taking many of the movements memorable photographs, including those of the formation of the Student Nonviolent Coordinating Committee (SNCC) and of Dr. Martin Luther King Jr. and his family.[1] Karales's single best known image is the iconic photograph of the Selma to Montgomery march showing people proudly marching along the highway under a cloudy turbulent sky.[2][3]\nKarales was born in Ohio to a family of Greek immigrants. Although he initially enrolled in Ohio University with the intention of majoring in electrical engineering, Karales switched his major to photography after watching his roommate in the darkroom.[2] He graduated with a bachelor of fine arts degree in 1955, departing Ohio for New York City.[2] He eventually found work as a darkroom assistant for photo-essay photographer W. Eugene Smith at the Magnum photo agency,[2] initially on a two-week assignment making prints for Smith's Pittsburgh essay.[4] He would go on to work for Smith for two years, making more than 7,000 prints and developing expertise both in the darkroom and as a photo-essayist.[2][4]\nAfter leaving Magnum, Karales produced his own photo essays, including works showing what life was like for the working citizens of Rendville, Ohio, a former stop on the Underground Railroad and one of the few integrated working communities in the United States.[4] His Rendville photo-essay would draw the attention of Edward Steichen and led to a solo exhibition at Helen Gee's Greenwich Village gallery, Limelight.[2] Karales also drew attention from Look for the Rendville essay, and Look would go on to hire him[2] in 1960[4] to cover and photograph both the civil rights movement and the war in Vietnam. Karales worked for Look until the magazine closed in 1972; afterwards, he worked as a freelance photographer.[4] Before he met Smith, he also created a photo-essay on the Greek-American community in his hometown of Canton, Ohio.[4][5]\n",
        "type": []
    },
    "45": {
        "link": "/wiki/Benny_Perrin",
        "title": "Benny Perrin",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Perrin",
        "county": "Limestone County",
        "paragraph": "\nJesse Bennett Perrin (October 20, 1959 – February 3, 2017) was a professional American football safety who played four seasons for the St. Louis Cardinals in the National Football League.  Perrin played for the legendary University of Alabama football coach Paul \"Bear\" Bryant from 1978–1981, winning NCAA National Championships in 1978 and 1979.\nPerrin attended Decatur High School in Decatur, Alabama, where he resided at the time of his death and was the owner of BB Perrins Sports Bar and Grille.\n",
        "type": []
    },
    "46": {
        "link": "/wiki/Execution_of_Nathaniel_Woods",
        "title": "Execution of Nathaniel Woods",
        "date": "March 5, 2020(2020-03-05) (aged 43) Holman Correctional Facility, Atmore, Alabama, U.S.",
        "year": "2020",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "\nThe execution of Nathaniel Woods occurred on March 5, 2020, at Holman Correctional Facility in Alabama. The execution was controversial due to skepticism about his culpability and the fairness of his trial.[6] Woods had surrendered inside a crack house during a police raid that attempted to serve a months-old arrest warrant on Woods.[7][8] Another man came downstairs and opened fire, killing three officers. Woods ran from the scene after the gunfire erupted.[9][3]\nDespite never pulling a trigger, Woods was accused of being an accomplice and was convicted of capital murder.[10] The same jury voted 10–2 in favor of capital punishment.[10]\n",
        "type": [
            "murder",
            "killing",
            "assault"
        ]
    },
    "47": {
        "link": "/wiki/Frederick_D._Reese",
        "title": "Frederick D. Reese",
        "date": "April 5, 2018(2018-04-05) (aged 88) Atlanta, Georgia, U.S.",
        "year": "2018",
        "location": "",
        "state": "Alabama",
        "place": "Atlanta",
        "county": "Montgomery County",
        "paragraph": "Frederick Douglas Reese (November 28, 1929 – April 5, 2018) was an American civil rights activist, educator and minister from Selma, Alabama. Known as a member of Selma's \"Courageous Eight\",[1] Reese was the president of the Dallas County Voters League (DCVL) when it invited the Southern Christian Leadership Conference and Martin Luther King Jr. to Selma to amplify the city's local voting rights campaign.[2] This campaign eventually gave birth to the Selma to Montgomery marches, which later led to the passage of the Voting Rights Act.\nReese was also president of the Selma Teachers Association, and in January 1965 he mobilized Selma's teachers to march as a group for their right to vote.[2]\nReese retired from teaching and from February 2015 and until his death in April 2018, he was active as a minister at Selma's Ebenezer Missionary Baptist Church.[3]\n",
        "type": []
    },
    "48": {
        "link": "/wiki/Bill_Sketoe",
        "title": "Bill Sketoe",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Methodist",
        "county": "Dallas County",
        "paragraph": "William Sketoe, Sr. (June 8, 1818 – December 3, 1864) was a Methodist minister from the south Alabama town of Newton, whose lynching there on December 3, 1864 gave birth to one of Alabama's best-known ghost stories.  While locally-told stories of his life usually say that he was hanged on trumped-up charges of desertion from the Confederate Army, other sources show that he was killed for allegedly aiding pro-Union renegades in the area.  Whatever the reason for his murder, a shallow hole dug beneath Sketoe's feet during the hanging (to accommodate his large frame) ultimately led to stories about \"the hole that won't stay filled.\"  According to witnesses, this hole never disappeared—even after being filled numerous times—retaining its original dimensions for the next 125 years.\nSketoe's tale became a staple of Southern folklore, and was later immortalized by Alabama author Kathryn Tucker Windham in her 13 Alabama Ghosts and Jeffrey.  His hanging site remained a local tourist attraction for decades, and continues to attract visitors even though the hole itself recently disappeared due to flooding in the area.  Today the site of Sketoe's lynching lies beneath the Alabama Highway 134 bridge over the Choctawhatchee River, and a monument to Sketoe has been erected nearby.\nWhile much of Bill Sketoe's story is difficult to reconstruct with certainty, he is known to have resided in Newton, Alabama prior to the Civil War,[1] and to have been lynched there on December 3, 1864.[2]    The main source for his tale is Kathryn Tucker Windham's 13 Alabama Ghosts and Jeffrey, which tells the legend of Sketoe's life and death as it has been related for generations in and around Newton.  However, certain details of this story—such as Sketoe's alleged Confederate war service and the precise reason for his lynching—are subject to controversy based upon other available records.  While the legend attributes his death to an ultimately romantic cause (Sketoe's desire to care for his desperately ill spouse), other accounts hint at far more sinister reasons behind his demise, involving Sketoe's alleged (but never proven) collaboration with Unionist local guerrillas.\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "49": {
        "link": "/wiki/Recy_Taylor",
        "title": "Recy Taylor",
        "date": "December 28, 2017(2017-12-28) (aged 97) Abbeville, Alabama, U.S.",
        "year": "2017",
        "location": "",
        "state": "Alabama",
        "place": "Abbeville",
        "county": "Henry County",
        "paragraph": "\nRecy Taylor (née Corbitt; December 31, 1919 – December 28, 2017)[2]: 297  was an African-American woman from Abbeville in Henry County, Alabama. She was born and raised in a sharecropping family in the Jim Crow era Southern United States.  Taylor's refusal to remain silent about her rape by white men led to organizing in the African-American community for justice and civil rights.\nOn September 3, 1944, Taylor was kidnapped while leaving church and gang-raped by six white men.[2]: xv–xvii [3][4] Despite the men's confessions to authorities, two grand juries subsequently declined to indict the men; no charges were ever brought against her assailants.[5]\n",
        "type": [
            "rape",
            "kidnapped"
        ]
    },
    "50": {
        "link": "/wiki/Charles_Albert_Poland",
        "title": "2013 Alabama bunker hostage crisis",
        "date": "January 29, 2013 – February 4, 2013 c. 3:30 p.m.[1] – 3:12 p.m. (CST)",
        "year": "2013",
        "location": "Midland City, Alabama, U.S.",
        "state": "Alabama",
        "place": "Midland City",
        "county": "Dale County",
        "paragraph": "\nOn January 29, 2013, a hostage crisis, lasting almost seven days, began in the Wiregrass Region near U.S. Highway 231 in Midland City, Alabama. Jimmy Lee Dykes, a 65-year-old Vietnam War-era veteran, boarded a Dale County school bus, killed the driver, and took a five-year-old boy hostage. On the afternoon of February 4, law enforcement agents entered the bunker, killed Dykes, and rescued the child.[3]\nJust after 3:30 p.m.,[1] Dykes boarded a Dale County school bus that was stopped in Midland City and told the driver that he wanted to take two children, six and eight years old, both boys,[4] from the bus. The school bus driver, 66-year-old Charles Albert Poland, Jr., refused to let him take the children and challenged Dykes to shoot him.[4] He blocked access to the aisle of the bus while Dykes continued to argue with him.\n",
        "type": [
            "murder"
        ]
    },
    "51": {
        "link": "/wiki/Amy_Bishop",
        "title": "University of Alabama in Huntsville shooting",
        "date": "February 12, 2010; 12 years ago (2010-02-12) 4:00 p.m. (CST)",
        "year": "2010",
        "location": "Huntsville, Alabama, U.S.",
        "state": "Alabama",
        "place": "Huntsville",
        "county": "Madison County",
        "paragraph": "\nOn February 12, 2010, three people were killed and three others wounded in a shooting at the University of Alabama in Huntsville (UAH) in Huntsville, Alabama, United States. During a routine meeting of the biology department attended by approximately 12 people, Amy Bishop, a biology professor at the university, began shooting those nearest her with a Ruger P95 handgun.\nBishop was charged with one count of capital murder and three counts of attempted murder. On September 11, 2012, she pleaded guilty to the charges after family members of victims petitioned the judge against use of the death penalty. The jury heard a condensed version of the evidence on September 24, as required by Alabama law. The same day, Bishop was sentenced to life in prison without the possibility of parole.[1]\n",
        "type": [
            "murder",
            "mass shooting",
            "shooting"
        ]
    },
    "52": {
        "link": "/wiki/Hurtsboro_race_riot",
        "title": "Hurtsboro race riot",
        "date": "December 1920",
        "year": "1920",
        "location": "Hurtsboro, Alabama, United States",
        "state": "Alabama",
        "place": "Hurtsboro",
        "county": "Russell County",
        "paragraph": "The Hurtsboro race riot was conflict between Black and White residents of Hurtsboro, Alabama in the final days of 1920.\nViolence against Blacks were and other incidents of civil unrest were nothing new to early 20th century America. The country had recently gone through what is now known as the American Red Summer of 1919. Attacks on black communities and white oppression spread to more than three dozen cities and counties. In most cases, white mobs attacked African American neighborhoods. In some cases, black community groups resisted the attacks, especially in Chicago and Washington, D.C. Most deaths occurred in rural areas during events like the Elaine race riot in Arkansas, where an estimated 100 to 240 blacks and 5 whites were killed. Other major events of Red Summer were the Chicago race riot and Washington D.C. Race Riot, which caused 38 and 39 deaths, respectively. Both riots had many more non-fatal injuries and extensive property damage reaching up into the millions of dollars.[1]\nIn December of 1920, the wife of a white farmer in Hurtsboro was allegedly assaulted by a Black man.[2] Her husband alerted by her screams ran to her aid but was knocked out by the assailant. While shaken he was able to make it to a phone and called the authorities who quickly created a posse led by Deputy Sheriff Boss W.E. Dozier of Russell County, Alabama.[2]\n",
        "type": [
            "assault",
            "riot"
        ]
    },
    "53": {
        "link": "/wiki/Robert_Edward_Chambliss",
        "title": "Robert Edward Chambliss",
        "date": "October 29, 1985(1985-10-29) (aged 81) Birmingham, Alabama, U.S.",
        "year": "1985",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "Robert Edward Chambliss (January 14, 1904 – October 29, 1985), also known as Dynamite Bob,[1] was a white supremacist terrorist convicted in 1977 of murder for his role as conspirator in the 16th Street Baptist Church bombing in 1963. A member of the United Klans of America, Chambliss also firebombed the houses of several black families in Alabama.[citation needed]\nA May 13, 1965 memo to Federal Bureau of Investigation (FBI) director J. Edgar Hoover identified Chambliss, Bobby Frank Cherry, Herman Frank Cash and Thomas Edwin Blanton Jr. as suspects in the 16th Street Baptist Church bombing that killed four young African-American girls.[2]\nThe investigation was originally closed in 1968; no charges were filed. Years later it was found that the FBI had accumulated evidence against the named suspects that had not been revealed to the prosecutors by order of J. Edgar Hoover. Edgar Hoover stopped and shut down the investigation in 1968. The files were used by Alabama attorney general Bill Baxley to reopen the case in 1971.[2] In 1977 Chambliss was convicted of murder for the bombing and sentenced to several terms of life imprisonment. He died in Lloyd Noland Hospital and Health Center in Birmingham on October 29, 1985,[1] still proclaiming his innocence. He was 81.\n",
        "type": [
            "murder",
            "terrorist"
        ]
    },
    "54": {
        "link": "/wiki/Bill_Wilson_(convict)",
        "title": "Bill Wilson (convict)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Blount County",
        "county": "Blount County",
        "paragraph": "Bill Wilson (born 1880) was a farmer in Blount County, Alabama who was falsely convicted of killing his wife and youngest child.\nBill Wilson, a farmer in Blount County, Alabama, married Jenny Wade in 1900. Their third child was born in 1907. Jenny left Wilson 19 months later with their third child to return to her family. Wilson then chose to move in with his father taking the two older children with him. During the divorce proceedings, Wade and the third child vanished. Shortly before Jenny was last seen, Jane McClendon, a local farmer's daughter, also mysteriously disappeared. For several weeks rumors circulated that foul play was involved in both disappearances.[1][2]\nIn late 1912, Dolphus Tidwell and his son were fishing on the Black Warrior River near the property of Wilson's father when they noticed a bone sticking out of the soil. The Tidwells found a mat under the soil that exposed what they believed to be the skeletal remains of an adult and a child. Thinking that there may have been an Indigenous burial mound nearby, they searched the area for relics but found nothing. They re-buried the bones and returned home. News of the discovery spread, and for several days locals searched the area for Native American artifacts until they lost interest.[1][2]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "55": {
        "link": "/wiki/Larry_Gene_Heath",
        "title": "Heath v. Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Heath",
        "county": "Covington County",
        "paragraph": "Heath v. Alabama, 474 U.S. 82 (1985), is a case in which the United States Supreme Court ruled that, because of the doctrine of \"dual sovereignty\" (the concept that the United States and each state possess sovereignty – a consequence of federalism), the double jeopardy clause of the Fifth Amendment to the Constitution does not prohibit one state from prosecuting and punishing somebody for an act of which they had already been convicted of and sentenced for in another state.\nThis decision is one of several that holds that the Fifth Amendment does not forbid the U.S. federal government and a state government, or the governments of more than one state, from prosecuting the same individual separately for the same illegal act.\nThe Fifth Amendment to the Constitution of the United States says:\n",
        "type": []
    },
    "56": {
        "link": "/wiki/Lynching_of_Michael_Donald",
        "title": "Lynching of Michael Donald",
        "date": "March 21, 1981 (aged 19) Mobile, Alabama, U.S.",
        "year": "1981",
        "location": "",
        "state": "Alabama",
        "place": "Mobile",
        "county": "Mobile County",
        "paragraph": "\nThe lynching of Michael Donald in Mobile, Alabama, on March 21, 1981, was one of the last reported lynchings in the United States.[1][2] Several Ku Klux Klan (KKK) members beat and killed Michael Donald, a 19-year-old African-American, and hung his body from a tree. One perpetrator, Henry Hays, was executed by electric chair in 1997, while another, James Knowles, was sentenced to life in prison after pleading guilty and testifying against Hays. A third man was convicted as an accomplice and also sentenced to life in prison, and a fourth was indicted but died before his trial could be completed.\nHays's execution was the first in Alabama since 1913 for a white-on-black crime. It was the only execution of a KKK member during the 20th century for the murder of an African American.[3] Donald's mother, Beulah Mae Donald, brought a civil suit for wrongful death against the United Klans of America (UKA), to which the attackers belonged. In 1987 a jury awarded her damages of $7 million, which bankrupted the organization. This set a precedent for civil legal action for damages against other racist hate groups.\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "57": {
        "link": "/wiki/Killing_of_Aniah_Blanchard",
        "title": "Killing of Aniah Blanchard",
        "date": "October 2019",
        "year": "2019",
        "location": "Alabama, United States",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nAniah Haley Blanchard (born June 22, 2000) was from Homewood, Alabama.[1][2] She is the daughter of Elijah Blanchard, a Birmingham businessman,[3] and Angela Haley-Harris, a registered nurse. Haley-Harris is currently married to UFC heavyweight fighter Walt Harris.[1] Blanchard graduated from Homewood High School, where she played softball.[2][4] At the time of her death, she was a student at Southern Union State Community College and was studying early childhood education. She was planning to transfer to Auburn University.[5][6]\nA scholarship in Blanchard's memory has been established by Homewood Public Schools.[6] In June 2020, a bench at the Patriot Park in Homewood was dedicated to her.[7]\nThe kidnapping and murder of Aniah Blanchard occurred in October 2019. Blanchard, the 19-year-old stepdaughter of Ultimate Fighting Championship (UFC) fighter Walt Harris, was reported missing on October 24. She had last been seen at a Chevron gas station in Auburn, Alabama, the previous night. A witness from the gas station claims to have seen Blanchard's kidnapping. Blanchard's body was found in Macon County, Alabama, one month after her disappearance.[8] The cause of death was determined to be a gunshot wound.[9] A suspect, identified as Ibraheem Yazeed, was arrested and charged with Blanchard's murder. As of January 2021, Yazeed is being held in Lee County Jail without bond.[10] A judge has decided that there is probable cause for a grand jury to hear the case.[11] Prosecutors are seeking the death penalty.[12][13]\nBlanchard's death attracted national attention and media coverage[14][15] and led to the creation of \"Aniah's law,\" which reforms Alabama's bail system.[16] If Alabama voters approve Amendment One in November 2022, one of the bills that Aniah’s Law consists of will take effect.[17][18]\n",
        "type": [
            "riot",
            "killing",
            "murder",
            "kidnapped",
            "kidnapping"
        ]
    },
    "58": {
        "link": "/wiki/Adriel_Johnson",
        "title": "Adriel Johnson",
        "date": "February 12, 2010(2010-02-12) (aged 52) Huntsville, Alabama, US",
        "year": "2010",
        "location": "",
        "state": "Alabama",
        "place": "Huntsville",
        "county": "Madison County",
        "paragraph": "Adriel Duland Johnson Sr. (June 22, 1957 – February 12, 2010) was an American biologist and faculty member at the University of Alabama in Huntsville whose research focused on areas of cell biology and nutritional physiology. He was one of three faculty members who was killed in the shooting on the UAH campus on February 12, 2010.\nJohnson was a native of Tuskegee, Alabama, and attended the Chamblis Children's House Elementary School, which was housed on the campus of Tuskegee Institute. Johnson was a Boy Scout and participated in the medical explorers Program.[1] He was a lifelong member of the National Eagle Scout Association. Johnson graduated from Washington University in St. Louis in 1979 with a degree in biology.[2]\nJohnson earned two master's degrees: one in biology-population genetics from Tennessee Technological University in 1981, and the second in biology-muscle protein biochemistry from UAHuntsville in 1986. Johnson earned a PhD in animal science/nutritional physiology from North Carolina State University in 1989.[3] Johnson was the principal investigator of the Louis Stokes Alliance for Minority Participation program site at the University of Alabama in Huntsville for over nineteen years.[4] In addition to mentoring youth in scouting and academia, Johnson served many others through advisement of numerous student groups and participation in various committees.[5]\n",
        "type": [
            "shooting"
        ]
    },
    "59": {
        "link": "/wiki/LaFayette,_Alabama",
        "title": "LaFayette, Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "LaFayette",
        "county": "Chambers County",
        "paragraph": "LaFayette (/ləˈfeɪɛt, -ˈfaɪ-/ lə-FAY-et, -⁠FY-, /ˈlʌfeɪɛt/ LUF-ay-et) is the county seat of Chambers County, Alabama, United States, 47 miles (76 km) northwest of Columbus, Georgia. As of the 2010 census, the population of the city was 3,003.[3]\nChambers County was formed in 1832. The newly elected county officials opted to locate the county seat as near as possible to the center of the county. Lots for the new town were auctioned in October 1833, with proceeds from the sale financing the construction of a courthouse and jail. The town was first called \"Chambersville\", but by the time of incorporation on January 7, 1835, the town name had been changed to \"Lafayette\", named after the Marquis de Lafayette; its spelling was changed to \"LaFayette\" due to the influence of newspaper editor Johnson J. Hooper, who created a fictional character called Captain Simon Suggs, a backwoods southerner who pronounced the town's name as \"La\nFait\".[1][4] The city's newspaper, The LaFayette Sun, was founded under the name The Alabama Standard in April 1841 and adopted its current name on August 3, 1881.[5]\nIn 1898 John Anderson, a black man, was quickly hanged in LaFayette by a mob for a murder he did not commit.[6]\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "60": {
        "link": "/wiki/Murder_of_Amore_Wiggins",
        "title": "Murder of Amore Wiggins",
        "date": "January 28, 2012; 11 years ago (2012-01-28) (discovery of remains)",
        "year": "2012",
        "location": "Opelika, Alabama, U.S.",
        "state": "Alabama",
        "place": "Opelika",
        "county": "Lee County",
        "paragraph": "Amore Joveah Wiggins, formerly known as Opelika Jane Doe (born January 1, 2006 – c. 2011) was a formerly unidentified murder victim whose skeletal remains were found in a trailer park in Opelika, Alabama.[1] Her identity was not known until nearly 11 years later in January 2023. Wiggins's father, Lamar Vickerstaff, was subsequently charged with felony murder and failure to report a missing child, while her step-mother, Ruth Vickerstaff, was charged with the latter. If convicted, Lamar would face up to life imprisonment without the possibility parole or the death penalty, and Ruth would face up to 10 years in prison.[2]\nOn January 28, 2012, a resident discovered a skull at Brook Haven Trailer Park, 1775 Hurst St. in Opelika, Alabama. Police searched the surrounding area and found more remains, including a pink, long sleeve shirt with heart buttons and ruffles nearby on a creek bank. It is unknown if that shirt belonged to the victim.[3]\nDetectives determined the skull belonged to a young African American girl, around 4–7 years of age. Evidence from her bones indicated she was malnourished, and she also had a visible deformity on her left eye. This could be natural or a result of injury or abuse. Forensic artists at the National Center for Missing & Exploited Children created an image of what Jane Doe may have looked like. Detectives looked at school and birth records, but this yielded no results.[4] In 2017, the University of South Florida Institute for Forensic Anthropology & Applied Science performed isotope testing on her bones, which indicated she lived in Southeastern United States.[5]\n",
        "type": [
            "murder"
        ]
    },
    "61": {
        "link": "/wiki/Theresa_Burroughs",
        "title": "Theresa Burroughs",
        "date": "May 22, 2019Greensboro, Alabama, U.S.",
        "year": "2019",
        "location": "",
        "state": "Alabama",
        "place": "Burroughs",
        "county": "Colbert County",
        "paragraph": "Theresa Burroughs (1929 – May 22, 2019)[1] was an active participant in the civil rights movement during the 1960s. She worked to secure the right to vote for blacks in Alabama and the rest of the Southern United States. In 1965 she was attacked and arrested by state troopers and sheriff's deputies along with other civil rights demonstrators attempting to cross the Edmund Pettus Bridge in Selma, Alabama. She was the founder of the Safe House Black History Museum in Greensboro, Alabama,[2] the location where the Reverend Dr. Martin Luther King Jr. was hidden from the Ku Klux Klan during his visit to Alabama in 1968.[3] Burroughs was a childhood friend of King's wife, Coretta Scott King.[2]\nBurroughs was a cosmetologist and ran a beauty parlor called \"In Beauty's Care\" in Greensboro, which she opened a few years before the night she hid King in her mother's home next door to the beauty shop.[3]\nHer parents were Mattie and Napoleon Turner.[1] She died on May 25, 2019 in Greensboro, Alabama at the age of 89.[3]\n",
        "type": []
    },
    "62": {
        "link": "/wiki/Scottsboro_Boys",
        "title": "Scottsboro Boys",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Memphis",
        "county": "Pickens County",
        "paragraph": "\nThe Scottsboro Boys were nine African American teenagers and young men, ages 13 to 20, accused in Alabama of raping two white women in 1931.  The landmark set of legal cases from this incident dealt with racism and the right to a fair trial. The cases included a lynch mob before the suspects had been indicted, all-white juries, rushed trials, and disruptive mobs. It is commonly cited as an example of a legal injustice in the United States legal system.\nOn March 25, 1931, two dozen people were \"hoboing\" on a freight train traveling between Chattanooga and Memphis, Tennessee, the hoboes being an equal mix of blacks and whites. A group of white teenage boys saw 18-year-old Haywood Patterson on the train and attempted to push him off, claiming that it was \"a white man's train\".[1] A group of whites gathered rocks and attempted to force all of the black men from the train. Patterson and the other black passengers were able to ward off the group. The humiliated white teenagers jumped or were forced off the train and reported to the city's sheriff that they had been attacked by a group of black teenagers. The sheriff deputized a posse, stopped and searched the train at Paint Rock, Alabama and arrested the black Americans. Two young white women were also taken to the jail, where they accused the African-American teenagers of rape. The case was first heard in Scottsboro, Alabama, in three rushed trials, in which the defendants received poor legal representation. All but 13-year-old Roy Wright were convicted of rape and sentenced to death (the common sentence in Alabama at the time for black men convicted of raping white women), even though there was no medical evidence indicating that rape had taken place.[2]\n",
        "type": [
            "rape"
        ]
    },
    "63": {
        "link": "/wiki/First_Baptist_Church_(Selma,_Alabama)",
        "title": "First Baptist Church (Selma, Alabama)",
        "date": "",
        "year": "",
        "location": "709 Martin Luther King, Jr. St., Selma, Alabama",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "First Baptist Church is a historic church at 709 Martin Luther King, Jr. Street in Selma, Alabama.  A historically African American Baptist church, it was built in the Gothic Revival style in 1894 and known for its association with the Civil Rights Movement.[2] It was added to the National Register of Historic Places in 1979.[1]\n\nFrom the National Register of Historic Places Inventory — Nomination Form:[2] In 1963 under the leadership of Reverend M. C. Cleveland, the church became the first in the city to open its doors for activities and meetings of the Dallas County Voters League. During the next two years, the church was a focal point of the mass meeting and non-violent teaching sessions sponsored by the Student Nonviolent Coordinating Committee, and in late 1964, meetings were held in the church to plan the mass rallies and demonstrations of early 1965 which culminated in the Selma-to-Montgomery march. During the early months of 1965, Martin Luther King, Jr., Ralph Abernathy, and other leaders of the Southern Christian Leadership Conference, headquartered in Brown's Chapel half a block away, spoke nightly to the youth gathered at First Baptist Church.\nAfter the march, the church continued to headquarter the Student Nonviolent Coordinating Committee and continued to serve as a distribution center for food and clothing for those persons who suffered the loss of jobs.",
        "type": []
    },
    "64": {
        "link": "/wiki/Walter_Reuther",
        "title": "Walter Reuther",
        "date": "May 9, 1970(1970-05-09) (aged 62) Pellston, Michigan, U.S.",
        "year": "1970",
        "location": "",
        "state": "",
        "place": "Cuba",
        "county": "Sumter County",
        "paragraph": "\nWalter Philip Reuther (/ˈruːθər/; September 1, 1907 – May 9, 1970) was an American leader of organized labor and civil rights activist who built the United Automobile Workers (UAW) into one of the most progressive labor unions in American history.[1] He saw labor movements not as narrow special interest groups but as instruments to advance social justice and human rights in democratic societies.[1] He leveraged the UAW's resources and influence to advocate for workers' rights, civil rights, women's rights, universal health care, public education, affordable housing, environmental stewardship and nuclear nonproliferation around the world.[1] He believed in Swedish-style social democracy and societal change through nonviolent civil disobedience.[2][3] He cofounded the AFL-CIO in 1955 with George Meany.[4] He survived two attempted assassinations, including one at home where he was struck by a 12-gauge shotgun blast fired through his kitchen window.[5] He was the fourth and longest serving president of the UAW, serving from 1946 until his death in 1970.[6]\nAs the leader of five million autoworkers including retirees and their families,[7] Reuther was influential inside the Democratic Party.[8]  Following the Bay of Pigs in 1961, JFK sent Reuther to Cuba to negotiate a prisoner exchange with Fidel Castro.[9] He was instrumental in spearheading the creation of the Peace Corps[10][11][12] and in marshaling support for the Civil Rights Act of 1964,[13][14] the Voting Rights Act of 1965,[15] Medicare and Medicaid,[16] and the Fair Housing Act.[14] He met weekly in 1964 and 1965 with President Lyndon B. Johnson at the White House to discuss policies and legislation for the Great Society and War on Poverty.[17] The Republican Party was wary of Reuther, leading presidential candidate Richard Nixon to say about John F. Kennedy during the 1960 election, \"I can think of nothing so detrimental to this nation than for any President to owe his election to, and therefore be a captive of, a political boss like Walter Reuther.\"[18] Conservative politician Barry Goldwater declared that Reuther \"was more dangerous to our country than Sputnik or anything Soviet Russia might do.\"[19]\n",
        "type": []
    },
    "65": {
        "link": "/wiki/Birmingham_bus_attack",
        "title": "Birmingham bus attack",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "On 14 May 1961, during the American Civil Rights Movement, a mob of Ku Klux Klan members attacked civil rights Freedom Riders in Birmingham, Alabama after two buses were setting out to travel the south in protest of their civil rights following the Supreme Court case saying bus segregation was unconstitutional.\nCity of Birmingham\nCity of Montgomery\n",
        "type": []
    },
    "66": {
        "link": "/wiki/Benny_Marshall",
        "title": "Benny Marshall",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "Bennett \"Benny\" Marshall (November 6, 1919[1] - September 25, 1969) was a ten-time winner of the Alabama Sportswriter of the Year from the National Sportscasters and Sportswriters Association. He is considered the top sports writer in Alabama newspaper history. He became sports editor of The Birmingham News in 1959, replacing Zip Newman, and won numerous state and national awards. His son, Phillip Marshall, was a sports writer for The Huntsville News, The Birmingham Post-Herald, The Huntsville Times and sports editor of The Montgomery Advertiser.[2] Three other children - David, Ellen and Matt - are no longer living. Marshall died on September 25, 1969, from a self-inflicted gunshot. He was 49.\nBenny Marshall wrote a sports column for The Birmingham News. Amongst the variety of his writing styles, one particular style stood out from the rest. He could tell a story in his column in a way that touched people. Fifty years later, there are still some who can remember a Benny Marshall story bringing tears their [then] young eyes. Marshall covered the top football games played by the state's two major universities. He was a dutiful reporter of the facts and the big plays, an entirely different style than he used in many of his columns. Sometimes he would simply report independent factoids that were disconnected. The title on those columns was, \"Noted in passing...\". Other times, Marshall might have identified a sports story that had heart. When he was inspired, he could make that story come alive with the brief touching tapestry he weaved with his well chosen words. Marshall's talent for capturing the depth and character of humanity as played out in a sports story endeared him to sports lovers throughout the state.\n\n",
        "type": []
    },
    "67": {
        "link": "/wiki/National_Voting_Rights_Museum",
        "title": "National Voting Rights Museum",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "The National Voting Rights Museum and Institute, established in 1991 and opened in 1993, is an American museum in Selma, Alabama, which honors, chronicles, collects, archives, and displays the artifacts and testimony of the activists who participated in the events leading up to and including the 1965 Selma to Montgomery marches, and passage of the 1965 Voting Rights Act, as well as those who worked for the African-American Voting Rights and Women's Suffrage movements. As the museum describes in its mission statement, it recognizes other people, events, and actions which furthered America's Right to Vote since \"the Founding Fathers first planted the seeds of democracy in 1776.\"[1][2][3] The museum was founded by Faya Ora Rose Touré and Marie Foster.[4]\nIt is located near the Edmund Pettus Bridge. On this bridge on March 7, 1965, voting rights marchers who left the city for a planned walk to Montgomery were beaten and clubbed by Dallas County posse and Alabama State Troopers, in what became known as \"Bloody Sunday\". They had passed into the county on a planned walk of 54 miles to Montgomery, Alabama's state capital. This treatment was nationally televised and covered by major media, arousing national outrage. After gaining federal protection from President Lyndon B. Johnson and a federal court order protecting their right to march, thousands of people left Selma on March 21, reaching Montgomery several days later. By then, they had been joined by thousands more, black and white, and 25,000 marchers entered the state capital to press for protection of constitutional voting rights. Later that summer the Voting Rights Act of 1965, introduced by the Johnson administration, was passed by Congress and signed by the president. \nThe museum's several rooms and exhibit areas include the \"Footprints to Freedom\" room, which features molded cast-footprints of some of the activists who participated in the Selma to Montgomery marches; a \"Women's Suffrage Room\", honoring the contributions of African-American and other women who secured women's voting rights in the U.S.; the \"Selma Room\", also known as the \"Marie Foster\" room, where voting records, clothes worn by people beaten during the march, and other artifacts of these social movements are displayed; and a room where people who participated in the 1960s marches can leave personal messages and chronicle their memories.[1] The museum also features a large blow-up of a portion of an iconic photograph taken on the Selma to Montgomery march by Look magazine photographer James Karales.\n",
        "type": []
    },
    "68": {
        "link": "/wiki/Henry_Francis_Hays",
        "title": "Lynching of Michael Donald",
        "date": "March 21, 1981 (aged 19) Mobile, Alabama, U.S.",
        "year": "1981",
        "location": "",
        "state": "Alabama",
        "place": "Mobile",
        "county": "Mobile County",
        "paragraph": "\nThe lynching of Michael Donald in Mobile, Alabama, on March 21, 1981, was one of the last reported lynchings in the United States.[1][2] Several Ku Klux Klan (KKK) members beat and killed Michael Donald, a 19-year-old African-American, and hung his body from a tree. One perpetrator, Henry Hays, was executed by electric chair in 1997, while another, James Knowles, was sentenced to life in prison after pleading guilty and testifying against Hays. A third man was convicted as an accomplice and also sentenced to life in prison, and a fourth was indicted but died before his trial could be completed.\nHays's execution was the first in Alabama since 1913 for a white-on-black crime. It was the only execution of a KKK member during the 20th century for the murder of an African American.[3] Donald's mother, Beulah Mae Donald, brought a civil suit for wrongful death against the United Klans of America (UKA), to which the attackers belonged. In 1987 a jury awarded her damages of $7 million, which bankrupted the organization. This set a precedent for civil legal action for damages against other racist hate groups.\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "69": {
        "link": "/wiki/Dorothy_Tillman",
        "title": "Dorothy Tillman",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Chicago",
        "county": "Baldwin County",
        "paragraph": "Dorothy Jean Tillman  (née Wright;  May 12, 1947) is an American politician, civil rights activist and former Chicago, Illinois alderman. Tillman served as the alderman of the city's 3rd Ward (map) from 1985 until 2007. A member of the Democratic Party, representing part of the city's South Side in the Chicago City Council. As an Alderman, Tillman was a strong advocate of reparations for slavery. In April 2007, Tillman was defeated in a runoff election by challenger Pat Dowell. Tillman defeated Dowell in 2003.  Prior to her career as an alderman, Tillman was active in the Civil Rights Movement, working for Martin Luther King Jr.'s Southern Christian Leadership Conference (SCLC) as an activist. Tillman was known for wearing large hats and has cultivated this image as her trademark.\nTillman was born as Dorothy Jean Wright in Montgomery, Alabama to James Wright, a local handyman and Edna Mae Struggs (formerly Wright; d. November 30, 2009).[4] Tillman's parents divorced when she was a child which resulted in her spending her childhood between Montgomery with her father and Pensacola, Florida, where her mother had remarried and relocated to.[5] Tillman joined the Southern Christian Leadership Conference (SCLC) as a trainee and field staff organizer in 1963. Tillman marched with Martin Luther King Jr. and was among the SCLC Field Staff to cross the Edmund Pettus Bridge  in Selma, Alabama in the Selma to Montgomery marches on 7 March 1965.\nTillman had her first involvement in Chicago politics later in 1965 when King sent her there to campaign for better housing, education and employment conditions for blacks. This campaign marked the start of King's effort to improve socio-economic conditions for blacks. Tillman was involved in organizing King's move into a Chicago tenement in early 1966 and the launch of his campaign in July 1966. By 1967, Tillman and her husband, Jimmy, moved to San Francisco shortly after their marriage and became involved in a successful campaign to improve public transport services to their neighborhood.\n",
        "type": []
    },
    "70": {
        "link": "/wiki/Killing_of_Emantic_Fitzgerald_Bradford_Jr.",
        "title": "Killing of Emantic Fitzgerald Bradford Jr.",
        "date": "November 22, 2018 (2018-11-22)",
        "year": "2018",
        "location": "Riverchase Galleria, Hoover, Alabama",
        "state": "Alabama",
        "place": "Hoover",
        "county": "Jefferson County",
        "paragraph": "\nOn November 22, 2018, Emantic Fitzgerald Bradford Jr., an African-American man, was shot three times from behind and killed by Hoover police officer David Alexander on the night of Thanksgiving, at the Riverchase Galleria shopping mall in Hoover, Alabama.[2] Police responded to a shooting at the mall where two people were shot.[3]  Another African-American man suspected in the first shooting was arrested in Georgia a week later and charged in the shooting of one of those injured. Bradford was holding a legally owned weapon when shot and was not involved in the prior shooting incident, although near the crime scene.[4][5] The shooting of Bradford was immediately controversial, and was condemned by the Alabama National Association for the Advancement of Colored People (NAACP) as an example of racially biased policing.[6]\nEmantic \"EJ\" Fitzgerald Bradford Jr., of Hueytown, Alabama, was 21 years old. He was born on June 18, 1997.[1] He attended Holy Family Cristo Rey High School in Birmingham and earned his diploma through the General Educational Development (GED) program.[7] Bradford had enlisted in the U.S. Army in 2017 and completed basic training, and was on leave in August 2018 before completing advanced individual training.[8] Bradford worked full-time and was a caretaker for his father, a former correctional officer, with cancer.[9]\n",
        "type": [
            "shooting",
            "killing"
        ]
    },
    "71": {
        "link": "/wiki/Selma,_Lord,_Selma",
        "title": "Selma, Lord, Selma",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "Selma, Lord, Selma is a 1999 American made-for-television biographical drama film based on true events that happened in March 1965, known as Bloody Sunday in Selma, Alabama. The film tells the story through the eyes of an 9-year-old African-American girl named Sheyann Webb (Jurnee Smollett). It was directed by Charles Burnett, one of the pioneers of African-American independent cinema. It premiered on ABC on January 17, 1999.\nSheyann Webb sees Dr. Martin Luther King Jr. going into Brown Chapel AME Church one day while playing outside with her friends. They are told that Dr. King has come to Selma, Alabama to help the Negro people get voting rights. Sheyann learns many things from Dr. King. He teaches her and her friend Rachel (Stephanie Zandra Peyton) that when asked, \"Children, what do you want?\" their answer should be \"Freedom.\" He also teaches her that everyone deserves to be treated with fairness, regardless of the color of their skin, and that children also have a battle to fight. Sheyann wants to get involved and skips school to sneak into the meetings. One night a friend of Sheyann's named Jimmie Lee Jackson is killed. To draw attention to the death of Jimmie Lee Jackson, it is decided that a 54-mile march to the state capital of Alabama will take place. Marchers will present a petition to Governor Wallace to protest that Negroes are not being treated fairly. On Sunday, March 7, 1965, a day that comes to be called Bloody Sunday, Sheyann and other African-American protesters march over the Edmund Pettus Bridge en route to Montgomery, and are attacked by police. Sheyann is the youngest person to attempt to march.\nIn August, President Lyndon Johnson signs the Voting Rights Act of 1965, to oversee and enforce constitutional rights of suffrage and prevent discriminatory measures, such as use of literacy tests against potential voters.\n",
        "type": []
    },
    "72": {
        "link": "/wiki/John_Lewis",
        "title": "John Lewis",
        "date": "July 17, 2020(2020-07-17) (aged 80) Atlanta, Georgia, U.S.",
        "year": "2020",
        "location": "",
        "state": "",
        "place": "Atlanta",
        "county": "Montgomery County",
        "paragraph": "\nJohn Robert Lewis (February 21, 1940 – July 17, 2020) was an American politician and civil rights activist who served in the United States House of Representatives for Georgia's 5th congressional district from 1987 until his death in 2020. He participated in the 1960 Nashville sit-ins, the Freedom Rides, was the chairman of the Student Nonviolent Coordinating Committee (SNCC) from 1963 to 1966, and was one of the \"Big Six\" leaders of groups who organized the 1963 March on Washington. Fulfilling many key roles in the civil rights movement and its actions to end legalized racial segregation in the United States, in 1965 Lewis led the first of three Selma to Montgomery marches across the Edmund Pettus Bridge where, in an incident which became known as Bloody Sunday, state troopers and police attacked Lewis and the other marchers.\nA member of the Democratic Party, Lewis was first elected to the U.S. House of Representatives in 1986 and served 17 terms. The district he represented included most of Atlanta. Due to his length of service, he became the dean of the Georgia congressional delegation. Lewis was one of the leaders of the Democratic Party in the House, serving from 1991 as a chief deputy whip and from 2003 as a senior chief deputy whip. He received many honorary degrees and awards, including the Presidential Medal of Freedom in 2011.\n",
        "type": []
    },
    "73": {
        "link": "/wiki/James_Bonard_Fowler",
        "title": "James Bonard Fowler",
        "date": "July 5, 2015(2015-07-05) (aged 81) Geneva County, Alabama, U.S.",
        "year": "2015",
        "location": "",
        "state": "Alabama",
        "place": "Geneva County",
        "county": "Geneva County",
        "paragraph": "\nJames Bonard Fowler (September 10, 1933 – July 5, 2015) was an Alabama state trooper, known for fatally shooting civil rights activist Jimmie Lee Jackson on February 18, 1965, during a peaceful march by protesters seeking voting rights. Fowler was among police and state troopers who attacked unarmed marchers that night in Marion, Alabama. A grand jury declined to indict him that year. It was not until 2005 that Fowler acknowledged shooting Jackson, a young deacon in the Baptist church, claiming to have acted in self defense. In response to Jackson's death, several days later civil rights leaders initiated the Selma to Montgomery marches as part of their campaign for voting rights. That year Congress passed the Voting Rights Act of 1965, which President Lyndon B. Johnson signed.[1]\nAfter the shooting, Fowler was reassigned to Birmingham. In 1968 he was dismissed from the state troopers after physically attacking his supervisor. He enlisted in the US Army, serving with valor in Vietnam. He was awarded two Silver Stars and a Purple Heart. After the war, he became a heroin trafficker in northern Thailand, returning to the US for brief visits. During his time in Thailand, he was convicted of heroin trafficking and served five years in a Thai prison. After returning to the US permanently in 1996, Fowler farmed with his wife in rural Geneva County, Alabama.\n",
        "type": [
            "shooting"
        ]
    },
    "74": {
        "link": "/wiki/Casey_White_prison_escape",
        "title": "Casey White prison escape",
        "date": "April 29 – May 9, 2022 (2022-04-29 – 2022-05-09)",
        "year": "2022",
        "location": "Lauderdale County Jail, Florence, Alabama, U.S.",
        "state": "Alabama",
        "place": "Lauderdale County Jail",
        "county": "Lauderdale County",
        "paragraph": "\nVicky White (charges dropped after death):\nThe prison escape of Casey White took place on April 29, 2022, when White, who was awaiting trial in a capital murder case, escaped the Lauderdale County Jail in Florence, Alabama, United States. Corrections officer Vicky White (no relation) engineered and facilitated the escape by taking Casey in a car to what she claimed to her coworkers was a scheduled mental health evaluation at the courthouse.[1] The manhunt for the pair was widely covered by American media.\n",
        "type": [
            "murder"
        ]
    },
    "75": {
        "link": "/wiki/Marie_Foster",
        "title": "Marie Foster",
        "date": "September 6, 2003(2003-09-06) (aged 85) Selma, Alabama, United States",
        "year": "2003",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "\nMarie Priscilla Martin Foster (October 24, 1917 – September 6, 2003) was a leader in the Civil Rights Movement in the U.S. during the 1960s. Her successful voter registration in Dallas County, Alabama fueled her to become an activist, and she began teaching adult classes to help people pass the required literacy tests. She was the Alabama foot soldier that convinced Martin Luther King Jr. to come to Selma, Alabama and helped organize the Selma to Montgomery marches in 1965. Her dedication gave her the moniker \"The Mother of the Voting Rights Movement,\" which was shortened to Mother Foster.[1]\nMarie Foster was born Maria Priscilla Martin on October 24, 1917 near Alberta, Alabama in the Black Belt. Like the rest of the South, Wilcox County, Alabama was segregated, and educational opportunities were limited for Black students. Going against her husband's wishes, Foster's mother moved her and her siblings to Selma to ensure her children got the best education they could.[2]\n",
        "type": []
    },
    "76": {
        "link": "/wiki/John_Louis_Evans",
        "title": "John Louis Evans",
        "date": "April 22, 1983(1983-04-22) (aged 33) Holman Correctional Facility, Atmore, Alabama, U.S.",
        "year": "1983",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "John Louis Evans III (January 4, 1950 – April 22, 1983) was the first inmate to be executed by the state of Alabama after the United States reinstituted the death penalty in 1976. The manner of his execution is frequently cited by opponents of capital punishment in the United States. Evans was born in Beaumont, Texas, and was executed at the Holman Correctional Facility near Atmore, Alabama, at the age of 33.\nAfter his 1976 parole from an Indiana prison, Evans and fellow convict Wayne Ritter (January 30, 1954 – August 28, 1987) embarked on a two-month-long crime spree involving, by Evans's own admission, over thirty armed robberies, nine kidnappings, and two extortion schemes across seven states. On January 5, 1977, he and Ritter robbed and killed Edward Nassar, a pawn shop owner in Mobile, Alabama, while his two young daughters were in the store. The perpetrators fled but were captured on March 7 by FBI agents in Little Rock, Arkansas. The evidence recovered was the gun used to shoot Nassar in the back and another gun stolen from the pawn shop.\nAlthough he gave a detailed confession, prosecutors refused to accept his plea of guilty because they wanted Evans sentenced to death, and under Alabama law, this is only allowed following a conviction by a jury. Evans was tried in State Circuit Court in Mobile, Alabama on April 26, 1977, for first-degree murder committed during the commission of a robbery. During the trial, Evans again admitted to his crime and stated that he did not feel remorse and that under the same circumstances, he would kill again. Furthermore, he threatened that if the jury did not sentence him to death, he would escape and murder each of them. Despite his testimony, the jury was instructed to consider all the evidence and return a guilty verdict only if the prosecutors had left no reasonable doubt. After less than fifteen minutes of deliberation, the jury convicted Evans of the capital offense charged, thus imposing the death penalty.\n",
        "type": [
            "robbery",
            "murder",
            "robber",
            "kidnapping",
            "robberies"
        ]
    },
    "77": {
        "link": "/wiki/Devin_Moore_(murderer)",
        "title": "Devin Moore (murderer)",
        "date": "June 7, 2003",
        "year": "2003",
        "location": "",
        "state": "Alabama",
        "place": "Fayette",
        "county": "Fayette County",
        "paragraph": "Devin Moore (born Devin Darnell Thompson on May 15, 1985[2] in Fayette, Alabama) is a convicted murderer from Alabama who sparked a controversy over the video game Grand Theft Auto: Vice City when he committed three acts of first-degree murder in the Fayette, Alabama police station in 2003. Moore killed two policemen (Arnold Strickland and James Crump) and a dispatcher (Leslie Mealer) after being booked on suspicion of stealing a car. He then fled in a highway patrol vehicle.\nMoore was apprehended later in Mississippi. According to the Associated Press, after his recapture he said, \"Life is a video game. Everybody's got to die sometime.\" Once in custody, Moore quickly confessed. He told detectives that he shot the men because he didn't want to go to jail.[3]: 139 \nThe controversy involving his relation to Grand Theft Auto was revealed during an episode of 60 Minutes on March 4, 2005. In the episode, a student demonstrated Grand Theft Auto to them, showing them the adult nature of the game.[4] Moore, who recently graduated from high school at the time, had no criminal record and was never in trouble before. He had enlisted in the Air Force and was due to leave for service at the end of the summer.\n",
        "type": [
            "murder",
            "theft"
        ]
    },
    "78": {
        "link": "/wiki/University_of_Alabama_in_Huntsville_shooting",
        "title": "University of Alabama in Huntsville shooting",
        "date": "February 12, 2010; 12 years ago (2010-02-12) 4:00 p.m. (CST)",
        "year": "2010",
        "location": "Huntsville, Alabama, U.S.",
        "state": "Alabama",
        "place": "Huntsville",
        "county": "Madison County",
        "paragraph": "\nOn February 12, 2010, three people were killed and three others wounded in a shooting at the University of Alabama in Huntsville (UAH) in Huntsville, Alabama, United States. During a routine meeting of the biology department attended by approximately 12 people, Amy Bishop, a biology professor at the university, began shooting those nearest her with a Ruger P95 handgun.\nBishop was charged with one count of capital murder and three counts of attempted murder. On September 11, 2012, she pleaded guilty to the charges after family members of victims petitioned the judge against use of the death penalty. The jury heard a condensed version of the evidence on September 24, as required by Alabama law. The same day, Bishop was sentenced to life in prison without the possibility of parole.[1]\n",
        "type": [
            "murder",
            "mass shooting",
            "shooting"
        ]
    },
    "79": {
        "link": "/wiki/Albert_Patterson",
        "title": "Albert Patterson",
        "date": "June 18, 1954(1954-06-18) (aged 60) Phenix City, Alabama, U.S.",
        "year": "1954",
        "location": "",
        "state": "Alabama",
        "place": "Phenix City",
        "county": "Russell County",
        "paragraph": "\nAlbert Love Patterson (January 27, 1894 – June 18, 1954) was an American politician and attorney in Phenix City, Alabama. He was assassinated outside his law office shortly after he had won the Democratic nomination for Alabama Attorney General on a platform of reforming the rife corruption and vice in Phenix City.\nPatterson was born in the New Site community in Tallapoosa County sometime between 1891 and 1897, depending on what source is used. According to his driver's license at the time of his death, his date of birth was January 27, 1894.[2] He was the son of Mary Green (Sorrell) and Delona Patterson,[3] and grew up on a farm with seven siblings. He left Alabama as a teenager to seek a better life. He eventually settled in East Texas, working as a day laborer on farms and oil fields.[2]\n",
        "type": []
    },
    "80": {
        "link": "/wiki/Martin_Luther_King_Jr.",
        "title": "Martin Luther King Jr.",
        "date": "April 4, 1968(1968-04-04) (aged 39) Memphis, Tennessee, U.S.",
        "year": "1968",
        "location": "",
        "state": "",
        "place": "Memphis",
        "county": "Pickens County",
        "paragraph": "\n\nCampaigns\n",
        "type": [
            "murder"
        ]
    },
    "81": {
        "link": "/wiki/Jimmy_Wilson_(robber)",
        "title": "Jimmy Wilson (robber)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "\nJames E. Wilson (born c. 1904),[1] was an American farmhand who was convicted of violent robbery by an Alabama court in 1958 and sentenced to death.[2] His case became a cause célèbre due to the small amount stolen ($1.95) and that Wilson, as an African-American, was convicted by an all-white jury.\nThe case became a source of embarrassment for the United States at the height of the Cold War, as it suggested that American promotion of democratic principles overseas was hypocritical when it did not seem to uphold the same standards in its own states.[3]\nJames Wilson was born in Alabama in 1904.[4] He was illiterate.[5]\n",
        "type": [
            "robber",
            "robbery"
        ]
    },
    "82": {
        "link": "/wiki/Judge_Edward_Aaron",
        "title": "Judge Edward Aaron",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nJudge Edward Aaron (born 1923) was an African American handyman in Birmingham, Alabama who was abducted by seven members of  Asa Earl Carter's independent Ku Klux Klan group on Labor Day, September 2, 1957.[1]\nAaron, who was mildly developmentally disabled, was abducted by Klan members who beat him with an iron bar, carved the letters \"KKK\" into his chest, castrated him with a razor, and poured turpentine on his wounds. They then put him in the trunk of a car and drove him away from the scene, finally dumping him near a creek.[2] Police found Aaron, near death from blood loss, and took him to Hillman Hospital.[3]\n",
        "type": [
            "torture",
            "kidnapped"
        ]
    },
    "83": {
        "link": "/wiki/Lisa_Ann_Millican",
        "title": "Alvin and Judith Neelley",
        "date": "September 28, 1982(1982-09-28) (aged 13) Alabama",
        "year": "1982",
        "location": "",
        "state": "",
        "place": "Wetumpka",
        "county": "Elmore County",
        "paragraph": "Alvin Howard Neelley, Jr. (July 15, 1953 – October 21, 2005) and Judith Ann Adams Neelley (born June 7, 1964) are an American married couple who committed the kidnappings and torture murders of Lisa Ann Millican and Janice Kay Chatman; they also attempted a third abduction. Judith was sentenced to death in 1983, but her sentence was commuted to life imprisonment in 1999.[1] She served her sentence at the Julia Tutwiler Prison for Women in Wetumpka, Alabama.[2] Alvin was serving a life sentence at the Bostick State Prison in Hardwick, Georgia at the time of his death in 2005.[1]\nAlvin Howard Neelley, Jr., was born in 1953 in Georgia, where he was a car thief during his teenage years. He met his second wife, Judith Ann Adams, when he was 26 years old and she was 15. Alvin divorced his first wife shortly before eloping with Judith in 1980.[3]\nJudith Ann Adams was born in Murfreesboro, Tennessee, on June 7, 1964. Her father, an alcoholic, died in a motorcycle accident when she was nine. After meeting Neelley, she began her life of crime, committing armed robberies across the country (even when heavily pregnant) for which she was later caught. She gave birth to twins while incarcerated at Rome, Georgia's Youth Development Center.[3]\n",
        "type": [
            "thief",
            "torture",
            "murder",
            "robber",
            "kidnapping",
            "robberies"
        ]
    },
    "84": {
        "link": "/wiki/Whatley,_Alabama_race_riot_of_1919",
        "title": "Whatley, Alabama race riot of 1919",
        "date": "Friday, August 1, 1919",
        "year": "1919",
        "location": "Whatley, Alabama, United States",
        "state": "Alabama",
        "place": "Whatley",
        "county": "Clarke County",
        "paragraph": "The Whatley, Alabama race riot of 1919 was a riot, gun battle between the local Black and White community on August 1, 1919.\nFrom July 27, 1919, to August 3, 1919, there was a Chicago Race Riot that was covered extensively in national media. This increased tension in both the Black and White communities. Also, in July 1919 there were a number of racial incidents in Alabama including a race riot in Tuscaloosa, Alabama and in Hobson City, Alabama the black mayor, Newman O'Neal, faced death threats and was assaulted forcing him to flee.\nOn August 1, 1919, a fight broke out between a White man and a group of Black youths. The violence quickly spiralled out of control and a gun battle broke out between White and Black communities where two white men and one Black man were shot but not seriously. However on August 2, 1919, a black man by the name of Archie Robinson and another black man were taken from their home and lynched.They are memorialized in the National Memorial for Peace and Justice in Montgomery, Alabama. [1] A few of those wounded were Fred Bates and Charles Chapman who received a bullet in the hip.[2] [3] The Chattanooga News reported that at one point a white mob had surrounded a group of Blacks in the woods.[3]  Media reports later said that local Sheriff C. E. Cox, of Clarke County was able to suppress the riot with his police presence.[3]\n",
        "type": [
            "assault",
            "riot"
        ]
    },
    "85": {
        "link": "/wiki/John_Doar",
        "title": "John Doar",
        "date": "November 11, 2014(2014-11-11) (aged 92) New York City, New York, US",
        "year": "2014",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "John Michael Doar (December 3, 1921 – November 11, 2014) was an American lawyer and senior counsel with the law firm Doar Rieck Kaley & Mack in New York City. During the administrations of presidents John F. Kennedy and Lyndon B. Johnson, he served first as Deputy Assistant Attorney General for Civil Rights from 1961 to 1965, and then as head of the division from 1965 until 1967. He led the government's response to events such as the admission and protection of James Meredith, the first black student admitted to the University of Mississippi,[1] as well as the evolving response to the civil rights movement promoting integration and voter registration in the South.[2] Additionally, in 1973–74, he served as the lead special counsel for the U.S. House Judiciary Committee's impeachment inquiry staff during the impeachment process against Richard Nixon.[3]\nDoar was born in New Richmond, Wisconsin, the son of Mae and William Doar.[4] In 1940, Doar graduated from St. Paul Academy and Summit School in Saint Paul, Minnesota.[5] He served in the United States Army Air Forces during World War II and was a pilot. He graduated with an A.B. from the School of Public and International Affairs (now Princeton School of Public and International Affairs) at Princeton University in 1944 after completing a senior thesis titled \"An Analysis of Farmer Cooperatives, 1918–1946.\"[6] He then received an LL.B. from the University of California-Berkeley Boalt Hall School of Law. From 1950 to 1960, Doar then worked in his family's law firm in New Richmond, Wisconsin.[4]\nA Republican,[4] Doar served as Deputy Assistant and then Assistant Attorney General for Civil Rights in the U.S. Dept. of Justice, from 1960 to 1967,[7] during which time he was involved in several of the most significant events of the American civil rights movement. In 1961 he operated in Montgomery, Alabama, along with his assistant, John Seigenthaler, to protect the Freedom Riders.[8]  In 1962, he confronted Ross Barnett over Barnett's attempts to prevent James Meredith from entering the segregated University of Mississippi. He also prosecuted Collie Leroy Wilkins for federal civil rights violations in the murder of Viola Liuzzo,[9] gaining conviction by an all-white jury in Alabama. In 1963, he calmed an angry mob after the assassination of civil rights leader Medgar Evers, murdered outside his home.[10]\n",
        "type": [
            "murder"
        ]
    },
    "86": {
        "link": "/wiki/Dunn_v._Ray",
        "title": "Dunn v. Ray",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "Dunn v. Ray, 586 U.S. ___ (2019), was a February 2019 United States Supreme Court case related to religious freedom. The case attracted media attention in early February 2019. Defendant Domineque Hakim Marcelle Ray (May 31, 1976 – February 7, 2019), an Alabama death row inmate scheduled for execution on February 7, 2019, argued that he had the right to have a Muslim imam present in the execution chamber, instead of the Christian chaplain mandated by Alabama's execution protocol. Ray received a stay from the 11th Circuit Court of Appeals the day before his execution, but Alabama moved for the Supreme Court to vacate the stay of execution. The Supreme Court vacated the stay and Ray was executed on his scheduled date.[1][2] He was one of 22 people executed in the United States in 2019.\nThe ruling was criticized by many commentators.[3]\nOn March 28, 2019, less than two months after Ray's execution, the Supreme Court stayed the execution of Patrick Murphy in Texas over concerns that not allowing him to have a Buddhist spiritual advisor instead of the Christian chaplain or Muslim imams, only two religions' spiritual advisors permitted by Texas to be present in the execution chamber, would violate his Constitutional rights. The ruling on Murphy renewed attention to Ray's case due to the similarity and proximity of the cases.[4][5] and the lack of explanation from justices Alito, Kavanaugh and Roberts for their latest positions.[6]\n",
        "type": []
    },
    "87": {
        "link": "/wiki/Lynching_of_Jesse_Thornton",
        "title": "Lynching of Jesse Thornton",
        "date": "June 22, 1940; 82 years ago (1940-06-22)",
        "year": "1940",
        "location": "Luverne, Alabama",
        "state": "Alabama",
        "place": "Luverne",
        "county": "Crenshaw County",
        "paragraph": "\nJesse Thornton was a 26-year old African-American  man who was lynched in the town of Luverne, Alabama, on June 22, 1940. Thornton was lynched for allegedly refusing to address a white man as \"Mister\". He was shot to death, and his body was thrown into the Patsaliga River.[1] The Equal Justice Initiative documented that the white man Thornton had apparently offended by his Jim Crow infraction was a police officer.[2]\nAccording to Legacy of Lynching, the killing took place on June 21. Police officer Rhodes hears Thornton mention his name, apparently leaving out \"Mr.\" He arrested him but while he was taking him to jail, a mob started throwing stones at Thornton, who was held by another officer, Nolan Ellis. Thornton managed to escape but was shot by the mob, which pursued him and then shot him dead. The mob then went to his house where they abused Nellie May, Thornton's wife. Later, they came back to the house, abducted May, and threatened to kill her if she would tell on them. The NAACP's local chapter investigated, and with the assistance of Thurgood Marshall sent a report to the United States Department of Justice. No prosecution resulted from the investigation or the report.[3]\n",
        "type": [
            "murder",
            "killing",
            "lynching"
        ]
    },
    "88": {
        "link": "/wiki/James_Coyle",
        "title": "James Coyle",
        "date": "August 11, 1921(1921-08-11) (aged 48) Birmingham, Alabama, United States",
        "year": "1921",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "James Edwin Coyle (March 23, 1873 – August 11, 1921) was a Catholic priest who was murdered in Birmingham, Alabama by a Ku Klux Klan member for performing an interracial marriage.\nJames Coyle was born in Drum, County Roscommon, United Kingdom of Great Britain and Ireland, now modern day Ireland, to Owen Coyle and his wife Margaret Durney.[1] He attended Mungret College in Limerick and the Pontifical North American College in Rome, and was ordained a priest at age 23 on May 30, 1896.\nLater that year, he sailed with another priest, Father Michael Henry, to Mobile, Alabama, and served under Bishop Edward Patrick Allen. He became an instructor, and later rector, of the McGill Institute for Boys. In 1904 Bishop Allen appointed Coyle to succeed Patrick O'Reilly as pastor of St. Paul's Church (later Cathedral) in Birmingham, where he was well received and loved by the congregation.[2] Father Coyle was the Knights of Columbus chaplain of Birmingham, Alabama Council 635.[3]\n",
        "type": [
            "murder"
        ]
    },
    "89": {
        "link": "/wiki/Lynching_of_Josh_Shorter",
        "title": "Lynching of Josh Shorter",
        "date": "June 9, 1881; 141 years ago (1881-06-09)",
        "year": "1881",
        "location": "Eufaula, Alabama",
        "state": "Alabama",
        "place": "Eufaula",
        "county": "Barbour County",
        "paragraph": "\nJosh Shorter was an African-American man who was lynched in Eufaula, Alabama, or between Eufaula and Georgetown, Georgia, in early June 1881. \nThe lynching is described in an article in The Weekly, a newspaper published in Georgia, on June 18, 1881: \"A special telegram from Eufaula under date of the 9th, states that a moat villainous outrage was committed upon a respectable white girl, twelve years old, by Josh Shorter, a negro, near city, on Wednesday afternoon. A diligent pursuit by a large party resulted in his capture across the river in Georgia. He was immediately carried to the Alabama side, and upon the Sheriff’s attempting to get possession of him, they hurried him hack to Georgia with a large crowd and hung him to a limb of a largo tree, about midway between Eufaula and Georgetown.\"[1]\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "90": {
        "link": "/wiki/Chuck_Fager",
        "title": "Chuck Fager",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Fayetteville",
        "county": "Talladega County",
        "paragraph": "Charles Eugene Fager (born 1942), known as Chuck Fager, is an American activist, author, editor, publisher and an outspoken and prominent member of the Religious Society of Friends or Quakers. He is known for his work in both the Civil Rights Movement and in the Peace movement. His written works include religious and political essays, humor, adult fiction, and juvenile fiction, and he is best known for his 1974 book Selma 1965: The March That Changed the South, his in-depth history of the 1965 Selma Voting Rights Movement which led to the passage of the Voting Rights Act.\nFager served as Director of Quaker House in Fayetteville, North Carolina, a peace project founded in 1969 near Fort Bragg, a major US Army base from 2002 to 2012.[1][2][3]\nCharles E. Fager was born in Kansas to a Roman Catholic family. He is the oldest of eleven children. He grew up on various United States Air Force bases.[4]\n",
        "type": []
    },
    "91": {
        "link": "/wiki/James_Orange",
        "title": "James Orange",
        "date": "February 16, 2008(2008-02-16) (aged 65) Atlanta, Georgia, U.S.",
        "year": "2008",
        "location": "",
        "state": "Alabama",
        "place": "Atlanta",
        "county": "Montgomery County",
        "paragraph": "\nJames Edwards Orange[1] (October 29, 1942 – February 16, 2008), also known as \"Shackdaddy\",[2] was a leading civil rights activist in the Civil Rights Movement in America. He was assistant to Martin Luther King Jr. in the civil rights movement.[3] Orange joined the civil rights marches led by King and Ralph Abernathy in Atlanta in 1963.[3] Later he became a project coordinator for Southern Christian Leadership Conference, drawing young people into the movement.[3]\nJames Edward Orange was born in Birmingham, Alabama, but moved to Atlanta, Georgia in the early 1960s.[4] Orange, at over 6 feet 3 inches (1.91 m) tall[5][4] and over 300 pounds (140 kg),[6] was physically impressive but deeply committed to non-violence. In his attempts to convert gang members in Chicago to adopt nonviolent principles, he endured nine beatings without resistance.[5] He was also known for preaching and singing in a strong baritone voice.[6]\n",
        "type": []
    },
    "92": {
        "link": "/wiki/Mitcham_War",
        "title": "Mitcham War",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Clarke County",
        "county": "Clarke County",
        "paragraph": "The Mitcham War was a bloody conflict that occurred in Clarke County, Alabama in the early 1890s.[1]\nThe conflict was between rural farmers in remote section of Clarke County named Mitcham Beat and merchants in Coffeeville and other towns near the Mitcham Beat.[1]  Some accounts characterize the conflict as resulting from the 1892 elections that left rural whites disenfranchised and angry and resulting in racial violence.[2]\nAround 1890, a group of young rural men formed a secret society called \"Hell-at-the-Breech\" that believed their local economy was being controlled by a small group.  On December 25, 1892, the gang entered Coffeeville and murdered a prominent businessman.[1]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "93": {
        "link": "/wiki/William_Lewis_Moore",
        "title": "William Lewis Moore",
        "date": "April 23, 1963(1963-04-23) (aged 35) Attalla, Alabama, U.S.",
        "year": "1963",
        "location": "",
        "state": "Alabama",
        "place": "Attalla",
        "county": "Etowah County",
        "paragraph": "William Lewis Moore  (April 28, 1927 – April 23, 1963) was a postal worker and Congress of Racial Equality (CORE) member who staged lone protests against racial segregation. He was assassinated in Keener, Alabama, during a protest march from Chattanooga, Tennessee to Jackson, Mississippi, where he intended to deliver a letter to Governor Ross Barnett, supporting civil rights.\nMoore was born in Binghamton, New York and raised in New York and Mississippi. For a time before his death he lived in Baltimore, Maryland.\nIn the early 1950s, when Moore was a graduate student at Johns Hopkins University, he had a mental breakdown. He was institutionalized for a year and a half with a diagnosis of schizophrenia. After being released, he became an activist on behalf of the mentally ill. He gradually got involved in civil rights activism for African Americans.\n",
        "type": [
            "murder"
        ]
    },
    "94": {
        "link": "/wiki/Murder_of_Willie_Brewster",
        "title": "Murder of Willie Brewster",
        "date": "July 15, 1965; 57 years ago (1965-07-15)",
        "year": "1965",
        "location": "Anniston, Alabama",
        "state": "Alabama",
        "place": "Anniston",
        "county": "Calhoun County",
        "paragraph": "City of Birmingham\nCity of Montgomery\nCity of Selma\n",
        "type": [
            "murder"
        ]
    },
    "95": {
        "link": "/wiki/Jonathan_Daniels",
        "title": "Jonathan Daniels",
        "date": "August 20, 1965(1965-08-20) (aged 26) Hayneville, Alabama, U.S.",
        "year": "1965",
        "location": "",
        "state": "Alabama",
        "place": "Hayneville",
        "county": "Lowndes County",
        "paragraph": "\nJonathan Myrick Daniels (March 20, 1939 – August 20, 1965) was an Episcopal seminarian and civil rights activist. In 1965, he was killed by a special county deputy, Tom Coleman, who was a construction worker, in Hayneville, Alabama, while in the act of shielding 17-year-old Ruby Sales.[1] He saved the life of the young Black civil rights activist. They were both working in the nonviolent civil rights movement in Lowndes County to integrate public places and register Black voters after passage of the Voting Rights Act that summer. Daniels' death generated further support for the civil rights movement.\nIn 1991, Daniels was designated as a martyr in the Episcopal church, and is recognized annually in its calendar.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "96": {
        "link": "/wiki/Robert_Melson_(murderer)",
        "title": "Robert Melson (murderer)",
        "date": "April 15, 1994",
        "year": "1994",
        "location": "",
        "state": "Alabama",
        "place": "Popeyes",
        "county": "Mobile County",
        "paragraph": "Robert Bryant Melson (June 5, 1971 – June 8, 2017)[1] was an Alabama prison inmate who was executed for the 1994 murders of three workers at a Popeyes restaurant in Gadsden.[2]\nOn the night of April 15, 1994, Melson and his accomplice Cuhuatemoc Hinricky Peraita (born May 19, 1976)[1] entered a Popeyes restaurant in east Gadsden through the back door of the building after employee Darrell K. Collier unlocked it to allow fellow employees Nathaniel Baker and Bryant Archer to take out the trash. Upon entry, Melson and Peraita ordered Archer, Baker, Collier, and another employee, Tamika Collins, into the restaurant's office and demanded that they empty the safe. They complied, after which Melson ordered the group to get inside the restaurant's freezer. Shortly after locking them in the freezer, Melson unlocked the door and opened fire. Baker, Collier and Collins all died of their wounds before paramedics arrived. Archer was shot four times, but he survived and was able to crawl to the restaurant's office to call 911.[3][4]\nMelson was convicted of his role in the crime, sentenced to death on May 17, 1996, and placed on death row under Alabama Department of Corrections ID 0000Z601.[1] Peraita was sentenced to life without parole. He killed a fellow inmate on December 11, 1999, and was given a death sentence in October 2001. Melson had two execution dates set in 2010, both of which were stayed. On April 5, 2017, Melson had an execution date set for June 8, 2017.[5] He received a temporary stay from an appellate court on June 2, but the U.S. Supreme Court vacated the stay on June 6 without comment. At 5:45 p.m. on the night of the execution, the U.S. Supreme Court granted a temporary stay so Justice Clarence Thomas could review Melson's appeals. The stay was later lifted and the execution began at 9:55 p.m. Melson was pronounced dead at 10:27 p.m.[6]\n",
        "type": [
            "murder"
        ]
    },
    "97": {
        "link": "/wiki/J._L._Chestnut_Jr.",
        "title": "J. L. Chestnut Jr.",
        "date": "September 30, 2008(2008-09-30) (aged 77) Birmingham, Alabama",
        "year": "2008",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "J. L. Chestnut Jr. (December 16, 1930 – September 30, 2008)[1] was an author, attorney, and a figure in the Civil Rights Movement.\nHe was the first African-American attorney in Selma, Alabama, and the author of the 1991 autobiographical book, Black in Selma: The Uncommon Life of J.L. Chestnut, Jr.,[2] which chronicles the history of the Selma Voting Rights Movement, including the 1965 Selma to Montgomery marches and Bloody Sunday.\nChestnut was born in Selma, and attended Howard University Law School. He returned home as Selma's only black attorney, and represented civil rights demonstrators at trial there when the Selma Movement began in the 1960s.\nIn 1986, Chestnut was one of the founders of the New South Coalition, along with Birmingham, Alabama Mayor Richard Arrington, when the Alabama Democratic Party refused to endorse Jesse Jackson for the Democratic presidential nomination.[3]\n",
        "type": []
    },
    "98": {
        "link": "/wiki/Lynching_of_Willie_Lee_Jenkins",
        "title": "Lynching of Willie Lee Jenkins",
        "date": "January 10, 1922",
        "year": "1922",
        "location": "Eufaula, Barbour County, Alabama",
        "state": "Alabama",
        "place": "Eufaula",
        "county": "Barbour County",
        "paragraph": "Willie Lee Jenkins was lynched in Eufaula, Barbour County, Alabama. According to the United States Senate Committee on the Judiciary it was the 3rd of 61 lynchings during 1922 in the United States. [1]\nAccording to his grand daughter Shirley Johnson, her grandfather had a dispute with his boss' wife which cost him his life.[2] Newspapers of the time reported that he \"insulted a white woman.\"[3]\nHe tried to escape by train but a mob dragged him off, took him into the woods and killed him.[2] His corpse was found in the bottom of a well in Barbour County, 4 miles (6.4 km) from Eufaula on the Batesville road.[3]\n",
        "type": [
            "riot",
            "lynching"
        ]
    },
    "99": {
        "link": "/wiki/De%27Runnya_Wilson",
        "title": "De'Runnya Wilson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nDe’Runnya S. Wilson[1] (September 14, 1994 – January 21, 2020) was an American football wide receiver for the Albany Empire of the Arena Football League (AFL). He played college football for the Mississippi State Bulldogs.\nWilson attended Wenonah High School in Birmingham, Alabama, where he was primarily a basketball star, earning first-team Parade All-American honors in 2013. He joined the football team in his senior season, when he caught 31 passes for 682 yards and helped lead the Dragons to a 10-2 season.[1]\n",
        "type": [
            "murder"
        ]
    },
    "100": {
        "link": "/wiki/1919_Lynching_in_Montgomery,_Alabama",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "year": "1919",
        "location": "Montgomery, Alabama, United States",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\nOn 2 AM on September 30, 1919, a day after the lynching of Phifer and Crosky, John Temple was lynched in a hospital for allegedly fatally wounding Policeman Barbaree.[5][6] The two events were not linked.[5]\n",
        "type": [
            "murder",
            "riot",
            "lynching",
            "assault"
        ]
    },
    "101": {
        "link": "/wiki/George_Floyd_protests_in_Alabama",
        "title": "George Floyd protests in Alabama",
        "date": "May 28, 2020–June 7, 2020 (1 week and 3 days)",
        "year": "2020",
        "location": "Alabama, United States",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Alabama, United States. Protests occurred in fourteen various communities in the state.\nA crowd protested peacefully along Quintard Avenue on June 1 and 2.[3]\n",
        "type": [
            "riot"
        ]
    },
    "102": {
        "link": "/wiki/Ralph_Abernathy",
        "title": "Ralph Abernathy",
        "date": "April 17, 1990(1990-04-17) (aged 64) Atlanta, Georgia, U.S.",
        "year": "1990",
        "location": "",
        "state": "",
        "place": "Atlanta",
        "county": "Montgomery County",
        "paragraph": "\nRalph David Abernathy Sr. (March 11, 1926 – April 17, 1990) was an American civil rights activist and Baptist minister. He was ordained in the Baptist tradition in 1948. As a leader of the civil rights movement, he was a close friend and mentor of Martin Luther King Jr. He collaborated with King and E. D. Nixon to create the Montgomery Improvement Association, which led to the Montgomery bus boycott, and co-created and was an executive board member of the Southern Christian Leadership Conference (SCLC). He became president of the SCLC following the assassination of King in 1968; he led the Poor People's Campaign in Washington, D.C.,[1] as well as other marches and demonstrations for disenfranchised Americans. He also served as an advisory committee member of the Congress on Racial Equality (CORE).\nIn 1971, Abernathy addressed the United Nations speaking about world peace. He also assisted in brokering a deal between the FBI and American Indian Movement protestors during the Wounded Knee incident of 1973. He retired from his position as president of the SCLC in 1977 and became president emeritus. Later that year he unsuccessfully ran for the U.S. House of Representatives for the 5th district of Georgia. He later founded the Foundation for Economic Enterprises Development, and he testified before the U.S. Congress in support of extending the Voting Rights Act in 1982.\n",
        "type": []
    },
    "103": {
        "link": "/wiki/Thomas_Edwin_Blanton_Jr.",
        "title": "Thomas Edwin Blanton Jr.",
        "date": "June 26, 2020(2020-06-26) (aged 82) William E. Donaldson Correctional Facility, Bessemer, Alabama, U.S.",
        "year": "2020",
        "location": "",
        "state": "Alabama",
        "place": "Bessemer",
        "county": "Jefferson County",
        "paragraph": "Thomas Edwin Blanton Jr. (June 20, 1938 – June 26, 2020) was an American terrorist and convicted felon, formerly serving four life sentences for his role as conspirator in the 16th Street Baptist Church bombing in Birmingham, Alabama on September 15, 1963, which killed four African-American girls (Carole Robertson, Cynthia Wesley, Addie Mae Collins, and Denise McNair).[1] Blanton, along with Bobby Frank Cherry, was convicted in 2001 in a highly publicized trial of the cold case.[2]\nBlanton was born in Washington, D.C. on June 20, 1938, and was the son of Thomas Edwin \"Pops\" Blanton Sr., who was described in 2001 as a notorious racist in the Birmingham, Alabama area.[3][4]\nBlanton had a tenth-grade education and served as an aircraft mechanic in the Navy from 1956 to 1959. Blanton was a member of the Ku Klux Klan in the early 1960s, along with the other suspects in the bombing.[4]\n",
        "type": [
            "murder",
            "mass murder",
            "terrorist"
        ]
    },
    "104": {
        "link": "/wiki/1910_lynching_in_Centreville,_Alabama",
        "title": "Centreville, Alabama",
        "date": "",
        "year": "1910",
        "location": "",
        "state": "Alabama",
        "place": "Centreville",
        "county": "Bibb County",
        "paragraph": "\nCentreville is a city in Bibb County, Alabama, United States. At the 2020 census, the population was 2,800. The city is the county seat of Bibb County.\nAccording to the U.S. Census Bureau, Centreville has a total area of 9.6 square miles (24.9 km2), of which 9.5 square miles (24.5 km2) are land and 0.15 square miles (0.4 km2), or 1.52%, is water.[2] The city is bordered to the west by the city of Brent by the Cahaba River.\n",
        "type": []
    },
    "105": {
        "link": "/wiki/Annie_Lee_Cooper",
        "title": "Annie Lee Cooper",
        "date": "November 24, 2010(2010-11-24) (aged 100) Selma, Alabama",
        "year": "2010",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "Annie Lee Wilkerson Cooper (June 2, 1910 – November 24, 2010) was an African-American civil rights activist in the 1965 Selma Voting Rights Movement who is best known for punching Dallas County, Alabama Sheriff Jim Clark.\nAnnie Lee Wilkerson Cooper was born on June 2, 1910, as Annie Lee Wilkerson in Selma, Alabama, one of ten children of Lucy Jones and Charles Wilkerson Sr. When Cooper finished seventh grade, she dropped out of school and moved to Kentucky to live with one of her older sisters.[1]\nIn 1962, Cooper returned to Selma to care for her elderly mother.[2] Appalled by the fact that although she had been a registered voter in Pennsylvania and Ohio she was unable to register to vote in Alabama, Cooper began to participate in the Civil Rights Movement.[3] Her attempt to register to vote in 1963 resulted in her being fired from her job as a nurse at a rest home.[2] She then worked as a clerk at the Torch Motel.\n",
        "type": []
    },
    "106": {
        "link": "/wiki/Samuel_B._McKinney",
        "title": "Samuel B. McKinney",
        "date": "April 7, 2018 (aged 91) Seattle, Washington, U.S.",
        "year": "2018",
        "location": "",
        "state": "",
        "place": "Seattle",
        "county": "Jefferson County",
        "paragraph": "Samuel Berry McKinney (December 28, 1926 – April 7, 2018) was an American Christian pastor and Civil Rights leader. He was the pastor of Mount Zion Baptist Church in Seattle for four decades. He attended the Selma to Montgomery marches in 1965, and he served on the Seattle Human Rights Commission.\nSamuel B. McKinney was born on December 28, 1926, in Flint, Michigan.[1][2] He grew up in Cleveland, Ohio, where his father, Wade Hampton McKinney, was a pastor.[1]\nMcKinney graduated from Morehouse College in 1949.[1][2] He earned a divinity degree from Colgate Rochester Crozer Divinity School in 1952.[1][2]\n",
        "type": []
    },
    "107": {
        "link": "/wiki/Julia_Tutwiler_Prison_for_Women",
        "title": "Julia Tutwiler Prison for Women",
        "date": "",
        "year": "",
        "location": "Wetumpka, Alabama",
        "state": "Alabama",
        "place": "Wetumpka",
        "county": "Elmore County",
        "paragraph": "The Julia Tutwiler Prison for Women is a prison for women of the Alabama Department of Corrections (ADOC), located in Wetumpka, Alabama. All female inmates entering ADOC are sent to the receiving unit in Tutwiler.[1] Tutwiler houses Alabama's female death row, which qualifies it for the \"maximum security\" classification.[2]\nKnown as the \"angel of the prisons\", Tutwiler pushed for many reforms of the Alabama penal system. In a letter sent from Julia Tutwiler in Dothan, Alabama to Frank S. White in Birmingham, Alabama, Tutwiler pushed for key issues such as the end to convict leasing, the re-establishment of night school education, and the separation of minor offenders and hardened criminals.[3] Tutwiler's letter cites major controversies during her time such as the Banner Mining Incident of 1911, where 125 of the 128 dead miners were convicts, predominately guilty of minor offenses, leased by state prisons.[4]\nTutwiler additionally suggested medical and psychological treatment for convicts such as rehabilitation for drug addicts, sanitation, and nurses to care for dying inmates who lack families to visit them. Despite her progressive stance on prison reform, Tutwiler also pandered to a segregationist approach to the prison system, advocating the separation of prison inmates by race as it is \"important for public welfare to separate them in all other relations- in schools, in travel, and in social life, it would be better for both races if this could be done here also.\"[3]\n",
        "type": []
    },
    "108": {
        "link": "/wiki/Scotty_Joe_Weaver",
        "title": "Scotty Joe Weaver",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Bay Minette",
        "county": "Baldwin County",
        "paragraph": "Scotty Joe Weaver (March 26, 1986 - July 22, 2004) was an 18-year-old murder victim from Bay Minette, Alabama, whose burned and partially decomposed body was discovered on July 22, 2004, a few miles from the mobile home in which he lived.  He had been beaten, strangled and stabbed numerous times, partially decapitated, and his body doused in gasoline and set on fire.[1]\nThe Baldwin County District Attorney, David Whetstone, stated that Weaver's sexual orientation was a factor in the crime. He remarked that the brutality involved \"is suggestive of overkill, which is not something you see in a regular robbery and murder.\" Alabama's hate crimes statute does not apply to people targeted because of their sexual orientation.\nThree people were charged with capital murder and robbery in connection with the crime, two of whom were Weaver's roommates: Christopher Gaines, aged 20, Nichole Kelsay, aged 18, and Robert Porter, aged 18. Nichole Kelsay had been Weaver's friend throughout most of his life.\n",
        "type": [
            "murder",
            "robbery",
            "robber"
        ]
    },
    "109": {
        "link": "/wiki/Lynchings_in_Elmore_County,_Alabama",
        "title": "Lynchings in Elmore County, Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Elmore County",
        "county": "Elmore County",
        "paragraph": "\nElmore County is a county located in the east-central portion of the U.S. state of Alabama. Throughout its history, there have been many lynchings in the county including on July 2, 1901, when a local mob lynched Robert (or perhaps Robin) White. In a strange turn of events, a local farmer, George White confessed in court to the killing and named five other local men as killers. Three men were convicted in the killing and sentenced to ten years in prison. On 9 June 1902, they were pardoned by Governor Jelks.[1]\nLynching is an extrajudicial killing by a group. In the Jim Crow American South, it was also used as an extreme form of informal group social control, and it is often conducted with the display of a public spectacle (often in the form of hanging) for maximum intimidation. Victims often professed their innocence right up to the public deaths in front of crowds that sometimes numbered in the thousands. Lynching victims are never given their time in court to prove their innonence.\n",
        "type": [
            "riot",
            "killing",
            "lynching"
        ]
    },
    "110": {
        "link": "/wiki/Jakell_Mitchell",
        "title": "Jakell Mitchell",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Opelika",
        "county": "Lee County",
        "paragraph": "\nJakell Lenard Mitchell (January 1, 1996 – December 14, 2014) was an American college football player who was shot and killed during his freshman year at Auburn University. He was a heavily recruited three-sport athlete at Opelika High School in Opelika, Alabama.\nJakell Mitchell was the son of Mario and Arlicia Mitchell.[1] Like Jakell, Mario Mitchell played football at Opelika High School. By his senior season of 1991–92, Mario had become a top defensive line prospect.[2] Following a recruiting visit by Larry Blakeney, head coach at Troy State University and former Auburn quarterback, Mario committed to Troy State and enrolled in the fall of 1992.[2]\n",
        "type": [
            "murder"
        ]
    },
    "111": {
        "link": "/wiki/John_Temple_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "year": "1919",
        "location": "Montgomery, Alabama, United States",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\nOn 2 AM on September 30, 1919, a day after the lynching of Phifer and Crosky, John Temple was lynched in a hospital for allegedly fatally wounding Policeman Barbaree.[5][6] The two events were not linked.[5]\n",
        "type": [
            "murder",
            "riot",
            "lynching",
            "assault"
        ]
    },
    "112": {
        "link": "/wiki/Catesby_ap_Roger_Jones",
        "title": "Catesby ap Roger Jones",
        "date": "June 21, 1877(1877-06-21) (aged 56) Selma, Alabama, United States",
        "year": "1877",
        "location": "",
        "state": "",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "\nCatesby ap Roger Jones (April 15, 1821 – June 21, 1877) was an officer in the U.S. Navy who became a commander in the Confederate Navy during the American Civil War. He assumed command of CSS Virginia during the Battle of Hampton Roads and engaged USS Monitor in the historic first battle of the two ironclads.\nJones was born in Clarke County, Virginia, son of Major General Roger ap Catesby Jones and Mary Ann Mason. His mother was a lineal descendant of William Byrd II of Westover and Robert \"King\" Carter, making her also a cousin of General Robert E. Lee.[1] His uncle was Thomas ap Catesby Jones, a naval officer during the War of 1812 and Mexican–American War. Jones was appointed a midshipman in the United States Navy in 1836, and served extensively at sea, receiving promotion to the rank of lieutenant in 1849. During the 1850s, Jones was involved in development work on navy weapons and served as ordnance officer on the new steam frigate Merrimack when she began active service in 1856.\n",
        "type": [
            "murder"
        ]
    },
    "113": {
        "link": "/wiki/Lynching_of_Albert_Easley",
        "title": "Lynching of Albert Easley",
        "date": "January 20, 1879; 144 years ago (1879-01-20)",
        "year": "1879",
        "location": "Jacksonville, Alabama, U.S.",
        "state": "Alabama",
        "place": "Jacksonville",
        "county": "Calhoun County",
        "paragraph": "Albert Easley was an African-American boy of 13–14 years who was lynched in Jacksonville, Calhoun County, Alabama, on January 20, 1879 after being arrested as a suspect in the assault and rape of Mrs. Moses Ables of nearby Cove Creek, Etowah County, Alabama. Mrs. Ables, a widowed mother of three, was found unconscious but alive three days earlier with severe head injuries and indications that she had been raped. No eyewitnesses were reported and it is not clear why suspicion rested immediately upon Easley. Accounts emphasize that he confessed, though one account claims he admitted only the beating and denied the rape. He was arrested and taken to the jail in Jacksonville about 14 miles from where the crime occurred. At 1 pm a mob of between one hundred and fifty and three hundred persons took Easley from the jail by force and lynched him within the city limits during the daytime. Mrs. Ables died five weeks after the lynching took place.\nNewspaper reports suggest that the crime was committed on Thursday, January 16, just 4 days before the lynching. Mrs. Moses Ables was reportedly found the following day unconscious, suffering from multiple skull fractures and apparently raped.[1] She was presumed to be near death though she survived several weeks following the assault and subsequent lynching.[2]\nIn the press the victim is represented only as Mrs. Ables, Mrs. Moses Ables,[3][4] or the daughter of James Beard.[5] From the 1860[6] and 1870[7] federal censuses it appears that her given name may have been Sophrony or Safrona.\n",
        "type": [
            "murder",
            "lynching",
            "rape",
            "assault"
        ]
    },
    "114": {
        "link": "/wiki/Miles_Phifer_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "year": "1919",
        "location": "Montgomery, Alabama, United States",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\nOn 2 AM on September 30, 1919, a day after the lynching of Phifer and Crosky, John Temple was lynched in a hospital for allegedly fatally wounding Policeman Barbaree.[5][6] The two events were not linked.[5]\n",
        "type": [
            "murder",
            "riot",
            "lynching",
            "assault"
        ]
    },
    "115": {
        "link": "/wiki/Student_Nonviolent_Coordinating_Committee",
        "title": "Student Nonviolent Coordinating Committee",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Greensboro",
        "county": "Hale County",
        "paragraph": "The Student Nonviolent Coordinating Committee (SNCC, often pronounced /snɪk/ SNIK) was the principal channel of student commitment in the United States to the civil rights movement during the 1960s. Emerging in 1960 from the student-led sit-ins at segregated lunch counters in Greensboro, North Carolina, and Nashville, Tennessee, the Committee sought to coordinate and assist direct-action challenges to the civic segregation and political exclusion of African Americans. From 1962, with the support of the Voter Education Project, SNCC committed to the registration and mobilization of black voters in the Deep South. Affiliates such as the Mississippi Freedom Democratic Party and the Lowndes County Freedom Organization in Alabama also worked to increase the pressure on federal and state government to enforce constitutional protections.\nBy the mid-1960s the measured nature of the gains made, and the violence with which they were resisted, were generating dissent from the group's principles of nonviolence, of white participation in the movement, and of field-driven, as opposed to national-office, leadership and direction. At the same time some original organizers were now working with the Southern Christian Leadership Conference (SCLC), and others were being lost to a de-segregating Democratic Party and to federally-funded anti-poverty programs. Following an aborted merger with the Black Panther Party in 1968, SNCC effectively dissolved.\nBecause of the successes of its early years, SNCC is credited with breaking down barriers, both institutional and psychological, to the empowerment of African-American communities.\n",
        "type": []
    },
    "116": {
        "link": "/wiki/Geneva_County_shootings",
        "title": "Geneva County shootings",
        "date": "March 10, 2009; 13 years ago (2009-03-10) c. 3:30 – 4:17 p.m.[1] (EST)",
        "year": "2009",
        "location": "Geneva and Samson, Alabama, United States",
        "state": "Alabama",
        "place": "Geneva County",
        "county": "Geneva County",
        "paragraph": "On March 10, 2009, Michael Kenneth McLendon, 28, fatally shot ten people and wounded six others between the communities of Kinston, Samson, and Geneva, Alabama.  McLendon's shooting spree was the deadliest mass shooting in Alabama's history.[5]\nMcLendon first killed his mother and burned down her house in the town of Kinston. Traveling to Samson, he killed his maternal grandmother, uncle, two cousins, and others, and wounded six.[6] When law enforcement reached him, McLendon committed suicide. He was said to have been depressed about lack of work; in a note he said that his mother's family was not giving him enough support.\nMcLendon began his attacks at about 3:30 p.m. on March 10, 2009 at his mother's house where they lived in Kinston, a town of 540 residents. McLendon shot and killed his mother and their three dogs, and set the interior of the house on fire. He drove to his uncle's house in the small city of Samson, population about 2,000. There he shot his uncle, two cousins, a neighbor, and said neighbor's infant daughter, all of which were sitting on the porch of his uncle and aunt's house. His aunt escaped the shooting uninjured because she was inside the house, while the neighbor's four-month-old daughter survived her gunshot wounds. McLendon then went next door and shot and killed his maternal grandmother.[7]\n",
        "type": [
            "murder",
            "mass shooting",
            "shooting",
            "arson"
        ]
    },
    "117": {
        "link": "/wiki/Murder_of_Lauren_Burk",
        "title": "Murder of Lauren Burk",
        "date": "March 4, 2008",
        "year": "2008",
        "location": "Auburn, Alabama, U.S.",
        "state": "Alabama",
        "place": "Auburn",
        "county": "Lee County",
        "paragraph": "\nThe murder of Lauren Burk occurred on March 4, 2008, in Auburn, Alabama. Burk, an 18-year-old freshman at Auburn University, was kidnapped at gunpoint by Courtney Lockhart. Lockhart, a U.S. military veteran who had been dishonorably discharged, robbed Burk and forced her to strip naked.[1] He drove her around for about 30 minutes, during which he lamented about his unemployment and misfortunes. When Burk attempted to escape Lockhart shot her in the lungs.[2] Burk, who was now severely injured and completely naked except for a pair of socks, was left on Alabama State Route 147.[1][2] Lauren was able to tell law enforcement that her purse/ID was still in the attacker’s car, and she gave a brief description of her attacker and the vehicle, facts that would help police find the culprit relatively quickly. She was later pronounced dead at a local hospital. [3]\nThe murder of Burk, which attracted national attention, was part of a months-long violent crime spree during which Lockhart robbed and assaulted several women.[2][4] The spree began in February 2008 and ended with his arrest on March 7.[1][4] Judge Jacob Walker cited Lockhart's criminal history when he overrode the jury's unanimous recommendation for life in prison and sentenced him to death.[5] Lockhart is currently on death row at the Holman Correctional Facility.[6]\n",
        "type": [
            "murder",
            "kidnapped",
            "assault"
        ]
    },
    "118": {
        "link": "/wiki/Lorenz-Sirloin_Stockade_murders",
        "title": "Roger Dale Stafford",
        "date": "July 1, 1995(1995-07-01) (aged 43) Oklahoma State Penitentiary, McAlester, Oklahoma, U.S.",
        "year": "1995",
        "location": "",
        "state": "Alabama",
        "place": "Purcell",
        "county": "Blount County",
        "paragraph": "Roger Dale Stafford (November 4, 1951 – July 1, 1995) was a convicted serial killer executed for the 1978 murders of the Lorenz Family and six employees of a Sirloin Stockade restaurant in Oklahoma.[1] Stafford never acknowledged his guilt, but Stafford's wife, Verna, implicated him in a total of 34 murders in seven different states.[2]\nStafford began his killing spree on January 12, 1974 by killing 21-year-old Jimmy Earl Berry, a student at the University of North Alabama, working as an assistant manager at a McDonald's restaurant in Muscle Shoals, Alabama. Berry was shot four times and the perpetrator robbed the restaurant of US$1,390.00.[3] This crime remained unsolved until four years after the incident, when Stafford and his brother Harold were implicated by Dale's wife, Verna. Stafford was never prosecuted for Berry's murder because of the Oklahoma murder convictions.[2]\nHe continued on with his murder spree along with his wife, Verna, and brother, Harold, on June 22, 1978. His wife flagged down the Lorenz family on the side of Interstate 35 near Purcell, Oklahoma, when Melvin Lorenz, 38, his wife, Linda, 31, and their son Richard, 12, were traveling to North Dakota for the funeral of Melvin Lorenz's mother. After the Lorenz family stopped to help, Stafford then robbed and murdered the entire family.[1]\n",
        "type": [
            "murder",
            "mass murder",
            "killing"
        ]
    },
    "119": {
        "link": "/wiki/Frank_Minis_Johnson",
        "title": "Frank Minis Johnson",
        "date": "July 23, 1999(1999-07-23) (aged 80) Montgomery, Alabama",
        "year": "1999",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Frank Minis Johnson Jr. (October 30, 1918 – July 23, 1999) was a United States district judge and United States Circuit Judge serving 1955 to 1999 on the United States District Court for the Middle District of Alabama, United States Court of Appeals for the Fifth Circuit and United States Court of Appeals for the Eleventh Circuit. He made landmark civil rights rulings that helped end segregation and disenfranchisement of African Americans in the South. In the words of journalist and historian Bill Moyers, Judge Johnson \"altered forever the face of the South.\"\nJohnson was born in 1918 and grew up in Haleyville in northern Alabama, a longtime independent-minded part of the state. Winston County had opposed secession from the Union during the American Civil War.[1] While a student, he was asked by a staunchly Democratic classmate why he insisted upon being a Republican, to which Johnson replied that there were \"so few of us that one day I might be a federal judge.\" Another classmate George C. Wallace, future governor of the state, overheard the remark and replied, \"Well, that'll be the day. I'll be governor by then.\"[2] Wallace would prove to be Johnson's bête noire during the civil rights era of the 1960s.\nJohnson graduated from the University of Alabama and later the University of Alabama School of Law with a Bachelor of Laws in 1943, and was admitted to the bar.[3]\n",
        "type": []
    },
    "120": {
        "link": "/wiki/Ed_Tutwiler",
        "title": "Ed Tutwiler",
        "date": "September 3, 1932(1932-09-03) (aged 51) Montgomery, Alabama",
        "year": "1932",
        "location": "",
        "state": "",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "\nEdward Magruder \"Tut\" Tutwiler Jr. (September 13, 1880 – September 3, 1932) was a college football player and coach. He played quarterback for the Alabama Crimson Tide of the University of Alabama and the Virginia Cavaliers of the University of Virginia.\nEdward M. Tutwiler, Jr was born on September 13, 1880 in Balcony Falls, Virginia to Maj. Edward Magruder Tutwiler, a wealthy Birmingham philanthropist, and Mary Fendley Jeffray. His father served in the American Civil War, participating in the Battle of New Market as one of the VMI cadets.\n",
        "type": []
    },
    "121": {
        "link": "/wiki/Riverchase_Galleria",
        "title": "Riverchase Galleria",
        "date": "",
        "year": "",
        "location": "Hoover, Alabama",
        "state": "Alabama",
        "place": "Hoover",
        "county": "Jefferson County",
        "paragraph": "Riverchase Galleria, locally known as The Galleria, is a large, super–regional shopping mall and mixed use development in Hoover, Alabama, in the Greater Birmingham metropolitan area. It is ranked 43rd on the list of largest shopping malls in the United States. It is the largest enclosed shopping center in Alabama.\nLocated at the intersection of U.S. Highway 31 (Montgomery Highway) and Interstate 459, the Riverchase Galleria complex includes the region's only Costco, and also includes the 15-story, 1,700,000-square-foot (160,000 m2) Hyatt Regency, and the 17-story, 285,000-square-foot (26,500 m2) Galleria Tower office building. The tower includes the headquarters of Walter Energy, Inc.[2] The mall's anchor stores are JCPenney, Von Maur, Macy's, Belk , and Dave & Buster's. There are two vacant anchor stores which were once Sears and Belk Children's and Home.\nThe Galleria is anchored by 4 department stores: JCPenney, Belk, Macy's, and Von Maur.[3] The Galleria has two large parking decks, with several entrances, attached to the mall.[citation needed]\n",
        "type": [
            "mass shooting",
            "shooting"
        ]
    },
    "122": {
        "link": "/wiki/Nectar_Covered_Bridge",
        "title": "Nectar Covered Bridge",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Blount County",
        "county": "Blount County",
        "paragraph": "The Nectar Covered Bridge was a wood and metal combination style covered bridge which spanned the Locust Fork of the Black Warrior River in Blount County, Alabama, United States.  It was located on Nectar Bridge Road off State Route 160, just east of the town of Nectar, about 14 miles (16 kilometers) northwest of Oneonta.  Nectar Covered Bridge was at one time the seventh-longest covered bridge in the country.  The bridge remained open to single lane motor traffic from its construction until it was burned by vandals on June 13, 1993.[2]\nBuilt in 1934, the 385-foot (117-meter) bridge was a Town Lattice truss construction over four spans.[3]  It was built by a crew led by foreman Zelma C. Tidwell over a wide section of the Locust Fork.[4]  It was the third-longest covered bridge built in Blount County.  At one time, the Nectar Covered Bridge was the seventh longest covered bridge in the country.  The bridge was burned by vandals on June 13, 1993.  It was maintained by the Blount County Commission and the Alabama Department of Transportation.  The Nectar Covered Bridge was listed on the National Register of Historic Places on August 20, 1981.[1]\nThe bridge was once a community meeting place and a site for large baptism ceremonies.[5]  A concrete bridge has since replaced the former covered bridge, but the old stone piers remain across the river south of the current crossing.\n",
        "type": []
    },
    "123": {
        "link": "/wiki/Newman_O%27Neal",
        "title": "Newman O'Neal",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Hobson City",
        "county": "Calhoun County",
        "paragraph": "Newman O'Neal was the mayor of Hobson City, Alabama, until he faced death threats and was assaulted forcing him to flee.\nTo prevent a large population of Black voters from swaying the election of Oxford, Alabama, Mayor Whitehead of Oxford went to the state capitol and had the corporate boundaries of Oxford redrawn to exclude what is now Hobson City. The town was incorporated on August 16, 1899.[1] Records from a contemporary Alabama newspaper, The Peoples' Journal, described the municipality as \"the only municipality controlled and governed entirely by colored people anywhere in the United States.\" The newspaper further commented: \"The whole country will doubtless be interested in the result of this experiment.\" Under the leadership of the first mayor, S. L. Davis, and the first police chief, James Duran, police protection was restored to the area. The town was named after Richmond P. Hobson, a white naval hero in the then-recent Spanish-American War and member of Congress.\nIn the summer of 1919, the mayor of Hobson City, Alabama, was Newman O'Neal. He served his community until he received death threats in the form of a \"black hand letter surmounted by a skull and crossbones.\"[2] He ignored the letter but he was assaulted by unknown aggressors and seriously injured forcing him north into exile in late July 1919.[3] [4] The acting Mayor J. D. Kirksey also received an unsigned death threat letter.[5]  Author Cameron McWhirter says this was a typical tactic of the Ku Klux Klan.[5]\n",
        "type": [
            "assault",
            "riot"
        ]
    },
    "124": {
        "link": "/wiki/West_End_Christian_School_hostage_crisis",
        "title": "West End Christian School hostage crisis",
        "date": "February 2, 1988",
        "year": "1988",
        "location": "Tuscaloosa, Alabama, United States",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "The West End Christian School hostage crisis occurred on February 2, 1988, when James L. Harvey took captive nearly 60 people, mostly children, inside the West End Christian School in Tuscaloosa, Alabama, United States. The siege came to an end when Harvey was shown a videotape made by Alabama Governor H. Guy Hunt in which the governor said that he would be granted a pardon and immunity. However, the promise was considered to have been written under duress, and thus carried no legal weight and was part of a ruse into getting him to surrender. After giving up his weapons, two pistols and a rifle, to authorities and preparing to lead the child hostages outside for what he believed would be a news conference, Harvey was wrestled to the ground by police and arrested.\nHarvey's motives in committing the crime was to spread awareness of homelessness.\n\n",
        "type": []
    },
    "125": {
        "link": "/wiki/G._K._Podila",
        "title": "G. K. Podila",
        "date": "February 12, 2010(2010-02-12) (aged 52) Huntsville, Alabama, US",
        "year": "2010",
        "location": "",
        "state": "",
        "place": "Huntsville",
        "county": "Madison County",
        "paragraph": "Gopi K. Podila (September 14, 1957[1] – February 12, 2010) was an Indian–American biologist who served as a professor at the University of Alabama in Huntsville. He was one of three faculty members killed in a shooting at the university on February 12, 2010.[2] Podila was chairperson of the university's department of biological sciences, with a particular interest in the ecology of Populus and their mycorrhizal symbionts.\nHe listed his research interests as \"engineering tree biomass for bioenergy, functional genomics of plant-microbe interactions, plant molecular biology and biotechnology\".\n[3]\nIn particular, Podila studied genes that regulate growth in fast growing trees, especially poplar and aspen. He has advocated prospective use of fast growing trees and grasses as an alternative to corn sources for producing ethanol.[4] He was also the coordinator of an international consortium of institutions that has deciphered the genome of mycorrhizal fungus, a fungus whose symbiotic properties allow trees to generate large amounts of biomass.[5]\n",
        "type": [
            "shooting"
        ]
    },
    "126": {
        "link": "/wiki/Williamson_Robert_Winfield_Cobb",
        "title": "Williamson Robert Winfield Cobb",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Rhea County",
        "county": "Etowah County",
        "paragraph": "Williamson Robert Winfield Cobb (June 8, 1807 – November 1, 1864) was an American politician who served the state of Alabama in the U.S. House of Representatives between 1847 and 1861.\nHe was born in Rhea County, Tennessee on June 8, 1807 to David Cobb and Martha Bryant. He moved with his father, David Cobb, in 1809 to Bellefonte, Jackson County, Alabama. Cobb received a limited education and worked as a clock peddler and merchant in Bellefonte before being elected to the Alabama House of Representatives in 1844. In 1846 he was elected as a Democrat to the U.S. House of Representatives from Alabama's sixth congressional district, which then included Huntsville and the mountainous counties of northeast Alabama, including Cobb's home county of Jackson, carved out of Madison in 1819.\nCobb was reelected to six additional terms, consistently defeating more affluent, better educated opponents from Huntsville, including Clement Claiborne Clay, by the majority vote of the plain folk of the hill country. Despite owning slaves himself, Cobb ran on an anti-elite platform which garnered support among poor and disenfranchised people.[1][2]\n",
        "type": []
    },
    "127": {
        "link": "/wiki/Strickland_v._Sony",
        "title": "Strickland v. Sony",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Fayette",
        "county": "Fayette County",
        "paragraph": "Strickland v. Sony was a court case that focused on whether violent video games played a role in Devin Moore's first-degree murder/shooting of three people in a police station. In August 2005, former[clarification needed] attorney Jack Thompson filed the lawsuit against Sony.\nDevin Moore was convicted in 2005 for the 2003 shooting of two police officers and a dispatcher as he was being detained for allegedly stealing a car. He grabbed one officer's .45 caliber pistol and killed all three before fleeing the station in a police cruiser he stole from the station. He was eventually caught and sentenced to death by lethal injection.[citation needed]\nIn March 2005, Thompson announced he was filing a lawsuit on behalf of the families of two of the three victims in Fayette, Alabama. He was also featured in a 60 Minutes special on the case.[1]\n",
        "type": [
            "murder",
            "theft",
            "shooting"
        ]
    },
    "128": {
        "link": "/wiki/Vestavia_Hills_church_shooting",
        "title": "Vestavia Hills church shooting",
        "date": "June 16, 2022 (2022-06-16) 6:22 p.m. – c. 6:30 p.m. (UTC−06:00)",
        "year": "2022",
        "location": "St. Stephen's Episcopal Church,3775 Crosshaven DriveVestavia Hills, Alabama, U.S.",
        "state": "Alabama",
        "place": "Vestavia",
        "county": "Jefferson County",
        "paragraph": "\nThe Vestavia Hills church shooting occurred on June 16, 2022 at 6:22 p.m. local time in Vestavia Hills, a suburb of Birmingham, Alabama.  A man entered the St. Stephen's Episcopal Church and opened fire during a potluck meeting, which the church had previously advertised. Two people were killed at the scene, a third died later in hospital, and the suspect is subsequently in custody.[2][3][4] The suspect was a 70 year old Birmingham man named Robert Findlay Smith (born December 23, 1951),[5][1] a gun dealer.[6][7]\nFollowing the shooting, Alabama governor Kay Ivey issued a statement saying that the shooting is \"shocking and tragic,\" adding that \"this should never happen — in a church, in a store, in the city or anywhere.\"[11]\n",
        "type": [
            "shooting"
        ]
    },
    "129": {
        "link": "/wiki/16th_Street_Baptist_Church_bombing",
        "title": "16th Street Baptist Church bombing",
        "date": "September 15, 1963; 59 years ago 10:22 a.m. (UTC-5)",
        "year": "1963",
        "location": "Birmingham, Alabama",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nEvents\nCity of Birmingham\n",
        "type": [
            "murder"
        ]
    },
    "130": {
        "link": "/wiki/Lynda_Lyon_Block",
        "title": "Lynda Lyon Block",
        "date": "October 4, 1993 (1993-10-04)",
        "year": "1993",
        "location": "",
        "state": "",
        "place": "Orlando",
        "county": "Montgomery County",
        "paragraph": "Lynda Cheryle Lyon Block (February 8, 1948 – May 10, 2002) was an American convicted murderer.[1]\nLynda Cheryle Lyon was born February 8, 1948, in Orlando, Florida, to Francis (Frank) Stephen Lyon and Berylene Elisabeth Owen. Lynda, and her sister Denyce (born 1952), lost their father when she was 10, when he died of heart failure. Lynda and her mother were never close, and Block claimed that her mother was both physically and mentally abusive.[2]\nHer second husband, George Sibley (September 8, 1942 – August 4, 2005), claimed that a constant trait of Block was charity. While living in Key West she served as Secretary of the Humane Society, and also as animal abuse investigator. She was also active in civic work besides her service to the Humane Society: for two years she served as president of the Friends of the Library in Key West and served as publicity director for a mayoral candidate.[2]\n",
        "type": [
            "murder"
        ]
    },
    "131": {
        "link": "/wiki/Anniston,_Alabama_in_the_Civil_Rights_era",
        "title": "Anniston, Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Anniston",
        "county": "Calhoun County",
        "paragraph": "\nAnniston is the county seat of Calhoun County in Alabama and is one of two urban centers/principal cities of and included in the Anniston-Oxford Metropolitan Statistical Area. As of the 2010 census, the population of the city was 23,106.[2] According to 2019 Census estimates, the city had a population of 21,287.[3]\nNamed \"The Model City\" by Atlanta newspaperman Henry W. Grady for its careful planning in the late 19th century, the city is situated on the slope of Blue Mountain.\n",
        "type": []
    },
    "132": {
        "link": "/wiki/Brown_Chapel_A.M.E._Church_(Selma,_Alabama)",
        "title": "Brown Chapel A.M.E. Church (Selma, Alabama)",
        "date": "",
        "year": "",
        "location": "410 Martin Luther King, Jr., Street, Selma, Alabama",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "Brown Chapel A.M.E. Church is a church at 410 Martin Luther King Jr. Boulevard in Selma, Alabama, United States. This church was a starting point for the Selma to Montgomery marches in 1965 and, as the meeting place and offices of the Southern Christian Leadership Conference (SCLC) during the Selma Movement, played a major role in the events that led to the adoption of the Voting Rights Act of 1965. The nation's reaction to Selma's \"Bloody Sunday\" march is widely credited with making the passage of the Voting Rights Act politically viable in the United States Congress.[3][4]\nIt was added to the Alabama Register of Landmarks and Heritage on June 16, 1976 and later declared a National Historic Landmark on February 4, 1982.[2][1]\nThe structure sustained significant damage from termites and mold while it was unoccupied during the COVID-19 pandemic, and it was included on the National Trust for Historic Preservation's annual list of America's 11 Most Endangered Places in 2022.[5][6]\n",
        "type": []
    },
    "133": {
        "link": "/wiki/Walter_McMillian",
        "title": "Walter McMillian",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Monroeville",
        "county": "Monroe County",
        "paragraph": "Walter \"Johnny D.\" McMillian (October 27, 1941 – September 11, 2013)[1] was a pulpwood worker from Monroeville, Alabama, who was wrongfully convicted of murder and sentenced to death. His conviction was wrongfully obtained, based on police coercion and perjury. In the 1988 trial, under a controversial Alabama doctrine called \"judicial override\", the judge imposed the death penalty, although the jury had voted for a sentence of life imprisonment.\nFrom 1990 to 1993, the Alabama Court of Criminal Appeals turned down four appeals. In 1993, after McMillian had served six years on Alabama's death row, the Court of Criminal Appeals reversed the lower court decision and ruled that he had been wrongfully convicted.\nThe controversial case received national attention beginning in the fall of 1992. Bryan Stevenson, McMillian's defense attorney, raised awareness on the CBS News program 60 Minutes. Journalist Pete Earley covered it in his book Circumstantial Evidence: Death, Life, and Justice in a Southern Town (1995).[2] Stevenson featured this early case of his career in a TED talk and in his memoir Just Mercy (2014). This was adapted as an eponymous feature film, released in 2019. Jamie Foxx portrays McMillian and Michael B. Jordan stars as Stevenson.\n",
        "type": [
            "murder"
        ]
    },
    "134": {
        "link": "/wiki/Selma_to_Montgomery_National_Historic_Trail",
        "title": "Selma to Montgomery National Historic Trail",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "\nThe Selma to Montgomery National Historic Trail is a 54-mile (87 km) National Historic Trail in Alabama. It commemorates and marks the journey of the participants of the 1965 Selma to Montgomery marches in support of the Voting Rights Act.\nThe Selma to Montgomery March occurred on March 21 to 25, 1965, and was led by Dr Martin Luther King.[1] This march was the culmination of several weeks of activity, during which demonstrators had tried to march on two occasions.[1] They were stopped on both occasions, once violently, by the police.[1] Approximately 25,000 people joined the March and it became a landmark event in the Civil Rights Movement, leading directly to the passing of the Voting Rights Act of 1965.[1] The march brought public attention to the injustices faced by African Americans in voting.[2]\n",
        "type": []
    },
    "135": {
        "link": "/wiki/Thomas_Whisenhant",
        "title": "Thomas Whisenhant",
        "date": "May 27, 2010(2010-05-27) (aged 63) Holman Correctional Facility, Atmore, Alabama, U.S.",
        "year": "2010",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "Thomas Warren Whisenhant (January 29, 1947 – May 27, 2010)[1] was an American serial killer who murdered at least four women between 1963 and 1976 in Mobile County, Alabama. After being arrested for the October 1976 murder of Cheryl Payton, Whisenhant confessed to killing three other women. He was sentenced to death in Alabama in September 1977, and was executed in May 2010 at Holman Correctional Facility via lethal injection. At the time of his execution, Whisenhant was Alabama's longest serving death row inmate, spending thirty-two years, eight months, and twenty days on death row.[2]\nThomas Warren Whisenhant was born on January 29, 1947, in Prichard, Alabama, the last of four children born to Willie and Emma Whisenhant.[3] He came from a low-income family, which was ruled by his mother, a domineering woman who would constantly argue with and frequently attack her physically weak and alcoholic husband and who also encouraged her children to do the same. Such altercations often occurred when Whisenhant's father would get drunk on moonshine and try to seduce his wife, who would always reject him. She reserved her anger and abuse only for her husband and instead spoiled Whisenhant, of whom she was overprotective. Whisenhant was made to share a bed with his mother until the age of 7 and continued to share the same bedroom with her until the age of 16, by which time he had, according to his sister, become moody and violent.[4] Also by his teenage years, Whisenhant was constantly accompanied by his mother, who never let him out of her sight. According to a psychologist, Whisenhant resented her.[4]\nOn May 6, 1963, 72-year-old widow Lexie Haynes was fatally shot in Prichard. Police arrived at the scene and found the murder weapon in an empty lot next to Whisenhant's family home. Whisenhant, who was 16 at the time, was immediately suspected, as he had recently been charged with robbing a blind woman. According to a retired Prichard police captain, the robbery charge against Whisenhant was later thrown out of court due to a technicality. Police questioned Whisenhant about the murder; however, his family provided him with an alibi and claimed he had been at home when the shooting occurred.[4] Before the shooting occurred, Whisenhant and his friends had been playing with a stolen handgun. A witness later said Whisenhant had taken a bullet from the revolver, held it up, and stated it would soon kill somebody.[5] Police later revealed that Haynes had spoken with Whisenhant about this behavior, which was why they suspected he killed her. However, for unknown reasons, Whisenhant was never brought to trial for the murder of Haynes.[6][7]\n",
        "type": [
            "robbery",
            "killing",
            "murder",
            "robber",
            "shooting"
        ]
    },
    "136": {
        "link": "/wiki/Albert_Turner_(activist)",
        "title": "Albert Turner (activist)",
        "date": "April 13, 2000(2000-04-13) (aged 64) Selma, Alabama",
        "year": "2000",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "Albert Turner (February 29, 1936 – April 13, 2000) was an American civil rights activist and an advisor to Martin Luther King Jr.[1] He was Alabama field secretary for the Southern Christian Leadership Conference and helped lead the voting rights march from Selma to Montgomery; he was beaten on Bloody Sunday.[2]\nTurner was born outside of Marion, Alabama, the son of a Perry County farmer; he was the fourth of 12 children. He graduated from Alabama A&M.[1]\nAlbert Turner attempted to register to vote in 1962, but despite his college education, could not pass the literacy test given.[3] That incident galvanized Turner to organize local voter registration efforts and educate prospective voters about the voter registration tests.[3] Turner was one of the marchers credited with leading the Selma to Montgomery procession in March 1965 while Dr. King attended a ceremony honoring his work in Cleveland.[4]\n",
        "type": []
    },
    "137": {
        "link": "/wiki/James_Hubbard_(murderer)",
        "title": "James Hubbard (murderer)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "James Barney Hubbard (March 7, 1930 – August 5, 2004) was sentenced to death by the state of Alabama in 1977 for the murder of Lillian Montgomery, with whom he was living after having been released from prison. Hubbard had served a 20-year sentence for murder and called police to report a shooting on January 10, 1977. He said Lillian had shot herself at her home in Tuscaloosa, Alabama. She died as the result of three gunshot wounds, one to the face, one to the head, and one to the shoulder. He was executed by lethal injection 27 years after the murder. At age 74, he was the oldest American to be executed in decades.\n\nThis United States biographical article related to crime is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "138": {
        "link": "/wiki/Kurt_Crain",
        "title": "Kurt Crain",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Spanish Fort",
        "county": "Baldwin County",
        "paragraph": "Kurt Crain (December 31, 1964 – April 10, 2012) was an American football player and coach. He played college football for the University of Memphis and Auburn University. He went on to play two seasons in the NFL – one for the Houston Oilers, the other for the Green Bay Packers. In 2008, he joined the coaching staff of the University of South Alabama.[2][3]\nCrain died of an apparent self-inflicted gunshot wound at his home in Spanish Fort, Alabama on April 10, 2012. He was 47.[2][3]\nThis biographical article relating to an American football linebacker born in the 1960s is a stub. You can help Wikipedia by expanding it.",
        "type": []
    },
    "139": {
        "link": "/wiki/Murder_in_Alabama_law",
        "title": "Murder in Alabama law",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "\nMurder in Alabama constitutes the intentional killing, under circumstances defined by law, of people within or under the jurisdiction of the U.S. state of Alabama.\nThe United States Centers for Disease Control and Prevention reported that in the year 2020, Alabama had the third-highest rate of homicides in the country.[1]\nIn Alabama, the common law felony murder rule has been codified in Alabama Code § 13A-6-2(a)(3).  It provides that when a person commits various crimes and \"in the course of and in furtherance of the crime\" another is killed, then the perpetrator is guilty of murder, a \"Class A Felony\", the punishment of which is not less than 10 years nor more than 99 years in prison, or life in prison. If any aggravating circumstances were present, the penalty is death or life imprisonment.[2]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "140": {
        "link": "/wiki/Rhonda_Belle_Martin",
        "title": "Rhonda Belle Martin",
        "date": "(1957-10-11) October 11, 1957 (aged 50) Kilby Correctional Facility, Montgomery, Alabama, U.S.",
        "year": "1957",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Rhonda Belle Martin (born Rhonda Belle Thomley;[1] 1907 – October 11, 1957) was an American serial killer.\nA forty-nine-year-old waitress in Montgomery, Alabama, she confessed in March 1956 to poisoning her mother, two husbands, and three of her children. She denied killing two other children. According to LIFE Magazine in an article published at the time, she loved getting the get-well cards, and later the sympathy cards that came when the victims died, as well as taking great care to have them buried side by side in a private plot.\nHer fifth husband, formerly her step-son,[2] was poisoned like the others, but survived and was left a paraplegic. It was his illness that led authorities to look into the strange deaths surrounding Martin.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "141": {
        "link": "/wiki/Doe_B",
        "title": "Doe B",
        "date": "December 28, 2013(2013-12-28) (aged 22) Montgomery, Alabama, U.S.",
        "year": "2013",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "\nGlenn Thomas (June 13, 1991 – December 28, 2013), better known by his stage name Doe B, was an American rapper from Montgomery, Alabama. He was perhaps best known for being signed to fellow rapper T.I.'s Atlanta-based record label, Hustle Gang.[1] Thomas was also known for his signature eye patch, the result of a shooting that occurred in 2009. During his career he released several mixtapes, including Trap Life (2012) and Baby Jesus (2013); he was also featured on the 2013 Grand Hustle compilation G.D.O.D. (Get Dough or Die). Thomas was shot and killed on December 28, 2013, at the Centennial Hill Bar & Grill, in his hometown of Montgomery. There have been two posthumous projects, D.O.A.T. 3 (Definition of a Trapper) and the compilation mixtape Doe B Presents C.B.M.: Choppaz, Brickz & Money, released by Doe B's own label, Cote Block Music.\nOn November 22, 2012, Doe B released his first full-length project, a mixtape titled Trap Life, with Hoodrich Entertainment.[2] The mixtape, which hosted by American disc jockeys DJ Frank White and DJ Scream, includes production from Lex Luger, Zaytoven, M16 and Will-A-Fool, among others.[2]\n",
        "type": [
            "mass shooting",
            "shooting"
        ]
    },
    "142": {
        "link": "/wiki/Archbishop_Iakovos_of_America",
        "title": "Archbishop Iakovos of America",
        "date": "April 10, 2005(2005-04-10) (aged 93) Stamford, Connecticut, US",
        "year": "2005",
        "location": "",
        "state": "",
        "place": "Stamford",
        "county": "Montgomery County",
        "paragraph": "Archbishop Iakovos of North and South America  (Greek: Ιάκωβος; born Demetrios Koukouzis (Δημήτριος Κουκούζης);[1] July 29, 1911 – April 10, 2005) was the primate of the Greek Orthodox Archdiocese of North and South America (now the Greek Orthodox Archdiocese of America) from 1959 until his resignation in 1996.\nBorn on the village of Agios Theodoros in the island of Imvros, Ottoman Empire on July 29, 1911, to Maria and Athanasios Koukouzis, he had two sisters Virginia and Chrysanthi and a brother Panagiotis. He enrolled at age 15 in the Ecumenical Patriarchal Theological School of Halki. After graduating with high honors, Demetrios Koukouzis was ordained deacon in 1934, taking the ecclesiastical name Iakovos. Five years after his ordination, Deacon Iakovos received an invitation to serve as Archdeacon to the late Archbishop Athenagoras, the Primate of North and South America, who later (1949–72) became Ecumenical Patriarch of Constantinople.\nOrdained a priest in 1940 in Lowell, Massachusetts, US, he served at St. George Church, Hartford, Connecticut, while teaching and serving as assistant dean of the Holy Cross Greek Orthodox Theological School, then in Pomfret, Connecticut. In 1941, he was named Preacher at Archdiocesan Cathedral of the Holy Trinity in New York City and in the summer of 1942 served as temporary Dean of St. Nicholas Church in St. Louis, Missouri. He was appointed Dean of the Annunciation Greek Orthodox Cathedral in Boston in 1942 and remained there until 1954. In 1945 he earned a Master of Sacred Theology Degree from Harvard University.\n",
        "type": []
    },
    "143": {
        "link": "/wiki/Bernard_Lafayette",
        "title": "Bernard Lafayette",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Tampa",
        "county": "Mobile County",
        "paragraph": "Bernard Lafayette (or LaFayette), Jr. (born July 29, 1940) is an American civil rights activist and organizer, who was a leader in the Civil Rights Movement. He played a leading role in early organizing of the Selma Voting Rights Movement; was a member of the Nashville Student Movement; and worked closely throughout the 1960s movements with groups such as the Student Nonviolent Coordinating Committee (SNCC), the Southern Christian Leadership Conference (SCLC), and the American Friends Service Committee.[1]\nLafayette was born and raised in Tampa, Florida. His parents were Bernard Lafayette Sr. and Verdell Lafayette. Bernard was the eldest of eight children. His siblings were Harold Rozelia, Brenda, Geri, Michael, and Victoria.[2] Lafayette spent much of his childhood in Tampa. His family grew up poor, so Bernard started working odd jobs to gain more income by the age of 11.[2] His jobs included cashiering, meat cutting, delivering produce, and collecting change at a coffee shop.[2] When reminiscing on his childhood, Bernard says: \"I had to grow up rapidly. In other words, I didn't have a childhood.\"[3]\nDespite being black in the south, Bernard says he went to school in an integrated elementary school, and eventually began to go to schools that were still segregated. While he was at the integrated school he says that \"even though it wasn't segregated, I could still see the contrast between the two worlds.\"[3]  Bernard has clear recollections of some of the racism that he experienced at a young age. When Bernard was seven years old, he was heading downtown with his grandmother, Ma Foster, so they decided to catch a cable car. One of the segregation laws regarding cable cars was that black people would pay at the front door, and then enter through the back door. When His grandmother paid the cable car driver, the driver started driving before either of them could board, pocketing their money and leaving them stranded.[4] He says this is one of the first instances where he realized he wanted to do something about how his people were being treated.\n",
        "type": []
    },
    "144": {
        "link": "/wiki/Viola_Liuzzo",
        "title": "Viola Liuzzo",
        "date": "March 25, 1965(1965-03-25) (aged 39) Selma, Alabama, U.S.",
        "year": "1965",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "Viola Fauver Liuzzo (née Gregg; April 11, 1925 – March 25, 1965) was an American civil rights activist. In March 1965, Liuzzo heeded the call of Martin Luther King Jr. and traveled from Detroit, Michigan, to Selma, Alabama, in the wake of the Bloody Sunday attempt at marching across the Edmund Pettus Bridge. Liuzzo participated in the successful Selma to Montgomery marches and helped with coordination and logistics. At the age of 39, while driving back from a trip shuttling fellow activists to the Montgomery airport, she was fatally hit by shots fired from a pursuing car containing Ku Klux Klan members Collie Wilkins, William Eaton, Eugene Thomas, and Gary Thomas Rowe, the last of whom was actually an undercover informant working for the Federal Bureau of Investigation (FBI).[1][2] Although the State of Alabama was unable to secure a murder conviction, Wilkins, Eaton, and Thomas were charged in federal court with conspiracy to intimidate African Americans under the 1871 Ku Klux Klan Act, a Reconstruction civil rights statute. On December 3, the trio was found guilty by an all-white, all-male jury, and were sentenced to ten years in prison, a landmark in Southern legal history.\nRowe testified that Wilkins had fired two shots into Liuzzo on the order of Thomas,[citation needed] and was placed in the witness protection program by the FBI.[3] In an effort to deflect attention from having employed Rowe as an informant, the FBI produced disinformation[4][5] for politicians and the press, stating that Liuzzo was a member of the Communist Party, heroin addict,[6] and had abandoned her children to have sexual relationships with African-Americans involved in the Civil Rights Movement.[7] Liuzzo's involvement in the civil rights movement was scrutinized and she was condemned by various racist organizations. In 1983, the Liuzzo family filed a lawsuit against the FBI after learning about the FBI's activities, but the suit was dismissed.\nIn addition to other honors, Liuzzo's name is today inscribed on the Civil Rights Memorial in Montgomery, Alabama, created by Maya Lin.\n",
        "type": [
            "murder"
        ]
    },
    "145": {
        "link": "/wiki/Tina_Mott",
        "title": "Forensic Files (season 6)",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Forensic Files is an American documentary-style series which reveals how forensic science is used to solve violent crimes, mysterious accidents, and even outbreaks of illness. The show is broadcast on truTV, narrated by Peter Thomas, and produced by Medstar Television, in association with truTV Original Productions. It has broadcast 406 episodes since its debut on TLC in 1996 as Medical Detectives.\n",
        "type": []
    },
    "146": {
        "link": "/wiki/Matthew_Reeves",
        "title": "Matthew Reeves",
        "date": "November 27, 1996",
        "year": "1996",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "\nMatthew Reeves (December 13, 1977 – January 27, 2022) was an American convicted murderer who was executed by the state of Alabama for the 1996 murder of Willie Johnson. Reeves' case generated attention due to claims he was intellectually disabled.[2][3]\nReeves was born on December 13, 1977.[4] He had intellectual disabilities, with an IQ score in the 60s.[5]\n",
        "type": [
            "murder"
        ]
    },
    "147": {
        "link": "/wiki/Angela_Russell_(politician)",
        "title": "Angela Russell (politician)",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nAngela Veta Russell[1] (born 1943) is an American politician and civil rights activist who served in the Montana House of Representatives from the 99th district as a member of the Democratic Party. Russell participated in the Selma to Montgomery marches and Native American activism. She is a member of the Crow Tribe of Montana.\nAngela Veta Russell was born in 1943. She graduated from Hardin High School in 1961. She graduated from the University of Montana with a bachelor's degree in anthropology and sociology, and later graduated in 1974, from Tulane University with a master’s degree in social work and counseling.[2]\n",
        "type": []
    },
    "148": {
        "link": "/wiki/Railroad_Bill",
        "title": "Railroad Bill",
        "date": "(1896-03-07) March 7, 1896Atmore, Alabama",
        "year": "1896",
        "location": "",
        "state": "Alabama",
        "place": "Baldwin County",
        "county": "Baldwin County",
        "paragraph": "Morris Slater (died March 7, 1896) was an African American, notable for his dramatic escapes from the law in the style of Robin Hood. He acquired the name Railroad Bill. Although there was a price on his head for some years, he evaded capture through ingenuity and exceptional athletic abilities. He was eventually shot dead in an ambush at a store he was known to visit. Slater is celebrated in the folk-ballad Railroad Bill, which has been recorded by numerous artists, including Lonnie Donegan, Taj Mahal, Bob Dylan, Joan Baez, Roger McGuinn, Doc Watson, and Dave Alvin. \nLittle is known about the personal life of the individual who became notorious as Railroad Bill.[1] His true name, location of his birth, and details of his family have been debated since his criminal career ended in 1896.[2] What is known is that he once traveled with a circus and learned showmanship and the skills of a performer.[3] He joined a turpentine company in South Carolina and continued with the firm when it moved to Baldwin County, Alabama, and Bluff Springs, Florida.[4] In the turpentine camps he was known as Morris Slater—a profoundly athletic, \"top notch\" laborer and affable individual.[3][5]\nSlater became an antagonist of the Louisville and Nashville Railroad after a brakeman found him stealing a ride to Mobile, Alabama, and threw him off the moving train. In turn, the turpentine worker fired his rifle at the brakeman.[6] That altercation led Slater into a personal vendetta against the company, in which he would wound several trainmen, commandeer a train and force it out of the station, and threaten the life of James I. McKinnie, Superintendent of L&N's Mobile and Montgomery Division.[7][8][9] The company responded by dispatching detectives to investigate the offender and offering a $350 reward for his capture.[10] Not knowing Slater's name, detectives simply called him Railroad Bill, which was the alias of another L&N antagonist who lived in Mobile.[11] Slater embraced the moniker, and it became the name reporters typically used in writing hundreds of newspaper articles about his criminal activities.\n",
        "type": [
            "murder",
            "robber"
        ]
    },
    "149": {
        "link": "/wiki/Anthony_Ray_Hinton",
        "title": "Anthony Ray Hinton",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "Anthony Ray Hinton (born June 1, 1956) is an American activist, writer, and author who was wrongly convicted of the 1985 murders of two fast food restaurant managers in Birmingham, Alabama.[2] Hinton was sentenced to death and held on the state's death row for 28 years before his 2015 release.[2][3][4][5][6]\nIn 2014 the Supreme Court of the United States unanimously overturned his conviction on appeal, after which the state dropped all charges against him. The court was unable to affirm the forensic evidence of a gun, which was the only evidence in the first trial.[4] After being released, Hinton wrote and published a memoir The Sun Does Shine: How I Found Life and Freedom on Death Row (2018).[4] Hinton was portrayed by O'Shea Jackson Jr. in the 2019 film Just Mercy.\nOn February 25, 1985, and July 2, 1985, two fast food managers, John Davidson and Thomas Wayne Vason, were killed in separate incidents during armed robberies at their fast food restaurants in Birmingham.[3] A survivor of a third restaurant robbery picked a photo of Anthony Ray Hinton, then age 29, from a lineup, and the police investigated him. At the time, Hinton worked at a supermarket warehouse and lived with his mother, Buhlar Hinton, at her home in rural Alabama, about half an hour north of Birmingham.[4]\n",
        "type": [
            "murder",
            "robbery",
            "robber",
            "robberies"
        ]
    },
    "150": {
        "link": "/wiki/Audrey_Marie_Hilley",
        "title": "Audrey Marie Hilley",
        "date": "February 26, 1987(1987-02-26) (aged 53) Blue Mountain, Alabama, US",
        "year": "1987",
        "location": "",
        "state": "Alabama",
        "place": "Blue Mountain",
        "county": "Calhoun County",
        "paragraph": "Audrey Marie Hilley (née Frazier; June 4, 1933 – February 26, 1987) was an American murderer. Her life and crime spree are the subjects of the 1991 telefilm Wife, Mother, Murderer.\nAudrey Marie Frazier was born on June 4, 1933 in the Blue Mountain area of Anniston, Alabama to Lucille (née Meads) and Huey Frazier. She married Frank Hilley on May 8, 1951; they had two children, Mike and Carol. Despite Frank's well-paying job and Marie's secretarial employment, the couple had little money set aside in savings due to Frazier's excessive spending habits, leading to friction in the marriage. Unknown to Frank, his wife frequently engaged in sex with her bosses in exchange for money or superior performance evaluations. Frank began suffering from a mysterious illness, as did his son Mike, but Mike's symptoms – which his doctors attributed to stomach flu – abruptly stopped when he moved away to attend a seminary.\nIn 1975, after returning home early due to his illness, Frank found Marie in bed with her boss. Frank turned to Mike, then an ordained minister living in Atlanta, for advice. In May 1975, a short time after a visit from Mike, Frank visited his doctor complaining of nausea and tenderness in his abdomen, being diagnosed with a viral stomach ache. The condition persisted and he was admitted to a hospital, where tests indicated a malfunction of the liver and doctors diagnosed infectious hepatitis. He died early in the morning of May 25.\n",
        "type": [
            "murder"
        ]
    },
    "151": {
        "link": "/wiki/Emmit_King",
        "title": "Emmit King",
        "date": "November 28, 2021(2021-11-28) (aged 62) Bessemer, Alabama, U.S.",
        "year": "2021",
        "location": "",
        "state": "",
        "place": "Bessemer",
        "county": "Jefferson County",
        "paragraph": "Emmit King (March 24, 1959 – November 28, 2021) was an American track and field sprinter, who twice was a member of the American Relay Team for the Summer Olympics (1984 and 1988) but he did not compete. He is best known for winning the bronze medal at the inaugural 1983 World Championships in the men's 100 metres. At the same championships, he was part of the team that won gold in the 4x100 m relay for the United States, and in doing so set a new world record of 37.86 s.[1] He set his personal best (10.04) in the 100 metres on June 17, 1988, at the 1988 USA Outdoor Track and Field Championships in Tampa, Florida.\nWhile at the University of Alabama, King became the 1983 NCAA 100 meters National Champion (10.15 seconds). \nKing was also twice national champion at the short sprint indoors: in 1984 at 60 yards and in 1988 at 55 metres.\n",
        "type": []
    },
    "152": {
        "link": "/wiki/Wetumpka,_Alabama",
        "title": "Wetumpka, Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Wetumpka",
        "county": "Elmore County",
        "paragraph": "\nWetumpka (US: /wɪˈtʌmkə/) is a city in and the county seat of Elmore County, Alabama, United States. At the 2020 census, the population was 7,220.[2] In the early 21st century Elmore County became one of the fastest-growing counties in the state.[3] The city is considered part of the Montgomery Metropolitan Area.\nWetumpka identifies as \"The City of Natural Beauty\". Among the notable landmarks are the Wetumpka crater and the Jasmine Hill Gardens, with a full-sized replica of the Temple of Hera of Olympia, Greece. Historic downtown Wetumpka developed on both sides of the Coosa River. It was near Fort Toulouse, built by French colonists in 1717, when they had claimed this territory for the king. Wetumpka is currently best known for jailing two elderly women attempting to feed stray cats. \n",
        "type": [
            "lynching"
        ]
    },
    "153": {
        "link": "/wiki/Walter_Moody",
        "title": "Walter Moody",
        "date": "(1) May 7, 1972 (2) December 16, 1989  (3) December 18, 1989",
        "year": "1972",
        "location": "",
        "state": "Alabama",
        "place": "Rex",
        "county": "Lee County",
        "paragraph": "Walter Leroy Moody Jr. (March 24, 1935 – April 19, 2018) was an American convicted murderer who was sentenced to death and executed in Alabama for the 1989 letter bomb murder of Robert S. Vance, a U.S. federal judge serving on the Court of Appeals for the 11th Circuit.\nWhen Moody was executed by lethal injection in April 2018, he became the oldest death row inmate to be executed since the death penalty was reinstated in 1976.[1][2]\nMoody was born on March 24, 1935, in Rex, Georgia, and grew up in Fort Valley.[2] He grew up as the oldest of three children and spent much of his time \"tinkering with machinery\".[3] He graduated from Peach County High School in 1953, and held a multitude of military positions in the years to 1961.[3]\n",
        "type": [
            "murder"
        ]
    },
    "154": {
        "link": "/wiki/Robert_Crosky_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "year": "1919",
        "location": "Montgomery, Alabama, United States",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\nOn 2 AM on September 30, 1919, a day after the lynching of Phifer and Crosky, John Temple was lynched in a hospital for allegedly fatally wounding Policeman Barbaree.[5][6] The two events were not linked.[5]\n",
        "type": [
            "murder",
            "riot",
            "lynching",
            "assault"
        ]
    },
    "155": {
        "link": "/wiki/2016_Citronelle_homicides",
        "title": "2016 Citronelle homicides",
        "date": "August 20, 2016 (2016-08-20) 4:10 a.m. (CT)",
        "year": "2016",
        "location": "Citronelle, Alabama, United States",
        "state": "Alabama",
        "place": "Citronelle",
        "county": "Mobile County",
        "paragraph": "\nOn August 20, 2016, a mass killing occurred in Citronelle, Alabama, resulting in the deaths of five people, including a woman who was five months pregnant. They were killed in the early morning in a private residence in a rural area west of the city. It was owned by a brother of Laneta Lester, who had sought refuge there. She and her brother's infant were abducted and taken to Leakesville, Mississippi, by her estranged boyfriend, Derrick Dearman. He released her that day. Lester returned with the infant to Citronelle. She notified police of the killings. Investigators described this mass killing as the worst in Mobile County's history. The house burned down a couple of weeks after the crime.\nDearman was considered a suspect. He was arrested after he turned himself in at the Greene County, Mississippi police station. He was extradited to Alabama, where he was charged with six counts of capital murder (including the fetus, under Alabama law) and two counts of abduction. Initially he pleaded not guilty to the charges. In September 2018 he pleaded guilty to the capital murder charges. He still had to face a jury trial, which convicted him of the murders and kidnappings, and sentenced him to death. The court upheld the sentence.\n",
        "type": [
            "killing",
            "murder",
            "mass shooting",
            "shooting",
            "kidnapping"
        ]
    },
    "156": {
        "link": "/wiki/Barack_Obama_Selma_50th_anniversary_speech",
        "title": "Barack Obama Selma 50th anniversary speech",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "On March 7, 2015, President of the United States Barack Obama delivered a speech at Edmund Pettus Bridge to mark the 50th anniversary of the Selma to Montgomery marches on the subject of race relations within the United States. Among the estimated 40,000 present[1] were former President George W. Bush, former First Lady Laura Bush, and Amelia Boynton Robinson, John Lewis, Diane Nash, Bernard Lafayette, and many other 'foot soldiers' who had taken part in the march in 1965.[2]\nThe formal writing process for the speech began on February 25, working closely with speechwriter Cody Keenan.[3] In preparation, Keenan had read works by Taylor Branch and had been watching speeches by Rep. John Lewis. A few days earlier, former New York Mayor Rudy Giuliani had made remarks about whether President Obama loved America, leading Keenan to suggest that the speech focus on patriotism.[4] The first draft was completed on March 5, two days before the address, and Obama instructed Keenan to add references to Ralph Waldo Emerson and Walt Whitman.[4] The speech went through five drafts before March 7,[3] with Obama still making tweaks on the flight to Alabama.[4]\nFollowing an introduction by Rep. John Lewis, who was injured in the Selma to Montgomery marches, President Obama discussed the Selma to Montgomery marches in the context of historic events: \"There are places, and moments in America where this nation's destiny has been decided, ... Selma is such a place\".[5] He spoke of how the marches led to the signing of the Voting Rights Act of 1965 by President Lyndon B. Johnson, \"echoing their call for America and the world to hear: 'We shall overcome'\".\n",
        "type": [
            "riot"
        ]
    },
    "157": {
        "link": "/wiki/Coretta_Scott_King",
        "title": "Coretta Scott King",
        "date": "January 30, 2006(2006-01-30) (aged 78) Rosarito, Mexico",
        "year": "2006",
        "location": "",
        "state": "",
        "place": "Boston",
        "county": "Covington County",
        "paragraph": "\nCoretta Scott King (née  Scott; April 27, 1927 – January 30, 2006) was an American author, activist, and civil rights leader who was married to Martin Luther King Jr. from 1953 until his assassination. As an advocate for African-American equality, she was a leader for the civil rights movement in the 1960s. King was also a singer who often incorporated music into her civil rights work. King met her husband while attending graduate school in Boston. They both became increasingly active in the American civil rights movement.\nKing played a prominent role in the years after her husband's assassination in 1968, when she took on the leadership of the struggle for racial equality herself and became active in the Women's Movement. King founded the King Center, and sought to make his birthday a national holiday. She finally succeeded when Ronald Reagan signed legislation which established Martin Luther King, Jr., Day on November 2, 1983. She later broadened her scope to include both advocacy for LGBTQ rights and opposition to apartheid. King became friends with many politicians before and after Martin's death, including John F. Kennedy, Lyndon B. Johnson, and Robert F. Kennedy. Her telephone conversation with John F. Kennedy during the 1960 presidential election has been credited by historians for mobilizing African-American voters.[1]\n",
        "type": []
    },
    "158": {
        "link": "/wiki/Southern_Christian_Leadership_Conference",
        "title": "Southern Christian Leadership Conference",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Atlanta",
        "county": "Montgomery County",
        "paragraph": "\nThe Southern Christian Leadership Conference (SCLC) is an African-American civil rights organization based in Atlanta, Georgia. SCLC is closely associated with its first president, Martin Luther King Jr., who had a large role in the American civil rights movement.[1]\nOn January 10, 1957, following the Montgomery bus boycott victory against the white establishment and consultations with Bayard Rustin, Ella Baker, and others, Martin Luther King Jr. invited about 60 black ministers and leaders to Ebenezer Church in Atlanta. Prior to this, Rustin, in New York City, conceived the idea of initiating such an effort and first sought C. K. Steele to make the call and take the lead role. Steele declined, but told Rustin he would be glad to work right beside him if he sought King in Montgomery for the role. Their goal was to form an organization to coordinate and support nonviolent direct action as a method of desegregating bus systems across the South. In addition to King, Rustin, Baker, and Steele, Fred Shuttlesworth of Birmingham, Joseph Lowery of Mobile, and Ralph Abernathy of Montgomery, all played key roles in this meeting.[2]\nThe group continued this initial meeting on January 11, calling it (in keeping with the recent bus segregation issue) a Southern Negro Leaders Conference on Transportation and Nonviolent Integration when they held a press conference that day. The press conference allowed them to introduce their efforts:\n",
        "type": []
    },
    "159": {
        "link": "/wiki/Sammy_Younge_Jr.",
        "title": "Sammy Younge Jr.",
        "date": "January 3, 1966(1966-01-03) (aged 21) Tuskegee, Alabama, U.S.",
        "year": "1966",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "Samuel Leamon Younge Jr. (November 17, 1944 – January 3, 1966) was a civil rights and voting rights activist who was murdered for trying to desegregate a \"whites only\" restroom.[1] Younge was an enlisted service member in the United States Navy, where he served for two years before being medically discharged.[2][3] Younge was an active member of the Student Nonviolent Coordinating Committee (SNCC) and a leader of the Tuskegee Institute Advancement League.[4][5]\nYounge was the first African-American university student to be murdered in the United States due to his actions in support of the Civil Rights Movement.[4][6] Three days after his death, SNCC became the first civil rights organization in the United States to oppose the Vietnam War, partly on the grounds that like Younge, innocent civilians should not face deadly violence.[7]\nYounge was born on November 17, 1944, in Tuskegee, Alabama. His father, Samuel Younge Sr., was an occupational therapist, and his mother was a local schoolteacher.[1] From the age of 12 to 14, from 1956 to 1958, Younge attended Cornwall Academy, in Massachusetts.[1] He graduated from Tuskegee Institute High School in 1962, after which he joined the United States Navy.[8] Younge served in the United States Navy from 1962 until July 1964, when he was given a medical discharge as a result of having to have one of his kidneys removed.[6] Upon his discharge from the Navy, Younge began attending the Tuskegee Institute, in 1965, as a political science student.[9]\n",
        "type": [
            "murder"
        ]
    },
    "160": {
        "link": "/wiki/Richard_H._Harris",
        "title": "Richard H. Harris",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Richard Henry Harris, Jr. (August 22, 1918 - July 24, 1976) was a prominent civil rights leader and pharmacist. A personal friend, neighbor and collaborator of Dr Martin Luther King Jr. in Montgomery, Alabama, Harris was instrumental in three of the most seminal protests of the U.S. civil rights movement: the Freedom Riders, the Montgomery Bus Boycott and the Selma to Montgomery marches. Harris's home, best known as the famed “Richard Harris House”, was Montgomery, Alabama’s central command center and safe haven for beaten and bloodied Freedom Riders as they traveled to Jackson, Mississippi amidst physically violent racial rioters, National Guard protection, and Alabama segregationist authorities’ call for martial law.[1][2]\nIn 2018, the World Monuments Fund (WMF) listed Harris’ home on its World Monuments Watch list of 20 threatened cultural sites not only for the potential risk to its physical structure, but the potential risk to its historical significance and backstory.[3][4]\nA former U.S. Army Air Force Captain, Harris was one of the U.S. military's first African American combat fighter pilots, serving with the prodigious 332nd Fighter Group's 99th Fighter Squadron, best known as the Tuskegee Airmen, \"Red Tails,\" or “Schwartze Vogelmenschen” (\"Black Birdmen\") among enemy German pilots.[5]\n",
        "type": [
            "riot"
        ]
    },
    "161": {
        "link": "/wiki/Horace_DeVauhan",
        "title": "Horace DeVauhan",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "Horace DeVaughan (died April 8, 1927), of Birmingham, Alabama, was the first prison inmate in Alabama to be executed by the Alabama electric chair, nicknamed \"Yellow Mama\" because it was painted with bright yellow highway paint. DeVaughan was electrocuted on April 8, 1927.\nThe murder case for which DeVaughan was executed was solved by Birmingham Police Detective Paul Cole, who traced the shells found at the scene, which had a unique marking from a defective shotgun. After he was arrested, DeVaughan confessed to the murders and was sentenced to death.\nDeVaughan was put to death at Kilby Prison in an electric chair built for the purpose earlier that year. He prayed to Jesus for hours beforehand, and accepted no food, drink or cigarettes on the night of the execution. In his final statement he expressed that he had been forgiven and had no hard feelings toward anyone, and asked for someone to tell his mother goodbye and that his soul was saved.\nDeVaughan underwent three 2,000 volt discharges between 12:31 and 12:42 AM. At the first 40-second jolt his body surged forward, a thin gray smoke flowed from under the electrode over his head, and the odor of burning flesh was apparent. After the second discharge, flames were seen on his leg, but he was still alive. After the third jolt, he was pronounced dead. Twenty were present as witnesses, included Moore's brother, George, who traveled from Coffeyville, Kansas and claimed a piece of DaVaughn's belt as a souvenir of his visit.\n\n",
        "type": [
            "murder"
        ]
    },
    "162": {
        "link": "/wiki/Maurice_Davis",
        "title": "Maurice Davis",
        "date": "December 14, 1993(1993-12-14) (aged 71) Palm Coast, Florida, United States",
        "year": "1993",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "Maurice Davis (December 15, 1921 – December 14, 1993[1]) was a rabbi and activist. He served on the President's Commission on Equal Opportunity, in the Lyndon B. Johnson Administration and was a director of the American Family Foundation, now known as the International Cultic Studies Association. Davis was the rabbi of the Jewish Community Center of White Plains, New York and a regular contributor to The Jewish Post and Opinion.\nRabbi Davis married Marion Cronbach, daughter of Rose Hentil and prominent reform rabbi and well-known pacifist (and Davis's teacher) Abraham Cronbach. Davis and his wife had two children, both went on to become rabbis.[citation needed]\nIn 1952, Davis founded the Kentucky Committee on Desegregation. In 1965, he walked with Martin Luther King Jr. in Alabama, on the third of the Selma to Montgomery marches, and was appointed to the Equal Employment Opportunity Commission by President Johnson.[citation needed]\n",
        "type": []
    },
    "163": {
        "link": "/wiki/Edmund_Pettus_Bridge",
        "title": "Edmund Pettus Bridge",
        "date": "",
        "year": "",
        "location": "Selma, Alabama, U.S.",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "\nThe Edmund Pettus Bridge carries U.S. Route 80 Business (US 80 Bus.) across the Alabama River in Selma, Alabama. Built in 1940, it is named after Edmund Pettus, a former Confederate brigadier general, U.S. senator, and state-level leader (\"Grand Dragon\") of the Alabama Ku Klux Klan.[2] The bridge is a steel through arch bridge with a central span of 250 feet (76 m). Nine large concrete arches support the bridge and roadway on the east side.\nThe Edmund Pettus Bridge was the site of the conflict of Bloody Sunday on March 7, 1965, when police attacked Civil Rights Movement demonstrators with horses, billy clubs, and tear gas[3] as they were attempting to march to the state capital, Montgomery.[2] The marchers crossed the bridge again on March 21 and walked to the Capitol building.\n",
        "type": []
    },
    "164": {
        "link": "/wiki/Albert_J._Lingo",
        "title": "Albert J. Lingo",
        "date": "August 17, 1969(1969-08-17) (aged 59) Birmingham, Alabama",
        "year": "1969",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nAlbert J. Lingo (January 22, 1910 – August 19, 1969) was appointed in 1963 by Alabama Gov. George Wallace to head the Alabama Highway Patrol, which he led until 1965 during turbulent years marked by marches and demonstrations that characterized the Civil Rights Movement in the U.S. South.[1]\nAccording to historian Dan T. Carter, Lingo had limited experience in law enforcement, but \"had a reputation indispensable for Wallace .... He was known as 'hell on niggers' and a man who seemed to relish confrontation.\" His anger was not limited to Blacks and \"his own recruits learned to stay out of his path; he was a dangerously unstable man ....\"[2]\n",
        "type": []
    },
    "165": {
        "link": "/wiki/Houston_Tumlin",
        "title": "Houston Tumlin",
        "date": "March 23, 2021(2021-03-23) (aged 28) Pelham, Alabama, U.S.",
        "year": "2021",
        "location": "",
        "state": "",
        "place": "Pelham",
        "county": "Shelby County",
        "paragraph": "[2]Houston Tumlin (December 27, 1992 – March 23, 2021) was an American actor, best known for acting in Talladega Nights: The Ballad of Ricky Bobby in 2006. Tumlin attended Victory Christian High School and graduated in 2011.[3] He served in the U.S. Army for nearly six years and earned achievement and participation decorations as an E-4 specialist in the 101st Airborne Division, including the Achievement Medal, the National Defense Service Medal, the Global War on Terrorism Service Medal and an Air Assault Badge. According to his mother, he had post- traumatic stress disorder (PTSD) and depression after his service in the military. Tumlin died by suicide by a self-inflicted gunshot on March 23, 2021, at his home in Pelham, Alabama.[3][4][5][6]\n\nThis article about an American actor is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "assault",
            "terrorism"
        ]
    },
    "166": {
        "link": "/wiki/Northington_v._State",
        "title": "Northington v. State",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Northington",
        "county": "Montgomery County",
        "paragraph": "Northington v. State, 413 So.2d 1169 (1981), was a case decided by the Court of Criminal Appeals of Alabama that reversed a conviction for murder on the basis that depraved heart murder requires a universal malice directed towards human life in general rather than malice directed towards a specific individual.[1]\nDefendant Northington was convicted of murder after allowing her five-month-old daughter to starve to death.  The appellate court reversed the conviction because the mens rea requirement for depraved heart murder was held to be universal malice towards human life in general, and Northington displayed extreme reckless indifference towards her daughter only.[2]\nThis article relating to case law in the United States or its constituent jurisdictions is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder"
        ]
    },
    "167": {
        "link": "/wiki/Henry_Williams_(soldier)",
        "title": "Henry Williams (soldier)",
        "date": "August 15, 1942(1942-08-15) (aged 23) Mobile, Alabama, United States",
        "year": "1942",
        "location": "",
        "state": "Alabama",
        "place": "Mobile",
        "county": "Mobile County",
        "paragraph": "\nHenry Williams (September 15, 1918 – August 15, 1942) was an African American Private in the United States Army during World War II.  He was killed by a bus driver in Mobile, Alabama on August 15, 1942.\nWilliams was born on September 15, 1918, in Macon, Mississippi.[1]  He enlisted in the Army on September 23, 1941, and was initially stationed at Fort McClellan in Alabama.\n",
        "type": [
            "murder"
        ]
    },
    "168": {
        "link": "/wiki/Murder_of_Jimmie_Lee_Jackson",
        "title": "Murder of Jimmie Lee Jackson",
        "date": "February 26, 1965(1965-02-26) (aged 26) Selma, Alabama, U.S.",
        "year": "1965",
        "location": "",
        "state": "Alabama",
        "place": "Selma",
        "county": "Dallas County",
        "paragraph": "Jimmie Lee Jackson (December 16, 1938 – February 26, 1965)[1][2] was an African American civil rights activist in Marion, Alabama, and a deacon in the Baptist church. On February 18, 1965, while unarmed and participating in a peaceful voting rights march in his city, he was beaten by troopers and fatally shot by an Alabama state trooper. Jackson died eight days later in the hospital.\nHis death helped inspire the Selma to Montgomery marches in March 1965, a major event in the civil rights movement that helped gain congressional passage of the Voting Rights Act of 1965. This opened the door to millions of African Americans being able to vote again in Alabama and across the Southern United States, regaining participation as citizens in the political system for the first time since the turn of the 20th century. Most had been disenfranchised since then by state constitutions and discriminatory practices that made voter registration and voting more difficult.[3]\nIn 2005, former Alabama State Trooper James Bonard Fowler admitted that he had shot Jackson, in what he said was self-defense soon after street lights had gone out and a melee had broken out.[3] Former trooper Fowler was indicted in 2007 in Jackson's death. In 2010 he pleaded guilty to manslaughter. He was sentenced to six months in prison.\n",
        "type": [
            "murder"
        ]
    },
    "169": {
        "link": "/wiki/Richie_Jean_Jackson",
        "title": "Richie Jean Jackson",
        "date": "November 10, 2013(2013-11-10) (aged 81) Mobile, Alabama, U.S.",
        "year": "2013",
        "location": "",
        "state": "Alabama",
        "place": "Mobile",
        "county": "Mobile County",
        "paragraph": "Richie Jean Sherrod Jackson (née Sherrod; August 30, 1932 – November 10, 2013),[1] was an American author, teacher, and civil rights activist.\nJackson was born in Mobile, Alabama, as the only child of John W. and Juanita Richardson Sherrod.[2] She was a childhood friend of Coretta Scott King.[2][3] She attended and graduated from Cardoza High School in Washington, D.C. She earned a Bachelor of Science degree in secondary education at Alabama State College, and a Masters of Education at the University of Montevallo.[2] She was married to Dr. Sullivan Jackson.[3] They had one child, a girl named Jawana Virginia Jackson.[4]\nIn February 1964, Martin Luther King Jr., Southern Christian Leadership Conference staff, and members of Congress met for strategy sessions to plan the Selma to Montgomery marches in Jackson's Selma, Alabama home.[5][6] After the first attempted march on March 7, 1965 (known as Bloody Sunday), Assistant U. S. Attorney General John Doar and Florida Governor LeRoy Collins, the latter of whom was there representing President Lyndon Johnson, met with King and others at Jackson's house.[5][7] This led to a second attempt at a voting rights march from Selma to Montgomery, and finally a third and successful attempt.[5][8] It was also in Jackson's home that Martin Luther King Jr. watched Lyndon Johnson give his Voting Rights Act Address on March 15, 1965.[3][9]\n",
        "type": []
    },
    "170": {
        "link": "/wiki/Holman_Correctional_Facility",
        "title": "Holman Correctional Facility",
        "date": "",
        "year": "",
        "location": "Atmore, Alabama",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "William C. Holman Correctional Facility is an Alabama Department of Corrections prison located in Atmore, Alabama.[1] The facility is along Alabama State Highway 21, 9 miles (14 km) north of Atmore in southern Alabama.[2]\nThe facility was originally built to house 581 inmates. Holman held as many as one thousand prisoners.[3] It has 632 general population beds, 200 single cells, and 170 death row cells, for a capacity of 1002 maximum through minimum-custody inmates, including a large contingent of life without parole inmates. The death chamber is located at Holman, where all state executions are conducted. Holman also operates two major correctional industries within the facility's perimeter: a license plate plant and a sewing factory.[4]\nHolman Correctional Facility was the subject of a documentary on MSNBC entitled Lockup: Holman Extended Stay (2006).[5] The warden at Holman Correctional Facility at the time was Grantt Culliver, who served from 2002 from 2009.[6] The current warden is Terry Raybon.[4]\n",
        "type": []
    },
    "171": {
        "link": "/wiki/Hosea_Williams",
        "title": "Hosea Williams",
        "date": "November 16, 2000(2000-11-16) (aged 74) [2][3]Atlanta, Georgia, U.S.",
        "year": "2000",
        "location": "",
        "state": "",
        "place": "china",
        "county": "Conecuh County",
        "paragraph": "\nHosea Lorenzo Williams (January 5, 1926 – November 16, 2000) was an American civil rights leader, activist, ordained minister, businessman, philanthropist, scientist, and politician. He is best known as a trusted member of fellow famed civil rights activist and Nobel Peace Prize winner Martin Luther King Jr.'s inner circle. Under the banner of their flagship organization, the Southern Christian Leadership Conference, King depended on Williams to organize and stir masses of people into nonviolent direct action in myriad protest campaigns they waged against racial, political, economic, and social injustice. King alternately referred to Williams, his chief field lieutenant, as his \"bull in a china closet\" and his \"Castro.\" Vowing to continue King's work for the poor, Williams is well known in his own right as the founding president of one of the largest social services organizations in North America, Hosea Feed the Hungry and Homeless. His famous motto was \"Unbought and Unbossed.\"[a]\nWilliams was born in Attapulgus, Georgia, a small city in the far southwest corner of the state in Decatur County.  Both of his parents were teenagers committed to a trade institute for the blind in Macon. His mother ran away from the institute upon learning of her pregnancy. At the age of 28, Williams stumbled upon his birth father, \"Blind\" Willie Wiggins, by accident in Florida.[4]  His mother died during childbirth when he was 10 years old.  He  and his older sister, Theresa, were raised by his mother's parents, Lelar and Turner Williams. Williams was run out of town by a lynch mob at the age of 13 for allegedly consorting with a white girl.[5]\n",
        "type": []
    },
    "172": {
        "link": "/wiki/James_Bevel",
        "title": "James Bevel",
        "date": "December 19, 2008(2008-12-19) (aged 72) Springfield, Virginia",
        "year": "2008",
        "location": "",
        "state": "Alabama",
        "place": "Springfield",
        "county": "Elmore County",
        "paragraph": "James Luther Bevel (October 19, 1936 – December 19, 2008) was a minister and leader of the 1960s Civil Rights Movement in the United States. As a member of the Southern Christian Leadership Conference (SCLC), and then as its Director of Direct Action and Nonviolent Education, Bevel initiated, strategized, and developed SCLC's three major successes of the era:[2][3] the 1963 Birmingham Children's Crusade,[4] the 1965 Selma voting rights movement, and the 1966 Chicago open housing movement.[5] He suggested that SCLC call for and join a March on Washington in 1963.[6] Bevel strategized the 1965 Selma to Montgomery marches, which contributed to Congressional passage of the 1965 Voting Rights Act.[7]\nPrior to his time with SCLC, Bevel worked in the Nashville Student Movement, which conducted the 1960 Nashville Lunch-Counter Sit-Ins, the 1961 Open Theater Movement, and recruited students to continue the 1961 Freedom Rides after they were attacked. He helped with initiating and directing the 1961 and 1962 voting rights movement in Mississippi. In 1967, Bevel was chairman of the Spring Mobilization Committee to End the War in Vietnam. He initiated the 1967 March on the United Nations as part of the anti-war movement.[8][9] His last major action was as co-initiator of the 1995 Day of Atonement/Million Man March in Washington, D.C. For his work, Bevel has been called the strategist and architect of the 1960s Civil Rights Movement[10] and, with Dr. King, half of the first-tier team that formulated many of the strategies and actions to gain federal legislation and social changes during the 1960s civil rights era.[8][9]\nIn 2005, Bevel was accused of incest by one of his daughters and abuse by three others. He was tried in April 2008, convicted of incest, sentenced to 15 years in prison,[11] and fined $50,000. After serving seven months, he was freed awaiting an appeal; he died of pancreatic cancer in December 2008 and was buried in Eutaw, Alabama.\n",
        "type": []
    },
    "173": {
        "link": "/wiki/Congregation_Beth_Israel_(Gadsden,_Alabama)",
        "title": "Congregation Beth Israel (Gadsden, Alabama)",
        "date": "",
        "year": "",
        "location": "761 Chestnut Street,Gadsden, Alabama, United States",
        "state": "Alabama",
        "place": "Gadsden",
        "county": "Etowah County",
        "paragraph": "Congregation Beth Israel (Hebrew: בית ישראל) was a Reform synagogue, located for most of its history at 761 Chestnut Street in Gadsden, Alabama.[3] An outgrowth of Gadsden's Jewish religious school, it was founded in 1908 and incorporated in 1910.[4][5] It moved into its Chestnut Street building in 1922,[1][4] and joined the Union of American Hebrew Congregations in 1924.[4]\nFrom 1911 to 1944 it had no rabbi, and was led by \"lay-religious-leader\" Hugo Hecht.[2][4] In 1944, Beth Israel hired its first full-time rabbi, Ernest Appel.[2]\nThe synagogue was fire-bombed and its windows smashed in 1960, during a Friday night service. Two members who rushed outside were wounded with a shotgun by the attacker, a young Nazi sympathizer.[6]\n",
        "type": []
    },
    "174": {
        "link": "/wiki/Yellow_Mama",
        "title": "Yellow Mama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Yellow Mama is the electric chair of the U.S. state of Alabama. It was used for executions from 1927 to 2002.\nFirst installed at Kilby State Prison in Montgomery, Alabama, the chair acquired its yellow color (and from it, the nickname \"Yellow Mama\") when it was painted with highway-line paint from the adjacent State Highway Department lab.[1] The chair was built by British inmate Ed Mason in 1927 and was first used to execute Horace DeVauhan in that year. Mason was rewarded for his efforts with a thirty day pass, but he absconded and was later found in a New York state penitentiary.[2]\nThe last person put to death in Yellow Mama was Lynda Lyon Block, who was executed in 2002. The chair has since been stored in an attic above the execution chamber at the Holman Correctional Facility.\n",
        "type": []
    },
    "175": {
        "link": "/wiki/Robert_Smith_Vance",
        "title": "Robert Smith Vance",
        "date": "December 16, 1989(1989-12-16) (aged 58) Mountain Brook, Alabama, U.S.",
        "year": "1989",
        "location": "",
        "state": "Alabama",
        "place": "Mountain Brook",
        "county": "Jefferson County",
        "paragraph": "\nRobert Smith Vance Sr. (May 10, 1931 – December 16, 1989) was a United States circuit judge of the United States Court of Appeals for the Fifth Circuit and later the United States Court of Appeals for the Eleventh Circuit. He was one of three 20th-century United States federal court judges assassinated because of his judicial service.\nBorn in Talladega, Alabama, Vance was the youngest of four children born to parents Harrell Taylor Vance, Sr., and Mae (Smith) Vance. He grew up in Birmingham, Alabama, graduating from Woodlawn High School. He then received a Bachelor of Science degree from the University of Alabama in 1950, and a Juris Doctor from University of Alabama School of Law in 1952. While at Alabama, Vance was purportedly the head of a secret yet powerful inter-fraternity organization known as The Machine and was elected as President of the Student Government Association. After law school, Vance entered military duty as an attorney in the United States Army Judge Advocate General Corps, and was stationed at the Pentagon. One of his first assignments was to serve on the team of lawyers defending the Army in hearings against charges brought by Senator Joseph McCarthy.\n",
        "type": [
            "murder"
        ]
    },
    "176": {
        "link": "/wiki/Home_of_the_Brave_(2004_film)",
        "title": "Home of the Brave (2004 film)",
        "date": "",
        "year": "2004",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "Home of the Brave is a 2004 documentary film about Viola Liuzzo, an American anti-racist activist during the Civil Rights Movement of the 1960s.\nA white housewife and mother of five children, Viola Liuzzo felt called to action by the words of Martin Luther King Jr., and left her Michigan home to work in Alabama with the Southern Christian Leadership Conference in 1965. While serving as a volunteer during the historic Selma to Montgomery marches, Liuzzo was shot dead by members of the Ku Klux Klan. The film is an historical account of her life presented in a montage of archival footage, narrated by the actress Stockard Channing and laced with extensive interviews of Liuzzo's family members and contemporaries.[1]\nHome of the Brave was written, directed, and co-produced by Paola di Florio.[1] The 75-minute film was released by Emerging Pictures in late 2004.[1]\n",
        "type": []
    },
    "177": {
        "link": "/wiki/Andrew_Lackey",
        "title": "Andrew Lackey",
        "date": "July 25, 2013(2013-07-25) (aged 29) Holman Correctional Facility, Atmore, Alabama, U.S.",
        "year": "2013",
        "location": "",
        "state": "Alabama",
        "place": "Atmore",
        "county": "Escambia County",
        "paragraph": "Andrew Reid Lackey (October 29, 1983 – July 25, 2013) was a prisoner executed for the October 31, 2005 murder of Charles Newman, an eighty-year-old World War II veteran. Lackey became the first person executed by the state of Alabama since October 20, 2011; executions had been partly slowed because of a legal dispute over the drugs being used.[1] No further executions would occur in Alabama until the January 2016 execution of Christopher Brooks.\nLackey broke into Newman's Limestone County home on Halloween night in 2005. Lackey had been told by Newman's grandson that there was a vault in the home containing gold bars and cash. Newman made a call to 911 on the night of the murder, in which he could be heard saying, “Don’t do that,” ”Leave me alone” and “What do you want?” Lackey could be heard repeatedly asking, “Where’s the vault?” according to court records.[2] It is believed that Newman grabbed his gun and shot Lackey, who then stabbed Newman with a knife about seventy times. Lackey also shot Newman in the chest with his own gun. Police arrived at the residence five minutes after the call was made, where they found Newman's body.\nLackey drove to a convenience store, where he called an ambulance. He was taken to Huntsville Hospital and treated for the gunshot wound. Police received a phone call indicating that Lackey was at the hospital. He was taken into custody after being released from treatment.[3]\n",
        "type": [
            "murder"
        ]
    },
    "178": {
        "link": "/wiki/Bombingham",
        "title": "Bombingham",
        "date": "",
        "year": "",
        "location": "Birmingham, Alabama",
        "state": "Alabama",
        "place": "Montgomery\nCity",
        "county": "Tallapoosa County",
        "paragraph": "City of Birmingham\nCity of Montgomery\nCity of Selma\n",
        "type": []
    },
    "179": {
        "link": "/wiki/Lynching_of_Horace_Maples",
        "title": "Lynching of Horace Maples",
        "date": "September 7, 1904",
        "year": "1904",
        "location": "Huntsville, Alabama",
        "state": "Alabama",
        "place": "Huntsville",
        "county": "Madison County",
        "paragraph": "Horace Maples was an African-American man who was lynched by a mob of approximately 2,000 people in Huntsville, Alabama, on September 7, 1904.[1] Maples had been accused of murder and was being held in the county jail when it was set on fire by the crowd. He jumped from a second story window in the jail, but was seized by the crowd and hanged on a tree on the courthouse lawn.[2][3] Maples' body was then shot full of bullets by people in the crowd.[4]\nDetailed news reports of the lynching spread quickly across the United States.  This report appeared in the weekly The Ingham County News, published in Mason, Michigan, on September 15, 1904:\nHuntsville, Ala., Sept. 8.—After setting fire to the jail and smoking out the prisoner while the fire department was held away with guns, and the sheriff, his deputies and the soldiers outwitted, a mob estimated at over 2.000 persons, Wednesday night lynched Horace Maples, a negro, accused of murdering Elias Waldrop.  Maples was hanged on a tree on the court house lawn.\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "180": {
        "link": "/wiki/Execution_of_Joe_Nathan_James_Jr.",
        "title": "Execution of Joe Nathan James Jr.",
        "date": "August 15, 1994",
        "year": "1994",
        "location": "",
        "state": "Alabama",
        "place": "",
        "county": "",
        "paragraph": "The execution of Joe Nathan James Jr. (July 25, 1972 – July 28, 2022) took place in the U.S. state of Alabama by means of lethal injection. James was sentenced to death for the 1994 murder of his ex-girlfriend, 26-year-old Faith Hall. His execution generated significant media attention and controversy due to a plea by the victim's family to spare his life and allegations that his execution would be botched.[1][2]\nJames is the last person to be executed in Alabama before the moratorium imposed by state governor, Kay Ivey.\nJoe Nathan James Jr. was born on July 25, 1972.[3] James was in a relationship with a woman, Faith Hall, a few years before the murder, their relationship would have lasted a year and a half or two according to Faith's brother.[4] Prosecutors say that James became obsessed after Faith rejected him, stalking and harassing her for months before killing her.[1] Court records show in the year prior to Faith's death, there were three harassment and one burglary police reports filed by Faith and her grandmother against James. The reports detailed James making threats to kill Faith, entering their home and damaging items, banging on windows, constant calling, and sitting in the home's driveway.[4]\n",
        "type": [
            "murder",
            "burglary",
            "killing"
        ]
    },
    "181": {
        "link": "/wiki/Election_Massacre_of_1874",
        "title": "Election Massacre of 1874",
        "date": "November 3, 1874",
        "year": "1874",
        "location": "Eufaula, Alabama",
        "state": "Alabama",
        "place": "Eufaula",
        "county": "Barbour County",
        "paragraph": "The Election Massacre of 1874, or Coup of 1874, took place on election day, November 3, 1874, near Eufaula, Alabama in Barbour County. Freedmen comprised a majority of the population and had been electing Republican candidates to office. Members of an Alabama chapter of the White League, a paramilitary group supporting the Democratic Party's drive to regain political power in the county and state, used firearms to ambush black Republicans at the polls.[1]\nIn Eufaula, members of the White League killed an estimated 15-40 black voters and wounded 70, while driving away more than 1,000 unarmed black people at the polls. In attacking the polling place in Spring Hill, the League effectively hijacked the elections. They turned all Republicans out of office and Democratic candidates took a majority of offices up for election.\nThe White League had formed in 1874 as an insurgent, white Democratic paramilitary group in Grant Parish and nearby parishes[2] on the Red River of the South in Louisiana. The League was founded by members of the white militia who had committed the Colfax Massacre in Louisiana in 1873, killing numerous black people in order to turn out Republicans from parish offices as part of the disputed 1872 gubernatorial election. Historians such as George Rabe consider groups such as the White League and Red Shirts as a \"military arm\" of the Democratic Party. Their members worked openly to disrupt Republican meetings, and attacked and intimidated voters to suppress black voting. They courted press attention rather than operating secretly, as had the Ku Klux Klan.\n",
        "type": [
            "riot",
            "killing"
        ]
    },
    "182": {
        "link": "/wiki/Murder_of_Willie_Edwards",
        "title": "Murder of Willie Edwards",
        "date": "January 23, 1957(1957-01-23) (aged 24) Tyler-Goodwyn BridgeAlabama River, Montgomery County, Alabama",
        "year": "1957",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery County",
        "county": "Montgomery County",
        "paragraph": "Willie Edwards Jr. (November 13, 1932 – January 23, 1957) was a 24-year-old African American, husband and father, who was murdered by members of the Alabama Ku Klux Klan. He is buried at New Pleasant Valley Cemetery in Letohatchee, Alabama.\nOn the night of January 22, 1957, a small group of Klansmen gathered, armed with pistols and a rifle. They got into a car to look for Willie Edwards, an African American, who had recently been hired as a driver for Winn-Dixie. They thought that he was sleeping with a white woman. Willie had come home from work and an hour later got a call from his boss asking to come back in because one of the other workers had called in sick.  Edwards left to go to work on the afternoon of January 23, never to return home. It is thought he was abducted and beaten  by the Klansmen as they drove him around Montgomery. Then they stopped at the Tyler-Goodwin Bridge, along the Alabama River near Montgomery, and pointed a gun at Edwards, before commanding him to jump off the bridge. He fell 125 feet (38.1 m) to his death. Three months passed before his body was discovered washed up on the shores of the river.  Officials stated that decomposition made it impossible to determine the cause of his death.\nIn 1976, then State Attorney General Bill Baxley re-opened the Edwards case.\nFour people were arrested and charged with Edwards's murder: Sonny Kyle Livingston Jr. (38), Henry Alexander (46), James York (73), and Raymond Britt Jr.  Britt broke the long silence with his affidavit (in exchange for immunity), dated February 20, 1976. In the statement to Attorney General Bill Baxley, Britt described how on the night of January 23, 1957, he along with three other men beat and forced Edwards to jump off the Tyler-Goodwin Bridge into the Alabama River. Alabama Judge Frank Embry, however, dismissed the charges, even with Britt's sworn testimony, because no cause of death was ever established. He concluded that \"merely forcing a person to jump from a bridge does not naturally and probably lead to the death of such person.\"[1]\n",
        "type": [
            "murder"
        ]
    },
    "183": {
        "link": "/wiki/Fred_Gray_(attorney)",
        "title": "Fred Gray (attorney)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "Fred David Gray (born December 14, 1930) is an American civil rights attorney, preacher, and activist from Alabama. He litigated several major civil rights cases in Alabama, including some, such as Browder v. Gayle, that reached the United States Supreme Court. He served as the president of the National Bar Association in 1985, and in 2001 was elected as the first African-American President of the Alabama State Bar.[1]\nBorn in Montgomery, Alabama, Gray attended the Loveless School, where his aunt taught, until the seventh grade. He attended the Nashville Christian Institute (NCI), a boarding school operated by the Churches of Christ, where he assisted NCI president and noted preacher Marshall Keeble in visiting other churches of the racially diverse nondenominational fellowship. After graduation, Gray matriculated at Alabama State College for Negroes, and received a baccalaureate degree in 1951.[2] Encouraged by a teacher to apply to law school despite his earlier plans to become an historian and preacher, Gray moved to Cleveland, Ohio, and received a juris doctor degree from Case Western Reserve University School of Law in 1954.[2] At the time there was no law school in Alabama that would accept African Americans.\nAfter passing the bar examination, Gray returned to his home town and established a law office. He also began preaching at the Holt Street Church of Christ, where his parents had long been devout members.[3]\n",
        "type": []
    },
    "184": {
        "link": "/wiki/Selma_to_Montgomery_marches",
        "title": "Selma to Montgomery marches",
        "date": "March 7 – 25, 1965; 57 years ago",
        "year": "1965",
        "location": "Brown Chapel A.M.E. Church, Edmund Pettus Bridge, U.S. Route 80, Haisten’s Mattress & Awning Company, Alabama State Capitol, Selma and Montgomery, Alabama",
        "state": "Alabama",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "\nDCVL members\nSCLC members\n",
        "type": []
    },
    "185": {
        "link": "/wiki/Beck_v._Alabama",
        "title": "Beck v. Alabama",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alabama",
        "place": "Beck",
        "county": "Covington County",
        "paragraph": "Beck v. Alabama, 447 U.S. 625 (1980), was a United States Supreme Court case in which the Court held that a jury must be allowed to consider lesser included offenses, not just capital offense or acquittal.\nBeck was participating in a robbery when his accomplice intentionally killed someone. Beck was tried for capital murder. Under the Code of Alabama, Section 13-11-2 (1975), the requisite intent to kill could not be supplied by the felony murder doctrine. Felony murder was thus a lesser-included offense of the capital crime of robbery with an intentional killing. Under the statute, the judge was specifically prohibited from giving the jury the option of convicting for the lesser-included offense. Absent the statutory ban on such an instruction, Beck's testimony would have entitled him to an instruction on felony murder\nIn the lower courts, Beck attacked the ban on the grounds that the Alabama statute was the same as the mandatory death penalty statutes that the Court had been striking down in recent holdings.\n",
        "type": [
            "murder",
            "robbery",
            "robber",
            "killing"
        ]
    },
    "186": {
        "link": "/wiki/Joseph_Gelders",
        "title": "Joseph Gelders",
        "date": "March 1, 1950(1950-03-01) (aged 51) San Francisco, California, US",
        "year": "1950",
        "location": "",
        "state": "Alabama",
        "place": "Birmingham",
        "county": "Jefferson County",
        "paragraph": "\nJoseph Sidney Gelders (November 20, 1898 – March 1, 1950) was an American physicist who later became an antiracist, civil rights activist, labor organizer, and communist. In the mid-1930s, he served as the secretary and southern-U.S. representative of the National Committee for the Defense of Political Prisoners. In September 1936, Gelders was kidnapped, beaten, and nearly killed by members of the Ku Klux Klan for his civil rights and labor organizing activities. After his recovery, Gelders continued his activism and cofounded the Southern Conference for Human Welfare and the National Committee to Abolish the Poll Tax. He collaborated closely with other activists including Lucy Randolph Mason and Virginia Foster Durr. Internal injuries sustained during his kidnapping and assault led to Gelders' death on March 1, 1950. \nGelders was born November 20, 1898, in Birmingham, Alabama, to a family of German-Jewish descent.[1][2][3] He was the son of Blanche Loeb, of Mississippi, and Louis Gelders, a restaurateur and real estate businessperson.[4] His elder sister was author Emma Gelders Sterne, and his brother, Louis Gelders Jr., was a New York architect.[5][6] Gelders attended the University of Alabama for a year and a half before attending the Massachusetts Institute of Technology for a year. Gelders went back to Birmingham and joined the American Legion. He worked at several jobs including \"third helper in an open-hearth furnace of the Tennessee Coal, Iron and Railroad Company.\"[7] Gelders tried to operate an automobile dealership without success. In 1929, he returned to the University of Alabama and completed a bachelor's and master's degree. After graduating in 1930, Gelders worked at the university as an assistant professor of physics for five years and was also head of the physics laboratory.[7]\n",
        "type": [
            "assault",
            "kidnapping",
            "kidnapped",
            "lynching"
        ]
    },
    "187": {
        "link": "/wiki/Eutaw_massacre",
        "title": "Eutaw massacre",
        "date": "October 25, 1870 (1870-10-25)",
        "year": "1870",
        "location": "Eutaw, Alabama, U.S.",
        "state": "Alabama",
        "place": "Eutaw",
        "county": "Greene County",
        "paragraph": "The Eutaw riot was an episode of white racial violence in Eutaw, Alabama, the county seat of Greene County, on October 25, 1870,[1][2] during the Reconstruction Era in the United States. It was related to an extended period of campaign violence before the fall gubernatorial election, as white Democrats in the state used racial terrorism to suppress black Republican voting. White Klan members attacked a Republican rally of 2,000 black citizens in the courthouse square, killing as many as four and wounding 54. \nBlack Republicans feared for their safety, staying away from the polls or voting Democratic. The Democratic Party won the 1870 gubernatorial election, as similar intimidation was conducted against blacks in other heavily majority Republican counties. \nAs in other states of the former Confederacy, Alabama citizens had been terrorized frequently by the Ku Klux Klan in the run-up to the 1870 gubernatorial election:[3] in Calhoun County, four blacks and one white had been lynched in July 1870.[1] In Greene County, Gilford Coleman, a black Republican leader, had been lynched, fatally shot and his body mutilated, after being taken from his own house. His was the first of two political assassinations of black men in the county in the summer and fall.[4]\n",
        "type": [
            "riot",
            "killing",
            "terrorism"
        ]
    },
    "188": {
        "link": "/wiki/Prathia_Hall",
        "title": "Prathia Hall",
        "date": "August 12, 2002(2002-08-12) (aged 62) Boston, Massachusetts, U.S.",
        "year": "2002",
        "location": "",
        "state": "",
        "place": "Boston",
        "county": "Covington County",
        "paragraph": "Prathia Laura Ann Hall Wynn (January 1, 1940 – August 12, 2002) was an American leader and activist in the Civil Rights Movement, a womanist theologian, and ethicist. She was the key inspiration for Martin Luther King Jr.'s \"I Have a Dream\" speech.\nHall was raised in Philadelphia, the daughter of Berkeley L Hall and Ruby Hall, née Johnson.[1]  Her father founded Mount Sharon Baptist Church, an inner-city congregation in an under-served area of the city.[2]  Her father was a Baptist preacher and a passionate advocate for racial justice,[3] who regarded her as his successor. He inspired her to pursue religion and social justice.[2][4] Prathia believed she was brought into the world for a reason – to integrate religion and freedom together.[5]\nHer leadership potential was recognized early.  She credited many groups, such as the National Conference of Christians and Jews for singling her out and helping her to develop.[2] Hall attended predominantly white schools until the age of five; she took a train ride South with her sisters to visit their grandparents. The girls were forced to sit in the segregated seats located just behind the engine.[3] This was her first experience of dehumanizing discrimination.\n",
        "type": []
    },
    "189": {
        "link": "/wiki/Ralph_Bunche",
        "title": "Ralph Bunche",
        "date": "December 9, 1971(1971-12-09) (aged 67) New York City, U.S.",
        "year": "1971",
        "location": "",
        "state": "",
        "place": "Israel",
        "county": "Montgomery County",
        "paragraph": "\nRalph Johnson Bunche (/bʌntʃ/; August 7, 1904 – December 9, 1971) was an American political scientist, diplomat, and leading actor in the mid-20th-century decolonization process and US civil rights movement, who received the 1950 Nobel Peace Prize for his late 1940s mediation in Israel. Among black Nobel laureates he is the first African American and first person of African descent to be awarded a Nobel Prize. He was involved in the formation and early administration of the United Nations, and played a major role in both the decolonization process and numerous UN peacekeeping operations.\nBunche served on the US delegation to both the Dumbarton Oaks Conference in 1944 and United Nations Conference on International Organization in 1945 that drafted the UN charter. He then served on the American delegation to the first session of the United Nations General Assembly in 1946 and joined the UN as head of the Trusteeship Department, beginning a long series of troubleshooting roles and responsibilities related to decolonization. In 1948, Bunche became an acting mediator for the Middle East, negotiating an armistice between Egypt and Israel. For this success he was awarded the Nobel Peace Prize in 1950.\n",
        "type": [
            "shooting"
        ]
    },
    "190": {
        "link": "/wiki/Bob_Mants",
        "title": "Bob Mants",
        "date": "December 7, 2011(2011-12-07) (aged 68) Atlanta, Georgia",
        "year": "2011",
        "location": "",
        "state": "",
        "place": "Atlanta",
        "county": "Montgomery County",
        "paragraph": "Robert \"Bob\" Mants, Jr. (April 25, 1943 – December 7, 2011) was an American civil rights activist, serving as a field secretary for the Student Nonviolent Coordinating Committee (SNCC). Mants moved to Lowndes County, working for civil rights for the remainder of his life. Lowndes County contained the majority of the distance covered by the 1965 Selma to Montgomery march, and was then notorious for its racist violence.\nMants was born in Atlanta, Georgia.[1] He graduated in 1961 from East Point/South Fulton High School,[1] a segregated black high school. While he was attending high school, Mants was a member of the Committee on Appeal for Human Rights (which would later develop into the Atlanta Student Movement) and volunteering for administrative tasks at the headquarters of the Student Nonviolent Coordinating Committee,[1] two blocks from his home.[2] He would go on to attend Morehouse College with the intention of majoring in medicine,[2] but left without graduating, working in 1964 with SNCC in Americus, Georgia. At the beginning of 1965 Mants moved to Lowndes County, AL for his job.[1]\nWhile in Americus, Mants reported over the Wide Area Telephone Service that \"negro and white\" mobs were forming on the evening of July 6, 1964, possibly in response to riots the evening before or the integration of two downtown restaurants earlier in the day, which had occurred without incident. Mants was working to calm and disperse the mobs. An hour later, Mants reported a drive-by shooting with no reported injuries or deaths.[3]\n",
        "type": [
            "riot",
            "shooting"
        ]
    },
    "191": {
        "link": "/wiki/Amelia_Boynton_Robinson",
        "title": "Amelia Boynton Robinson",
        "date": "August 26, 2015(2015-08-26) (aged 104) Montgomery, Alabama, U.S.",
        "year": "2015",
        "location": "",
        "state": "",
        "place": "Montgomery",
        "county": "Montgomery County",
        "paragraph": "\nAmelia Isadora Platts Boynton Robinson (August 18, 1911 – August 26, 2015) was an American activist who was a leader of the American Civil Rights Movement in Selma, Alabama,[1] and a key figure in the 1965 Selma to Montgomery marches. In 1984, she became founding vice-president of the Schiller Institute affiliated with Lyndon LaRouche. She was awarded the Martin Luther King Jr. Freedom Medal in 1990.[2]\nAmelia Isadora Platts was born in Savannah, Georgia, on August 18, 1911, to George and Anna Eliza (née Hicks) Platts,[3][4][5] both of whom were African-American. She also had Cherokee and German ancestry. Church was central to Amelia and her nine siblings' upbringing.[6] As a young girl, she became involved in campaigning for women's suffrage. Her family encouraged the children to read. Amelia attended two years at Georgia State Industrial College for Colored Youth (now Savannah State University, a historically black college).[4] She transferred to Tuskegee Institute (now Tuskegee University), earning a degree in home economics in 1927.[3][4] (Platts later also studied at Tennessee State, Virginia State, and Temple University.)[citation needed]\n",
        "type": []
    },
    "192": {
        "link": "/wiki/Maria_Ragland_Davis",
        "title": "Maria Ragland Davis",
        "date": "February 12, 2010(2010-02-12) (aged 50) Huntsville, Alabama, US",
        "year": "2010",
        "location": "",
        "state": "",
        "place": "Huntsville",
        "county": "Madison County",
        "paragraph": "Maria Ragland Davis (June 1, 1959 – February 12, 2010) was an American biologist and educator. She was associate professor of Biology at the University of Alabama in Huntsville where she studied molecular biology and plant genetics.[1]\nA native of Detroit, she received her undergraduate degree in chemical engineering from the University of Michigan and a master's degree in the same discipline from North Carolina State University.[2] Following the receipt of her master's degree, Davis completed her doctorate in biochemistry and plant biology. Davis studied strawberries, looking at the genetic makeup of strains that were susceptible to fungal pathogens under cold stress and those that were not.[3]\nShe was one of three faculty members killed in the University of Alabama in Huntsville shooting on February 12, 2010.[4] She was 50 years old.\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "193": {
        "link": "/wiki/Diane_Nash",
        "title": "Diane Nash",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Diane Judith Nash (born May 15, 1938) is an American civil rights activist, and a leader and strategist of the student wing of the Civil Rights Movement.\nNash's campaigns were among the most successful of the era. Her efforts included the first successful civil rights campaign to integrate lunch counters (Nashville);[1] the Freedom Riders, who desegregated interstate travel;[2] co-founding the Student Nonviolent Coordinating Committee (SNCC); and co-initiating the Alabama Voting Rights Project and working on the Selma Voting Rights Movement. This helped gain Congressional passage of the Voting Rights Act of 1965, which authorized the federal government to oversee and enforce state practices to ensure that African Americans and other minorities were not prevented from registering and voting.\nIn July 2022, Nash was awarded the Presidential Medal of Freedom by President Joe Biden.[3]\n",
        "type": []
    }
}