[
    {
        "link": "/wiki/Geneva_County_shootings",
        "title": "Geneva County shootings",
        "date": "March 10, 2009; 13 years ago (2009-03-10) c. 3:30 – 4:17 p.m.[1] (EST)",
        "location": "Geneva and Samson, Alabama, United States",
        "paragraph": "On March 10, 2009, Michael Kenneth McLendon, 28, fatally shot ten people and wounded six others between the communities of Kinston, Samson, and Geneva, Alabama.  McLendon's shooting spree was the deadliest mass shooting in Alabama's history.[5]\nMcLendon first killed his mother and burned down her house in the town of Kinston. Traveling to Samson, he killed his maternal grandmother, uncle, two cousins, and others, and wounded six.[6] When law enforcement reached him, McLendon committed suicide. He was said to have been depressed about lack of work; in a note he said that his mother's family was not giving him enough support.\n"
    },
    {
        "link": "/wiki/Nectar_Covered_Bridge",
        "title": "Nectar Covered Bridge",
        "date": "",
        "location": "",
        "paragraph": "The Nectar Covered Bridge was a wood and metal combination style covered bridge which spanned the Locust Fork of the Black Warrior River in Blount County, Alabama, United States.  It was located on Nectar Bridge Road off State Route 160, just east of the town of Nectar, about 14 miles (16 kilometers) northwest of Oneonta.  Nectar Covered Bridge was at one time the seventh-longest covered bridge in the country.  The bridge remained open to single lane motor traffic from its construction until it was burned by vandals on June 13, 1993.[2]\nBuilt in 1934, the 385-foot (117-meter) bridge was a Town Lattice truss construction over four spans.[3]  It was built by a crew led by foreman Zelma C. Tidwell over a wide section of the Locust Fork.[4]  It was the third-longest covered bridge built in Blount County.  At one time, the Nectar Covered Bridge was the seventh longest covered bridge in the country.  The bridge was burned by vandals on June 13, 1993.  It was maintained by the Blount County Commission and the Alabama Department of Transportation.  The Nectar Covered Bridge was listed on the National Register of Historic Places on August 20, 1981.[1]\n"
    },
    {
        "link": "/wiki/Recy_Taylor",
        "title": "Recy Taylor",
        "date": "",
        "location": "",
        "paragraph": "\nRecy Taylor (née Corbitt; December 31, 1919 – December 28, 2017)[2]: 297  was an African-American woman from Abbeville in Henry County, Alabama. She was born and raised in a sharecropping family in the Jim Crow era Southern United States.  Taylor's refusal to remain silent about her rape by white men led to organizing in the African-American community for justice and civil rights.\n"
    },
    {
        "link": "/wiki/Valhermoso_Springs_shooting",
        "title": "Valhermoso Springs, Alabama",
        "date": "",
        "location": "",
        "paragraph": "Valhermoso Springs is an unincorporated community in Morgan County, Alabama, United States. Valhermoso Springs is located on Alabama State Route 36, 6.7 miles (10.8 km) east-northeast of Somerville.[2] Valhermoso Springs has a post office with ZIP code 35775.[3]\nOn June 4, 2020, police received 9-1-1 calls about shots being fired at Talucah Road. Upon responding, they found a house on fire. When the flames were extinguished, the bodies of three females, four males, and a dog were discovered; all of them had suffered gunshot wounds. Police announced the incident was a targeted attack, and by the next day, all seven victims were identified.[4][5] On June 22, two suspects, John Michael Legg, 19, and Frederic Allen Rogers, 22, were arrested in a silver Dodge Charger in Stayton, Oregon, 15 miles (24 km) southeast of Salem, during a traffic stop, and both face capital murder charges. Legg and Rogers were allegedly motivated by an internal dispute in a club in which they and three of the victims were members.[6][7]\n"
    },
    {
        "link": "/wiki/16th_Street_Baptist_Church_bombing",
        "title": "16th Street Baptist Church bombing",
        "date": "September 15, 1963; 59 years ago 10:22 a.m. (UTC-5)",
        "location": "Birmingham, Alabama",
        "paragraph": "\nEvents\n"
    },
    {
        "link": "/wiki/Judge_Edward_Aaron",
        "title": "Judge Edward Aaron",
        "date": "",
        "location": "",
        "paragraph": "\nJudge Edward Aaron (born 1923) was an African American handyman in Birmingham, Alabama who was abducted by seven members of  Asa Earl Carter's independent Ku Klux Klan group on Labor Day, September 2, 1957.[1]\n"
    },
    {
        "link": "/wiki/Birmingham_bus_attack",
        "title": "Birmingham bus attack",
        "date": "",
        "location": "",
        "paragraph": "On 14 May 1961, during the American Civil Rights Movement, a mob of Ku Klux Klan members attacked civil rights Freedom Riders in Birmingham, Alabama after two buses were setting out to travel the south in protest of their civil rights following the Supreme Court case saying bus segregation was unconstitutional.\nCity of Birmingham\n"
    },
    {
        "link": "/wiki/Birmingham_riot_of_1963",
        "title": "Birmingham riot of 1963",
        "date": "May 11, 1963",
        "location": "Birmingham, Alabama, United States",
        "paragraph": "\nEvents\n"
    },
    {
        "link": "/wiki/Bombingham",
        "title": "Bombingham",
        "date": "",
        "location": "Birmingham, Alabama",
        "paragraph": "City of Birmingham\nCity of Montgomery\n"
    },
    {
        "link": "/wiki/Alexander_Boyd_(county_solicitor)",
        "title": "Alexander Boyd (county solicitor)",
        "date": "",
        "location": "",
        "paragraph": "Alexander Boyd (September 8, 1834 – March 31, 1870) was notable as the Republican County Solicitor and Register in Chancery of Greene County, Alabama in 1870 during Reconstruction who was murdered by a lynching party of Ku Klux Klan members. He was fatally shot on March 31, 1870 in Eutaw, the county seat. The Klan members apparently intended to hang him in the square in a public lynching, to demonstrate their power during this period and their threat to Republicans.[1]\nBoyd fiercely resisted their taking him from his hotel room. In the armed confrontation, he was shot and killed there. As was typical of most Klan attacks, his murderers were never brought to justice. That same night, prominent black Republican James Martin was shot and killed at his home in Union, Alabama, also in Greene County.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_Michael_Donald",
        "title": "Lynching of Michael Donald",
        "date": "",
        "location": "",
        "paragraph": "\nThe lynching of Michael Donald in Mobile, Alabama, on March 21, 1981, was one of the last reported lynchings in the United States.[1][2] Several Ku Klux Klan (KKK) members beat and killed Michael Donald, a 19-year-old African-American, and hung his body from a tree. One perpetrator, Henry Hays, was executed by electric chair in 1997, while another, James Knowles, was sentenced to life in prison after pleading guilty and testifying against Hays. A third man was convicted as an accomplice and also sentenced to life in prison, and a fourth was indicted but died before his trial could be completed.\n"
    },
    {
        "link": "/wiki/Murder_of_Willie_Edwards",
        "title": "Murder of Willie Edwards",
        "date": "",
        "location": "",
        "paragraph": "Willie Edwards Jr. (November 13, 1932 – January 23, 1957) was a 24-year-old African American, husband and father, who was murdered by members of the Alabama Ku Klux Klan. He is buried at New Pleasant Valley Cemetery in Letohatchee, Alabama.\nOn the night of January 22, 1957, a small group of Klansmen gathered, armed with pistols and a rifle. They got into a car to look for Willie Edwards, an African American, who had recently been hired as a driver for Winn-Dixie. They thought that he was sleeping with a white woman. Willie had come home from work and an hour later got a call from his boss asking to come back in because one of the other workers had called in sick.  Edwards left to go to work on the afternoon of January 23, never to return home. It is thought he was abducted and beaten  by the Klansmen as they drove him around Montgomery. Then they stopped at the Tyler-Goodwin Bridge, along the Alabama River near Montgomery, and pointed a gun at Edwards, before commanding him to jump off the bridge. He fell 125 feet (38.1 m) to his death. Three months passed before his body was discovered washed up on the shores of the river.  Officials stated that decomposition made it impossible to determine the cause of his death.\n"
    },
    {
        "link": "/wiki/Eutaw_massacre",
        "title": "Eutaw massacre",
        "date": "October 25, 1870 (1870-10-25)",
        "location": "Eutaw, Alabama, U.S.",
        "paragraph": "The Eutaw riot was an episode of white racial violence in Eutaw, Alabama, the county seat of Greene County, on October 25, 1870,[1][2] during the Reconstruction Era in the United States. It was related to an extended period of campaign violence before the fall gubernatorial election, as white Democrats in the state used racial terrorism to suppress black Republican voting. White Klan members attacked a Republican rally of 2,000 black citizens in the courthouse square, killing as many as four and wounding 54. \nBlack Republicans feared for their safety, staying away from the polls or voting Democratic. The Democratic Party won the 1870 gubernatorial election, as similar intimidation was conducted against blacks in other heavily majority Republican counties. \n"
    },
    {
        "link": "/wiki/Joseph_Gelders",
        "title": "Joseph Gelders",
        "date": "",
        "location": "",
        "paragraph": "\nJoseph Sidney Gelders (November 20, 1898 – March 1, 1950) was an American physicist who later became an antiracist, civil rights activist, labor organizer, and communist. In the mid-1930s, he served as the secretary and southern-U.S. representative of the National Committee for the Defense of Political Prisoners. In September 1936, Gelders was kidnapped, beaten, and nearly killed by members of the Ku Klux Klan for his civil rights and labor organizing activities. After his recovery, Gelders continued his activism and cofounded the Southern Conference for Human Welfare and the National Committee to Abolish the Poll Tax. He collaborated closely with other activists including Lucy Randolph Mason and Virginia Foster Durr. Internal injuries sustained during his kidnapping and assault led to Gelders' death on March 1, 1950. \n"
    },
    {
        "link": "/wiki/Viola_Liuzzo",
        "title": "Viola Liuzzo",
        "date": "",
        "location": "",
        "paragraph": "Viola Fauver Liuzzo (née Gregg; April 11, 1925 – March 25, 1965) was an American civil rights activist. In March 1965, Liuzzo heeded the call of Martin Luther King Jr. and traveled from Detroit, Michigan, to Selma, Alabama, in the wake of the Bloody Sunday attempt at marching across the Edmund Pettus Bridge. Liuzzo participated in the successful Selma to Montgomery marches and helped with coordination and logistics. At the age of 39, while driving back from a trip shuttling fellow activists to the Montgomery airport, she was fatally hit by shots fired from a pursuing car containing Ku Klux Klan members Collie Wilkins, William Eaton, Eugene Thomas, and Gary Thomas Rowe, the last of whom was actually an undercover informant working for the Federal Bureau of Investigation (FBI).[1][2] Although the State of Alabama was unable to secure a murder conviction, Wilkins, Eaton, and Thomas were charged in federal court with conspiracy to intimidate African Americans under the 1871 Ku Klux Klan Act, a Reconstruction civil rights statute. On December 3, the trio was found guilty by an all-white, all-male jury, and were sentenced to ten years in prison, a landmark in Southern legal history.\nRowe testified that Wilkins had fired two shots into Liuzzo on the order of Thomas,[citation needed] and was placed in the witness protection program by the FBI.[3] In an effort to deflect attention from having employed Rowe as an informant, the FBI produced disinformation[4][5] for politicians and the press, stating that Liuzzo was a member of the Communist Party, heroin addict,[6] and had abandoned her children to have sexual relationships with African-Americans involved in the Civil Rights Movement.[7] Liuzzo's involvement in the civil rights movement was scrutinized and she was condemned by various racist organizations. In 1983, the Liuzzo family filed a lawsuit against the FBI after learning about the FBI's activities, but the suit was dismissed.\n"
    },
    {
        "link": "/wiki/1910_lynching_in_Centreville,_Alabama",
        "title": "Centreville, Alabama",
        "date": "",
        "location": "",
        "paragraph": "\nCentreville is a city in Bibb County, Alabama, United States. At the 2020 census, the population was 2,800. The city is the county seat of Bibb County.\n"
    },
    {
        "link": "/wiki/1919_Lynching_in_Montgomery,_Alabama",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "location": "Montgomery, Alabama, United States",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\n"
    },
    {
        "link": "/wiki/1920_Alabama_coal_strike",
        "title": "1920 Alabama coal strike",
        "date": "September 7, 1920 – February, 1921",
        "location": "Walker County, Alabama",
        "paragraph": "John L. Lewis\nThomas Kilby\n"
    },
    {
        "link": "/wiki/Alexander_Boyd_(county_solicitor)",
        "title": "Alexander Boyd (county solicitor)",
        "date": "",
        "location": "",
        "paragraph": "Alexander Boyd (September 8, 1834 – March 31, 1870) was notable as the Republican County Solicitor and Register in Chancery of Greene County, Alabama in 1870 during Reconstruction who was murdered by a lynching party of Ku Klux Klan members. He was fatally shot on March 31, 1870 in Eutaw, the county seat. The Klan members apparently intended to hang him in the square in a public lynching, to demonstrate their power during this period and their threat to Republicans.[1]\nBoyd fiercely resisted their taking him from his hotel room. In the armed confrontation, he was shot and killed there. As was typical of most Klan attacks, his murderers were never brought to justice. That same night, prominent black Republican James Martin was shot and killed at his home in Union, Alabama, also in Greene County.[1]\n"
    },
    {
        "link": "/wiki/Robert_Crosky_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "location": "Montgomery, Alabama, United States",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\n"
    },
    {
        "link": "/wiki/Lynching_of_Michael_Donald",
        "title": "Lynching of Michael Donald",
        "date": "",
        "location": "",
        "paragraph": "\nThe lynching of Michael Donald in Mobile, Alabama, on March 21, 1981, was one of the last reported lynchings in the United States.[1][2] Several Ku Klux Klan (KKK) members beat and killed Michael Donald, a 19-year-old African-American, and hung his body from a tree. One perpetrator, Henry Hays, was executed by electric chair in 1997, while another, James Knowles, was sentenced to life in prison after pleading guilty and testifying against Hays. A third man was convicted as an accomplice and also sentenced to life in prison, and a fourth was indicted but died before his trial could be completed.\n"
    },
    {
        "link": "/wiki/Lynching_of_Albert_Easley",
        "title": "Lynching of Albert Easley",
        "date": "January 20, 1879; 144 years ago (1879-01-20)",
        "location": "Jacksonville, Alabama, U.S.",
        "paragraph": "Albert Easley was an African-American boy of 13–14 years who was lynched in Jacksonville, Calhoun County, Alabama, on January 20, 1879 after being arrested as a suspect in the assault and rape of Mrs. Moses Ables of nearby Cove Creek, Etowah County, Alabama. Mrs. Ables, a widowed mother of three, was found unconscious but alive three days earlier with severe head injuries and indications that she had been raped. No eyewitnesses were reported and it is not clear why suspicion rested immediately upon Easley. Accounts emphasize that he confessed, though one account claims he admitted only the beating and denied the rape. He was arrested and taken to the jail in Jacksonville about 14 miles from where the crime occurred. At 1 pm a mob of between one hundred and fifty and three hundred persons took Easley from the jail by force and lynched him within the city limits during the daytime. Mrs. Ables died five weeks after the lynching took place.\nNewspaper reports suggest that the crime was committed on Thursday, January 16, just 4 days before the lynching. Mrs. Moses Ables was reportedly found the following day unconscious, suffering from multiple skull fractures and apparently raped.[1] She was presumed to be near death though she survived several weeks following the assault and subsequent lynching.[2]\n"
    },
    {
        "link": "/wiki/Lynchings_in_Elmore_County,_Alabama",
        "title": "Lynchings in Elmore County, Alabama",
        "date": "",
        "location": "",
        "paragraph": "\nElmore County is a county located in the east-central portion of the U.S. state of Alabama. Throughout its history, there have been many lynchings in the county including on July 2, 1901, when a local mob lynched Robert (or perhaps Robin) White. In a strange turn of events, a local farmer, George White confessed in court to the killing and named five other local men as killers. Three men were convicted in the killing and sentenced to ten years in prison. On 9 June 1902, they were pardoned by Governor Jelks.[1]\n"
    },
    {
        "link": "/wiki/Hurtsboro_race_riot",
        "title": "Hurtsboro race riot",
        "date": "December 1920",
        "location": "Hurtsboro, Alabama, United States",
        "paragraph": "The Hurtsboro race riot was conflict between Black and White residents of Hurtsboro, Alabama in the final days of 1920.\nViolence against Blacks were and other incidents of civil unrest were nothing new to early 20th century America. The country had recently gone through what is now known as the American Red Summer of 1919. Attacks on black communities and white oppression spread to more than three dozen cities and counties. In most cases, white mobs attacked African American neighborhoods. In some cases, black community groups resisted the attacks, especially in Chicago and Washington, D.C. Most deaths occurred in rural areas during events like the Elaine race riot in Arkansas, where an estimated 100 to 240 blacks and 5 whites were killed. Other major events of Red Summer were the Chicago race riot and Washington D.C. Race Riot, which caused 38 and 39 deaths, respectively. Both riots had many more non-fatal injuries and extensive property damage reaching up into the millions of dollars.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_Willie_Lee_Jenkins",
        "title": "Lynching of Willie Lee Jenkins",
        "date": "January 10, 1922",
        "location": "Eufaula, Barbour County, Alabama",
        "paragraph": "Willie Lee Jenkins was lynched in Eufaula, Barbour County, Alabama. According to the United States Senate Committee on the Judiciary it was the 3rd of 61 lynchings during 1922 in the United States. [1]\nAccording to his grand daughter Shirley Johnson, her grandfather had a dispute with his boss' wife which cost him his life.[2] Newspapers of the time reported that he \"insulted a white woman.\"[3]\n"
    },
    {
        "link": "/wiki/LaFayette,_Alabama",
        "title": "LaFayette, Alabama",
        "date": "",
        "location": "",
        "paragraph": "LaFayette (/ləˈfeɪɛt, -ˈfaɪ-/ lə-FAY-et, -⁠FY-, /ˈlʌfeɪɛt/ LUF-ay-et) is the county seat of Chambers County, Alabama, United States, 47 miles (76 km) northwest of Columbus, Georgia. As of the 2010 census, the population of the city was 3,003.[3]\nChambers County was formed in 1832. The newly elected county officials opted to locate the county seat as near as possible to the center of the county. Lots for the new town were auctioned in October 1833, with proceeds from the sale financing the construction of a courthouse and jail. The town was first called \"Chambersville\", but by the time of incorporation on January 7, 1835, the town name had been changed to \"Lafayette\", named after the Marquis de Lafayette; its spelling was changed to \"LaFayette\" due to the influence of newspaper editor Johnson J. Hooper, who created a fictional character called Captain Simon Suggs, a backwoods southerner who pronounced the town's name as \"La\nFait\".[1][4] The city's newspaper, The LaFayette Sun, was founded under the name The Alabama Standard in April 1841 and adopted its current name on August 3, 1881.[5]\n"
    },
    {
        "link": "/wiki/Lynching_of_Horace_Maples",
        "title": "Lynching of Horace Maples",
        "date": "September 7, 1904",
        "location": "Huntsville, Alabama",
        "paragraph": "Horace Maples was an African-American man who was lynched by a mob of approximately 2,000 people in Huntsville, Alabama, on September 7, 1904.[1] Maples had been accused of murder and was being held in the county jail when it was set on fire by the crowd. He jumped from a second story window in the jail, but was seized by the crowd and hanged on a tree on the courthouse lawn.[2][3] Maples' body was then shot full of bullets by people in the crowd.[4]\nDetailed news reports of the lynching spread quickly across the United States.  This report appeared in the weekly The Ingham County News, published in Mason, Michigan, on September 15, 1904:\n"
    },
    {
        "link": "/wiki/Lynching_of_Jim_McMillan",
        "title": "Lynching of Jim McMillan",
        "date": "",
        "location": "",
        "paragraph": "Jim McMillan was lynched in Bibb County, Alabama on June 18, 1919.\nRacial tension in the Woodstock and Green Pond communities of Bibb County, Alabama worsened over the summer of 1919. Individuals terrorized the black community in southern Bibb County, around Woodstock.[1] The events culminated in a white mob seizing Jim McMillan and taking him into the Alabama bush. He was forced onto a stump and the mob shot him to death.[2][3][4][5]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Meadows",
        "title": "Lynching of George Meadows",
        "date": "",
        "location": "",
        "paragraph": "\nGeorge Meadows was an African American man who was lynched on January 15, 1889, in Jefferson County, Alabama, United States.[1]\n"
    },
    {
        "link": "/wiki/Miles_Phifer_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "location": "Montgomery, Alabama, United States",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\n"
    },
    {
        "link": "/wiki/James_Reeb",
        "title": "James Reeb",
        "date": "",
        "location": "",
        "paragraph": "James Joseph Reeb (January 1, 1927 – March 11, 1965) was an American Unitarian Universalist minister, pastor, and activist during the civil rights movement in Washington, D.C. and Boston, Massachusetts. While participating in the Selma to Montgomery marches actions in Selma, Alabama, in 1965, he was murdered by white segregationists, dying of head injuries in the hospital two days after being severely beaten. Three men were tried for Reeb's murder but were acquitted by an all-white jury. His murder remains officially unsolved.\nReeb was born on January 1, 1927, in Wichita, Kansas, to Mae (Fox) and Harry Reeb.[1][2] He was raised in Kansas and Casper, Wyoming.[3]  He attended Natrona County High School and graduated in 1945, after which he joined the Army despite the fact that his commitment to the ministry made him exempt from service. After basic training, he was sent to Anchorage, Alaska, as a clerk typist for the headquarters of Special Troops. He was honorably discharged eighteen months later in December 1946 as Technical Sergeant, Third Class.[4] After his time in the Army, Reeb continued his schooling. Initially, he attended classes in his home town at Casper Junior College, before moving on to St. Olaf College, in 1947, where he received his A.B. cum laude in 1950.[5] He then entered Princeton Theological Seminary in Princeton, New Jersey,[6] where he earned his B.D. in 1953.[4] Three days later, Reeb was ordained a Presbyterian minister at the First Presbyterian Church of Casper.[7] After this he accepted a position at the Philadelphia General Hospital as Chaplain to Hospitals for the Philadelphia Presbyter. To become a more effective counselor, he went back to school, enrolling at Conwell School of Theology, where he earned an S.T.M. in Pastoral Counseling in 1955.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_Josh_Shorter",
        "title": "Lynching of Josh Shorter",
        "date": "June 9, 1881; 141 years ago (1881-06-09)",
        "location": "Eufaula, Alabama",
        "paragraph": "\nJosh Shorter was an African-American man who was lynched in Eufaula, Alabama, or between Eufaula and Georgetown, Georgia, in early June 1881. \n"
    },
    {
        "link": "/wiki/Bill_Sketoe",
        "title": "Bill Sketoe",
        "date": "",
        "location": "",
        "paragraph": "William Sketoe, Sr. (June 8, 1818 – December 3, 1864) was a Methodist minister from the south Alabama town of Newton, whose lynching there on December 3, 1864 gave birth to one of Alabama's best-known ghost stories.  While locally-told stories of his life usually say that he was hanged on trumped-up charges of desertion from the Confederate Army, other sources show that he was killed for allegedly aiding pro-Union renegades in the area.  Whatever the reason for his murder, a shallow hole dug beneath Sketoe's feet during the hanging (to accommodate his large frame) ultimately led to stories about \"the hole that won't stay filled.\"  According to witnesses, this hole never disappeared—even after being filled numerous times—retaining its original dimensions for the next 125 years.\nSketoe's tale became a staple of Southern folklore, and was later immortalized by Alabama author Kathryn Tucker Windham in her 13 Alabama Ghosts and Jeffrey.  His hanging site remained a local tourist attraction for decades, and continues to attract visitors even though the hole itself recently disappeared due to flooding in the area.  Today the site of Sketoe's lynching lies beneath the Alabama Highway 134 bridge over the Choctawhatchee River, and a monument to Sketoe has been erected nearby.\n"
    },
    {
        "link": "/wiki/John_Temple_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "location": "Montgomery, Alabama, United States",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\n"
    },
    {
        "link": "/wiki/Lynching_of_Jesse_Thornton",
        "title": "Lynching of Jesse Thornton",
        "date": "June 22, 1940; 82 years ago (1940-06-22)",
        "location": "Luverne, Alabama",
        "paragraph": "\nJesse Thornton was a 26-year old African-American  man who was lynched in the town of Luverne, Alabama, on June 22, 1940. Thornton was lynched for allegedly refusing to address a white man as \"Mister\". He was shot to death, and his body was thrown into the Patsaliga River.[1] The Equal Justice Initiative documented that the white man Thornton had apparently offended by his Jim Crow infraction was a police officer.[2]\n"
    },
    {
        "link": "/wiki/Wetumpka,_Alabama",
        "title": "Wetumpka, Alabama",
        "date": "",
        "location": "",
        "paragraph": "\nWetumpka (US: /wɪˈtʌmkə/) is a city in and the county seat of Elmore County, Alabama, United States. At the 2020 census, the population was 7,220.[2] In the early 21st century Elmore County became one of the fastest-growing counties in the state.[3] The city is considered part of the Montgomery Metropolitan Area.\n"
    },
    {
        "link": "/wiki/2016_Citronelle_homicides",
        "title": "2016 Citronelle homicides",
        "date": "August 20, 2016 (2016-08-20) 4:10 a.m. (CT)",
        "location": "Citronelle, Alabama, United States",
        "paragraph": "\nOn August 20, 2016, a mass killing occurred in Citronelle, Alabama, resulting in the deaths of five people, including a woman who was five months pregnant. They were killed in the early morning in a private residence in a rural area west of the city. It was owned by a brother of Laneta Lester, who had sought refuge there. She and her brother's infant were abducted and taken to Leakesville, Mississippi, by her estranged boyfriend, Derrick Dearman. He released her that day. Lester returned with the infant to Citronelle. She notified police of the killings. Investigators described this mass killing as the worst in Mobile County's history. The house burned down a couple of weeks after the crime.\n"
    },
    {
        "link": "/wiki/Doe_B",
        "title": "Doe B",
        "date": "",
        "location": "",
        "paragraph": "\nGlenn Thomas (June 13, 1991 – December 28, 2013), better known by his stage name Doe B, was an American rapper from Montgomery, Alabama. He was perhaps best known for being signed to fellow rapper T.I.'s Atlanta-based record label, Hustle Gang.[1] Thomas was also known for his signature eye patch, the result of a shooting that occurred in 2009. During his career he released several mixtapes, including Trap Life (2012) and Baby Jesus (2013); he was also featured on the 2013 Grand Hustle compilation G.D.O.D. (Get Dough or Die). Thomas was shot and killed on December 28, 2013, at the Centennial Hill Bar & Grill, in his hometown of Montgomery. There have been two posthumous projects, D.O.A.T. 3 (Definition of a Trapper) and the compilation mixtape Doe B Presents C.B.M.: Choppaz, Brickz & Money, released by Doe B's own label, Cote Block Music.\n"
    },
    {
        "link": "/wiki/Geneva_County_shootings",
        "title": "Geneva County shootings",
        "date": "March 10, 2009; 13 years ago (2009-03-10) c. 3:30 – 4:17 p.m.[1] (EST)",
        "location": "Geneva and Samson, Alabama, United States",
        "paragraph": "On March 10, 2009, Michael Kenneth McLendon, 28, fatally shot ten people and wounded six others between the communities of Kinston, Samson, and Geneva, Alabama.  McLendon's shooting spree was the deadliest mass shooting in Alabama's history.[5]\nMcLendon first killed his mother and burned down her house in the town of Kinston. Traveling to Samson, he killed his maternal grandmother, uncle, two cousins, and others, and wounded six.[6] When law enforcement reached him, McLendon committed suicide. He was said to have been depressed about lack of work; in a note he said that his mother's family was not giving him enough support.\n"
    },
    {
        "link": "/wiki/Riverchase_Galleria",
        "title": "Riverchase Galleria",
        "date": "",
        "location": "Hoover, Alabama",
        "paragraph": "Riverchase Galleria, locally known as The Galleria, is a large, super–regional shopping mall and mixed use development in Hoover, Alabama, in the Greater Birmingham metropolitan area. It is ranked 43rd on the list of largest shopping malls in the United States. It is the largest enclosed shopping center in Alabama.\nLocated at the intersection of U.S. Highway 31 (Montgomery Highway) and Interstate 459, the Riverchase Galleria complex includes the region's only Costco, and also includes the 15-story, 1,700,000-square-foot (160,000 m2) Hyatt Regency, and the 17-story, 285,000-square-foot (26,500 m2) Galleria Tower office building. The tower includes the headquarters of Walter Energy, Inc.[2] The mall's anchor stores are JCPenney, Von Maur, Macy's, Belk , and Dave & Buster's. There are two vacant anchor stores which were once Sears and Belk Children's and Home.\n"
    },
    {
        "link": "/wiki/University_of_Alabama_in_Huntsville_shooting",
        "title": "University of Alabama in Huntsville shooting",
        "date": "February 12, 2010; 12 years ago (2010-02-12) 4:00 p.m. (CST)",
        "location": "Huntsville, Alabama, U.S.",
        "paragraph": "\nOn February 12, 2010, three people were killed and three others wounded in a shooting at the University of Alabama in Huntsville (UAH) in Huntsville, Alabama, United States. During a routine meeting of the biology department attended by approximately 12 people, Amy Bishop, a biology professor at the university, began shooting those nearest her with a Ruger P95 handgun.\n"
    },
    {
        "link": "/wiki/16th_Street_Baptist_Church_bombing",
        "title": "16th Street Baptist Church bombing",
        "date": "September 15, 1963; 59 years ago 10:22 a.m. (UTC-5)",
        "location": "Birmingham, Alabama",
        "paragraph": "\nEvents\n"
    },
    {
        "link": "/wiki/Murder_of_Willie_Brewster",
        "title": "Murder of Willie Brewster",
        "date": "July 15, 1965; 57 years ago (1965-07-15)",
        "location": "Anniston, Alabama",
        "paragraph": "City of Birmingham\nCity of Montgomery\n"
    },
    {
        "link": "/wiki/Murder_of_Lauren_Burk",
        "title": "Murder of Lauren Burk",
        "date": "March 4, 2008",
        "location": "Auburn, Alabama, U.S.",
        "paragraph": "\nThe murder of Lauren Burk occurred on March 4, 2008, in Auburn, Alabama. Burk, an 18-year-old freshman at Auburn University, was kidnapped at gunpoint by Courtney Lockhart. Lockhart, a U.S. military veteran who had been dishonorably discharged, robbed Burk and forced her to strip naked.[1] He drove her around for about 30 minutes, during which he lamented about his unemployment and misfortunes. When Burk attempted to escape Lockhart shot her in the lungs.[2] Burk, who was now severely injured and completely naked except for a pair of socks, was left on Alabama State Route 147.[1][2] Lauren was able to tell law enforcement that her purse/ID was still in the attacker’s car, and she gave a brief description of her attacker and the vehicle, facts that would help police find the culprit relatively quickly. She was later pronounced dead at a local hospital. [3]\n"
    },
    {
        "link": "/wiki/James_Coyle",
        "title": "James Coyle",
        "date": "",
        "location": "",
        "paragraph": "James Edwin Coyle (March 23, 1873 – August 11, 1921) was a Catholic priest who was murdered in Birmingham, Alabama by a Ku Klux Klan member for performing an interracial marriage.\nJames Coyle was born in Drum, County Roscommon, United Kingdom of Great Britain and Ireland, now modern day Ireland, to Owen Coyle and his wife Margaret Durney.[1] He attended Mungret College in Limerick and the Pontifical North American College in Rome, and was ordained a priest at age 23 on May 30, 1896.\n"
    },
    {
        "link": "/wiki/Robert_Crosky_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "location": "Montgomery, Alabama, United States",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\n"
    },
    {
        "link": "/wiki/Jonathan_Daniels",
        "title": "Jonathan Daniels",
        "date": "",
        "location": "",
        "paragraph": "\nJonathan Myrick Daniels (March 20, 1939 – August 20, 1965) was an Episcopal seminarian and civil rights activist. In 1965, he was killed by a special county deputy, Tom Coleman, who was a construction worker, in Hayneville, Alabama, while in the act of shielding 17-year-old Ruby Sales.[1] He saved the life of the young Black civil rights activist. They were both working in the nonviolent civil rights movement in Lowndes County to integrate public places and register Black voters after passage of the Voting Rights Act that summer. Daniels' death generated further support for the civil rights movement.\n"
    },
    {
        "link": "/wiki/Maria_Ragland_Davis",
        "title": "Maria Ragland Davis",
        "date": "",
        "location": "",
        "paragraph": "Maria Ragland Davis (June 1, 1959 – February 12, 2010) was an American biologist and educator. She was associate professor of Biology at the University of Alabama in Huntsville where she studied molecular biology and plant genetics.[1]\nA native of Detroit, she received her undergraduate degree in chemical engineering from the University of Michigan and a master's degree in the same discipline from North Carolina State University.[2] Following the receipt of her master's degree, Davis completed her doctorate in biochemistry and plant biology. Davis studied strawberries, looking at the genetic makeup of strains that were susceptible to fungal pathogens under cold stress and those that were not.[3]\n"
    },
    {
        "link": "/wiki/Doe_B",
        "title": "Doe B",
        "date": "",
        "location": "",
        "paragraph": "\nGlenn Thomas (June 13, 1991 – December 28, 2013), better known by his stage name Doe B, was an American rapper from Montgomery, Alabama. He was perhaps best known for being signed to fellow rapper T.I.'s Atlanta-based record label, Hustle Gang.[1] Thomas was also known for his signature eye patch, the result of a shooting that occurred in 2009. During his career he released several mixtapes, including Trap Life (2012) and Baby Jesus (2013); he was also featured on the 2013 Grand Hustle compilation G.D.O.D. (Get Dough or Die). Thomas was shot and killed on December 28, 2013, at the Centennial Hill Bar & Grill, in his hometown of Montgomery. There have been two posthumous projects, D.O.A.T. 3 (Definition of a Trapper) and the compilation mixtape Doe B Presents C.B.M.: Choppaz, Brickz & Money, released by Doe B's own label, Cote Block Music.\n"
    },
    {
        "link": "/wiki/Lynching_of_Michael_Donald",
        "title": "Lynching of Michael Donald",
        "date": "",
        "location": "",
        "paragraph": "\nThe lynching of Michael Donald in Mobile, Alabama, on March 21, 1981, was one of the last reported lynchings in the United States.[1][2] Several Ku Klux Klan (KKK) members beat and killed Michael Donald, a 19-year-old African-American, and hung his body from a tree. One perpetrator, Henry Hays, was executed by electric chair in 1997, while another, James Knowles, was sentenced to life in prison after pleading guilty and testifying against Hays. A third man was convicted as an accomplice and also sentenced to life in prison, and a fourth was indicted but died before his trial could be completed.\n"
    },
    {
        "link": "/wiki/Murder_of_Willie_Edwards",
        "title": "Murder of Willie Edwards",
        "date": "",
        "location": "",
        "paragraph": "Willie Edwards Jr. (November 13, 1932 – January 23, 1957) was a 24-year-old African American, husband and father, who was murdered by members of the Alabama Ku Klux Klan. He is buried at New Pleasant Valley Cemetery in Letohatchee, Alabama.\nOn the night of January 22, 1957, a small group of Klansmen gathered, armed with pistols and a rifle. They got into a car to look for Willie Edwards, an African American, who had recently been hired as a driver for Winn-Dixie. They thought that he was sleeping with a white woman. Willie had come home from work and an hour later got a call from his boss asking to come back in because one of the other workers had called in sick.  Edwards left to go to work on the afternoon of January 23, never to return home. It is thought he was abducted and beaten  by the Klansmen as they drove him around Montgomery. Then they stopped at the Tyler-Goodwin Bridge, along the Alabama River near Montgomery, and pointed a gun at Edwards, before commanding him to jump off the bridge. He fell 125 feet (38.1 m) to his death. Three months passed before his body was discovered washed up on the shores of the river.  Officials stated that decomposition made it impossible to determine the cause of his death.\n"
    },
    {
        "link": "/wiki/Jimmy_%22Orion%22_Ellis",
        "title": "Jimmy \"Orion\" Ellis",
        "date": "",
        "location": "",
        "paragraph": "James Hodges Ellis (born James Hughes Bell, February 26, 1945 – December 12, 1998), who used the stage name Orion at times in his career, was an American singer. His voice was similar to Elvis Presley's, a fact which he and his record company played upon, making some believe that some of his recordings were by Presley, or even that Presley had not died in 1977. Ellis appeared with many artists, including Loretta Lynn, Jerry Lee Lewis, Tammy Wynette, Ricky Skaggs, Lee Greenwood, Gary Morris, and the Oak Ridge Boys.\nEllis was born in either Pascagoula, Mississippi,[2] Orrville, Alabama,[3] or Washington, D.C.,[1] United States, into a single parent home. His birth certificate states the mother was a secretary named Gladys Bell, and the father was Vernon (no surname).[4] Aged two, he moved with his mother to Birmingham, Alabama, where he was put up for adoption and, aged four, was adopted by R. F. and Mary Faye (nee Hodges) Ellis.[1] He attended Orrville High School, where he excelled in baseball, football and basketball. After winning a state fair competition, his first professional performance was in a Demon's Den nightclub in Albany, Georgia. Ellis entered Middle Georgia College on an athletic scholarship, then transferred to Livingston State University.[1]\n"
    },
    {
        "link": "/wiki/Thomas_Haughey",
        "title": "Thomas Haughey",
        "date": "",
        "location": "",
        "paragraph": "Thomas Haughey (1826 – August 5, 1869) was a U.S. Representative from Alabama.\nBorn in Glasgow, Scotland, Haughey received a limited education. He immigrated with his father to the United States, where they settled in New York City. In 1841, he moved to Jefferson County, Alabama. While teaching in St. Clair County, he studied medicine. Haughey attended New Orleans Medical College and graduated as both a physician and surgeon in 1858, starting a medical practice in Elyton.\n"
    },
    {
        "link": "/wiki/Murder_of_Jimmie_Lee_Jackson",
        "title": "Murder of Jimmie Lee Jackson",
        "date": "",
        "location": "",
        "paragraph": "Jimmie Lee Jackson (December 16, 1938 – February 26, 1965)[1][2] was an African American civil rights activist in Marion, Alabama, and a deacon in the Baptist church. On February 18, 1965, while unarmed and participating in a peaceful voting rights march in his city, he was beaten by troopers and fatally shot by an Alabama state trooper. Jackson died eight days later in the hospital.\nHis death helped inspire the Selma to Montgomery marches in March 1965, a major event in the civil rights movement that helped gain congressional passage of the Voting Rights Act of 1965. This opened the door to millions of African Americans being able to vote again in Alabama and across the Southern United States, regaining participation as citizens in the political system for the first time since the turn of the 20th century. Most had been disenfranchised since then by state constitutions and discriminatory practices that made voter registration and voting more difficult.[3]\n"
    },
    {
        "link": "/wiki/Adriel_Johnson",
        "title": "Adriel Johnson",
        "date": "",
        "location": "",
        "paragraph": "Adriel Duland Johnson Sr. (June 22, 1957 – February 12, 2010) was an American biologist and faculty member at the University of Alabama in Huntsville whose research focused on areas of cell biology and nutritional physiology. He was one of three faculty members who was killed in the shooting on the UAH campus on February 12, 2010.\nJohnson was a native of Tuskegee, Alabama, and attended the Chamblis Children's House Elementary School, which was housed on the campus of Tuskegee Institute. Johnson was a Boy Scout and participated in the medical explorers Program.[1] He was a lifelong member of the National Eagle Scout Association. Johnson graduated from Washington University in St. Louis in 1979 with a degree in biology.[2]\n"
    },
    {
        "link": "/wiki/Catesby_ap_Roger_Jones",
        "title": "Catesby ap Roger Jones",
        "date": "",
        "location": "",
        "paragraph": "\nCatesby ap Roger Jones (April 15, 1821 – June 21, 1877) was an officer in the U.S. Navy who became a commander in the Confederate Navy during the American Civil War. He assumed command of CSS Virginia during the Battle of Hampton Roads and engaged USS Monitor in the historic first battle of the two ironclads.\n"
    },
    {
        "link": "/wiki/Viola_Liuzzo",
        "title": "Viola Liuzzo",
        "date": "",
        "location": "",
        "paragraph": "Viola Fauver Liuzzo (née Gregg; April 11, 1925 – March 25, 1965) was an American civil rights activist. In March 1965, Liuzzo heeded the call of Martin Luther King Jr. and traveled from Detroit, Michigan, to Selma, Alabama, in the wake of the Bloody Sunday attempt at marching across the Edmund Pettus Bridge. Liuzzo participated in the successful Selma to Montgomery marches and helped with coordination and logistics. At the age of 39, while driving back from a trip shuttling fellow activists to the Montgomery airport, she was fatally hit by shots fired from a pursuing car containing Ku Klux Klan members Collie Wilkins, William Eaton, Eugene Thomas, and Gary Thomas Rowe, the last of whom was actually an undercover informant working for the Federal Bureau of Investigation (FBI).[1][2] Although the State of Alabama was unable to secure a murder conviction, Wilkins, Eaton, and Thomas were charged in federal court with conspiracy to intimidate African Americans under the 1871 Ku Klux Klan Act, a Reconstruction civil rights statute. On December 3, the trio was found guilty by an all-white, all-male jury, and were sentenced to ten years in prison, a landmark in Southern legal history.\nRowe testified that Wilkins had fired two shots into Liuzzo on the order of Thomas,[citation needed] and was placed in the witness protection program by the FBI.[3] In an effort to deflect attention from having employed Rowe as an informant, the FBI produced disinformation[4][5] for politicians and the press, stating that Liuzzo was a member of the Communist Party, heroin addict,[6] and had abandoned her children to have sexual relationships with African-Americans involved in the Civil Rights Movement.[7] Liuzzo's involvement in the civil rights movement was scrutinized and she was condemned by various racist organizations. In 1983, the Liuzzo family filed a lawsuit against the FBI after learning about the FBI's activities, but the suit was dismissed.\n"
    },
    {
        "link": "/wiki/Lynching_of_Jim_McMillan",
        "title": "Lynching of Jim McMillan",
        "date": "",
        "location": "",
        "paragraph": "Jim McMillan was lynched in Bibb County, Alabama on June 18, 1919.\nRacial tension in the Woodstock and Green Pond communities of Bibb County, Alabama worsened over the summer of 1919. Individuals terrorized the black community in southern Bibb County, around Woodstock.[1] The events culminated in a white mob seizing Jim McMillan and taking him into the Alabama bush. He was forced onto a stump and the mob shot him to death.[2][3][4][5]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Meadows",
        "title": "Lynching of George Meadows",
        "date": "",
        "location": "",
        "paragraph": "\nGeorge Meadows was an African American man who was lynched on January 15, 1889, in Jefferson County, Alabama, United States.[1]\n"
    },
    {
        "link": "/wiki/Lisa_Ann_Millican",
        "title": "Alvin and Judith Neelley",
        "date": "",
        "location": "",
        "paragraph": "Alvin Howard Neelley, Jr. (July 15, 1953 – October 21, 2005) and Judith Ann Adams Neelley (born June 7, 1964) are an American married couple who committed the kidnappings and torture murders of Lisa Ann Millican and Janice Kay Chatman; they also attempted a third abduction. Judith was sentenced to death in 1983, but her sentence was commuted to life imprisonment in 1999.[1] She served her sentence at the Julia Tutwiler Prison for Women in Wetumpka, Alabama.[2] Alvin was serving a life sentence at the Bostick State Prison in Hardwick, Georgia at the time of his death in 2005.[1]\nAlvin Howard Neelley, Jr., was born in 1953 in Georgia, where he was a car thief during his teenage years. He met his second wife, Judith Ann Adams, when he was 26 years old and she was 15. Alvin divorced his first wife shortly before eloping with Judith in 1980.[3]\n"
    },
    {
        "link": "/wiki/Jakell_Mitchell",
        "title": "Jakell Mitchell",
        "date": "",
        "location": "",
        "paragraph": "\nJakell Lenard Mitchell (January 1, 1996 – December 14, 2014) was an American college football player who was shot and killed during his freshman year at Auburn University. He was a heavily recruited three-sport athlete at Opelika High School in Opelika, Alabama.\n"
    },
    {
        "link": "/wiki/William_Lewis_Moore",
        "title": "William Lewis Moore",
        "date": "",
        "location": "",
        "paragraph": "William Lewis Moore  (April 28, 1927 – April 23, 1963) was a postal worker and Congress of Racial Equality (CORE) member who staged lone protests against racial segregation. He was assassinated in Keener, Alabama, during a protest march from Chattanooga, Tennessee to Jackson, Mississippi, where he intended to deliver a letter to Governor Ross Barnett, supporting civil rights.\nMoore was born in Binghamton, New York and raised in New York and Mississippi. For a time before his death he lived in Baltimore, Maryland.\n"
    },
    {
        "link": "/wiki/Tina_Mott",
        "title": "Forensic Files (season 6)",
        "date": "",
        "location": "",
        "paragraph": "Forensic Files is an American documentary-style series which reveals how forensic science is used to solve violent crimes, mysterious accidents, and even outbreaks of illness. The show is broadcast on truTV, narrated by Peter Thomas, and produced by Medstar Television, in association with truTV Original Productions. It has broadcast 406 episodes since its debut on TLC in 1996 as Medical Detectives.\n"
    },
    {
        "link": "/wiki/Murder_of_Amore_Wiggins",
        "title": "Murder of Amore Wiggins",
        "date": "January 28, 2012; 11 years ago (2012-01-28) (discovery of remains)",
        "location": "Opelika, Alabama, U.S.",
        "paragraph": "Amore Joveah Wiggins, formerly known as Opelika Jane Doe (born January 1, 2006 – c. 2011) was a formerly unidentified murder victim whose skeletal remains were found in a trailer park in Opelika, Alabama.[1] Her identity was not known until nearly 11 years later in January 2023. Wiggins's father, Lamar Vickerstaff, was subsequently charged with felony murder and failure to report a missing child, while her step-mother, Ruth Vickerstaff, was charged with the latter. If convicted, Lamar would face up to life imprisonment without the possibility parole or the death penalty, and Ruth would face up to 10 years in prison.[2]\nOn January 28, 2012, a resident discovered a skull at Brook Haven Trailer Park, 1775 Hurst St. in Opelika, Alabama. Police searched the surrounding area and found more remains, including a pink, long sleeve shirt with heart buttons and ruffles nearby on a creek bank. It is unknown if that shirt belonged to the victim.[3]\n"
    },
    {
        "link": "/wiki/Albert_Patterson",
        "title": "Albert Patterson",
        "date": "",
        "location": "",
        "paragraph": "\nAlbert Love Patterson (January 27, 1894 – June 18, 1954) was an American politician and attorney in Phenix City, Alabama. He was assassinated outside his law office shortly after he had won the Democratic nomination for Alabama Attorney General on a platform of reforming the rife corruption and vice in Phenix City.\n"
    },
    {
        "link": "/wiki/Miles_Phifer_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "location": "Montgomery, Alabama, United States",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\n"
    },
    {
        "link": "/wiki/G._K._Podila",
        "title": "G. K. Podila",
        "date": "",
        "location": "",
        "paragraph": "Gopi K. Podila (September 14, 1957[1] – February 12, 2010) was an Indian–American biologist who served as a professor at the University of Alabama in Huntsville. He was one of three faculty members killed in a shooting at the university on February 12, 2010.[2] Podila was chairperson of the university's department of biological sciences, with a particular interest in the ecology of Populus and their mycorrhizal symbionts.\nHe listed his research interests as \"engineering tree biomass for bioenergy, functional genomics of plant-microbe interactions, plant molecular biology and biotechnology\".\n[3]\n"
    },
    {
        "link": "/wiki/Charles_Albert_Poland",
        "title": "2013 Alabama bunker hostage crisis",
        "date": "January 29, 2013 – February 4, 2013 c. 3:30 p.m.[1] – 3:12 p.m. (CST)",
        "location": "Midland City, Alabama, U.S.",
        "paragraph": "\nOn January 29, 2013, a hostage crisis, lasting almost seven days, began in the Wiregrass Region near U.S. Highway 231 in Midland City, Alabama. Jimmy Lee Dykes, a 65-year-old Vietnam War-era veteran, boarded a Dale County school bus, killed the driver, and took a five-year-old boy hostage. On the afternoon of February 4, law enforcement agents entered the bunker, killed Dykes, and rescued the child.[3]\n"
    },
    {
        "link": "/wiki/James_Reeb",
        "title": "James Reeb",
        "date": "",
        "location": "",
        "paragraph": "James Joseph Reeb (January 1, 1927 – March 11, 1965) was an American Unitarian Universalist minister, pastor, and activist during the civil rights movement in Washington, D.C. and Boston, Massachusetts. While participating in the Selma to Montgomery marches actions in Selma, Alabama, in 1965, he was murdered by white segregationists, dying of head injuries in the hospital two days after being severely beaten. Three men were tried for Reeb's murder but were acquitted by an all-white jury. His murder remains officially unsolved.\nReeb was born on January 1, 1927, in Wichita, Kansas, to Mae (Fox) and Harry Reeb.[1][2] He was raised in Kansas and Casper, Wyoming.[3]  He attended Natrona County High School and graduated in 1945, after which he joined the Army despite the fact that his commitment to the ministry made him exempt from service. After basic training, he was sent to Anchorage, Alaska, as a clerk typist for the headquarters of Special Troops. He was honorably discharged eighteen months later in December 1946 as Technical Sergeant, Third Class.[4] After his time in the Army, Reeb continued his schooling. Initially, he attended classes in his home town at Casper Junior College, before moving on to St. Olaf College, in 1947, where he received his A.B. cum laude in 1950.[5] He then entered Princeton Theological Seminary in Princeton, New Jersey,[6] where he earned his B.D. in 1953.[4] Three days later, Reeb was ordained a Presbyterian minister at the First Presbyterian Church of Casper.[7] After this he accepted a position at the Philadelphia General Hospital as Chaplain to Hospitals for the Philadelphia Presbyter. To become a more effective counselor, he went back to school, enrolling at Conwell School of Theology, where he earned an S.T.M. in Pastoral Counseling in 1955.[4]\n"
    },
    {
        "link": "/wiki/Bill_Sketoe",
        "title": "Bill Sketoe",
        "date": "",
        "location": "",
        "paragraph": "William Sketoe, Sr. (June 8, 1818 – December 3, 1864) was a Methodist minister from the south Alabama town of Newton, whose lynching there on December 3, 1864 gave birth to one of Alabama's best-known ghost stories.  While locally-told stories of his life usually say that he was hanged on trumped-up charges of desertion from the Confederate Army, other sources show that he was killed for allegedly aiding pro-Union renegades in the area.  Whatever the reason for his murder, a shallow hole dug beneath Sketoe's feet during the hanging (to accommodate his large frame) ultimately led to stories about \"the hole that won't stay filled.\"  According to witnesses, this hole never disappeared—even after being filled numerous times—retaining its original dimensions for the next 125 years.\nSketoe's tale became a staple of Southern folklore, and was later immortalized by Alabama author Kathryn Tucker Windham in her 13 Alabama Ghosts and Jeffrey.  His hanging site remained a local tourist attraction for decades, and continues to attract visitors even though the hole itself recently disappeared due to flooding in the area.  Today the site of Sketoe's lynching lies beneath the Alabama Highway 134 bridge over the Choctawhatchee River, and a monument to Sketoe has been erected nearby.\n"
    },
    {
        "link": "/wiki/John_Temple_(lynching_victim)",
        "title": "1919 Lynching in Montgomery, Alabama",
        "date": "September 29, 1919",
        "location": "Montgomery, Alabama, United States",
        "paragraph": "Miles (or Relius) Phifer and Robert Crosky were lynched in Montgomery, Alabama for allegedly assaulting a white woman.\nIn August or September 1919 Miles Phifer and Robert Crosky were arrested over allegations they assaulted two white women in separate incidents in Montgomery, Alabama. The Gadsden Daily Times-News reported that the two had confessed to the assaults.[1] A mob had formed and a concerned citizen notified Alabama's Governor Thomas Kilby that there might be a lynching.[2] Kilby ordered the two to be transferred to the relative safety of prison in Wetumpka, Alabama.[2] On September 29, 1919, the sheriff and his deputies were transporting Phifer and Crosky when they were stopped by a white mob, of about 25 masked men.[3]  The deputies stood by as the men pulled the two out of the car. They were taken into the wilderness 5 miles (8.0 km) out of Montgomery, Alabama and told to run. As Phifer and Crosky sprinted away from the mob they were gunned down. Croskey was instantly killed, but Phifer lived for a few hours.[2] [4] Phifer and Crosky were discharged soldiers and Phifer was still in his uniform when he was killed.[5] [1]\n"
    },
    {
        "link": "/wiki/Robert_Smith_Vance",
        "title": "Robert Smith Vance",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Smith Vance Sr. (May 10, 1931 – December 16, 1989) was a United States circuit judge of the United States Court of Appeals for the Fifth Circuit and later the United States Court of Appeals for the Eleventh Circuit. He was one of three 20th-century United States federal court judges assassinated because of his judicial service.\n"
    },
    {
        "link": "/wiki/Scotty_Joe_Weaver",
        "title": "Scotty Joe Weaver",
        "date": "",
        "location": "",
        "paragraph": "Scotty Joe Weaver (March 26, 1986 - July 22, 2004) was an 18-year-old murder victim from Bay Minette, Alabama, whose burned and partially decomposed body was discovered on July 22, 2004, a few miles from the mobile home in which he lived.  He had been beaten, strangled and stabbed numerous times, partially decapitated, and his body doused in gasoline and set on fire.[1]\nThe Baldwin County District Attorney, David Whetstone, stated that Weaver's sexual orientation was a factor in the crime. He remarked that the brutality involved \"is suggestive of overkill, which is not something you see in a regular robbery and murder.\" Alabama's hate crimes statute does not apply to people targeted because of their sexual orientation.\n"
    },
    {
        "link": "/wiki/De%27Runnya_Wilson",
        "title": "De'Runnya Wilson",
        "date": "",
        "location": "",
        "paragraph": "\nDe’Runnya S. Wilson[1] (September 14, 1994 – January 21, 2020) was an American football wide receiver for the Albany Empire of the Arena Football League (AFL). He played college football for the Mississippi State Bulldogs.\n"
    },
    {
        "link": "/wiki/Sammy_Younge_Jr.",
        "title": "Sammy Younge Jr.",
        "date": "",
        "location": "",
        "paragraph": "Samuel Leamon Younge Jr. (November 17, 1944 – January 3, 1966) was a civil rights and voting rights activist who was murdered for trying to desegregate a \"whites only\" restroom.[1] Younge was an enlisted service member in the United States Navy, where he served for two years before being medically discharged.[2][3] Younge was an active member of the Student Nonviolent Coordinating Committee (SNCC) and a leader of the Tuskegee Institute Advancement League.[4][5]\nYounge was the first African-American university student to be murdered in the United States due to his actions in support of the Civil Rights Movement.[4][6] Three days after his death, SNCC became the first civil rights organization in the United States to oppose the Vietnam War, partly on the grounds that like Younge, innocent civilians should not face deadly violence.[7]\n"
    },
    {
        "link": "/wiki/Selma_to_Montgomery_marches",
        "title": "Selma to Montgomery marches",
        "date": "March 7 – 25, 1965; 57 years ago",
        "location": "Brown Chapel A.M.E. Church, Edmund Pettus Bridge, U.S. Route 80, Haisten’s Mattress & Awning Company, Alabama State Capitol, Selma and Montgomery, Alabama",
        "paragraph": "\nDCVL members\n"
    },
    {
        "link": "/wiki/Ralph_Abernathy",
        "title": "Ralph Abernathy",
        "date": "",
        "location": "",
        "paragraph": "\nRalph David Abernathy Sr. (March 11, 1926 – April 17, 1990) was an American civil rights activist and Baptist minister. He was ordained in the Baptist tradition in 1948. As a leader of the civil rights movement, he was a close friend and mentor of Martin Luther King Jr. He collaborated with King and E. D. Nixon to create the Montgomery Improvement Association, which led to the Montgomery bus boycott, and co-created and was an executive board member of the Southern Christian Leadership Conference (SCLC). He became president of the SCLC following the assassination of King in 1968; he led the Poor People's Campaign in Washington, D.C.,[1] as well as other marches and demonstrations for disenfranchised Americans. He also served as an advisory committee member of the Congress on Racial Equality (CORE).\n"
    },
    {
        "link": "/wiki/Barack_Obama_Selma_50th_anniversary_speech",
        "title": "Barack Obama Selma 50th anniversary speech",
        "date": "",
        "location": "",
        "paragraph": "On March 7, 2015, President of the United States Barack Obama delivered a speech at Edmund Pettus Bridge to mark the 50th anniversary of the Selma to Montgomery marches on the subject of race relations within the United States. Among the estimated 40,000 present[1] were former President George W. Bush, former First Lady Laura Bush, and Amelia Boynton Robinson, John Lewis, Diane Nash, Bernard Lafayette, and many other 'foot soldiers' who had taken part in the march in 1965.[2]\nThe formal writing process for the speech began on February 25, working closely with speechwriter Cody Keenan.[3] In preparation, Keenan had read works by Taylor Branch and had been watching speeches by Rep. John Lewis. A few days earlier, former New York Mayor Rudy Giuliani had made remarks about whether President Obama loved America, leading Keenan to suggest that the speech focus on patriotism.[4] The first draft was completed on March 5, two days before the address, and Obama instructed Keenan to add references to Ralph Waldo Emerson and Walt Whitman.[4] The speech went through five drafts before March 7,[3] with Obama still making tweaks on the flight to Alabama.[4]\n"
    },
    {
        "link": "/wiki/James_Bevel",
        "title": "James Bevel",
        "date": "",
        "location": "",
        "paragraph": "James Luther Bevel (October 19, 1936 – December 19, 2008) was a minister and leader of the 1960s Civil Rights Movement in the United States. As a member of the Southern Christian Leadership Conference (SCLC), and then as its Director of Direct Action and Nonviolent Education, Bevel initiated, strategized, and developed SCLC's three major successes of the era:[2][3] the 1963 Birmingham Children's Crusade,[4] the 1965 Selma voting rights movement, and the 1966 Chicago open housing movement.[5] He suggested that SCLC call for and join a March on Washington in 1963.[6] Bevel strategized the 1965 Selma to Montgomery marches, which contributed to Congressional passage of the 1965 Voting Rights Act.[7]\nPrior to his time with SCLC, Bevel worked in the Nashville Student Movement, which conducted the 1960 Nashville Lunch-Counter Sit-Ins, the 1961 Open Theater Movement, and recruited students to continue the 1961 Freedom Rides after they were attacked. He helped with initiating and directing the 1961 and 1962 voting rights movement in Mississippi. In 1967, Bevel was chairman of the Spring Mobilization Committee to End the War in Vietnam. He initiated the 1967 March on the United Nations as part of the anti-war movement.[8][9] His last major action was as co-initiator of the 1995 Day of Atonement/Million Man March in Washington, D.C. For his work, Bevel has been called the strategist and architect of the 1960s Civil Rights Movement[10] and, with Dr. King, half of the first-tier team that formulated many of the strategies and actions to gain federal legislation and social changes during the 1960s civil rights era.[8][9]\n"
    },
    {
        "link": "/wiki/Brown_Chapel_A.M.E._Church_(Selma,_Alabama)",
        "title": "Brown Chapel A.M.E. Church (Selma, Alabama)",
        "date": "",
        "location": "410 Martin Luther King, Jr., Street, Selma, Alabama",
        "paragraph": "Brown Chapel A.M.E. Church is a church at 410 Martin Luther King Jr. Boulevard in Selma, Alabama, United States. This church was a starting point for the Selma to Montgomery marches in 1965 and, as the meeting place and offices of the Southern Christian Leadership Conference (SCLC) during the Selma Movement, played a major role in the events that led to the adoption of the Voting Rights Act of 1965. The nation's reaction to Selma's \"Bloody Sunday\" march is widely credited with making the passage of the Voting Rights Act politically viable in the United States Congress.[3][4]\nIt was added to the Alabama Register of Landmarks and Heritage on June 16, 1976 and later declared a National Historic Landmark on February 4, 1982.[2][1]\n"
    },
    {
        "link": "/wiki/Ralph_Bunche",
        "title": "Ralph Bunche",
        "date": "",
        "location": "",
        "paragraph": "\nRalph Johnson Bunche (/bʌntʃ/; August 7, 1904 – December 9, 1971) was an American political scientist, diplomat, and leading actor in the mid-20th-century decolonization process and US civil rights movement, who received the 1950 Nobel Peace Prize for his late 1940s mediation in Israel. Among black Nobel laureates he is the first African American and first person of African descent to be awarded a Nobel Prize. He was involved in the formation and early administration of the United Nations, and played a major role in both the decolonization process and numerous UN peacekeeping operations.\n"
    },
    {
        "link": "/wiki/Theresa_Burroughs",
        "title": "Theresa Burroughs",
        "date": "",
        "location": "",
        "paragraph": "Theresa Burroughs (1929 – May 22, 2019)[1] was an active participant in the civil rights movement during the 1960s. She worked to secure the right to vote for blacks in Alabama and the rest of the Southern United States. In 1965 she was attacked and arrested by state troopers and sheriff's deputies along with other civil rights demonstrators attempting to cross the Edmund Pettus Bridge in Selma, Alabama. She was the founder of the Safe House Black History Museum in Greensboro, Alabama,[2] the location where the Reverend Dr. Martin Luther King Jr. was hidden from the Ku Klux Klan during his visit to Alabama in 1968.[3] Burroughs was a childhood friend of King's wife, Coretta Scott King.[2]\nBurroughs was a cosmetologist and ran a beauty parlor called \"In Beauty's Care\" in Greensboro, which she opened a few years before the night she hid King in her mother's home next door to the beauty shop.[3]\n"
    },
    {
        "link": "/wiki/J._L._Chestnut_Jr.",
        "title": "J. L. Chestnut Jr.",
        "date": "",
        "location": "",
        "paragraph": "J. L. Chestnut Jr. (December 16, 1930 – September 30, 2008)[1] was an author, attorney, and a figure in the Civil Rights Movement.\nHe was the first African-American attorney in Selma, Alabama, and the author of the 1991 autobiographical book, Black in Selma: The Uncommon Life of J.L. Chestnut, Jr.,[2] which chronicles the history of the Selma Voting Rights Movement, including the 1965 Selma to Montgomery marches and Bloody Sunday.\nChestnut was born in Selma, and attended Howard University Law School. He returned home as Selma's only black attorney, and represented civil rights demonstrators at trial there when the Selma Movement began in the 1960s.\n"
    },
    {
        "link": "/wiki/Jim_Clark_(sheriff)",
        "title": "Jim Clark (sheriff)",
        "date": "",
        "location": "",
        "paragraph": "\nJames Gardner Clark, Jr. (September 17, 1922 – June 4, 2007)[1] was the sheriff of Dallas County, Alabama, United States from 1955 to 1966. He was one of the officials responsible for the violent arrests of civil rights protestors during the Selma to Montgomery marches of 1965, and is remembered as a racist whose brutal tactics included using cattle prods against unarmed civil rights supporters.[2][3]\n"
    },
    {
        "link": "/wiki/Annie_Lee_Cooper",
        "title": "Annie Lee Cooper",
        "date": "",
        "location": "",
        "paragraph": "Annie Lee Wilkerson Cooper (June 2, 1910 – November 24, 2010) was an African-American civil rights activist in the 1965 Selma Voting Rights Movement who is best known for punching Dallas County, Alabama Sheriff Jim Clark.\nAnnie Lee Wilkerson Cooper was born on June 2, 1910, as Annie Lee Wilkerson in Selma, Alabama, one of ten children of Lucy Jones and Charles Wilkerson Sr. When Cooper finished seventh grade, she dropped out of school and moved to Kentucky to live with one of her older sisters.[1]\n"
    },
    {
        "link": "/wiki/Dallas_County_Voters_League",
        "title": "Dallas County Voters League",
        "date": "",
        "location": "",
        "paragraph": "\nThe Dallas County Voters League (DCVL) was a local organization in Dallas County, Alabama, which contains the city of Selma, that sought to register black voters during the late 1950s and early 1960s.[1]\n"
    },
    {
        "link": "/wiki/Maurice_Davis",
        "title": "Maurice Davis",
        "date": "",
        "location": "",
        "paragraph": "Maurice Davis (December 15, 1921 – December 14, 1993[1]) was a rabbi and activist. He served on the President's Commission on Equal Opportunity, in the Lyndon B. Johnson Administration and was a director of the American Family Foundation, now known as the International Cultic Studies Association. Davis was the rabbi of the Jewish Community Center of White Plains, New York and a regular contributor to The Jewish Post and Opinion.\nRabbi Davis married Marion Cronbach, daughter of Rose Hentil and prominent reform rabbi and well-known pacifist (and Davis's teacher) Abraham Cronbach. Davis and his wife had two children, both went on to become rabbis.[citation needed]\n"
    },
    {
        "link": "/wiki/John_Doar",
        "title": "John Doar",
        "date": "",
        "location": "",
        "paragraph": "John Michael Doar (December 3, 1921 – November 11, 2014) was an American lawyer and senior counsel with the law firm Doar Rieck Kaley & Mack in New York City. During the administrations of presidents John F. Kennedy and Lyndon B. Johnson, he served first as Deputy Assistant Attorney General for Civil Rights from 1961 to 1965, and then as head of the division from 1965 until 1967. He led the government's response to events such as the admission and protection of James Meredith, the first black student admitted to the University of Mississippi,[1] as well as the evolving response to the civil rights movement promoting integration and voter registration in the South.[2] Additionally, in 1973–74, he served as the lead special counsel for the U.S. House Judiciary Committee's impeachment inquiry staff during the impeachment process against Richard Nixon.[3]\nDoar was born in New Richmond, Wisconsin, the son of Mae and William Doar.[4] In 1940, Doar graduated from St. Paul Academy and Summit School in Saint Paul, Minnesota.[5] He served in the United States Army Air Forces during World War II and was a pilot. He graduated with an A.B. from the School of Public and International Affairs (now Princeton School of Public and International Affairs) at Princeton University in 1944 after completing a senior thesis titled \"An Analysis of Farmer Cooperatives, 1918–1946.\"[6] He then received an LL.B. from the University of California-Berkeley Boalt Hall School of Law. From 1950 to 1960, Doar then worked in his family's law firm in New Richmond, Wisconsin.[4]\n"
    },
    {
        "link": "/wiki/Edmund_Pettus_Bridge",
        "title": "Edmund Pettus Bridge",
        "date": "",
        "location": "Selma, Alabama, U.S.",
        "paragraph": "\nThe Edmund Pettus Bridge carries U.S. Route 80 Business (US 80 Bus.) across the Alabama River in Selma, Alabama. Built in 1940, it is named after Edmund Pettus, a former Confederate brigadier general, U.S. senator, and state-level leader (\"Grand Dragon\") of the Alabama Ku Klux Klan.[2] The bridge is a steel through arch bridge with a central span of 250 feet (76 m). Nine large concrete arches support the bridge and roadway on the east side.\n"
    },
    {
        "link": "/wiki/Joseph_Ellwanger",
        "title": "Joseph Ellwanger",
        "date": "",
        "location": "",
        "paragraph": "\nJoseph W. Ellwanger Jr. (born February 18, 1934) is a Lutheran pastor, author, and civil rights activist. He was a key figure in the Civil Rights Movement in Birmingham, Alabama, and the only white religious leader included in strategy meetings with Martin Luther King Jr.[1]\n"
    },
    {
        "link": "/wiki/Chuck_Fager",
        "title": "Chuck Fager",
        "date": "",
        "location": "",
        "paragraph": "Charles Eugene Fager (born 1942), known as Chuck Fager, is an American activist, author, editor, publisher and an outspoken and prominent member of the Religious Society of Friends or Quakers. He is known for his work in both the Civil Rights Movement and in the Peace movement. His written works include religious and political essays, humor, adult fiction, and juvenile fiction, and he is best known for his 1974 book Selma 1965: The March That Changed the South, his in-depth history of the 1965 Selma Voting Rights Movement which led to the passage of the Voting Rights Act.\nFager served as Director of Quaker House in Fayetteville, North Carolina, a peace project founded in 1969 near Fort Bragg, a major US Army base from 2002 to 2012.[1][2][3]\n"
    },
    {
        "link": "/wiki/First_Baptist_Church_(Selma,_Alabama)",
        "title": "First Baptist Church (Selma, Alabama)",
        "date": "",
        "location": "709 Martin Luther King, Jr. St., Selma, Alabama",
        "paragraph": "First Baptist Church is a historic church at 709 Martin Luther King, Jr. Street in Selma, Alabama.  A historically African American Baptist church, it was built in the Gothic Revival style in 1894 and known for its association with the Civil Rights Movement.[2] It was added to the National Register of Historic Places in 1979.[1]\n\nFrom the National Register of Historic Places Inventory — Nomination Form:[2] "
    },
    {
        "link": "/wiki/Marie_Foster",
        "title": "Marie Foster",
        "date": "",
        "location": "",
        "paragraph": "\nMarie Priscilla Martin Foster (October 24, 1917 – September 6, 2003) was a leader in the Civil Rights Movement in the U.S. during the 1960s. Her successful voter registration in Dallas County, Alabama fueled her to become an activist, and she began teaching adult classes to help people pass the required literacy tests. She was the Alabama foot soldier that convinced Martin Luther King Jr. to come to Selma, Alabama and helped organize the Selma to Montgomery marches in 1965. Her dedication gave her the moniker \"The Mother of the Voting Rights Movement,\" which was shortened to Mother Foster.[1]\n"
    },
    {
        "link": "/wiki/James_Bonard_Fowler",
        "title": "James Bonard Fowler",
        "date": "",
        "location": "",
        "paragraph": "\nJames Bonard Fowler (September 10, 1933 – July 5, 2015) was an Alabama state trooper, known for fatally shooting civil rights activist Jimmie Lee Jackson on February 18, 1965, during a peaceful march by protesters seeking voting rights. Fowler was among police and state troopers who attacked unarmed marchers that night in Marion, Alabama. A grand jury declined to indict him that year. It was not until 2005 that Fowler acknowledged shooting Jackson, a young deacon in the Baptist church, claiming to have acted in self defense. In response to Jackson's death, several days later civil rights leaders initiated the Selma to Montgomery marches as part of their campaign for voting rights. That year Congress passed the Voting Rights Act of 1965, which President Lyndon B. Johnson signed.[1]\n"
    },
    {
        "link": "/wiki/Fred_Gray_(attorney)",
        "title": "Fred Gray (attorney)",
        "date": "",
        "location": "",
        "paragraph": "Fred David Gray (born December 14, 1930) is an American civil rights attorney, preacher, and activist from Alabama. He litigated several major civil rights cases in Alabama, including some, such as Browder v. Gayle, that reached the United States Supreme Court. He served as the president of the National Bar Association in 1985, and in 2001 was elected as the first African-American President of the Alabama State Bar.[1]\nBorn in Montgomery, Alabama, Gray attended the Loveless School, where his aunt taught, until the seventh grade. He attended the Nashville Christian Institute (NCI), a boarding school operated by the Churches of Christ, where he assisted NCI president and noted preacher Marshall Keeble in visiting other churches of the racially diverse nondenominational fellowship. After graduation, Gray matriculated at Alabama State College for Negroes, and received a baccalaureate degree in 1951.[2] Encouraged by a teacher to apply to law school despite his earlier plans to become an historian and preacher, Gray moved to Cleveland, Ohio, and received a juris doctor degree from Case Western Reserve University School of Law in 1954.[2] At the time there was no law school in Alabama that would accept African Americans.\n"
    },
    {
        "link": "/wiki/Prathia_Hall",
        "title": "Prathia Hall",
        "date": "",
        "location": "",
        "paragraph": "Prathia Laura Ann Hall Wynn (January 1, 1940 – August 12, 2002) was an American leader and activist in the Civil Rights Movement, a womanist theologian, and ethicist. She was the key inspiration for Martin Luther King Jr.'s \"I Have a Dream\" speech.\nHall was raised in Philadelphia, the daughter of Berkeley L Hall and Ruby Hall, née Johnson.[1]  Her father founded Mount Sharon Baptist Church, an inner-city congregation in an under-served area of the city.[2]  Her father was a Baptist preacher and a passionate advocate for racial justice,[3] who regarded her as his successor. He inspired her to pursue religion and social justice.[2][4] Prathia believed she was brought into the world for a reason – to integrate religion and freedom together.[5]\n"
    },
    {
        "link": "/wiki/Richard_H._Harris",
        "title": "Richard H. Harris",
        "date": "",
        "location": "",
        "paragraph": "Richard Henry Harris, Jr. (August 22, 1918 - July 24, 1976) was a prominent civil rights leader and pharmacist. A personal friend, neighbor and collaborator of Dr Martin Luther King Jr. in Montgomery, Alabama, Harris was instrumental in three of the most seminal protests of the U.S. civil rights movement: the Freedom Riders, the Montgomery Bus Boycott and the Selma to Montgomery marches. Harris's home, best known as the famed “Richard Harris House”, was Montgomery, Alabama’s central command center and safe haven for beaten and bloodied Freedom Riders as they traveled to Jackson, Mississippi amidst physically violent racial rioters, National Guard protection, and Alabama segregationist authorities’ call for martial law.[1][2]\nIn 2018, the World Monuments Fund (WMF) listed Harris’ home on its World Monuments Watch list of 20 threatened cultural sites not only for the potential risk to its physical structure, but the potential risk to its historical significance and backstory.[3][4]\n"
    },
    {
        "link": "/wiki/Abraham_Joshua_Heschel",
        "title": "Abraham Joshua Heschel",
        "date": "",
        "location": "",
        "paragraph": "\nAbraham Joshua Heschel (January 11, 1907 – December 23, 1972) was a Polish-born American rabbi and one of the leading Jewish theologians and Jewish philosophers of the 20th century. Heschel, a professor of Jewish mysticism at the Jewish Theological Seminary of America, authored a number of widely read books on Jewish philosophy and was a leader in the civil rights movement.[1][2]\n"
    },
    {
        "link": "/wiki/Home_of_the_Brave_(2004_film)",
        "title": "Home of the Brave (2004 film)",
        "date": "",
        "location": "",
        "paragraph": "Home of the Brave is a 2004 documentary film about Viola Liuzzo, an American anti-racist activist during the Civil Rights Movement of the 1960s.\nA white housewife and mother of five children, Viola Liuzzo felt called to action by the words of Martin Luther King Jr., and left her Michigan home to work in Alabama with the Southern Christian Leadership Conference in 1965. While serving as a volunteer during the historic Selma to Montgomery marches, Liuzzo was shot dead by members of the Ku Klux Klan. The film is an historical account of her life presented in a montage of archival footage, narrated by the actress Stockard Channing and laced with extensive interviews of Liuzzo's family members and contemporaries.[1]\n"
    },
    {
        "link": "/wiki/How_Long,_Not_Long",
        "title": "How Long, Not Long",
        "date": "",
        "location": "",
        "paragraph": "\"How Long, Not Long\" is the popular name given to the public speech delivered by Martin Luther King Jr. on the steps of the State Capitol in Montgomery, Alabama. Martin Luther King Jr. delivered this speech after the completion of the Selma to Montgomery March on March 25, 1965.[1] The speech is also known as \"Our God Is Marching On!\"[2]\n\n"
    },
    {
        "link": "/wiki/Archbishop_Iakovos_of_America",
        "title": "Archbishop Iakovos of America",
        "date": "",
        "location": "",
        "paragraph": "Archbishop Iakovos of North and South America  (Greek: Ιάκωβος; born Demetrios Koukouzis (Δημήτριος Κουκούζης);[1] July 29, 1911 – April 10, 2005) was the primate of the Greek Orthodox Archdiocese of North and South America (now the Greek Orthodox Archdiocese of America) from 1959 until his resignation in 1996.\nBorn on the village of Agios Theodoros in the island of Imvros, Ottoman Empire on July 29, 1911, to Maria and Athanasios Koukouzis, he had two sisters Virginia and Chrysanthi and a brother Panagiotis. He enrolled at age 15 in the Ecumenical Patriarchal Theological School of Halki. After graduating with high honors, Demetrios Koukouzis was ordained deacon in 1934, taking the ecclesiastical name Iakovos. Five years after his ordination, Deacon Iakovos received an invitation to serve as Archdeacon to the late Archbishop Athenagoras, the Primate of North and South America, who later (1949–72) became Ecumenical Patriarch of Constantinople.\n"
    },
    {
        "link": "/wiki/Murder_of_Jimmie_Lee_Jackson",
        "title": "Murder of Jimmie Lee Jackson",
        "date": "",
        "location": "",
        "paragraph": "Jimmie Lee Jackson (December 16, 1938 – February 26, 1965)[1][2] was an African American civil rights activist in Marion, Alabama, and a deacon in the Baptist church. On February 18, 1965, while unarmed and participating in a peaceful voting rights march in his city, he was beaten by troopers and fatally shot by an Alabama state trooper. Jackson died eight days later in the hospital.\nHis death helped inspire the Selma to Montgomery marches in March 1965, a major event in the civil rights movement that helped gain congressional passage of the Voting Rights Act of 1965. This opened the door to millions of African Americans being able to vote again in Alabama and across the Southern United States, regaining participation as citizens in the political system for the first time since the turn of the 20th century. Most had been disenfranchised since then by state constitutions and discriminatory practices that made voter registration and voting more difficult.[3]\n"
    },
    {
        "link": "/wiki/Richie_Jean_Jackson",
        "title": "Richie Jean Jackson",
        "date": "",
        "location": "",
        "paragraph": "Richie Jean Sherrod Jackson (née Sherrod; August 30, 1932 – November 10, 2013),[1] was an American author, teacher, and civil rights activist.\nJackson was born in Mobile, Alabama, as the only child of John W. and Juanita Richardson Sherrod.[2] She was a childhood friend of Coretta Scott King.[2][3] She attended and graduated from Cardoza High School in Washington, D.C. She earned a Bachelor of Science degree in secondary education at Alabama State College, and a Masters of Education at the University of Montevallo.[2] She was married to Dr. Sullivan Jackson.[3] They had one child, a girl named Jawana Virginia Jackson.[4]\n"
    },
    {
        "link": "/wiki/Frank_Minis_Johnson",
        "title": "Frank Minis Johnson",
        "date": "",
        "location": "",
        "paragraph": "Frank Minis Johnson Jr. (October 30, 1918 – July 23, 1999) was a United States district judge and United States Circuit Judge serving 1955 to 1999 on the United States District Court for the Middle District of Alabama, United States Court of Appeals for the Fifth Circuit and United States Court of Appeals for the Eleventh Circuit. He made landmark civil rights rulings that helped end segregation and disenfranchisement of African Americans in the South. In the words of journalist and historian Bill Moyers, Judge Johnson \"altered forever the face of the South.\"\nJohnson was born in 1918 and grew up in Haleyville in northern Alabama, a longtime independent-minded part of the state. Winston County had opposed secession from the Union during the American Civil War.[1] While a student, he was asked by a staunchly Democratic classmate why he insisted upon being a Republican, to which Johnson replied that there were \"so few of us that one day I might be a federal judge.\" Another classmate George C. Wallace, future governor of the state, overheard the remark and replied, \"Well, that'll be the day. I'll be governor by then.\"[2] Wallace would prove to be Johnson's bête noire during the civil rights era of the 1960s.\n"
    },
    {
        "link": "/wiki/James_Karales",
        "title": "James Karales",
        "date": "",
        "location": "",
        "paragraph": "James H. Karales (July 15, 1930, Canton, Ohio – April 1, 2002, Croton-on-Hudson, N.Y.) was an American photographer and photo-essayist best known for his work with Look magazine from 1960 to 1971. At Look he covered the Civil Rights Movement throughout its duration, taking many of the movements memorable photographs, including those of the formation of the Student Nonviolent Coordinating Committee (SNCC) and of Dr. Martin Luther King Jr. and his family.[1] Karales's single best known image is the iconic photograph of the Selma to Montgomery march showing people proudly marching along the highway under a cloudy turbulent sky.[2][3]\nKarales was born in Ohio to a family of Greek immigrants. Although he initially enrolled in Ohio University with the intention of majoring in electrical engineering, Karales switched his major to photography after watching his roommate in the darkroom.[2] He graduated with a bachelor of fine arts degree in 1955, departing Ohio for New York City.[2] He eventually found work as a darkroom assistant for photo-essay photographer W. Eugene Smith at the Magnum photo agency,[2] initially on a two-week assignment making prints for Smith's Pittsburgh essay.[4] He would go on to work for Smith for two years, making more than 7,000 prints and developing expertise both in the darkroom and as a photo-essayist.[2][4]\n"
    },
    {
        "link": "/wiki/Coretta_Scott_King",
        "title": "Coretta Scott King",
        "date": "",
        "location": "",
        "paragraph": "\nCoretta Scott King (née  Scott; April 27, 1927 – January 30, 2006) was an American author, activist, and civil rights leader who was married to Martin Luther King Jr. from 1953 until his assassination. As an advocate for African-American equality, she was a leader for the civil rights movement in the 1960s. King was also a singer who often incorporated music into her civil rights work. King met her husband while attending graduate school in Boston. They both became increasingly active in the American civil rights movement.\n"
    },
    {
        "link": "/wiki/Martin_Luther_King_Jr.",
        "title": "Martin Luther King Jr.",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Bernard_Lafayette",
        "title": "Bernard Lafayette",
        "date": "",
        "location": "",
        "paragraph": "Bernard Lafayette (or LaFayette), Jr. (born July 29, 1940) is an American civil rights activist and organizer, who was a leader in the Civil Rights Movement. He played a leading role in early organizing of the Selma Voting Rights Movement; was a member of the Nashville Student Movement; and worked closely throughout the 1960s movements with groups such as the Student Nonviolent Coordinating Committee (SNCC), the Southern Christian Leadership Conference (SCLC), and the American Friends Service Committee.[1]\nLafayette was born and raised in Tampa, Florida. His parents were Bernard Lafayette Sr. and Verdell Lafayette. Bernard was the eldest of eight children. His siblings were Harold Rozelia, Brenda, Geri, Michael, and Victoria.[2] Lafayette spent much of his childhood in Tampa. His family grew up poor, so Bernard started working odd jobs to gain more income by the age of 11.[2] His jobs included cashiering, meat cutting, delivering produce, and collecting change at a coffee shop.[2] When reminiscing on his childhood, Bernard says: \"I had to grow up rapidly. In other words, I didn't have a childhood.\"[3]\n"
    },
    {
        "link": "/wiki/Jim_Letherer",
        "title": "Jim Letherer",
        "date": "",
        "location": "",
        "paragraph": "James M. Letherer (December 30, 1933 – December 18, 2001), born and died in Saginaw, Michigan,[1][2] better known as Jim Letherer, was an American civil rights activist.[3][4]  He walked on crutches the entire 54 miles of the 1965 Selma to Montgomery march for voting rights, and in 1966 walked with Martin Luther King Jr. in James Meredith's Mississippi March Against Fear.[3][5] Letherer lost his right leg to cancer when he was ten years old.[6][7] Letherer has received honors by the Selma to Montgomery Interpretive Center Museum in Alabama, which hosts a life-size statue of him.\nWith a big heart and a tenacious spirit, he trooped with King and fellow marchers in many a Deep South protest despite not having his right leg from birth. During the 1965 Selma to Montgomery march, Letherer – who used crutches – helped keep spirits high by unswervingly shouting out cadence for his remaining leg, by chanting, \"Left, left, left!\"[8]"
    },
    {
        "link": "/wiki/John_Lewis",
        "title": "John Lewis",
        "date": "",
        "location": "",
        "paragraph": "\nJohn Robert Lewis (February 21, 1940 – July 17, 2020) was an American politician and civil rights activist who served in the United States House of Representatives for Georgia's 5th congressional district from 1987 until his death in 2020. He participated in the 1960 Nashville sit-ins, the Freedom Rides, was the chairman of the Student Nonviolent Coordinating Committee (SNCC) from 1963 to 1966, and was one of the \"Big Six\" leaders of groups who organized the 1963 March on Washington. Fulfilling many key roles in the civil rights movement and its actions to end legalized racial segregation in the United States, in 1965 Lewis led the first of three Selma to Montgomery marches across the Edmund Pettus Bridge where, in an incident which became known as Bloody Sunday, state troopers and police attacked Lewis and the other marchers.\n"
    },
    {
        "link": "/wiki/Albert_J._Lingo",
        "title": "Albert J. Lingo",
        "date": "",
        "location": "",
        "paragraph": "\nAlbert J. Lingo (January 22, 1910 – August 19, 1969) was appointed in 1963 by Alabama Gov. George Wallace to head the Alabama Highway Patrol, which he led until 1965 during turbulent years marked by marches and demonstrations that characterized the Civil Rights Movement in the U.S. South.[1]\n"
    },
    {
        "link": "/wiki/Viola_Liuzzo",
        "title": "Viola Liuzzo",
        "date": "",
        "location": "",
        "paragraph": "Viola Fauver Liuzzo (née Gregg; April 11, 1925 – March 25, 1965) was an American civil rights activist. In March 1965, Liuzzo heeded the call of Martin Luther King Jr. and traveled from Detroit, Michigan, to Selma, Alabama, in the wake of the Bloody Sunday attempt at marching across the Edmund Pettus Bridge. Liuzzo participated in the successful Selma to Montgomery marches and helped with coordination and logistics. At the age of 39, while driving back from a trip shuttling fellow activists to the Montgomery airport, she was fatally hit by shots fired from a pursuing car containing Ku Klux Klan members Collie Wilkins, William Eaton, Eugene Thomas, and Gary Thomas Rowe, the last of whom was actually an undercover informant working for the Federal Bureau of Investigation (FBI).[1][2] Although the State of Alabama was unable to secure a murder conviction, Wilkins, Eaton, and Thomas were charged in federal court with conspiracy to intimidate African Americans under the 1871 Ku Klux Klan Act, a Reconstruction civil rights statute. On December 3, the trio was found guilty by an all-white, all-male jury, and were sentenced to ten years in prison, a landmark in Southern legal history.\nRowe testified that Wilkins had fired two shots into Liuzzo on the order of Thomas,[citation needed] and was placed in the witness protection program by the FBI.[3] In an effort to deflect attention from having employed Rowe as an informant, the FBI produced disinformation[4][5] for politicians and the press, stating that Liuzzo was a member of the Communist Party, heroin addict,[6] and had abandoned her children to have sexual relationships with African-Americans involved in the Civil Rights Movement.[7] Liuzzo's involvement in the civil rights movement was scrutinized and she was condemned by various racist organizations. In 1983, the Liuzzo family filed a lawsuit against the FBI after learning about the FBI's activities, but the suit was dismissed.\n"
    },
    {
        "link": "/wiki/Bob_Mants",
        "title": "Bob Mants",
        "date": "",
        "location": "",
        "paragraph": "Robert \"Bob\" Mants, Jr. (April 25, 1943 – December 7, 2011) was an American civil rights activist, serving as a field secretary for the Student Nonviolent Coordinating Committee (SNCC). Mants moved to Lowndes County, working for civil rights for the remainder of his life. Lowndes County contained the majority of the distance covered by the 1965 Selma to Montgomery march, and was then notorious for its racist violence.\nMants was born in Atlanta, Georgia.[1] He graduated in 1961 from East Point/South Fulton High School,[1] a segregated black high school. While he was attending high school, Mants was a member of the Committee on Appeal for Human Rights (which would later develop into the Atlanta Student Movement) and volunteering for administrative tasks at the headquarters of the Student Nonviolent Coordinating Committee,[1] two blocks from his home.[2] He would go on to attend Morehouse College with the intention of majoring in medicine,[2] but left without graduating, working in 1964 with SNCC in Americus, Georgia. At the beginning of 1965 Mants moved to Lowndes County, AL for his job.[1]\n"
    },
    {
        "link": "/wiki/Spider_Martin",
        "title": "Spider Martin",
        "date": "",
        "location": "",
        "paragraph": "James \"Spider\" Martin (April 1, 1939 – April 8, 2003) was an American photographer known for his work documenting the American Civil Rights Movement in 1965, specifically Bloody Sunday and other incidents from the Selma to Montgomery marches.[1][2]\nMartin was born in Fairfield, Alabama. He was slightly built at 5 feet 2 inches (1.57 m) tall and 125 pounds (57 kg), and though he would climb trees and church towers to get a different angle for his photographs,[2] his nickname \"Spider\" dates back to his school days at Hueytown High, where a reporter described him as moving \"like a spider\" during one of his touchdown runs on the football field.[3]\n"
    },
    {
        "link": "/wiki/Samuel_B._McKinney",
        "title": "Samuel B. McKinney",
        "date": "",
        "location": "",
        "paragraph": "Samuel Berry McKinney (December 28, 1926 – April 7, 2018) was an American Christian pastor and Civil Rights leader. He was the pastor of Mount Zion Baptist Church in Seattle for four decades. He attended the Selma to Montgomery marches in 1965, and he served on the Seattle Human Rights Commission.\nSamuel B. McKinney was born on December 28, 1926, in Flint, Michigan.[1][2] He grew up in Cleveland, Ohio, where his father, Wade Hampton McKinney, was a pastor.[1]\n"
    },
    {
        "link": "/wiki/Diane_Nash",
        "title": "Diane Nash",
        "date": "",
        "location": "",
        "paragraph": "Diane Judith Nash (born May 15, 1938) is an American civil rights activist, and a leader and strategist of the student wing of the Civil Rights Movement.\nNash's campaigns were among the most successful of the era. Her efforts included the first successful civil rights campaign to integrate lunch counters (Nashville);[1] the Freedom Riders, who desegregated interstate travel;[2] co-founding the Student Nonviolent Coordinating Committee (SNCC); and co-initiating the Alabama Voting Rights Project and working on the Selma Voting Rights Movement. This helped gain Congressional passage of the Voting Rights Act of 1965, which authorized the federal government to oversee and enforce state practices to ensure that African Americans and other minorities were not prevented from registering and voting.\n"
    },
    {
        "link": "/wiki/National_Voting_Rights_Museum",
        "title": "National Voting Rights Museum",
        "date": "",
        "location": "",
        "paragraph": "The National Voting Rights Museum and Institute, established in 1991 and opened in 1993, is an American museum in Selma, Alabama, which honors, chronicles, collects, archives, and displays the artifacts and testimony of the activists who participated in the events leading up to and including the 1965 Selma to Montgomery marches, and passage of the 1965 Voting Rights Act, as well as those who worked for the African-American Voting Rights and Women's Suffrage movements. As the museum describes in its mission statement, it recognizes other people, events, and actions which furthered America's Right to Vote since \"the Founding Fathers first planted the seeds of democracy in 1776.\"[1][2][3] The museum was founded by Faya Ora Rose Touré and Marie Foster.[4]\nIt is located near the Edmund Pettus Bridge. On this bridge on March 7, 1965, voting rights marchers who left the city for a planned walk to Montgomery were beaten and clubbed by Dallas County posse and Alabama State Troopers, in what became known as \"Bloody Sunday\". They had passed into the county on a planned walk of 54 miles to Montgomery, Alabama's state capital. This treatment was nationally televised and covered by major media, arousing national outrage. After gaining federal protection from President Lyndon B. Johnson and a federal court order protecting their right to march, thousands of people left Selma on March 21, reaching Montgomery several days later. By then, they had been joined by thousands more, black and white, and 25,000 marchers entered the state capital to press for protection of constitutional voting rights. Later that summer the Voting Rights Act of 1965, introduced by the Johnson administration, was passed by Congress and signed by the president. \n"
    },
    {
        "link": "/wiki/James_Orange",
        "title": "James Orange",
        "date": "",
        "location": "",
        "paragraph": "\nJames Edwards Orange[1] (October 29, 1942 – February 16, 2008), also known as \"Shackdaddy\",[2] was a leading civil rights activist in the Civil Rights Movement in America. He was assistant to Martin Luther King Jr. in the civil rights movement.[3] Orange joined the civil rights marches led by King and Ralph Abernathy in Atlanta in 1963.[3] Later he became a project coordinator for Southern Christian Leadership Conference, drawing young people into the movement.[3]\n"
    },
    {
        "link": "/wiki/James_Reeb",
        "title": "James Reeb",
        "date": "",
        "location": "",
        "paragraph": "James Joseph Reeb (January 1, 1927 – March 11, 1965) was an American Unitarian Universalist minister, pastor, and activist during the civil rights movement in Washington, D.C. and Boston, Massachusetts. While participating in the Selma to Montgomery marches actions in Selma, Alabama, in 1965, he was murdered by white segregationists, dying of head injuries in the hospital two days after being severely beaten. Three men were tried for Reeb's murder but were acquitted by an all-white jury. His murder remains officially unsolved.\nReeb was born on January 1, 1927, in Wichita, Kansas, to Mae (Fox) and Harry Reeb.[1][2] He was raised in Kansas and Casper, Wyoming.[3]  He attended Natrona County High School and graduated in 1945, after which he joined the Army despite the fact that his commitment to the ministry made him exempt from service. After basic training, he was sent to Anchorage, Alaska, as a clerk typist for the headquarters of Special Troops. He was honorably discharged eighteen months later in December 1946 as Technical Sergeant, Third Class.[4] After his time in the Army, Reeb continued his schooling. Initially, he attended classes in his home town at Casper Junior College, before moving on to St. Olaf College, in 1947, where he received his A.B. cum laude in 1950.[5] He then entered Princeton Theological Seminary in Princeton, New Jersey,[6] where he earned his B.D. in 1953.[4] Three days later, Reeb was ordained a Presbyterian minister at the First Presbyterian Church of Casper.[7] After this he accepted a position at the Philadelphia General Hospital as Chaplain to Hospitals for the Philadelphia Presbyter. To become a more effective counselor, he went back to school, enrolling at Conwell School of Theology, where he earned an S.T.M. in Pastoral Counseling in 1955.[4]\n"
    },
    {
        "link": "/wiki/Frederick_D._Reese",
        "title": "Frederick D. Reese",
        "date": "",
        "location": "",
        "paragraph": "Frederick Douglas Reese (November 28, 1929 – April 5, 2018) was an American civil rights activist, educator and minister from Selma, Alabama. Known as a member of Selma's \"Courageous Eight\",[1] Reese was the president of the Dallas County Voters League (DCVL) when it invited the Southern Christian Leadership Conference and Martin Luther King Jr. to Selma to amplify the city's local voting rights campaign.[2] This campaign eventually gave birth to the Selma to Montgomery marches, which later led to the passage of the Voting Rights Act.\nReese was also president of the Selma Teachers Association, and in January 1965 he mobilized Selma's teachers to march as a group for their right to vote.[2]\n"
    },
    {
        "link": "/wiki/Walter_Reuther",
        "title": "Walter Reuther",
        "date": "",
        "location": "",
        "paragraph": "\nWalter Philip Reuther (/ˈruːθər/; September 1, 1907 – May 9, 1970) was an American leader of organized labor and civil rights activist who built the United Automobile Workers (UAW) into one of the most progressive labor unions in American history.[1] He saw labor movements not as narrow special interest groups but as instruments to advance social justice and human rights in democratic societies.[1] He leveraged the UAW's resources and influence to advocate for workers' rights, civil rights, women's rights, universal health care, public education, affordable housing, environmental stewardship and nuclear nonproliferation around the world.[1] He believed in Swedish-style social democracy and societal change through nonviolent civil disobedience.[2][3] He cofounded the AFL-CIO in 1955 with George Meany.[4] He survived two attempted assassinations, including one at home where he was struck by a 12-gauge shotgun blast fired through his kitchen window.[5] He was the fourth and longest serving president of the UAW, serving from 1946 until his death in 1970.[6]\n"
    },
    {
        "link": "/wiki/Amelia_Boynton_Robinson",
        "title": "Amelia Boynton Robinson",
        "date": "",
        "location": "",
        "paragraph": "\nAmelia Isadora Platts Boynton Robinson (August 18, 1911 – August 26, 2015) was an American activist who was a leader of the American Civil Rights Movement in Selma, Alabama,[1] and a key figure in the 1965 Selma to Montgomery marches. In 1984, she became founding vice-president of the Schiller Institute affiliated with Lyndon LaRouche. She was awarded the Martin Luther King Jr. Freedom Medal in 1990.[2]\n"
    },
    {
        "link": "/wiki/Angela_Russell_(politician)",
        "title": "Angela Russell (politician)",
        "date": "",
        "location": "",
        "paragraph": "\nAngela Veta Russell[1] (born 1943) is an American politician and civil rights activist who served in the Montana House of Representatives from the 99th district as a member of the Democratic Party. Russell participated in the Selma to Montgomery marches and Native American activism. She is a member of the Crow Tribe of Montana.\n"
    },
    {
        "link": "/wiki/Selma_(film)",
        "title": "Selma (film)",
        "date": "",
        "location": "",
        "paragraph": "\nSelma is a 2014 historical drama film directed by Ava DuVernay and written by Paul Webb. It is based on the 1965 Selma to Montgomery voting rights marches initiated and directed by James Bevel[5][6] and led by Martin Luther King Jr., Hosea Williams, and John Lewis. The film stars actors David Oyelowo as King, Tom Wilkinson as President Lyndon B. Johnson, Tim Roth as George Wallace, Carmen Ejogo as Coretta Scott King, and Common as Bevel.\n"
    },
    {
        "link": "/wiki/Selma_to_Montgomery_National_Historic_Trail",
        "title": "Selma to Montgomery National Historic Trail",
        "date": "",
        "location": "",
        "paragraph": "\nThe Selma to Montgomery National Historic Trail is a 54-mile (87 km) National Historic Trail in Alabama. It commemorates and marks the journey of the participants of the 1965 Selma to Montgomery marches in support of the Voting Rights Act.\n"
    },
    {
        "link": "/wiki/Selma,_Lord,_Selma",
        "title": "Selma, Lord, Selma",
        "date": "",
        "location": "",
        "paragraph": "Selma, Lord, Selma is a 1999 American made-for-television biographical drama film based on true events that happened in March 1965, known as Bloody Sunday in Selma, Alabama. The film tells the story through the eyes of an 9-year-old African-American girl named Sheyann Webb (Jurnee Smollett). It was directed by Charles Burnett, one of the pioneers of African-American independent cinema. It premiered on ABC on January 17, 1999.\nSheyann Webb sees Dr. Martin Luther King Jr. going into Brown Chapel AME Church one day while playing outside with her friends. They are told that Dr. King has come to Selma, Alabama to help the Negro people get voting rights. Sheyann learns many things from Dr. King. He teaches her and her friend Rachel (Stephanie Zandra Peyton) that when asked, \"Children, what do you want?\" their answer should be \"Freedom.\" He also teaches her that everyone deserves to be treated with fairness, regardless of the color of their skin, and that children also have a battle to fight. Sheyann wants to get involved and skips school to sneak into the meetings. One night a friend of Sheyann's named Jimmie Lee Jackson is killed. To draw attention to the death of Jimmie Lee Jackson, it is decided that a 54-mile march to the state capital of Alabama will take place. Marchers will present a petition to Governor Wallace to protest that Negroes are not being treated fairly. On Sunday, March 7, 1965, a day that comes to be called Bloody Sunday, Sheyann and other African-American protesters march over the Edmund Pettus Bridge en route to Montgomery, and are attacked by police. Sheyann is the youngest person to attempt to march.\n"
    },
    {
        "link": "/wiki/Southern_Christian_Leadership_Conference",
        "title": "Southern Christian Leadership Conference",
        "date": "",
        "location": "",
        "paragraph": "\nThe Southern Christian Leadership Conference (SCLC) is an African-American civil rights organization based in Atlanta, Georgia. SCLC is closely associated with its first president, Martin Luther King Jr., who had a large role in the American civil rights movement.[1]\n"
    },
    {
        "link": "/wiki/Student_Nonviolent_Coordinating_Committee",
        "title": "Student Nonviolent Coordinating Committee",
        "date": "",
        "location": "",
        "paragraph": "The Student Nonviolent Coordinating Committee (SNCC, often pronounced /snɪk/ SNIK) was the principal channel of student commitment in the United States to the civil rights movement during the 1960s. Emerging in 1960 from the student-led sit-ins at segregated lunch counters in Greensboro, North Carolina, and Nashville, Tennessee, the Committee sought to coordinate and assist direct-action challenges to the civic segregation and political exclusion of African Americans. From 1962, with the support of the Voter Education Project, SNCC committed to the registration and mobilization of black voters in the Deep South. Affiliates such as the Mississippi Freedom Democratic Party and the Lowndes County Freedom Organization in Alabama also worked to increase the pressure on federal and state government to enforce constitutional protections.\nBy the mid-1960s the measured nature of the gains made, and the violence with which they were resisted, were generating dissent from the group's principles of nonviolence, of white participation in the movement, and of field-driven, as opposed to national-office, leadership and direction. At the same time some original organizers were now working with the Southern Christian Leadership Conference (SCLC), and others were being lost to a de-segregating Democratic Party and to federally-funded anti-poverty programs. Following an aborted merger with the Black Panther Party in 1968, SNCC effectively dissolved.\n"
    },
    {
        "link": "/wiki/Dorothy_Tillman",
        "title": "Dorothy Tillman",
        "date": "",
        "location": "",
        "paragraph": "Dorothy Jean Tillman  (née Wright;  May 12, 1947) is an American politician, civil rights activist and former Chicago, Illinois alderman. Tillman served as the alderman of the city's 3rd Ward (map) from 1985 until 2007. A member of the Democratic Party, representing part of the city's South Side in the Chicago City Council. As an Alderman, Tillman was a strong advocate of reparations for slavery. In April 2007, Tillman was defeated in a runoff election by challenger Pat Dowell. Tillman defeated Dowell in 2003.  Prior to her career as an alderman, Tillman was active in the Civil Rights Movement, working for Martin Luther King Jr.'s Southern Christian Leadership Conference (SCLC) as an activist. Tillman was known for wearing large hats and has cultivated this image as her trademark.\nTillman was born as Dorothy Jean Wright in Montgomery, Alabama to James Wright, a local handyman and Edna Mae Struggs (formerly Wright; d. November 30, 2009).[4] Tillman's parents divorced when she was a child which resulted in her spending her childhood between Montgomery with her father and Pensacola, Florida, where her mother had remarried and relocated to.[5] Tillman joined the Southern Christian Leadership Conference (SCLC) as a trainee and field staff organizer in 1963. Tillman marched with Martin Luther King Jr. and was among the SCLC Field Staff to cross the Edmund Pettus Bridge  in Selma, Alabama in the Selma to Montgomery marches on 7 March 1965.\n"
    },
    {
        "link": "/wiki/Albert_Turner_(activist)",
        "title": "Albert Turner (activist)",
        "date": "",
        "location": "",
        "paragraph": "Albert Turner (February 29, 1936 – April 13, 2000) was an American civil rights activist and an advisor to Martin Luther King Jr.[1] He was Alabama field secretary for the Southern Christian Leadership Conference and helped lead the voting rights march from Selma to Montgomery; he was beaten on Bloody Sunday.[2]\nTurner was born outside of Marion, Alabama, the son of a Perry County farmer; he was the fourth of 12 children. He graduated from Alabama A&M.[1]\n"
    },
    {
        "link": "/wiki/C._T._Vivian",
        "title": "C. T. Vivian",
        "date": "",
        "location": "",
        "paragraph": "\nCordy Tindell Vivian (July 30, 1924 – July 17, 2020) was an American minister, author, and close friend and lieutenant of Martin Luther King Jr. during the civil rights movement.[1] Vivian resided in Atlanta, Georgia, and founded the C. T. Vivian Leadership Institute, Inc. He was a member of the Alpha Phi Alpha fraternity.[2]\n"
    },
    {
        "link": "/wiki/Sheyann_Webb",
        "title": "Sheyann Webb",
        "date": "",
        "location": "",
        "paragraph": "Sheyann Webb-Christburg (born February 17, 1956) is a civil rights activist known as Martin Luther King Jr.'s \"Smallest Freedom Fighter\" and co-author of the book Selma, Lord, Selma. As a nine-year-old, Webb took part in the first attempt at the Selma to Montgomery march across the Edmund Pettus Bridge on March 7, 1965, known as Bloody Sunday.\nWebb was born on February 17, 1956, in Selma, Alabama, to John and Betty Webb. She grew up in a family of eight children. As a child, she attended the segregated public schools of Dallas County, Alabama until she was one of the first black children to integrate an all-white school[1] where she was pushed down stairs, called derogatory names,  and spit on.\n"
    },
    {
        "link": "/wiki/Hosea_Williams",
        "title": "Hosea Williams",
        "date": "",
        "location": "",
        "paragraph": "\nHosea Lorenzo Williams (January 5, 1926 – November 16, 2000) was an American civil rights leader, activist, ordained minister, businessman, philanthropist, scientist, and politician. He is best known as a trusted member of fellow famed civil rights activist and Nobel Peace Prize winner Martin Luther King Jr.'s inner circle. Under the banner of their flagship organization, the Southern Christian Leadership Conference, King depended on Williams to organize and stir masses of people into nonviolent direct action in myriad protest campaigns they waged against racial, political, economic, and social injustice. King alternately referred to Williams, his chief field lieutenant, as his \"bull in a china closet\" and his \"Castro.\" Vowing to continue King's work for the poor, Williams is well known in his own right as the founding president of one of the largest social services organizations in North America, Hosea Feed the Hungry and Homeless. His famous motto was \"Unbought and Unbossed.\"[a]\n"
    },
    {
        "link": "/wiki/Gary_G._Yerkey",
        "title": "Gary G. Yerkey",
        "date": "",
        "location": "",
        "paragraph": "\nGary G. Yerkey, born in Chicago, is an American author and journalist currently based in Washington, D.C., contributing to The Christian Science Monitor and other publications.[1][2][3]\nA graduate of Ripon College with B.A. in philosophy, he later undertook post-graduate work at the American University of Beirut and spent more than a decade in Europe and the Middle East, reporting for Time Life, ABC News, The Christian Science Monitor, the International Herald Tribune and other U.S. news organizations. He was also a staff reporter for Bloomberg BNA covering Congress and the Executive Branch. He has reported from India, Morocco, Malaysia, China, Singapore, Colombia, Canada, Poland, Latvia, Estonia and many other countries and has interviewed and written profiles of dozens of famous and not-so-famous individuals—from influential jazz drummer Art Taylor to civil rights movement icon John Lewis and award-winning Mexican poet and environmental activist Homero Aridjis.  He has also served in the United States Air Force and is a former pilot.\n"
    }
]