[
    {
        "link": "/wiki/Bethel_Regional_High_School_shooting",
        "title": "Bethel Regional High School shooting",
        "date": "February 19, 1997",
        "location": "Bethel, Alaska, U.S.",
        "state": "Alaska",
        "county": "Bethel",
        "paragraph": "The Bethel Regional High School shooting was a school shooting that occurred on February 19, 1997 at Bethel Regional High School in Bethel, Alaska. Two people were killed and two people were wounded by student Evan Ramsey. Ramsey is serving two 99-year prison sentences and will be eligible for parole in 2066 when he is 85.[citation needed]\nReports say in the two weeks prior to the incident, more than 15 students knew of Ramsey's intention to commit a school shooting, and two actually assisted him.[1] One student, named James Randall, taught him how to load and fire a shotgun. Another student, named Matthew Charles, told him of the infamy that would come.[2] Reports say that several students brought cameras to school on the day of the shooting, and that many students were watching the shooting from a library balcony overlooking the student commons area.[3]\n"
    },
    {
        "link": "/wiki/Michael_Silka",
        "title": "Michael Silka",
        "date": "April 28 – May 19, 1984",
        "location": "",
        "state": "Alaska",
        "county": "Silka",
        "paragraph": "Michael Alan Silka (August 20, 1958 – May 19, 1984) was an American spree killer who is believed to have murdered nine people in Alaska during May 1984, primarily in the small village of Manley Hot Springs. The spree culminated in a shootout with Alaska State Troopers in the Alaskan wilderness in which Silka was shot and killed. The motives for Silka's actions remain unclear.\nMichael Silka grew up in Hoffman Estates, Illinois. From an early age, he had a love of firearms and the outdoors, and had a history of encounters with the law. In 1975, Silka and another juvenile were apprehended while trying to steal camping gear and weapons from a Des Plaines sporting goods store.[1] That same year, Silka and his brother Steve ran away from high school to the Canadian wilderness, returning when they had depleted their provisions.[2] In February 1977, four months before graduating from Hoffman Estates High School, Silka was arrested for carrying an antique black-powder muzzle-loading rifle — reminiscent of the weapons used by early mountain men — through a park in the suburb. He was arrested again for the same offenses later that year.[1] Silka was convicted and paid a $100 fine.[3]\n"
    },
    {
        "link": "/wiki/Murder_of_Eklutna_Annie",
        "title": "Murder of Eklutna Annie",
        "date": "",
        "location": "",
        "state": "Alaska",
        "county": "Eklutna",
        "paragraph": "Eklutna Annie is the name given to an unidentified murder victim whose body was discovered in a wooded area, one mile south of South Eklutna Lake Road in Eklutna, Anchorage, Alaska, in July 1980. She was aged between 16 and 25 at the time of her death, and her body was discovered several months after her murder. An autopsy report concluded that she had been killed by a single stab wound to the back.[3][4]\nEklutna Annie was murdered by serial killer Robert Hansen, most likely in 1979. Hansen specifically stated she was his first murder victim.[5][3]\n"
    }
]