{
    "0": {
        "link": "/wiki/Charles_L._Meach",
        "title": "Charles L. Meach",
        "date": "",
        "year": "new 1982",
        "location": "",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "Charles L. Meach, III (1948–2004) was a mentally ill American murderer who killed five people in Alaska.\nHe was born in Traverse City, Michigan, to a mother who had schizophrenia. He left home at sixteen to travel and accumulated a long record of minor crimes.[1]\nHe made his way to Anchorage, Alaska, and in 1973 he beat 22-year-old Robert Johnson, who worked as a grocery clerk, to death in Earthquake Park.[1] He was charged with murder, found not guilty by reason of insanity and sent to a mental hospital in California. In 1980, psychiatrists decided that his illness was in remission and he was returned to Alaska under the supervision of the Alaska Psychiatric Institute. On May 3, 1982, armed with a .38-caliber revolver that he had bought from a man on the street, he shot four teenagers to death in Russian Jack Springs Park; two 19-year-old boys while robbing their campsite and one 16 year old girl and one 17 year old girl. The teens were planning on going to the movies, when Meech shot them in cold blood. [2][3] He confessed to the killings when confronted and was charged.[4] He again pleaded not guilty by reason of insanity, but was convicted and sentenced to 396 years in prison without the possibility of parole — the longest sentence in the state's history.[5]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "1": {
        "link": "/wiki/Joshua_Wade",
        "title": "Joshua Wade",
        "date": "",
        "year": "new 1994",
        "location": "",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "Joshua Alan Wade (born March 13, 1980) is an American serial killer who has been convicted of two separate murders committed in Alaska in 2000 and 2007, respectively, and sentenced to 99 years imprisonment. Wade pled guilty to one of the murders in federal court to avoid execution. Seven years later, as part of a plea deal, he confessed to three additional murders, including one which he had previously been acquitted of, dating back to 1994 in exchange for a transfer to a federal prison.\nJoshua Alan Wade was born on March 13, 1980, in Anchorage, Alaska. He never met his father and raised solely by his mother, who resorted to placing him in an acquaintance's care so she could work. Unknown to her, that same acquaintance started sexually abusing her son when he was five.[1] This greatly affected Wade, who bottled up his feelings, stopped going to church and developed an addiction to marijuana. After suffering a failed romance as a teenager, he began to develop anger issues and soon after started getting in trouble with law enforcement.[2] According to his father, sister and several friends, Wade openly expressed his hatred of women, particularly towards Alaska Natives.[3]\nWade's first confessed murder was that of 38-year-old John Michael Martin, an unemployed schizophrenic who was found shot to death along a bike trail in Anchorage in May 1994. Shortly before his death, Martin had left a Village Inn he regularly visited to have coffee with friends. At the time of the murder, Wade was 14 years old and had no known connection to his victim.[2] Five years later, in December 1999, he claimed to have killed 30-year-old Henry Ongtowasruk at a motel in Knik-Fairview. His victim suffered from a mental illness and had lived at the motel for approximately a week before he was found shot to death by an employee in one of the rooms. Like Martin before him, Ongtowasruk had no known prior connection to Wade.[2]\n",
        "type": [
            "robber",
            "robbery",
            "murder"
        ]
    },
    "2": {
        "link": "/wiki/Bethel_Regional_High_School_shooting",
        "title": "Bethel Regional High School shooting",
        "date": "February 19, 1997",
        "year": "1997",
        "location": "Bethel, Alaska, U.S.",
        "state": "Alaska",
        "place": "Bethel",
        "county": "Unorganized Borough",
        "paragraph": "The Bethel Regional High School shooting was a school shooting that occurred on February 19, 1997 at Bethel Regional High School in Bethel, Alaska. Two people were killed and two people were wounded by student Evan Ramsey. Ramsey is serving two 99-year prison sentences and will be eligible for parole in 2066 when he is 85.[citation needed]\nReports say in the two weeks prior to the incident, more than 15 students knew of Ramsey's intention to commit a school shooting, and two actually assisted him.[1] One student, named James Randall, taught him how to load and fire a shotgun. Another student, named Matthew Charles, told him of the infamy that would come.[2] Reports say that several students brought cameras to school on the day of the shooting, and that many students were watching the shooting from a library balcony overlooking the student commons area.[3]\nOn February 19, 1997, Ramsey armed himself with a Mossberg 500 12-gauge shotgun, and arrived at Bethel Regional High School by school bus. He approached the student commons area, brandishing the shotgun, and shot 15-year-old Josh Palacios in the abdomen. Palacios later died after emergency surgery. He then shot and injured two other students. Reyne Athanas, an art teacher, entered the commons area after hearing the gunshots. Athanas said she tried and failed to convince Ramsey to surrender. He then entered the main lobby, where he shot principal Ron Edwards twice, killing him. \n",
        "type": [
            "shooting",
            "mass shooting",
            "murder",
            "killing"
        ]
    },
    "3": {
        "link": "/wiki/Brian_Sullivan_(district_attorney)",
        "title": "Brian Sullivan (district attorney)",
        "date": "December 8, 2014(2014-12-08) (aged 48) Utqiaġvik, Alaska, U.S.",
        "year": "2014",
        "location": "",
        "state": "",
        "place": "Utqiaġvik",
        "county": "North Slope",
        "paragraph": "Brian Joseph Sullivan (December 6, 1966 – December 8, 2014) was an American politician and attorney. He served in the Washington House of Representatives from 1997 to 2001, representing the 29th legislative district.\nSullivan was born in University Place, Washington, and raised in Tacoma, Washington. He received his bachelor's degree from University of Washington and a Juris Doctor from Mississippi College School of Law.\nAfter law school, Sullivan served in the United States Army as a judge advocate general and military police officer. He later practiced law in Tacoma. He served in the Washington House of Representatives as a Democrat from January 1997 to January 2001.[1][2]\n",
        "type": []
    },
    "4": {
        "link": "/wiki/John_Pezzenti",
        "title": "John Pezzenti",
        "date": "December 3, 2007(2007-12-03) (aged 55) Anchorage, Alaska, United States",
        "year": "2007",
        "location": "",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "John Pezzenti, Jr. (June 12, 1952 – December 3, 2007) was an American wildlife photographer born in Newington, Connecticut,[1][2] but who spent much of his life taking pictures of wildlife in the Alaskan wilderness.\nHe moved to Alaska in 1976, working on the Alaskan pipeline and owning and running a lodge at Kenai Lake during the 1970s.[2] Pezzenti then began working as an independent wildlife photographer and published three photography books during his life. Some of his photos hung in the Oval Office during the presidency of Ronald Reagan.[1] He had his photos published in many different magazines, including National Geographic, Alaska Magazine, Reader's Digest, and Natural History.[2] He also spoke at events at the World Trade Center and the Smithsonian Institution.[2]\nHe was found by police shot to death at his home in Anchorage, Alaska on December 3, 2007. Police have not yet determined a clear motive or found a solid suspect.[1] The story of his murder has been aired as a featured segment on the weekly television series America's Most Wanted twice (as well as once on an AMW radio segment).[1]\n",
        "type": [
            "murder"
        ]
    },
    "5": {
        "link": "/wiki/Murder_in_Alaska_law",
        "title": "Murder in Alaska law",
        "date": "",
        "year": "new 2020",
        "location": "",
        "state": "Alaska",
        "place": "",
        "county": "",
        "paragraph": "Murder in Alaska constitutes the intentional killing, under circumstances defined by law, of people within or under the jurisdiction of the U.S. state of Alaska.\nThe United States Centers for Disease Control and Prevention reported that in the year 2020, the state had a murder rate near the median for the entire country.[1]\nIn the state of Alaska, the common law felony murder rule is codified in Alaska Statutes § 11.41.100(a).  Alaska's law regarding felony murder is very specific, and unlike most felony murder rule laws, which make all felony crimes that cause murder that of the first degree, delegates some felony murders to second degree murder.  \n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "6": {
        "link": "/wiki/Murder_of_Samantha_Koenig",
        "title": "Israel Keyes",
        "date": "December 2, 2012(2012-12-02) (aged 34) Anchorage, Alaska, U.S.",
        "year": "2012",
        "location": "",
        "state": "",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "\nIsrael Keyes (January 7, 1978 – December 2, 2012) was an American serial killer, bank robber, burglar, arsonist, kidnapper and sex offender who murdered at least three victims and committed dozens of other felonies including armed robbery, arson, rape and burglary across the United States from June 2001 to February 2012.[2]\nWhile awaiting trial, Keyes committed suicide by hanging and slashing his wrists. Evidence left behind in his jail cell—including a suicide note, drawings of 11 skulls, a drawing of the Baphomet, and an inscription of \"Corozal\" on the cell's wall (all written or otherwise stained with Keyes' blood)—led the FBI to suspect Keyes murdered at least eleven victims in total.[3] He admitted to having committed violent crimes as early as 1996, with the aggravated sexual assault of a teenage girl in Oregon, in a series of meticulous crimes across multiple states that lasted until his capture in 2012.[4]\n",
        "type": [
            "murder",
            "rape",
            "robber",
            "arson",
            "robbery",
            "assault",
            "burglary"
        ]
    },
    "7": {
        "link": "/wiki/Shootout_on_Juneau_Wharf",
        "title": "Shootout on Juneau Wharf",
        "date": "July 8, 1898",
        "year": "1898",
        "location": "Skagway, District of Alaska, United States",
        "state": "Alaska",
        "place": "Skagway",
        "county": "Skagway",
        "paragraph": "\nThe Shootout on Juneau Wharf was a gunfight between Jefferson Randolph \"Soapy\" Smith, Frank H. Reid, and Jesse Murphy that took place on Friday, July 8, 1898, at approximately 9:15 p.m. in Skagway, District of Alaska, in the United States. Smith was shot in the heart and died shortly afterwards, and Reid died of his injuries 12 days later.\nThe founding of Skagway, a port town on the Inside Passage in Alaska's panhandle, in December 1897, attracted western crime boss Jefferson Randolph \"Soapy\" Smith and his gang of confidence men, as the town was the primary American starting point leading to the White Pass Trail and ultimately the Klondike gold fields, which had been discovered in 1896 and triggered a massive gold rush in the region.[1] Smith had been well known as a streetside confidence trickster and racketeer in Denver and Creede, Colorado, where he was threatened with imprisonment as a criminal in 1895 and fled the state. When interest in the gold rush peaked, he set up his swindle operations in Skagway and quickly became the region's underworld boss, just as he had done in Denver and Creede.[2]\n",
        "type": []
    },
    "8": {
        "link": "/wiki/Michael_Silka",
        "title": "Michael Silka",
        "date": "April 28 – May 19, 1984",
        "year": "1984",
        "location": "",
        "state": "Alaska",
        "place": "Fairbanks",
        "county": "Fairbanks North Star",
        "paragraph": "Michael Alan Silka (August 20, 1958 – May 19, 1984) was an American spree killer who is believed to have murdered nine people in Alaska during May 1984, primarily in the small village of Manley Hot Springs. The spree culminated in a shootout with Alaska State Troopers in the Alaskan wilderness in which Silka was shot and killed. The motives for Silka's actions remain unclear.\nMichael Silka grew up in Hoffman Estates, Illinois. From an early age, he had a love of firearms and the outdoors, and had a history of encounters with the law. In 1975, Silka and another juvenile were apprehended while trying to steal camping gear and weapons from a Des Plaines sporting goods store.[1] That same year, Silka and his brother Steve ran away from high school to the Canadian wilderness, returning when they had depleted their provisions.[2] In February 1977, four months before graduating from Hoffman Estates High School, Silka was arrested for carrying an antique black-powder muzzle-loading rifle — reminiscent of the weapons used by early mountain men — through a park in the suburb. He was arrested again for the same offenses later that year.[1] Silka was convicted and paid a $100 fine.[3]\nShortly thereafter, Silka enlisted in the United States Army, at least partly on the advice of a longtime neighbor, Forman Hurst, who later recalled him as \"a good kid, a typical teenager. He loved the outdoors. That was his No. 1 ambition, to be outside exploring nature.\"[3] In 1981, he was stationed at Fort Wainwright, located on the East side of Fairbanks, Alaska, until his discharge the same year.[4] Army records show that Silka was rated an expert marksman with the M16 rifle and grenade launcher while in basic training.[1] However, his stay at Fort Wainwright was marked by several run-ins with military police, including an assault charge and an arrest for discharging a firearm in a barracks.[3]\n",
        "type": [
            "assault",
            "murder",
            "burglary"
        ]
    },
    "9": {
        "link": "/wiki/Mark_DeSimone",
        "title": "Mark DeSimone",
        "date": "",
        "year": "new 2006",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Mark DeSimone was a member of the Arizona House of Representatives for a single term.[1] He represented the 11th District during the 48th Legislature, winning the November 2006 election.[2]: ix \nOn the last day of the legislative session in 2008 DeSimone was arrested for spousal abuse.  A few days later, he resigned his seat.  The civil charges were dropped after counseling. (2008)\n[3][4]\nHe was unsuccessful in his bid for re-election in 2008.[1]\n",
        "type": [
            "murder"
        ]
    },
    "10": {
        "link": "/wiki/Mandy_Lemaire",
        "title": "Tazlina, Alaska",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alaska",
        "place": "CDP",
        "county": "Haines",
        "paragraph": "Tazlina /tæzˈliːnə/ (Tezdlen Na’[2] in Ahtna Athabascan) is a census-designated place (CDP) in the Copper River Census Area, Alaska, United States. At the 2020 census the population was 244, down from 297 in 2010.[3]\nTazlina is located at 62°2′57″N 145°24′55″W﻿ / ﻿62.04917°N 145.41528°W﻿ / 62.04917; -145.41528 (62.049082, -145.415224).[4]\nAccording to the United States Census Bureau, the CDP has a total area of 9.07 square miles (23.5 km2), of which, 8.22 square miles (21.3 km2) of it is land and 0.85 square miles (2.2 km2) of it (9.37%) is water.[1]\n",
        "type": []
    },
    "11": {
        "link": "/wiki/Massacre_of_Craig,_Alaska",
        "title": "Craig, Alaska",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alaska",
        "place": "Ketchikan",
        "county": "Ketchikan Gateway",
        "paragraph": "Craig (Tlingit: Sháan Séet) is a[12] city in the Prince of Wales-Hyder Census Area in the Unorganized Borough[A] in the U.S. state of Alaska. The population was 1,036 at the 2020 census,[13] down from 1,201 in 2010.[10]\nCraig is the largest town on Prince of Wales Island, the fourth-largest island in the United States.[4] Craig is approximately 56 miles (90 km) by air northwest of Ketchikan and 220 miles (350 km) south of Juneau.[4]\nAccording to the United States Census Bureau, the city has a total area of 9.4 square miles (24.3 km2), of which, 6.7 square miles (17.4 km2) of it is land and 2.7 square miles (7.0 km2) of it (28.94%) is water.\n",
        "type": []
    },
    "12": {
        "link": "/wiki/Joe_Vogler",
        "title": "Joe Vogler",
        "date": "c. May 31, 1993(1993-05-31) (aged 80) Alaska",
        "year": "1993",
        "location": "",
        "state": "Alaska",
        "place": "Fairbanks",
        "county": "Fairbanks North Star",
        "paragraph": "\nJoseph E. Vogler (April 24, 1913 – c. May 31, 1993) was the founder of the Alaskan Independence Party. He was also chair or gubernatorial nominee during most of the party's existence. He was also known, originally in his adopted hometown of Fairbanks, Alaska, and later statewide, as a frequent participant in governmental and political affairs and frequent litigant in court. Curiously enough, he was known to many non-political observers for his fashion sense, in particular his ubiquitous wearing of fedoras and bolo ties.\nVogler was born April 24, 1913, on a farm outside Barnes, Kansas. He graduated from high school in Waterville, Kansas, in 1929. That year, he began studying at the University of Kansas on a scholarship. He graduated with a law degree in five years and was admitted to the Kansas State Bar.\n",
        "type": [
            "murder"
        ]
    },
    "13": {
        "link": "/wiki/James_Dale_Ritchie",
        "title": "James Dale Ritchie",
        "date": "November 12, 2016(2016-11-12) (aged 40) Anchorage, Alaska, U.S.",
        "year": "2016",
        "location": "",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "James Dale Ritchie (November 4, 1976 – November 12, 2016) was an American serial killer. Throughout 2016, Ritchie murdered upwards of five individuals in and around Anchorage, Alaska, most of whom were in parks or along bike paths. He always committed his murders at night, often around midnight or a short time after. Ritchie was killed during a shootout with police officers in downtown Anchorage on November 12, 2016. Following his death, a Colt Python handgun on his person connected him to the string of murders he committed over the course of two months.\nJames Dale Ritchie was born on November 4, 1976.[1] He grew up in Anchorage's Wonder Park neighborhood and attended East Anchorage High School, where – standing at 6 ft 3 in (1.91 m) – he was noted as being a standout athlete, having played on the 1994 state championship football and basketball teams alongside future professional athletes Trajan Langdon and Mao Tosi.[2] Ritchie was a close friend of Quincy and Bobby Thompson, whose family hosted him often throughout his teenage years.[3]\nRitchie scored 1200 on his SAT and was recruited by the West Virginia University (WVU) football team in 1994, one day following the death of Quincy. He subsequently fell out of contact with the Thompson family.[4][1]\n",
        "type": [
            "murder"
        ]
    },
    "14": {
        "link": "/wiki/Harvey_Carignan",
        "title": "Harvey Carignan",
        "date": "",
        "year": "new 1949",
        "location": "",
        "state": "",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "Harvey Louis Carignan (born May 18, 1927) is an American serial killer serving a life sentence at the Minnesota Correctional Facility – Faribault for the murders of two women.[1] He had been previously convicted for a 1949 rape and murder he committed while stationed in the U.S. Army, in Anchorage, Alaska.[2]\nCarignan was born in North Dakota in 1927.[3]\nOn July 31, 1949, Carignan killed 58-year-old Laura Showalter during an attempted rape in the Territory of Alaska.[4] On September 16, 1949, he attempted to rape another woman, Christine Norton, and was arrested the next day. Carignan was convicted of first degree murder and assault with intent to commit rape. The jury did not recommend mercy, and he received a mandatory death sentence. However, Carignan won a new trial on his murder conviction in 1951 on the grounds that his confession had been improperly obtained. An officer interrogating Carignan had told him he wouldn't be executed if he confessed to the murder.[5][6][3] Carignan's confession was suppressed and the murder charge was later dismissed.[7] He continued to serve a 15-year sentence for assaulting Christine Norton. In 1952, he was transferred to Alcatraz Federal Penitentiary, before being paroled in 1960.[8][9]\n",
        "type": [
            "rape",
            "assault",
            "murder"
        ]
    },
    "15": {
        "link": "/wiki/Death_of_Kent_Leppink",
        "title": "Death of Kent Leppink",
        "date": "",
        "year": "new 1996",
        "location": "",
        "state": "Alaska",
        "place": "Hope",
        "county": "Kenai Peninsula",
        "paragraph": " Kent Leppink was a fisherman who was killed in Hope, Alaska, in May 1996. His former fiancée, Mechele Linehan, and former roommate, John Carlin, were convicted of murdering him in 2007, but the judgments were reversed on appeal.[1][2][3] Carlin died in prison in 2008 and Alaska prosecutors ultimately decided against indicting Linehan a second time.\nKent Leppink was a Michigan native who moved to Alaska to work as a fisherman. He met Linehan at a striptease club. Between 1994 and 1996, Linehan was romantically involved with Leppink and a man named John Carlin at the same time. For several months the three lived in the same house in Anchorage.[4] On May 2, 1996, Leppink (age 36) was found dead in Hope, Alaska, with three .44 caliber Desert Eagle gunshot wounds.[2] Linehan was arrested over 10 years later in October 2006 and convicted of his murder on October 22, 2007, but the verdict was overturned in February 2010.[2]\nAt trial, Linehan was accused of conspiring with John Carlin to kill Leppink.[1] The government said that Linehan's motive was that she was the beneficiary of Leppink's $1 million life insurance policy.[5] Leppink changed the beneficiary on the policy a few days before his death.[6][7]\n",
        "type": [
            "murder"
        ]
    },
    "16": {
        "link": "/wiki/Jason_Coday",
        "title": "Jason Coday",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alaska",
        "place": "Ketchikan",
        "county": "Ketchikan Gateway",
        "paragraph": "Jason Michael Coday (born February 7, 1978)[1] is a man from Vernal, Utah.[2][clarification needed] On May 15, 2007, he was convicted of first-degree murder in the death of Simone Yung Kim behind the Fred Meyer store in Juneau, Alaska on August 4, 2006.[3]  It was the city's first murder in five years.[4]\nCoday was a drifter doing odd jobs.  The week before Kim's death, he had worked in Ketchikan, Alaska at a fish processing plant; he had planned to do similar work in Juneau.[4]\nI never really had one [job] to stick with.",
        "type": [
            "murder"
        ]
    },
    "17": {
        "link": "/wiki/John_Fautenberry",
        "title": "John Fautenberry",
        "date": "July 14, 2009(2009-07-14) (aged 46) Southern Ohio Correctional Facility, Lucasville, Ohio, U.S.",
        "year": "2009",
        "location": "",
        "state": "",
        "place": "New London",
        "county": "Anchorage",
        "paragraph": "John Joseph Fautenberry (July 4, 1963 – July 14, 2009) was an American serial killer. A long-haul trucker, Fautenberry befriended and subsequently murdered five people across four states between 1990 and 1991,[1][2] and after his arrest, confessed to an additional 1984 murder for which another man was convicted. He was sentenced to death for one of his killings, and subsequently executed at the Southern Ohio Correctional Facility in 2009.[3]\nBorn on July 4, 1963 in New London, Connecticut,[n 1] Fautenberry was the illegitimate son of a Navy seaman. Rejected by his father and grandparents, young John was placed in the care of his mother, who went on to marry twice more. He was ignored by his stepfathers, suffering beatings for the smallest of mistakes, once for confusing a potato salad with tomato salad. According to Fautenberry, he would use an imaginary hammer to nail his and his sister's blankets to the beds, in an effort to not get taken away by malicious forces.[4] The family often changed residences, shifting between Ohio and Hawaii before moving to North Kingstown, Rhode Island in 1983.[5] By that time, Fautenberry had already had run-ins with the law: he had stolen a 1968 Chrysler in Atlanta, but was later captured in Heflin, Alabama after leaving a gas station without paying for gas.[6]\nIn 1985, his mother died of cancer, leading Fautenberry to become even more disillusioned and untrustworthy of people, with him developing a growing addiction to drugs and alcohol.[4] In order to support himself, he held several short-term jobs as a long-haul trucker, travelling all across the United States, but was often fired for poor performance and negligence.[7] By the time his murders began, he acquired several more convictions for minor offenses, including carrying a concealed weapon in Ohio and a public disturbance charge in Ledyard, Connecticut.[5]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "18": {
        "link": "/wiki/Capital_punishment_in_Alaska",
        "title": "Capital punishment in Alaska",
        "date": "",
        "year": "new 1869",
        "location": "",
        "state": "Alaska",
        "place": "Fort Wrangell",
        "county": "Wrangell",
        "paragraph": "\nCapital punishment was abolished in 1957 in Alaska. Between December 28, 1869, and April 14, 1950, between the Department, District, and Territory of Alaska, twelve felons, all male, were executed by hanging for murder, robbery, and other crimes.[1] Some were European, some were Native American, and two were African.[2] The territorial legislature abolished capital punishment in 1957 during preparations for statehood, making Alaska the first in the West Coast of the United States to outlaw executions, along with Hawaii, which did the same.\nThere is no recorded history of any executions occurring in Alaska prior to its purchase by the United States government and its designation as the Department of Alaska. There are only four recorded executions in Alaska during the 19th century.[1]\nThe first recorded execution to occur in the Alaskan Territory was that of a Stikine Native American, only known by the name Scutd-doo, on December 29, 1869. The Espy Files have his name misspelled as \"Scutdor.\"[1] Scutd-doo was convicted of murdering Leon Smith, a naval commander, on December 25, 1869. Leon Smith's murder was in retaliation for the murder of Scutd-doo's relative, a brother or cousin known as Lowan or Si-Wau,[3] who had been murdered by American soldiers after being involved in an altercation with them in which he bit off the finger of the wife of the quartermaster of Fort Wrangell. The murder of Leon Smith prompted an incident known as the Wrangell Bombardment, wherein the United States Army issued an ultimatum to the Stikine village of Old Wrangell demanding Scutd-doo's surrender. Two days after the United States Army and Stikine villagers exchanged fire, Scutd-doo was handed over to the United States Army, court-martialed, and publicly hanged in front of his fellow villagers on December 29, 1869, only four days after Smith's murder. The hanging occurred during the daytime; Scutd-doo's body was left hanging until nightfall to serve as a warning.[4][5]\n",
        "type": [
            "robber",
            "robbery",
            "murder"
        ]
    },
    "19": {
        "link": "/wiki/Alaska_political_corruption_probe",
        "title": "Alaska political corruption probe",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alaska",
        "place": "D.C.",
        "county": "Bristol Bay",
        "paragraph": "\n\n\nThe Alaska political corruption probe refers to a 2003 to 2010 widespread investigation by the Public Integrity Section of the U.S. Department of Justice, the Federal Bureau of Investigation, and the Internal Revenue Service into political corruption of nine then-current or former Alaskan state lawmakers, as well as Republican US Representative Don Young and then-US Senator, Republican Ted Stevens. Sometimes referred to as \"The Corrupt Bastards Club\" or the \"Operation Polar Pen\", the investigation focused on the oil industry, fisheries and for-profit prison industries.\nBy the spring of 2006, the FBI set up in a Baranof hotel suite just three blocks away from the capitol building in Juneau. From their position in the hotel suite, they gathered evidence, such as a videotape of VECO's CEO Bill Allen arranging paper money for legislators, and made other observations. By August 2008, the investigation resulted in indictments against six sitting or former Alaska Republican state legislators on corruption charges. In August 2008 US Senator Ted Stevens was indicted and, by October, he was convicted in Washington, D.C. on seven felony counts of failure to disclose gifts. The convictions, eight days before the November 2008 election, resulted in his narrow loss, after 40 years in the U.S. Senate, to Democrat Mark Begich. His convictions were later set aside because of prosecutorial misconduct and the United States Department of Justice ended further prosecution.\nIn addition to the conviction of US Senator Stevens, two executives of the VECO Corporation, an oilfield services contractor, pleaded guilty to charges of bribery and conspiracy to impede the Internal Revenue Service. Alaska businessmen/lobbyists Bill Weimar (former for-profit halfway house owner) and Bill Bobrick, as well as Jim Clark, the former governor's chief of staff, also were indicted and convicted. Clark's guilty plea and sentence were later vacated before he was ordered to report to custody. That was followed by ex-Alaska State Rep. Bruce Weyhrauch's Supreme Court challenge to the honest services fraud statute. His case was decided on June 24, 2010, in association with the Skilling v. United States and Conrad Black case decisions. While the Court overturned the Skilling conviction, stating that the honest services fraud statute was not applicable to private citizens, the Court upheld, but narrowed the application of the honest services fraud statute by stating that it was applicable to public officials only, and remanding Weyhrauch's conviction to the 9th Circuit Court of Appeals.\n",
        "type": [
            "killing"
        ]
    },
    "20": {
        "link": "/wiki/Wrangell_Bombardment",
        "title": "Wrangell Bombardment",
        "date": "December 25–29, 1869",
        "year": "1869",
        "location": "Wrangell, Alaska56°23′06″N 132°05′11″W﻿ / ﻿56.38500°N 132.08639°W﻿ / 56.38500; -132.08639Coordinates: 56°23′06″N 132°05′11″W﻿ / ﻿56.38500°N 132.08639°W﻿ / 56.38500; -132.08639",
        "state": "Alaska",
        "place": "Fort Wrangell",
        "county": "Wrangell",
        "paragraph": "The Wrangell Bombardment was the bombardment of the Stikine village of Old Wrangell (Tlingit: Ḵaachx̱aana.áakʼw) by the United States Army in 1869. The army issued an ultimatum to the villagers, demanding they deliver a Stikine named Scutd-doo to justice following the retribution murder of Leon Smith by Scutd-doo. Scutd-doo's son, Lowan, had earlier been killed by soldiers following an altercation in which he bit off a finger of the wife of the quartermaster of Fort Wrangell.\nFollowing a two-day bombardment of the village and return musket fire by Stikine skirmishers, Scutd-doo was handed over to the army, court-martialed, and in the first application of the death penalty in Alaska under U.S. rule, was hanged before the garrison and Stikine villagers.\nFollowing the Alaska Purchase, the United States Army came to Alaska to serve as the civil administering entity of the Department of Alaska. In the summer of 1868 a detachment from Battery I of the 2nd Regiment of Artillery established a small outpost at Fort Wrangell (which was previously a trading post) in a 200 by 200 feet area, surrounded by a 10-foot log wall with elevated platforms, a 12-pounder mountain howitzer, and a 6-pounder cannon. In December 1869 the fort was garrisoned by 26 soldiers, with accompanying civilians.[1]\n",
        "type": [
            "battery",
            "murder"
        ]
    },
    "21": {
        "link": "/wiki/Leon_Smith_(naval_commander)",
        "title": "Leon Smith (naval commander)",
        "date": "26 December 1869(1869-12-26) (aged 39–40) Wrangell, Alaska",
        "year": "1869",
        "location": "",
        "state": "",
        "place": "Wrangell",
        "county": "Wrangell",
        "paragraph": "Leonidas R. Smith (1829 – December 26, 1869) was an American steamboat captain and soldier. In the American Civil War he served the Confederate States of America as a volunteer; he was named Commander of the Texas Marine Department[a] under General John B. Magruder. Smith was involved in most major conflicts along the Texas coast during the war,[2][3] and was described by war-time governor of Texas Francis Lubbock as \"undoubtedly the ablest Confederate naval commander in the Gulf waters\".[4]\nSmith was born in Portsmouth, New Hampshire in 1829. He was a Freemason, and according to some wartime and post-war reports, Caleb Blood Smith, a cabinet member under President Lincoln, was his half-brother.[3][5][6][4]\nSmith was married, and had a son, named Leon B. Smith.[3][7]\n",
        "type": [
            "murder"
        ]
    },
    "22": {
        "link": "/wiki/Dean_Westlake",
        "title": "Dean Westlake",
        "date": "August 21, 2022(2022-08-21) (aged 62) Anchorage, Alaska, U.S.",
        "year": "2022",
        "location": "",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "\nDean Westlake (January 8, 1960 – August 21, 2022), or Nuna in Iñupiaq, was an American politician from Alaska. He served in the Alaska House of Representatives in 2017, representing the 40th District in Alaska's North Slope region. A member of the Democratic Party, he caucused with the Democrat-led majority in the House of Representatives that includes independents and Republicans.[1]\nWestlake first ran for the House in 2014, mounting an unsuccessful Democratic primary challenge to Barrow Representative Benjamin Nageak, who caucused with the Republican-led majority caucus at the time. He ran again in 2016 and defeated Nageak in a very close election that was contested in court. A lower court ruled that 50 votes cast in Shungnak, a rural community that went overwhelmingly for Westlake, had been improperly cast and should not have been counted. The Alaska Supreme Court reversed the ruling however, making Westlake the winner.[2] Westlake was unopposed in the general election.[3]\n",
        "type": [
            "murder"
        ]
    },
    "23": {
        "link": "/wiki/McCarthy_Murders",
        "title": "McCarthy, Alaska",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alaska",
        "place": "Cordova",
        "county": "Chugach",
        "paragraph": "McCarthy is a census-designated place (CDP) in Copper River Census Area, Alaska, United States. It is in Wrangell-St. Elias National Park and Preserve. The population was 107 at the 2020 census, up from 28 in 2010.[3]\nMcCarthy is 120 mi (190 km) northeast of Cordova at the foot of the Wrangell Mountains. According to the United States Census Bureau, the CDP of McCarthy has a total area of 148.3 square miles (384 km2). None of the area is covered with water. It is connected to the outside world via the McCarthy Road spur of the Edgerton Highway from Chitina, and must be passed through to reach Kennecott, which is also within the McCarthy CDP. Historically, from the end of the road one had to cross the Kennecott River and then a smaller stream using manually propelled ropeways, but a footbridge was built in 1997. Visitors can walk to McCarthy in about 15 minutes, although shuttle vans and buses are available during the tourist season from the bridge to both McCarthy and Kennecott.[4] A private service bridge for vehicle traffic was constructed in 2004 downstream from the footbridge, but use is only available to residents, businesses, and the National Park Service for an annual fee.[5]\nMcCarthy has a subarctic climate (Köppen: Dfc).\n",
        "type": []
    },
    "24": {
        "link": "/wiki/2014_Alaska_State_Trooper_killings",
        "title": "2014 Alaska State Trooper killings",
        "date": "May 1, 2014 (2014-05-01)",
        "year": "2014",
        "location": "Tanana, Alaska, U.S.",
        "state": "Alaska",
        "place": "Fairbanks",
        "county": "Fairbanks North Star",
        "paragraph": "\nOn May 1, 2014, two Alaska State Troopers were killed in Tanana after responding to a report of a resident brandishing a gun in an altercation over the private sale of a $150 couch.[1] The Fairbanks-based troopers, Sergeant Patrick Scott Johnson and Trooper Gabriel Lenox Rich, had been featured in the National Geographic Channel program Alaska State Troopers.[2] Nineteen-year-old Tanana resident Nathanial Lee Kangas was charged with two counts of first-degree murder and a single count of third-degree assault.\nKangas shot and killed the officers as they attempted to arrest his father, Arvin Kangas, at the family's home.[3] Arvin Kangas, 58, was charged with assault for pointing a shotgun at the local Village Public Safety Officer (VPSO) during the incident that prompted the troopers' investigation.[4]\n",
        "type": [
            "assault",
            "murder",
            "killing"
        ]
    },
    "25": {
        "link": "/wiki/Soapy_Smith",
        "title": "Soapy Smith",
        "date": "July 8, 1898(1898-07-08) (aged 37) Skagway, District of Alaska",
        "year": "1898",
        "location": "",
        "state": "Alaska",
        "place": "Skagway",
        "county": "Skagway",
        "paragraph": "Jefferson Randolph \"Soapy\" Smith II (November 2, 1860 – July 8, 1898) was an American con artist and gangster in the American frontier.\nSmith operated confidence schemes across the Western United States, and had a large hand in organized criminal operations in both Colorado and the District of Alaska. Smith gained notoriety through his \"prize soap racket,\" in which he would sell bars of soap with prize money hidden in some of the bars' packaging in order to increase sales. However, through sleight-of-hand, he would ensure that only members of his gang purchased \"prize\" soap. The racket led to his sobriquet of \"Soapy.\"\nThe success of his soap racket and other scams helped him finance three successive criminal empires in Denver and Creede, both in Colorado, and in Skagway, Alaska. He was killed in the shootout on Juneau Wharf in Skagway, on July 8, 1898.\n",
        "type": []
    },
    "26": {
        "link": "/wiki/Murder_of_Kathleen_Jo_Henry",
        "title": "Murder of Kathleen Jo Henry",
        "date": "October 2, 2019 (2019-10-02) (body discovered)",
        "year": "2019",
        "location": "Anchorage, Alaska, U.S.",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "The murder of Kathleen Jo Henry occurred on September 4, 2019, in Anchorage, Alaska. The murder occurred at a local TownePlace Suites hotel, operated by Marriott International. The murder of Kathleen Henry, who was also sexually assaulted before her death, made international news when it was revealed that her alleged killer, Brian Steven Smith, recorded her death in both still photograph as well as numerous videos which he recorded on an SD card. Henry's remains were found along Alaska's Seward Highway on October 2, 2019.[1]\nDetectives with the Anchorage Police Department recognized Smith from a previous investigation involving him, and obtained a warrant for his arrest. On October 8, 2019, Smith was arrested at Ted Stevens Anchorage International Airport, where he arrived after returning from a trip. Smith was subsequently booked into an Anchorage jail. Police have stated that they discovered thirty-nine photos and twelve videos related to Henry's assault and murder on the SD card, which was found by a woman on the street in the Fairview section of Anchorage.[2]\nOn October 17, 2019, Smith was charged with the murder of a second woman, Veronica Abouchuk, whom Smith allegedly confessed to killing. Smith allegedly admitted to her death, and told authorities where they could find her body.[3]\n",
        "type": [
            "riot",
            "assault",
            "murder",
            "killing"
        ]
    },
    "27": {
        "link": "/wiki/Investor_massacre",
        "title": "Craig, Alaska",
        "date": "",
        "year": "",
        "location": "",
        "state": "Alaska",
        "place": "Ketchikan",
        "county": "Ketchikan Gateway",
        "paragraph": "Craig (Tlingit: Sháan Séet) is a[12] city in the Prince of Wales-Hyder Census Area in the Unorganized Borough[A] in the U.S. state of Alaska. The population was 1,036 at the 2020 census,[13] down from 1,201 in 2010.[10]\nCraig is the largest town on Prince of Wales Island, the fourth-largest island in the United States.[4] Craig is approximately 56 miles (90 km) by air northwest of Ketchikan and 220 miles (350 km) south of Juneau.[4]\nAccording to the United States Census Bureau, the city has a total area of 9.4 square miles (24.3 km2), of which, 6.7 square miles (17.4 km2) of it is land and 2.7 square miles (7.0 km2) of it (28.94%) is water.\n",
        "type": []
    },
    "28": {
        "link": "/wiki/Kermit_Roosevelt",
        "title": "Kermit Roosevelt",
        "date": "June 4, 1943(1943-06-04) (aged 53) Fort Richardson, Alaska",
        "year": "1943",
        "location": "",
        "state": "Alaska",
        "place": "Fort Richardson",
        "county": "Anchorage",
        "paragraph": "\nKermit Roosevelt MC (October 10, 1889 – June 4, 1943) was an American businessman, soldier, explorer, and writer. A son of Theodore Roosevelt, the 26th President of the United States, Kermit graduated from Harvard College, served in both World Wars (with both the British and U.S. Armies), and explored two continents with his father. He fought a lifelong battle with depression and died by suicide while serving in the US Army in Alaska during World War II.[1]\nKermit was born at Sagamore Hill, the family estate in Oyster Bay, New York, the second son of Theodore Roosevelt, (1858–1919) and Edith Kermit Carow (1861–1948). He had an older half-sister Alice Lee Roosevelt (1884–1980), from his father's first marriage to Alice Hathaway Lee (1861–1884), an elder brother, Theodore Roosevelt III (1887–1944), a younger sister, Ethel Carow Roosevelt (1891–1977), and two younger brothers; Archibald Bulloch \"Archie\" Roosevelt (1894–1979) and Quentin Roosevelt (1897–1918).\n",
        "type": []
    },
    "29": {
        "link": "/wiki/Frank_H._Reid",
        "title": "Frank H. Reid",
        "date": "July 20, 1898 (aged 53-54) Skagway, District of Alaska",
        "year": "1898",
        "location": "",
        "state": "Alaska",
        "place": "Skagway",
        "county": "Skagway",
        "paragraph": "Frank H. Reid (1844 – July 20, 1898) was an American soldier, teacher, city engineer, vigilante, and one of the  combatants in the shootout on Juneau Wharf that ended the life of American outlaw Jefferson \"Soapy\" Smith, as well as Reid's own life.\nReid was born in Illinois about 1844.[1] He enlisted in the army and became a lieutenant for a company of Oregon volunteers. In the 1870s, he studied engineering and then became a teacher in Linn County, Oregon, District 29.[1]\nDuring the Klondike Gold Rush, he settled in Skagway, Alaska, where he worked as a bartender at the Klondike saloon, believed to have been owned by Soapy Smith.[2] On August 18, 1897, he was appointed town surveyor and helped map the town of Skagway.[3] At some point, Reid joined the vigilante committee known as the 101.[3]\n",
        "type": []
    },
    "30": {
        "link": "/wiki/Murder_of_Eklutna_Annie",
        "title": "Murder of Eklutna Annie",
        "date": "c. November 1979 – June 1980 (aged 16 – 25) [1]",
        "year": "1979",
        "location": "",
        "state": "Alaska",
        "place": "Eklutna",
        "county": "Anchorage",
        "paragraph": "Eklutna Annie is the name given to an unidentified murder victim whose body was discovered in a wooded area, one mile south of South Eklutna Lake Road in Eklutna, Anchorage, Alaska, in July 1980. She was aged between 16 and 25 at the time of her death, and her body was discovered several months after her murder. An autopsy report concluded that she had been killed by a single stab wound to the back.[3][4]\nEklutna Annie was murdered by serial killer Robert Hansen, most likely in 1979. Hansen specifically stated she was his first murder victim.[5][3]\nThis unidentified decedent became known as Eklutna Annie due to the location in which her body was discovered. The case remains open, and numerous efforts have been made to determine the identity of the decedent, including several forensic facial reconstructions of how she may have appeared in life.[6]\n",
        "type": [
            "murder"
        ]
    },
    "31": {
        "link": "/wiki/Carl_McCunn",
        "title": "Carl McCunn",
        "date": "December 18, 1981(1981-12-18) (aged 34) Brooks Range, Alaska, U.S.",
        "year": "1981",
        "location": "",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "Carl McCunn (January 25, 1947 – December 18, 1981) was an American wildlife photographer who became stranded in the Alaskan wilderness and eventually died by suicide when he ran out of supplies.\nMcCunn was the son of Donovan P. and Erika Hess McCunn.  McCunn was born in Munich, Germany, where his father was stationed by the United States Army. He was raised in San Antonio, Texas, graduated from high school in 1964, and enlisted in the United States Navy shortly after dropping out of community college. McCunn served in the Navy for four years and was discharged in 1969. He briefly lived in Seattle, Washington, before settling in Anchorage, Alaska, in 1970.[2][3]\nI keep thinking of all the shotgun shells I threw away about two months ago. Had five boxes and when I kept seeing them sitting there I felt rather silly for having brought so many. (Felt like a war monger.) So I threw all away ... but about a dozen ... real bright. ... Who would have known I might need them just to keep from starving?\n",
        "type": []
    },
    "32": {
        "link": "/wiki/Robert_Hansen",
        "title": "Robert Hansen",
        "date": "August 21, 2014(2014-08-21) (aged 75) Anchorage, Alaska, U.S.",
        "year": "2014",
        "location": "",
        "state": "Alaska",
        "place": "Anchorage",
        "county": "Anchorage",
        "paragraph": "\nRobert Christian Hansen (February 15, 1939 – August 21, 2014), known in the media as the Butcher Baker, was an American serial killer. Between 1971 and 1983, Hansen abducted, raped, and murdered at least seventeen women in and around Anchorage, Alaska; he hunted many of them down in the wilderness with a Ruger Mini-14 and a knife. He was arrested and convicted in 1983, and was sentenced to 461 years without the possibility of parole.[2][3] He died in 2014 of natural causes due to lingering health conditions at age 75.\nRobert Christian Boes Hansen was born in Estherville, Iowa, at Coleman Hospital on February 15, 1939, the elder of two children to an American mother and a Danish father.[4] The family moved to Richmond, California in 1942, but returned to Iowa in 1949, settling in Pocahontas.[5] His mother was Edna Margret Petersen.[6] His father Christian Hansen (1907–1983) owned a bakery in the town, and Robert was employed at the bakery. In his youth, he was painfully shy, had a stutter and severe acne that left him permanently scarred. Not receiving the attention he wanted from the attractive girls in school, Hansen grew up hating them and nursing fantasies of cruel revenge.[7]\n",
        "type": [
            "rape",
            "murder"
        ]
    },
    "33": {
        "link": "/wiki/Awa%27uq_Massacre",
        "title": "Awa'uq Massacre",
        "date": "14 August 1784",
        "year": "",
        "location": "Sitkalidak Island, Alaska, Russian America57°06′22″N 153°05′00″W﻿ / ﻿57.10604°N 153.0832814°W﻿ / 57.10604; -153.0832814Coordinates: 57°06′22″N 153°05′00″W﻿ / ﻿57.10604°N 153.0832814°W﻿ / 57.10604; -153.0832814",
        "state": "Alaska",
        "place": "Refuge Rock",
        "county": "Kodiak Island",
        "paragraph": "none\nGrigory Shelikhov\nThe Awa'uq Massacre[4][5] or Refuge Rock Massacre,[5] or, more recently, as the Wounded Knee of Alaska,[2] was an attack and massacre of Koniag Alutiiq (Sugpiaq) people in April 1784 at Refuge Rock near Kodiak Island by Russian fur trader Grigory Shelekhov and 130 armed Russian men and cannoneers of his Shelikhov-Golikov Company. \n",
        "type": [
            "murder"
        ]
    },
    "34": {
        "link": "/wiki/Evan_Ramsey",
        "title": "Bethel Regional High School shooting",
        "date": "February 19, 1997",
        "year": "1997",
        "location": "Bethel, Alaska, U.S.",
        "state": "Alaska",
        "place": "Bethel",
        "county": "Unorganized Borough",
        "paragraph": "The Bethel Regional High School shooting was a school shooting that occurred on February 19, 1997 at Bethel Regional High School in Bethel, Alaska. Two people were killed and two people were wounded by student Evan Ramsey. Ramsey is serving two 99-year prison sentences and will be eligible for parole in 2066 when he is 85.[citation needed]\nReports say in the two weeks prior to the incident, more than 15 students knew of Ramsey's intention to commit a school shooting, and two actually assisted him.[1] One student, named James Randall, taught him how to load and fire a shotgun. Another student, named Matthew Charles, told him of the infamy that would come.[2] Reports say that several students brought cameras to school on the day of the shooting, and that many students were watching the shooting from a library balcony overlooking the student commons area.[3]\nOn February 19, 1997, Ramsey armed himself with a Mossberg 500 12-gauge shotgun, and arrived at Bethel Regional High School by school bus. He approached the student commons area, brandishing the shotgun, and shot 15-year-old Josh Palacios in the abdomen. Palacios later died after emergency surgery. He then shot and injured two other students. Reyne Athanas, an art teacher, entered the commons area after hearing the gunshots. Athanas said she tried and failed to convince Ramsey to surrender. He then entered the main lobby, where he shot principal Ron Edwards twice, killing him. \n",
        "type": [
            "shooting",
            "mass shooting",
            "murder",
            "killing"
        ]
    }
}