[
    {
        "link": "/wiki/Battleground_Gunfight",
        "title": "Battleground Gunfight",
        "date": "October 8, 1901",
        "location": "Fort Apache Indian Reservation, Arizona Territory, United States",
        "paragraph": "The Battleground Gunfight,[1] also known as the Battleground Shootout,[2] was a gunfight between a posse of American lawmen and the Smith Gang. It was fought on October 8, 1901, within Arizona Territory's Fort Apache Indian Reservation, at a clearing in the forest known today as the \"Battleground\". Nine Arizona Rangers and deputies caught up with the cattle rustler Bill Smith and his gang. During a long exchange of gunfire that followed, Ranger Carlos Tafolla[3] and Deputy Bill Maxwell[4] were killed and one or two of the outlaws may have been wounded. In the end, the Smith Gang escaped the posse and fled into Mexico.[2]\nThe Arizona Rangers were established in 1901 and the Battleground Gunfight became the first major shootout to involve the new police force. The Smith Gang was one of the first targets for the rangers. In northeastern Graham County, Bill Smith owned a ranch on the Blue River, where he lived with his mother and his younger brothers and sisters. The ranch house served as a base for rustling cattle from nearby settlers, such as Henry Barrett, a former Rough Rider. In 1898, the Smith brothers were arrested for stealing unbranded calves from Barrett and Bill Phelps. Bill Smith assumed full responsibility, so he was sent to jail at St. Johns. Because of this, Bill was said to have developed a grudge against Henry Barrett. During the first week of October 1901, the Smith Gang was spotted at Pat Knoll, near Springerville, heading south with a herd of fifteen or twenty stolen horses. Police informants said the gang was on their way from Utah, where they robbed a train. A few days later, Bill and his brother Al came across Henry Barrett and another cowboy in the Big Cienega range. During the confrontation, Bill threatened to kill Barrett, so the latter informed the sheriff of Apache County, who organized a posse.[2]\n"
    },
    {
        "link": "/wiki/Shootout_in_Benson",
        "title": "Shootout in Benson",
        "date": "February 27, 1907",
        "location": "Benson, Arizona Territory, USA",
        "paragraph": "The Shootout in Benson was one of the last great gunfights in the Old West. On February 27, 1907, the Arizona Ranger Harry C. Wheeler attempted to detain a man named J. A. Tracy in the town of Benson, Arizona. Tracy resisted arrest and opened fire on Wheeler, but the latter armed himself and a gunfight ensued. When the shooting was over, both Tracy and Wheeler were badly wounded, however, the former died of his wounds and Wheeler fully recovered.[1][2]\nJ. A. Tracy was a wealthy businessman who lived in Vail Station, where he was employed as an agent for the Helvetia Copper Company. According to author Pleasant DeSpain, Tracy came to Arizona from Nevada to pursue a young lady, with whom he'd had relations in the past. The lady was not interested in Tracy though and she left Nevada for Phoenix between 1905 and 1906. There she joined a Mr. D. W. Silverton, Jr., who was the son of the Kentucky Colonel D. W. Silverton, and the two went to Tucson to settle down. Mr. Silverton claimed that he married the young lady, whose name remains unknown, because she refused to tell the newspapers in the aftermath of the Benson shooting. She was the daughter in a wealthy family from Colorado and, because of her relationship with Tracy, she wanted to protect her family name from embarrassment. The ceremony was, allegedly, carried out by a traveling evangelist minister in Phoenix, but a later investigation suggested that the marriage may have been fabricated. Tracy was not giving up on Mrs. Silverton. He began sending her threatening letters and, sometime later, he purchased a diamond ring with the intention of proposing to her, unaware that she had already been married.[1][2][3]\n"
    },
    {
        "link": "/wiki/Bisbee_massacre",
        "title": "Bisbee massacre",
        "date": "December 8, 1883",
        "location": "Bisbee, Arizona Territory, United States",
        "paragraph": "\nThe Bisbee massacre (a.k.a. the Bisbee murders or Bisbee raid) occurred in Bisbee, Arizona, on December 8, 1883, when six outlaws who were part of the Cochise County Cowboys robbed a general store. Believing the general store's safe contained a mining payroll of $7,000, they timed the robbery incorrectly and were only able to steal between $800 and $3,000, along with a gold watch and jewelry. During the robbery, members of the gang killed five people, including a lawman and a pregnant woman. Six men were convicted of the robbery and murders. John Heath, who was accused of organizing the robbery, was tried separately and sentenced to life in prison. The other five men were convicted of murder and sentenced to hang.\n"
    },
    {
        "link": "/wiki/Canyon_Diablo_shootout",
        "title": "Canyon Diablo shootout",
        "date": "April 8, 1905",
        "location": "Canyon Diablo, Arizona Territory, US",
        "paragraph": "The Canyon Diablo shootout was a gunfight between American lawmen and a pair of bandits that occurred on April 8, 1905, in the present-day ghost town of Canyon Diablo, Arizona. On the night before, two men named William Evans and John Shaw robbed a saloon in Winslow and made off with at least $200 in coins. Two lawmen pursued the bandits and on the following day they encountered each other in Canyon Diablo. A three-second shootout ensued, which was described at the time as \"one huge explosion\" that resulted in the death of Shaw and the wounding and capture of Evans.[1][2][3]\nLittle is known about the lives of William Evans and John Shaw before they became bandits. The former was an ex-convict who also went by the name of William Smith, or Smythe. Both were in their early to mid twenties when they decided that banditry would be easier than being a cowboy. The robbery which ultimately led to the shooting in Canyon Diablo occurred on the night of April 7, 1905. Shortly before midnight, Evans and Shaw entered the Wigwam Saloon in Winslow, Arizona, dressed in their finest clothing. The two headed straight for the bar and ordered a couple shots of rot gut, a type of whiskey common at the time. They weren't interested in wasting time, though, and before drinking they turned around and pulled out their revolvers to hold up a group of seven men playing poker at one of the tables. At gunpoint, the two bandits relieved the gamblers of between $200 and $600 worth of silver coins and then fled out the front door without firing a shot.[1][2][4]\n"
    },
    {
        "link": "/wiki/Fairbank_train_robbery",
        "title": "Fairbank train robbery",
        "date": "February 15, 1900",
        "location": "Fairbank, Arizona Territory, United States",
        "paragraph": "The Fairbank train robbery occurred on the night of February 15, 1900, when some bandits attempted to hold up a Wells Fargo express car at the town of Fairbank, Arizona. Although it was thwarted by Jeff Milton, who managed to kill \"Three Fingered Jack\" Dunlop in an exchange of gunfire, the train robbery was unique for being one of the few to have occurred in a public place and was also one of the last during the Old West period.[1]\nIn the 1890s, Burt Alvord and his partner in crime, Billy Stiles, were serving as deputy sheriffs in Willcox. Law enforcement paid little, though, so they began robbing trains belonging to the Southern Pacific Railroad. For a while they managed to be successful and went undetected by their fellow lawmen.[1][2]\n"
    },
    {
        "link": "/wiki/Guadalupe_Canyon_Massacre",
        "title": "Guadalupe Canyon Massacre",
        "date": "",
        "location": "",
        "paragraph": "Coordinates: 31°20′22″N 109°05′33″W﻿ / ﻿31.339416°N 109.092436°W﻿ / 31.339416; -109.092436\nThe Guadalupe Canyon Massacre was an incident that occurred on August 13, 1881 in the Guadalupe Canyon area of the southern Peloncillo Mountains – Guadalupe Mountains. Five American men were killed in an ambush, including \"Old Man\" Clanton, the alleged leader. They most likely belonged to The Cowboys, an outlaw group based in Pima and Cochise counties in Arizona. Two men survived the attack. The canyon straddles the modern Arizona and New Mexico state line and connects the Animas Valley of New Mexico with the San Bernardino Valley of Arizona. During the American Old West, the canyon was a key route for smugglers into and out of Mexico.\n"
    },
    {
        "link": "/wiki/Kelvin_Grade_massacre",
        "title": "Kelvin Grade massacre",
        "date": "November 2, 1889",
        "location": "near Globe, Arizona",
        "paragraph": "The Kelvin Grade massacre was an incident that occurred on November 2, 1889 when a group of nine imprisoned Apache escaped from police custody during a prisoner transfer near the town of Globe, Arizona. The escape resulted in the deaths of two sheriffs and triggered one of the largest manhunts in Arizona history. Veterans of the Apache Wars scoured the Arizona frontier for nearly a year in search of the fugitives, by the end of which all were caught or killed except for the famous Indian scout known as the Apache Kid.\nWhen the reservation system began in Arizona, the local Apache peoples were among the first to be subjugated. Throughout most of the Old West period, the reservations were undersupplied, which led to starvation, and their operators tended to be corrupt. This led to conflicts such as Geronimo's War, beginning in 1881, during which Geronimo and his band of Apaches left their assigned reservations and evaded capture until 1886. The Apache Kid, or Haskay-bay-nay-ntayl, had for most of the 1880s served as an Indian scout for the U.S. Army in the Apache Wars, having been involved in the mutiny during the Battle of Cibecue Creek and the Crawford Affair. Though many people at the time believed that the Apache Kid did not kill any of the soldiers at Cibecue, he left the reservation system in 1887 after an incident at the San Carlos Reservation. The Kid was also a friend of Al Sieber, Chief of the Army Scouts, who allegedly betrayed him after the Cibecue affair. Sometime in 1888 the Apache Kid was caught, put on trial in Globe for various crimes, and sentenced to spend the next seven years in Yuma Territorial Prison. The Kid had already served over a year of prison time at San Carlos and Alcatraz Island, so the prospect of going to the prison at Yuma was intolerable and he conspired with his fellow inmates to escape whenever and wherever possible.\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Heath",
        "title": "Bisbee massacre",
        "date": "December 8, 1883",
        "location": "Bisbee, Arizona Territory, United States",
        "paragraph": "\nThe Bisbee massacre (a.k.a. the Bisbee murders or Bisbee raid) occurred in Bisbee, Arizona, on December 8, 1883, when six outlaws who were part of the Cochise County Cowboys robbed a general store. Believing the general store's safe contained a mining payroll of $7,000, they timed the robbery incorrectly and were only able to steal between $800 and $3,000, along with a gold watch and jewelry. During the robbery, members of the gang killed five people, including a lawman and a pregnant woman. Six men were convicted of the robbery and murders. John Heath, who was accused of organizing the robbery, was tried separately and sentenced to life in prison. The other five men were convicted of murder and sentenced to hang.\n"
    },
    {
        "link": "/wiki/Gunfight_at_the_O.K._Corral",
        "title": "Gunfight at the O.K. Corral",
        "date": "October 26, 1881",
        "location": "Tombstone, Arizona Territory, U.S.",
        "paragraph": "\nThe gunfight at the O.K. Corral was a thirty-second shootout between lawmen led by Virgil Earp and members of a loosely organized group of outlaws called the Cowboys that occurred at about 3:00 p.m. on Wednesday, October 26, 1881, in Tombstone, Arizona Territory, United States. It is generally regarded as the most famous shootout in the history of the American Old West.\n"
    },
    {
        "link": "/wiki/O.K._Corral_hearing_and_aftermath",
        "title": "O.K. Corral hearing and aftermath",
        "date": "October 30, 1881 – March 19, 1882 (1881-10-30 – 1882-03-19)",
        "location": "Tombstone, Arizona Territory, United States",
        "paragraph": "\nThe O.K. Corral hearing and aftermath was the direct result of the 30-second Gunfight at the O.K. Corral in Tombstone, Arizona Territory, on October 26, 1881. During that confrontation, Deputy U.S. Marshal and Tombstone Town Marshal Virgil Earp, Assistant Town Marshal Morgan Earp, and temporary deputy marshals Wyatt Earp and Doc Holliday shot and killed Billy Clanton, and Tom and Frank McLaury. Billy's brother Ike, who had repeatedly threatened to kill the Earps for some time, had been present at the gunfight but was unarmed and fled. As permitted by territory law,  he filed murder charges against the Earps and Doc Holliday on October 30.\n"
    },
    {
        "link": "/wiki/Skeleton_Canyon_massacres",
        "title": "Skeleton Canyon massacres",
        "date": "",
        "location": "",
        "paragraph": "The Skeleton Canyon massacres refer to two separate attacks on Mexican citizens in 1879 and 1881. Skeleton Canyon is located in the Peloncillo Mountains (Hidalgo County), which straddles the modern Arizona and New Mexico state line border. This canyon connects the Animas Valley of New Mexico with the San Simon Valley of Arizona.\nThe first Skeleton Canyon Massacre occurred in 1879 when a group of Mexican Rurales were ambushed by cattle rustlers. In July 1879, several rustlers attacked a rancho in northern Sonora, killing several of the inhabitants. After the attack on the rancho, the survivors reported the attacks to Commandant Francisco Neri, who sent out a detachment of Rurales, including Captain Alfredo Carrillo. The Rurales  crossed the border into Arizona. As they entered Skeleton Canyon, shots were fired against them. Of the large group that crossed, only three of the Rurales survived.\n"
    },
    {
        "link": "/wiki/Skeleton_Canyon_shootout",
        "title": "Skeleton Canyon shootout",
        "date": "August 12, 1896",
        "location": "Skeleton Canyon, Arizona Territory, United States",
        "paragraph": "The Skeleton Canyon shootout was a gunfight on August 12, 1896, between members of the High Five Gang and a posse of American lawmen. Following a failed robbery on August 1 of the bank in Nogales, Arizona, the High Fives headed east and split up. The gang's leader, Black Jack Christian, and George Musgrave got away.\nThree others, including Bob Christian, were engaged by the posse at the entrance of Skeleton Canyon. This gorge in the Peloncillo Mountains had historically been used by smugglers, bandits, and legitimate travelers between the United States and Mexico. The outlaws fought off their pursuers, killing Frank Robson, and escaped into New Mexico Territory.[1]\n"
    },
    {
        "link": "/wiki/Wickenburg_Massacre",
        "title": "Wickenburg Massacre",
        "date": "November 5, 1871",
        "location": "Wickenburg, Arizona",
        "paragraph": "\nCoordinates: 33°57′47″N 112°47′50″W﻿ / ﻿33.963072°N 112.797253°W﻿ / 33.963072; -112.797253﻿ (Wickenburg Massacre Historical Monument)\nThe Wickenburg Massacre was the November 5, 1871, murder of six stagecoach passengers en route westbound from Wickenburg, Arizona Territory, headed for San Bernardino, California, on the La Paz road.\n"
    },
    {
        "link": "/wiki/Shootout_at_Wilson_Ranch",
        "title": "Shootout at Wilson Ranch",
        "date": "April 7, 1899",
        "location": "Near Pearce, Arizona Territory, United States",
        "paragraph": "The Shootout at Wilson Ranch resulted in the final and most famous hanging in the history of Tombstone, Arizona. On April 7, 1899, the brothers William and Thomas Lee Halderman were confronted by two lawmen at a ranch located in the Chiricahua Mountains. A brief gunfight ensued, during which Constable Chester L. Ainsworth was killed and his deputy, Teddy Moore, was mortally wounded. The Halderman brothers then fled to New Mexico, but they were captured shortly thereafter and executed on November 16, 1900, following a hasty trial in Tombstone.[1][2][3][4]\nWilliam and Thomas Halderman were twenty-one and eighteen, respectively, at the time of their deaths. They belonged to a wealthy and influential family of Texas pioneers, the Kokernots, but worked as cowboys in Cochise County, Arizona. In 1898, the Halderman brothers began feuding with the eighteen-year-old Teddy Moore over a pair of young women named Rena and Mary Wilson. According to later court findings, in November 1898, Moore threatened to kill William and continued to do so over the following months. Finally, on April 6, 1899, Justice William Monmonier received a report from the owner of the Smith Ranch, Buck Smith, accusing the Halderman brothers of stealing and killing cattle. A warrant was issued and the task of arresting the Haldermans fell onto Constable Chester Ainsworth, who was the brother of Attorney General Charles F. Ainsworth.[1][2][3][4]\n"
    },
    {
        "link": "/wiki/Rodeo%E2%80%93Chediski_Fire",
        "title": "Rodeo–Chediski Fire",
        "date": "",
        "location": "Coconino and Navajo counties, Arizona",
        "paragraph": "The Rodeo–Chediski Fire was a wildfire that burned in east-central Arizona beginning on June 18, 2002, and was not controlled until July 7.[2] It was the worst forest fire in Arizona's recorded history until June 14, 2011 when the Wallow Fire surpassed it.[3]  Several local communities, including Show Low, Pinetop-Lakeside, Heber-Overgaard Clay Springs and Pinedale, were threatened and had to be evacuated.\nInitially there were two separate fires. The first fire, the Rodeo, was reported on the afternoon of June 18 near the Rodeo Fairgrounds on the Fort Apache Indian Reservation by Cibecue. An arsonist was arrested on June 29 and was later charged. By early evening, around 1,200 acres (1.9 sq mi; 490 ha) were ablaze. Increasing wind speeds fed the fire to over 2,000 acres (3.1 sq mi; 810 ha) by the following morning, and when wind speeds increased to around 25 miles per hour (40 km/h) the fire grew rapidly, increasing fourfold over the next three hours.\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Heath",
        "title": "Bisbee massacre",
        "date": "December 8, 1883",
        "location": "Bisbee, Arizona Territory, United States",
        "paragraph": "\nThe Bisbee massacre (a.k.a. the Bisbee murders or Bisbee raid) occurred in Bisbee, Arizona, on December 8, 1883, when six outlaws who were part of the Cochise County Cowboys robbed a general store. Believing the general store's safe contained a mining payroll of $7,000, they timed the robbery incorrectly and were only able to steal between $800 and $3,000, along with a gold watch and jewelry. During the robbery, members of the gang killed five people, including a lawman and a pregnant woman. Six men were convicted of the robbery and murders. John Heath, who was accused of organizing the robbery, was tried separately and sentenced to life in prison. The other five men were convicted of murder and sentenced to hang.\n"
    },
    {
        "link": "/wiki/2022_Arizona_Capitol_protests",
        "title": "2022 Arizona Capitol protests",
        "date": "June 24, 2022 7 p.m. (MST)[1]",
        "location": "Phoenix, Arizona, U.S.",
        "paragraph": "\nOngoing protests in Arizona against the overturning of Roe v. Wade include demonstrations at the State Capitol and throughout Phoenix.[2]\n"
    },
    {
        "link": "/wiki/Bisbee_%2717",
        "title": "Bisbee '17",
        "date": "",
        "location": "",
        "paragraph": "Bisbee '17 (also Bisbee '17: A Story Told in Six Chapters[2]) is a 2018 American film directed by Robert Greene. Partially documentary and partially based on a true story Western, it reflects on the events of the 1917 Bisbee Deportation, 100 years later; it is set in Bisbee, Arizona, both in 1917 and 2017.\nFive years after its statehood and a few months after the United States' entry into World War I, xenophobia and anti-unionism is growing in the southernmost towns of Arizona near the Mexican border. In Bisbee, immigrant workers organized and were violently rounded up and transported to the desert in New Mexico; not as famous as the events in nearby Tombstone, the deportation didn't live in the national memory, but is quietly remembered by the townsfolk today. And so at the 100 year anniversary, Bisbee citizens organized a re-enactment. The events unfold again, as if they were happening in 1917, framed alongside interviews with the present day locals.[3]\n"
    },
    {
        "link": "/wiki/Bisbee_Deportation",
        "title": "Bisbee Deportation",
        "date": "July 12, 1917",
        "location": "Bisbee, ArizonaJerome, Arizona",
        "paragraph": "Charles Moyer\nWalter S. Douglas,(President of the Phelps Dodge Copper Queen Mine)  John C. Greenway (General Manager of The Calumet and Arizona Mining Company of Warren), Lemuel C. Shattuck (Owner and General Manager of the Shattuck-Denn Mine) Harry Wheeler\n"
    },
    {
        "link": "/wiki/Bisbee_Riot",
        "title": "Bisbee Riot",
        "date": "July 3, 1919",
        "location": "Bisbee, Arizona, United States",
        "paragraph": "The Bisbee Riot, or the Battle of Brewery Gulch, occurred on July 3, 1919, between the black Buffalo Soldiers of the 10th Cavalry and members of local police forces in Bisbee, Arizona.\nFollowing a confrontation between a military policeman and some of the Buffalo Soldiers, the situation escalated into a street battle in Bisbee's historic Brewery Gulch. At least eight people were seriously injured, and fifty soldiers were arrested. This incident was unusual for being between police and military. Most other riots during the Red Summer of 1919 involved wide-scale white rioting against blacks, both sides civilians.[1][2]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Arizona",
        "title": "George Floyd protests in Arizona",
        "date": "May 28, 2020 – October 17, 2020 (4 months, 2 weeks, 5 days)",
        "location": "Arizona, United States",
        "paragraph": "\nThis is a list of George Floyd protests in Arizona, United States. Protests occurred in at least nineteen communities in the state, with protests continuing for five weeks in Phoenix.\n"
    },
    {
        "link": "/wiki/2011_Tucson_shooting",
        "title": "2011 Tucson shooting",
        "date": "January 8, 2011; 12 years ago (2011-01-08) 10:10 a.m. MST (UTC−07:00)",
        "location": "Casas Adobes, Arizona, near Tucson",
        "paragraph": "\nOn January 8, 2011, U.S. Representative Gabby Giffords and 18 others were shot during a constituent meeting held in a supermarket parking lot in Casas Adobes, Arizona, in the Tucson metropolitan area. Six people were killed, including federal District Court Chief Judge John Roll; Gabe Zimmerman, one of Giffords's staffers; and a 9-year-old girl, Christina-Taylor Green.[7][8][9][10][11] Giffords was holding the meeting, called \"Congress on Your Corner\", in the parking lot of a Safeway store when Jared Lee Loughner drew a pistol and shot her in the head before proceeding to fire on other people.[8][9] One additional person was injured in the immediate aftermath of the shooting.[12] News reports identified the target of the attack to be Giffords, a Democrat representing Arizona's 8th congressional district.[8] She was shot through the head at point-blank range, and her medical condition was initially described as \"critical\".[8][9]\n"
    },
    {
        "link": "/wiki/Americans_for_Responsible_Solutions",
        "title": "Americans for Responsible Solutions",
        "date": "",
        "location": "Washington, D.C.",
        "paragraph": "\nAmericans for Responsible Solutions (ARS) was a United States non-profit organization and super PAC that supports gun control.[2][3] The group's stated goal was \"to encourage elected officials to stand up for solutions to prevent gun violence and protect responsible gun ownership.\"[4] It typically supported Democratic politicians in elections.[5] In 2016, the organization merged with the Law Center to Prevent Gun Violence to become Giffords.[6]\n"
    },
    {
        "link": "/wiki/2012_Arizona%27s_8th_congressional_district_special_election",
        "title": "2012 Arizona's 8th congressional district special election",
        "date": "",
        "location": "",
        "paragraph": "Gabby Giffords\nDemocratic\nRon Barber\nDemocratic\n"
    },
    {
        "link": "/wiki/Barack_Obama_Tucson_memorial_speech",
        "title": "Barack Obama Tucson memorial speech",
        "date": "",
        "location": "",
        "paragraph": "Barack Obama, then-president of the United States, delivered a speech at the Together We Thrive: Tucson and America memorial on January 12, 2011, held in the McKale Center on the University of Arizona campus.\nIt honored the victims of the 2011 Tucson shooting and included themes of healing and national unity. Watched by more than 30 million Americans,[1] it drew widespread praise from politicians and commentators across the political spectrum and from abroad.\n"
    },
    {
        "link": "/wiki/Ron_Barber",
        "title": "Ron Barber",
        "date": "",
        "location": "",
        "paragraph": "\nRonald Sylvester Barber (born August 25, 1945) is an American politician. He was a member of the United States House of Representatives from 2012 to 2015. Barber, a member of the Democratic Party from Arizona, served as district director for U.S. Representative Gabby Giffords before Giffords resigned her seat due to the severe injuries she sustained in an assassination attempt, during which Barber was also injured. He won the Democratic nomination for the special election to finish Giffords's term[1] and was sworn into office on June 19, 2012.[1]\n"
    },
    {
        "link": "/wiki/Casas_Adobes,_Arizona",
        "title": "Casas Adobes, Arizona",
        "date": "",
        "location": "",
        "paragraph": "\nCasas Adobes (Spanish: \"Adobe Houses\") is an unincorporated community and census-designated place (CDP) located in the northern metropolitan area of Tucson, Arizona (in Pima County). The population was 66,795 at the 2010 census. Casas Adobes is situated south and southwest of the town of Oro Valley, and west of the community of Catalina Foothills.\n"
    },
    {
        "link": "/wiki/Gabby_Giffords",
        "title": "Gabby Giffords",
        "date": "",
        "location": "",
        "paragraph": "\nGabrielle Dee Giffords (born June 8, 1970) is an American retired politician and gun control advocate who served as a member of the United States House of Representatives representing Arizona's 8th congressional district from January 2007 until January 2012, when she resigned due to a severe brain injury suffered during an assassination attempt. A member of the Democratic Party, she was the third woman in Arizona's history to be elected to the U.S. Congress.\n"
    },
    {
        "link": "/wiki/Christina-Taylor_Green",
        "title": "2011 Tucson shooting",
        "date": "January 8, 2011; 12 years ago (2011-01-08) 10:10 a.m. MST (UTC−07:00)",
        "location": "Casas Adobes, Arizona, near Tucson",
        "paragraph": "\nOn January 8, 2011, U.S. Representative Gabby Giffords and 18 others were shot during a constituent meeting held in a supermarket parking lot in Casas Adobes, Arizona, in the Tucson metropolitan area. Six people were killed, including federal District Court Chief Judge John Roll; Gabe Zimmerman, one of Giffords's staffers; and a 9-year-old girl, Christina-Taylor Green.[7][8][9][10][11] Giffords was holding the meeting, called \"Congress on Your Corner\", in the parking lot of a Safeway store when Jared Lee Loughner drew a pistol and shot her in the head before proceeding to fire on other people.[8][9] One additional person was injured in the immediate aftermath of the shooting.[12] News reports identified the target of the attack to be Giffords, a Democrat representing Arizona's 8th congressional district.[8] She was shot through the head at point-blank range, and her medical condition was initially described as \"critical\".[8][9]\n"
    },
    {
        "link": "/wiki/Jared_Lee_Loughner",
        "title": "Jared Lee Loughner",
        "date": "",
        "location": "",
        "paragraph": "\nJared Lee Loughner (/ˈlɒfnər/; born September 10, 1988)[1] is an American mass murderer who pled guilty to 19 charges of murder and attempted murder in connection with the January 8, 2011, Tucson shooting, in which he shot and severely injured U.S. Representative Gabby Giffords, and killed six people, including Chief U.S. District Court Judge John Roll, Gabe Zimmerman, a member of Giffords' staff, and a 9-year-old girl, Christina-Taylor Green.[2][3][4][5][6] Loughner shot and injured a total of 13 people, including one man who was injured while subduing him.[7]\n"
    },
    {
        "link": "/wiki/John_Roll",
        "title": "John Roll",
        "date": "",
        "location": "",
        "paragraph": "\nJohn McCarthy Roll (February 8, 1947 – January 8, 2011) was a United States district judge who served on the United States District Court for the District of Arizona from 1991 until his murder in 2011, and as chief judge of that court from 2006 to 2011. With degrees from the University of Arizona College of Law and University of Virginia School of Law, Roll began his career as a court bailiff in Arizona and became an assistant city attorney of Tucson, Arizona in 1973. Later that year, Roll became a deputy county attorney for Pima County, Arizona until 1980, when he began serving as an Assistant United States Attorney for seven years. President George H. W. Bush appointed Roll to a federal judge seat in Arizona after Roll served four years as a state judge.\n"
    },
    {
        "link": "/wiki/Gabe_Zimmerman",
        "title": "2011 Tucson shooting",
        "date": "January 8, 2011; 12 years ago (2011-01-08) 10:10 a.m. MST (UTC−07:00)",
        "location": "Casas Adobes, Arizona, near Tucson",
        "paragraph": "\nOn January 8, 2011, U.S. Representative Gabby Giffords and 18 others were shot during a constituent meeting held in a supermarket parking lot in Casas Adobes, Arizona, in the Tucson metropolitan area. Six people were killed, including federal District Court Chief Judge John Roll; Gabe Zimmerman, one of Giffords's staffers; and a 9-year-old girl, Christina-Taylor Green.[7][8][9][10][11] Giffords was holding the meeting, called \"Congress on Your Corner\", in the parking lot of a Safeway store when Jared Lee Loughner drew a pistol and shot her in the head before proceeding to fire on other people.[8][9] One additional person was injured in the immediate aftermath of the shooting.[12] News reports identified the target of the attack to be Giffords, a Democrat representing Arizona's 8th congressional district.[8] She was shot through the head at point-blank range, and her medical condition was initially described as \"critical\".[8][9]\n"
    },
    {
        "link": "/wiki/Valentine_Sally",
        "title": "Murder of Carolyn Eaton",
        "date": "",
        "location": "",
        "paragraph": "\nCarolyn Celeste Eaton (October 1, 1964 – c. February 1982) was a formerly unidentified American teenager from Bellefontaine Neighbors, Missouri, who was found murdered along Interstate 40 in Williams, Arizona, on Valentine's Day 1982. The young woman had been last seen alive with an unidentified older man on February 4, 1982, at the Monte Carlo Truck Stop near Ash Fork, Arizona.\n"
    }
]