{
    "0": {
        "link": "/wiki/Ricky_Ray_Rector",
        "title": "Ricky Ray Rector",
        "date": "March 21/24, 1981",
        "year": "1981",
        "location": "",
        "state": "Arkansas",
        "place": "Conway",
        "county": "Conway County",
        "paragraph": "Ricky Ray Rector (January 12, 1950 – January 24, 1992) was an American convicted murderer who was executed for the 1981 murder of police officer Robert Martin in Conway, Arkansas. After killing a man in a restaurant and fleeing, Rector spent three days on the run before he agreed to turn himself in. However, instead of giving himself up, he shot the police officer who had negotiated his surrender in the back. He then shot himself in the head in a suicide attempt. The attempt effectively resulted in a lobotomy.[1]\nA 1991 request for a writ of certiorari to the Supreme Court was denied, with Justice Thurgood Marshall dissenting.[2] Despite Rector's mental state, then-Arkansas Governor Bill Clinton made a point of returning to Arkansas to oversee Rector's January 24, 1992, execution during the 1992 U.S. presidential election campaign.\nOn March 21, 1981, Rector and some friends drove to a dance hall at Tommy's Old-Fashioned Home-Style Restaurant in Conway. When one friend who could not pay the $3 cover charge was refused entry, Rector became incensed and pulled a .38 caliber pistol from his waist band. He fired several shots, wounding two and killing a third man named Arthur D. Criswell, who died almost instantly after being struck in the throat and forehead.[3]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "1": {
        "link": "/wiki/Murder_of_Connie_Franklin",
        "title": "Murder of Connie Franklin",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Stone County",
        "county": "Stone County",
        "paragraph": "Connie Franklin (c. 1896–1932) was an American man who became widely known in the United States for testifying at his own murder trial in 1929. Franklin was known in the popular press as the \"Arkansas Ghost\".[1]\nIn January 1929, Connie Franklin moved to the town of St. James in Stone County, Arkansas. At the time, he claimed to be 22 years old, and  worked cutting timber and as a farm hand. Soon after his arrival in the area he began courting a local 16-year-old girl, surname Ruminer, whose given name is reported variously as Tillar,[2] Tillir,[3] Tiller,[4] and Tillie.[5] In March 1929, Franklin disappeared. After an investigation, Sheriff Sam Johnson presented Bertha Burns and Tillar Ruminer as his evidence to a grand jury, but as there were at that time no witnesses willing to testify, the Grand Jury took no action in the case.[6]\nIn the fall of 1929 Bertha Burns, who had found the bloody hat that supposedly belonged to Franklin back in the Spring, contacted Johnson and brought him to a pit of ashes not far from her home, claiming that there might be the evidence of Franklin's murder in the pit. Johnson found some bone fragments and teeth, which he took to the Arkansas state health officer, Dr. C. W. Garrison, who determined that at least one of the shards came from a human skull.[6]\n",
        "type": [
            "murder"
        ]
    },
    "2": {
        "link": "/wiki/Murder_of_Kacie_Woody",
        "title": "Murder of Kacie Woody",
        "date": "December 4, 2002(2002-12-04) (aged 13) Conway, Arkansas, United States",
        "year": "2002",
        "location": "",
        "state": "Arkansas",
        "place": "Conway",
        "county": "Conway County",
        "paragraph": "\nKacie Rene Woody (October 17, 1989 – December 4, 2002) was an American teenager from Holland, Arkansas, who was catfished, abducted, and murdered by 47-year-old David Leslie Fuller,[2] from La Mesa, California, whom she met in a Yahoo Christian chat room for teens. Fuller had given his name as Dave Fagen, claimed to be a 17-year-old living in San Diego, and used a photo of a younger male on his profile.[3] Fuller traveled to Arkansas, and abducted Kacie from her home on the night of December 3, 2002. The next day, her body was found in the rear of a minivan inside a storage unit in Conway, along with the body of Fuller. After he had shot her, he also shot himself, as law enforcement closed in on the unit.[4] Kacie's case has been featured on the Investigation Discovery documentary shows Web of Lies[5] and Man with a Van,[6] and the podcast Crime Junkie. It is possibly the first well-documented case of a pedophile using the Internet to groom, abduct, and murder a victim.\nSince Kacie's murder, her friends and family founded the Kacie Woody Foundation, which is designed to educate parents and children about dangers associated with the Internet.\n",
        "type": [
            "murder"
        ]
    },
    "3": {
        "link": "/wiki/Read_Fletcher",
        "title": "Read Fletcher",
        "date": "November 21, 1889(1889-11-21) (aged 59–60) Pine Bluff, Arkansas, U.S.",
        "year": "1889",
        "location": "",
        "state": "",
        "place": "Pine Bluff",
        "county": "Jefferson County",
        "paragraph": "\nRead Fletcher (c. 1829 – November 21, 1889) was an American politician, lawyer, co-founder and editor of the Pine Bluff Graphic.[1] Besides service on state court benches,[2] he represented Jefferson County in the Arkansas House of Representatives.[3] He previously served with the Confederate army during the Civil War.[4]\n\n",
        "type": []
    },
    "4": {
        "link": "/wiki/Brandon_Dewayne_Johnson",
        "title": "Brandon Dewayne Johnson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "Brandon Dewayne Johnson (born January 18, 1988) is an American spree killer who killed three men and wounded eight others during a series of violent robberies between September 2008 and January 2009 in Little Rock, Arkansas. After he was found to be mentally disabled, Johnson pleaded guilty to three counts of first degree murder and other charges and was sentenced to 100 years in prison.\nIn September 2008, Johnson, who was on probation for a misdemeanor car theft and a misdemeanor check fraud charge, embarked on a violent crime spree in Little Rock, Arkansas. He committed multiple armed robberies. Most of the victims were Hispanic. Three men were killed and eight others were wounded. Johnson later pleaded guilty to four specific shootings, including all of the fatal ones. He used a .380-caliber handgun to commit his crimes.[1]\nOn November 15, Armando Guerrero and his friend, Andy Tapia, were leaving a friend's apartment when Johnson approached them and asked to use cellphone. When Tapia and Guerrero said they didn’t have a phone, Johnson robbed them at gunpoint. Afterwards, he shot Guerrero in the torso. Guerrero survived his injuries.[2]\n",
        "type": [
            "shooting",
            "robber",
            "murder",
            "theft",
            "robberies"
        ]
    },
    "5": {
        "link": "/wiki/Lynching_of_John_Harrison",
        "title": "Lynching of John Harrison",
        "date": "February 2, 1922",
        "year": "1922",
        "location": "Malvern, Hot Spring County, Arkansas",
        "state": "Arkansas",
        "place": "Spring County",
        "county": "Ouachita County",
        "paragraph": "John Henry Harrison (also referred to as Harry Harrison[1] and John Harris[2]) was a 38-year-old African-American man who was lynched in Malvern, Hot Spring County, Arkansas, by masked men on February 2, 1922. According to the United States Senate Committee on the Judiciary it was the 10th of 61 lynchings in America and 1 of 5 lynchings in the State of Arkansas during 1922.[1]\nAccording to the 1920 census John Harrison was thirty-eight years old, married, and worked as a laborer in a Malvern lumber mill.[3] In 1917, when he registered for the military draft, he was living at 405 Vine Street in Malvern.[4] In early 1922 he began to show troubling behavior including stalking and threatening women. One of these woman reported his actions to Hot Spring County, Arkansas Sheriff Donald F. Bray who arrested Harrison in February 1922.[3]\nWord of his arrest and that he was harassing white women spread and a mob quickly gathered on the evening of February 2, 1922. Sheriff Bray, fearing a lynching, tried to spirit Harrison out of the town by road to Arkadelphia, Arkansas, but found all roads blocked. He then tried to smuggle him out by train hiding him under a seat in the segregated \"colored\" section of the train around 10:30 PM. Just before the train could leave, a group of around 20 men stopped the train and went from car to car searching for Harrison. He was discovered, dragged a short distance away, and shot at least seventeen times.[3] [5]\n",
        "type": [
            "lynching",
            "riot"
        ]
    },
    "6": {
        "link": "/wiki/William_U._McCabe",
        "title": "William U. McCabe",
        "date": "May 6, 1931(1931-05-06) (aged 51) Little Rock, Arkansas",
        "year": "1931",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "William U. McCabe (1880 – May 5, 1931) was an attorney and politician from Mountain Home, Arkansas. He served in the Arkansas Senate from 1921 to 1924, and the Arkansas House of Representatives from January 1931 until his death on May 6, 1931. McCabe worked to reform the Arkansas Constitution and state highway funding system during a period of good government reforms in the state.\nMcCabe entered government by serving in the 1918 constitutional convention to replace the 1874 Arkansas Constitution. The proposed constitution included women's suffrage, but was not ratified.[1]\nThroughout his political career, McCabe fought to increase highway funding for small, rural counties like Baxter County. He introduced bills in 1924[2] and 1931.\n",
        "type": []
    },
    "7": {
        "link": "/wiki/New_Gascony,_Arkansas",
        "title": "New Gascony, Arkansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Gascony",
        "county": "Jefferson County",
        "paragraph": "\nNew Gascony is an unincorporated community in Bogy township, Jefferson county, Arkansas, 13 miles (21 km) west of Pine Bluff, the county seat. It was founded by French Peninsular War veteran and Indian trader Antoine Barraque on November 29, 1832,[1][2] and named for the Gascony region of France.[3]\nIt is a part of the Pine Bluff School District.[4] The schools serving New Gascony are Park/Greenville School for preschool, James Matthews Elementary School, Robert F. Morehead Middle School, and Dollarway High School.\n",
        "type": []
    },
    "8": {
        "link": "/wiki/Lynching_of_Owen_Flemming",
        "title": "Lynching of Owen Flemming",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Mellwood",
        "county": "Phillips County",
        "paragraph": "\nOwen Flemming or Flemings[1] was an African-American man who was lynched by a mob near Mellwood, Arkansas, on June 8, 1927, after an altercation with a white man who attempted to force him to work on a levee during the Great Mississippi Flood of 1927.\nFlemming was one of many Black citizens who were forced to assist, often at gunpoint, with rescue operations and levee strengthening following the Great Mississippi Flood of 1927. White officials rounded up Black citizens of all layers of society (including business men, doctors, and preachers) and put them to work strengthening levees. According to the Pittsburgh Courier, a national African-American weekly newspaper, the Black laborers were coerced to work without food and many were not allowed to change into workwear.[2] White citizens were excluded from partaking in this labor. Nonetheless, according to the Courier, some white men \"volunteered to go down and help force the Negroes to work with the aid of a shot gun.\"[2] In Helena, Arkansas, white police officers walked into a Black church during the service and made the men of the congregation work on the levees.[2]\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "9": {
        "link": "/wiki/Westside_Middle_School_massacre",
        "title": "1998 Westside Middle School shooting",
        "date": "March 24, 1998 c. 12:40 p.m. (Central Time)",
        "year": "1998",
        "location": "Craighead County (Jonesboro street address), Arkansas, United States",
        "state": "Arkansas",
        "place": "Jonesboro",
        "county": "Craighead County",
        "paragraph": "\nThe Westside Middle School shooting was a school shooting on March 24, 1998, at Westside Middle School in unincorporated Craighead County, Arkansas near the city of Jonesboro.[1] Perpetrators Mitchell Johnson, 13, and Andrew Golden, 11, fatally shot four students and a teacher with multiple weapons, and both were arrested when they attempted to flee the scene. Ten others were wounded. Golden and Johnson were convicted of five murders and ten assaults, and were imprisoned until each turned 21 years of age. After the 1992 Lindhurst High School shooting that killed four people in Olivehurst, California, the massacre was the deadliest non-college school shooting[2] in contemporary U.S. history until the April 1999 Columbine High School massacre.\nOn the night before the shooting, Golden assisted Johnson in loading his mother's Dodge Caravan with camping supplies, snack foods, nine weapons (Remington 742 .30-06 rifle, Universal .30 M1 carbine replica, Ruger .44 Magnum rifle, Smith & Wesson .38 Special revolver, Double Deuce Buddie .22 caliber two-shot derringer, FIE .380 pistol, Star .380 pistol, Ruger Security Six .357 revolver, Davis Industries .38 two-shot derringer and a Charter Arms .38 Special revolver),[3] all of which had been stolen from Golden's grandfather's house, and 2,000 rounds of ammunition.\n",
        "type": [
            "mass shooting",
            "shooting",
            "assault",
            "mass murder",
            "murder"
        ]
    },
    "10": {
        "link": "/wiki/Raphel_Cherry",
        "title": "Raphel Cherry",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Raphel Jerome Cherry (born December 19, 1961) is a former American football defensive back in the National Football League for the Washington Redskins and the Detroit Lions.  He played college football at the University of Hawaii.\nIn 1999, Cherry was convicted of first degree murder in the death of his wife.  He was initially sentenced to life imprisonment,[1] but upon appeal of his conviction, his sentence was reduced to 30 years. Cherry's estimated release date is January 9, 2029.[2]\nThis biographical article relating to an American football defensive back born in the 1960s is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder"
        ]
    },
    "11": {
        "link": "/wiki/Eric_Nance",
        "title": "Eric Nance",
        "date": "October 11, 1993",
        "year": "1993",
        "location": "",
        "state": "Arkansas",
        "place": "Hot Springs",
        "county": "Garland County",
        "paragraph": "Eric Randall Nance (January 9, 1960 – November 28, 2005) was an American man who was convicted of murder in the state of Arkansas. Nance was executed in 2005.\nOn October 11, 1993, 18-year-old Julie Heath (June 11, 1975 – October 11, 1993) was driving on U.S. Highway 270 between Malvern and Hot Springs, Arkansas, to visit her boyfriend in Hot Springs. Nance stated that he stopped to help Heath after her car broke down and offered her a ride to Malvern. The prosecution said that Nance then raped and murdered her. He was later seen in a convenience store wearing no shoes, socks, or shirt. According to the clerk, there appeared to be fresh dark, damp stains on his overalls.[1]\nHeath's body was found on October 18, 1993, by a hunter. Her throat had been cut. Photographs of the scene show that she was fully clothed, but her belt buckle was partially undone, her pants zipper was not fully up, and the left shoulder of her shirt was torn. The shirt was also on inside out. The medical examiner also reported that her socks and panties were on inside out and her bra was pulled up around the neck and shoulder area. A pubic hair located in Nance's pickup was said by an expert to be microscopically identical to that of Heath.[1]\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "12": {
        "link": "/wiki/Kim_Mills",
        "title": "Murder of Jimmy Hendricks and Kim Mills",
        "date": "June 17, 1978 (1978-06-17)",
        "year": "1978",
        "location": "Pemiscot County, Missouri, United States",
        "state": "Arkansas",
        "place": "Mississippi County",
        "county": "Mississippi County",
        "paragraph": "James Hendricks and Kimberlin Mills (known as Jimmy and Kim respectively) are American murder victims who were discovered on June 17, 1978. The pair were believed to have been seen together at a truck stop in Missouri, which is where the murders are presumed to have taken place. Hendricks was left at the crime scene, while Mills was found in Mississippi County, Arkansas.[1][2]\nHendricks was identified in May 2017; Mills' identity was confirmed in late 2017, and publicly released in early February 2018.[3] Neither had been reported missing. Both were from Michigan.[4]\nThe bodies later identified as Hendricks and Mills were discovered on June 17, 1978 in Pemiscot County, Missouri, and Blytheville, Arkansas, respectively. Although they were found fifteen miles from each other, they were likely murdered by the same person, as the pair were reportedly seen together before the murders at a truck stop in the same town and were believed to have been dropped off by a man.[5]\n",
        "type": [
            "murder"
        ]
    },
    "13": {
        "link": "/wiki/David_Dewayne_Johnson",
        "title": "David Dewayne Johnson",
        "date": "September 2, 1989",
        "year": "1989",
        "location": "",
        "state": "",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "David Dewayne Johnson (January 10, 1963 – December 19, 2000) was an American murderer executed for the 1989 murder of Leon Brown, 67, in Little Rock, Arkansas.[1]\nOn September 2, 1989, Johnson entered a warehouse and convinced the night watchman, 67-year-old Leon Brown, that he needed to use the telephone to get his car, a white Oldsmobile, out of a ditch nearby. Dudley Swann, the principal stockholder in Little Rock Crate and Basket identified Johnson as the driver of the white Oldsmobile. Swann had earlier asked Johnson to leave and come back the next day to get his car because he did not want the driver on the premises after dark. Brown was found later beaten to death with a 2x4 in a pool of blood. Johnson's fingerprints were found at the scene and Johnson was in possession of property stolen from the warehouse.[1][2]\nOn November 30, 1990, Johnson was convicted of capital murder and sentenced to death.[2][3] He later appealed his sentence by claiming his lawyer was manic-depressive and incapable of defending an accused murderer. His original lawyer's law license had also been suspended in 1993, after Johnson's conviction.[2]\n",
        "type": [
            "murder"
        ]
    },
    "14": {
        "link": "/wiki/Progressive_Farmers_and_Household_Union_of_America",
        "title": "Progressive Farmers and Household Union of America",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Elaine",
        "county": "Phillips County",
        "paragraph": "The Progressive Farmers and Household Union of America was a union of African-American tenant farmers and sharecroppers, organized by Robert L. Hill. A meeting of this union near Elaine, Arkansas, was disrupted on the evening of September 30, 1919. The fatal shooting of a white man sparked retaliation by whites; hundreds poured into the area, attacking blacks on sight and resulting in the Elaine Race Riot, believed to be the deadliest in American history.\nThe Progressive Farmers and Household Union of America was formed by Robert L. Hill of Winchester, Arkansas, a black tenant farmer. He claimed chapters in 15 to 20 counties, and the union had several lodges in the Elaine area. \nIn late 1919 the union organized resistance among blacks in the Elaine area: black women stopped working in domestic positions in white households, and the union demanded higher wages for cotton pickers. The union had also hired lawyers at the state capital and planned to sue landlords for shares allegedly withheld from tenant farmers and sharecroppers.\n",
        "type": [
            "shooting",
            "riot"
        ]
    },
    "15": {
        "link": "/wiki/Sandford_C._Faulkner",
        "title": "Sandford C. Faulkner",
        "date": "August 4, 1874(1874-08-04) (aged 71) Little Rock, Arkansas, U.S.",
        "year": "1874",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nSandford C. Faulkner (March 3, 1803 – August 4, 1874), better known as Sandy Faulkner, was an American planter, raconteur and fiddler who personified the mid-19th century folk song \"Arkansas Traveler,\" for which he received writing credit. It has since gone on to become the official state historic song of Arkansas.\nSandford C. Faulkner was born in Georgetown, Kentucky on March 3, 1803 to Nicholas and Sally (née  Fletcher) Faulkner.[1] He was responsible in large part for the story forming the basis of the \"Arkansas Traveler\",[2][3] which was the official song of Arkansas from 1949 to 1963, and the state historical song since 1987.[4] During the American Civil War, he served as an artillery officer detailed to ordnance duty in the Trans-Mississippi Department of the Confederate States Army.[5]\n",
        "type": []
    },
    "16": {
        "link": "/wiki/1889_Forrest_City_riot",
        "title": "1889 Forrest City riot",
        "date": "May 18–19, 1889",
        "year": "1889",
        "location": "Forrest City, Arkansas, United States",
        "state": "Arkansas",
        "place": "Forrest City",
        "county": "St. Francis County",
        "paragraph": "\nThe 1889 Forrest City riot was a period of civil unrest in Forrest City, Arkansas, United States. The riot began on May 18 and concluded the following day.\nThe conflict had its roots in recent political developments within St. Francis County, of which Forrest City was the county seat. During the late 1880s, the Union Labor Party, which was made up of labor and agricultural activists from groups such as the Agricultural Wheel, formed an alliance with the Republican Party and won several elected positions in the county government in the 1888 elections. This development upset many white Democrats in the county, as the election saw many African Americans elected on the fusion ticket. The following year, elections were scheduled for the county's school board, and there was a possibility that African Americans could win a majority of seats on the institution. On May 18, election day, a fight broke out between Americus M. Neely, an African American school board member, and a white member of the board at a polling place. In the aftermath, shots were fired by members of both parties, resulting in several deaths. Neely fled the scene and barricaded himself in the offices of his local newspaper, though he was killed by militia members the following day.\n",
        "type": [
            "riot"
        ]
    },
    "17": {
        "link": "/wiki/Murder_of_Donald_Lehman",
        "title": "Murder of Donald Lehman",
        "date": "August 3, 1994(1994-08-03) (aged 37) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "1994",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Donald Lehman (1933 – January 8, 1981) was an American man who was murdered in front of his family by four men in Arkansas. All four men: James William Holmes, Hoyt Franklin Clines, Michael Orndorff, and Darryl Richley, were convicted of capital murder and sentenced to death, albeit Orndorff's sentence was reduced to life without parole on appeal. The other three were all executed one by one on August 3, 1994. It was the first triple execution in the United States in the modern era.[1]\nDonald Lehman, his wife, Virginia, and their daughter, Vicki, were at their home when four men wearing ski masks rang the doorbell and forced their way inside. Lehman was shot three times and severely beaten with a motorcycle drive chain in front of his family. More than $1,000 and several guns were stolen, according to court documents. Holmes, Richley, Clines, and Orndorff were arrested later that day. They were each convicted of capital murder and sentenced to death. Orndorff later had his sentence overturned on appeal, and Lehman's family agreed to a life sentence in his case.[2][3][4]\nAfter the U.S. Supreme Court rejected arguments they were being treated like \"hogs at a slaughter\", Clines, Richley, and Holmes were all executed by lethal injection on August 3, 1994. All three of them declined to make final statements. Clines was executed first, and was pronounced dead at 7:11 p.m. Richley was pronounced dead 58 minutes later, followed by Holmes at 9:24 p.m.[5]\n",
        "type": [
            "murder"
        ]
    },
    "18": {
        "link": "/wiki/Frank_Dalton",
        "title": "Frank Dalton",
        "date": "November 27, 1887(1887-11-27) (aged 28) Oklahoma, United States",
        "year": "1887",
        "location": "",
        "state": "Arkansas",
        "place": "Fort Smith",
        "county": "Sebastian County",
        "paragraph": "John Franklin \"Frank\" Dalton (June 8, 1859 – November 27, 1887) was a Deputy US Marshal of the Old West under Judge Isaac Parker (the hangin' judge), for Oklahoma Territory, as well as the older brother to the members of the Dalton Gang, in addition to being the brother to William M. Dalton, once a member of California legislature, and later an outlaw and leader of the Doolin Dalton gang alongside Bill Doolin. Frank Dalton is not to be confused with J. Frank Dalton (1848-1951), who made many claims to be famous people, including his claim of being Frank Dalton, and later Jesse James.\nDalton was commissioned as a Deputy US Marshal, serving under Judge Parker, and quickly developed a reputation as being a brave lawman.[1] Based out of Fort Smith, Arkansas, Dalton was involved in a number of shootouts and high risk arrests over a three-year period. However, on November 27, 1887, he and Deputy J.R. Cole were on the trail of outlaw Dave Smith, wanted for horse theft. As they approached Smith's camp, Smith fired a shot from a rifle, hitting Dalton in the chest. Deputy Cole returned fire, killing Smith, but was then shot and wounded by a Smith cohort. Cole was able to make his escape believing Dalton was dead. Dalton, however, was still alive, and engaged the outlaws in a short gunbattle. One of Smith's cohorts was wounded, and a woman who was in the camp was killed during the crossfire. Frank Dalton was shot and killed near the Arkansas River by the time Deputy Cole returned with a posse, having been killed with two additional rifle shots by outlaw Will Towerly.[2] The outlaw wounded by Dalton never revealed his own name. He died shortly thereafter, but not before naming Towerly as Frank Dalton's murderer. A newspaper of the time indicated Dalton had begged Towerly not to kill him, saying he was already dying. However, that was a rumour, and there were no witnesses to the crime who ever made that statement. Towerly was killed one month later by Deputy William Moody and Deputy US Marshal Ed Stokley.[3] Stokley was also killed during the gunfight. Dalton was buried in Elmwood Cemetery in Coffeyville, Kansas, not far from the graves of his two outlaw brothers, Grat and Bob. (One can see the graves of Bob, and Grat just to the left of Frank's grave about 30 yards (27 m) back with the original hitching post that they tied their horses to) [4]\nThe actor Robert Lansing played Frank Dalton in the NBC television series Outlaws in a two-part episode \"The Daltons Must Die\", which aired early in 1961.[5]\n",
        "type": [
            "murder",
            "killing",
            "theft"
        ]
    },
    "19": {
        "link": "/wiki/James_William_Holmes",
        "title": "Murder of Donald Lehman",
        "date": "August 3, 1994(1994-08-03) (aged 37) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "1994",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Donald Lehman (1933 – January 8, 1981) was an American man who was murdered in front of his family by four men in Arkansas. All four men: James William Holmes, Hoyt Franklin Clines, Michael Orndorff, and Darryl Richley, were convicted of capital murder and sentenced to death, albeit Orndorff's sentence was reduced to life without parole on appeal. The other three were all executed one by one on August 3, 1994. It was the first triple execution in the United States in the modern era.[1]\nDonald Lehman, his wife, Virginia, and their daughter, Vicki, were at their home when four men wearing ski masks rang the doorbell and forced their way inside. Lehman was shot three times and severely beaten with a motorcycle drive chain in front of his family. More than $1,000 and several guns were stolen, according to court documents. Holmes, Richley, Clines, and Orndorff were arrested later that day. They were each convicted of capital murder and sentenced to death. Orndorff later had his sentence overturned on appeal, and Lehman's family agreed to a life sentence in his case.[2][3][4]\nAfter the U.S. Supreme Court rejected arguments they were being treated like \"hogs at a slaughter\", Clines, Richley, and Holmes were all executed by lethal injection on August 3, 1994. All three of them declined to make final statements. Clines was executed first, and was pronounced dead at 7:11 p.m. Richley was pronounced dead 58 minutes later, followed by Holmes at 9:24 p.m.[5]\n",
        "type": [
            "murder"
        ]
    },
    "20": {
        "link": "/wiki/Richard_Snell_(criminal)",
        "title": "Richard Snell (criminal)",
        "date": "November 3, 1983–June 30, 1984",
        "year": "1983",
        "location": "",
        "state": "Arkansas",
        "place": "Elijah",
        "county": "Crittenden County",
        "paragraph": "Richard Wayne Snell (May 21, 1930 – April 19, 1995) was an American white supremacist convicted of killing of two people in Arkansas between November 3, 1983 and June 30, 1984. Snell was sentenced to death for one of the murders, and executed by lethal injection in 1995.[1]\nRichard Snell was a member of the white supremacist group The Covenant, The Sword, and the Arm of the Lord (known as the CSA), which was started in 1971 in the small community of Elijah, Missouri, by polygamist James Ellison. He was also a believer in the Christian Identity religion, and frequented Elohim City, a private community located in Oklahoma. The Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) had ongoing investigations into the organization. By the end of their operations, the ATF obtained 155 Krugerrands (gold coins), one live light antitank rocket (LAW), 94 long guns, 30 handguns, 35 sawed-off shotguns and machine guns, one light machine gun (a Japanese copy of the World War I Lewis, in .303 caliber), and three and a half bars of C-4 explosives.[2] Much of this arsenal had been stolen.[citation needed]\nSnell was involved in the filming of planes that landed at Mena Intermountain Municipal Airport in Mena, Arkansas, thought of by Snell and many conspiracy theorists to be used in a government-sanctioned operation of the Central Intelligence Agency (CIA) to smuggle drugs into the United States. Snell had claimed that law enforcement agencies, both state and those local to that area of western Arkansas, were involved in the cover-up of the Mena airport drug smuggling. He had also made claims that he had filmed the then-Governor of Arkansas, Bill Clinton, at Mena Intermountain Municipal Airport, but that claim has never been proven. Snell further claimed that one of the Arkansas state troopers assigned to Clinton's security team at that time had beaten Snell's wife in an attempt to force her to reveal the location of the alleged video footage Snell had taken at the airport.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "21": {
        "link": "/wiki/Lynching_of_Mr_Norman",
        "title": "Lynching of Mr Norman",
        "date": "February 11, 1922",
        "year": "1922",
        "location": "Texarkana, Miller County, Arkansas",
        "state": "Arkansas",
        "place": "Miller County",
        "county": "Miller County",
        "paragraph": "Mr. Norman (referree to as P. Norman[1] and N. Norman[2]) was an African-American man who was lynched in Texarkana, Miller County, Arkansas by masked men on February 11, 1922. According to the 1926 report of the United States Senate Committee on the Judiciary, this was  the 12th of 61 lynchings during 1922 in the United States. [3]\nTexarkana is a city that straddles the state border of Texas and Arkansas. The west of the city is in Bowie County, Texas and the east is in Miller County, Arkansas. It was developed at a 19th-century junction of two major railroads.\nIn February 1922, Deputy Sheriff J.R. Jordan of Texarkana was allegedly held at gunpoint by Norman and forced to drive several miles. At some point later, Norman was arrested and held at Ashdown, Arkansas.[2]\n",
        "type": [
            "lynching",
            "riot"
        ]
    },
    "22": {
        "link": "/wiki/Devil%27s_Knot_(film)",
        "title": "Devil's Knot (film)",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nDevil's Knot is a 2013 American biographical crime drama film directed by Atom Egoyan. Adapted from Mara Leveritt's 2002 book of the same name, the film is about the true story of three murdered children, and the three teenagers known as the West Memphis Three who were convicted of killing them, during the Satanic ritual abuse panic. The teenagers were subsequently sentenced to death (Echols) and life imprisonment (Baldwin and Misskelley), before all were released after eighteen years.[6] Produced by Elizabeth Fowler, Richard Saperstein, Clark Peterson, Christopher Woodrow, and Paul Harris Boardman, the film stars Colin Firth, Reese Witherspoon, Dane DeHaan, Mireille Enos, Bruce Greenwood, Elias Koteas, Stephen Moyer, Alessandro Nivola, Amy Ryan, and Martin Henderson.\nThe film premiered at the 2013 Toronto International Film Festival on September 8.[7][8][9] It had a limited release in Canadian theaters on January 24, 2014,[10] and was released in U.S. theaters and video on demand services on May 9, 2014.[11]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "23": {
        "link": "/wiki/Hartford_coal_mine_riot",
        "title": "Hartford coal mine riot",
        "date": "July 12, 1914",
        "year": "1914",
        "location": "Hartford, Arkansas, United States",
        "state": "Arkansas",
        "place": "Hartford",
        "county": "Sebastian County",
        "paragraph": "The Hartford coal mine riot occurred on July 12, 1914, at Hartford, Arkansas.  In a productive region of a state with 100% of its coal miners represented by the United Mine Workers (UMW), one mine owner attempted to open a non-union shop.  In the resulting conflict, mines were flooded by sabotage, and on July 17 a crowd of union miners and sympathizers destroyed the surface plant of the Prairie Creek coal mine #3 and murdered two non-union miners.[1]\nResulting litigation in federal courts stretched to an out-of-court settlement of a nominal $27,500 in 1927.\nThe coal fields and economic prosperity in Sebastian County, Arkansas, peaked between 1910 and 1920, with the population in Hartford, Arkansas, reaching 4,000 at one point.  The clean burning coal yielded from the mines that stretched all along the Hartford/Hackett/Huntington corridor attracted mining interests.  Incoming miners were mostly of Italian, German, Polish and Greek heritage.[2]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "24": {
        "link": "/wiki/William_A._Lake",
        "title": "William A. Lake",
        "date": "October 15, 1861(1861-10-15) (aged 53) Hopefield, Arkansas, U.S.",
        "year": "1861",
        "location": "",
        "state": "",
        "place": "Hopefield",
        "county": "Crittenden County",
        "paragraph": "William Augustus Lake (January 6, 1808 – October 15, 1861) was an American lawyer and politician who served one term as  a U.S. Representative from Mississippi from 1855 to 1857.\nBorn near Cambridge, Maryland on January 6, 1808, Lake pursued classical studies and was graduated from Jefferson College, Pennsylvania, in 1827. He served as a member of the Maryland House of Delegates in 1831, after which he moved to Vicksburg, Mississippi. He studied law, was admitted to the bar in 1834 and started practicing in Vicksburg. He served as member of the Mississippi State Senate in 1848.\nLake was elected as an American Party candidate to the Thirty-fourth Congress (March 4, 1855 – March 3, 1857). He was an unsuccessful candidate for reelection in 1856 to the Thirty-fifth Congress. He served in the Mississippi House of Representatives from 1859 to 1861, and was its Speaker in the January 1861 session.[1]\n",
        "type": []
    },
    "25": {
        "link": "/wiki/Mark_Gardner_(murderer)",
        "title": "Mark Gardner (murderer)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Sebastian County",
        "county": "Sebastian County",
        "paragraph": "Mark Edward Gardner (May 4, 1956 – September 8, 1999) was an American murderer executed at the age of 43 by lethal injection by the state of Arkansas. He was convicted of the December 12, 1985 murders of Joe and Martha Joyce, as well as the rape and murder of their daughter, Sara Joyce McCurdy, in Sebastian County, Arkansas.\nMark Gardner was 29 when he killed Joe Joyce, his wife Martha and raped and murdered their adult daughter, Sara Joyce McCurdy.\nJoe Joyce had just returned home from a funeral and Sara McCurdy had gone to her parents' home for lunch while her husband was away on Air National Guard duty. The family was tied up and they were suffocated with tape that was placed over their mouths and noses. Martha was found with a wire coat hanger around her neck. Their house was ransacked and jewelry and a car was stolen. Gardner was on parole for an armed robbery conviction and was under an arrest warrant out of Illinois for another armed robbery. Some of the family's jewelry was found on Gardner when he was arrested and he told police that he had also killed a man in New York State. At his trial he claimed that demons had made him do it.\nMark Gardner was accused of repeatedly raping and beating a fellow Death Row inmate who was later released from prison, Damien Echols, who had been convicted for the West Memphis Three murders.\n",
        "type": [
            "murder",
            "robber",
            "robbery",
            "rape"
        ]
    },
    "26": {
        "link": "/wiki/West_of_Memphis",
        "title": "West of Memphis",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Memphis",
        "county": "Phillips County",
        "paragraph": "\nWest of Memphis is a 2012 New Zealand-American documentary film directed and co-written by Amy J. Berg, produced by Peter Jackson and Damien Echols, and released in the US by Sony Pictures Classics to critical acclaim. It received a nomination for Best Documentary Screenplay from the Writers Guild of America.[2]\nAs with the Paradise Lost film and its two sequels, West of Memphis follows the events of the West Memphis Three, a case in which three teenagers (Jessie Misskelley, Damien Echols and Jason Baldwin) were arrested for the murders of three 8-year-old children.[3]\n",
        "type": [
            "murder"
        ]
    },
    "27": {
        "link": "/wiki/Rise_Above:_24_Black_Flag_Songs_to_Benefit_the_West_Memphis_Three",
        "title": "Rise Above: 24 Black Flag Songs to Benefit the West Memphis Three",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nRise Above: 24 Black Flag Songs to Benefit the West Memphis Three is a 2002 tribute album.[2] It consists of covers of Black Flag songs performed by the Rollins Band, with vocalists from various well-known rock, hip hop, punk and metal artists (as well as certain members of Black Flag) singing. All money raised from sales of the album were donated to the legal funds of the West Memphis Three.\nAll tracks are written by Greg Ginn, except where noted.",
        "type": []
    },
    "28": {
        "link": "/wiki/Lavinia_Burnett",
        "title": "Lavinia Burnett",
        "date": "November 8, 1845(1845-11-08) (aged 59–60) Fayetteville, Arkansas",
        "year": "1845",
        "location": "",
        "state": "",
        "place": "Fayetteville",
        "county": "Washington County",
        "paragraph": "Lavinia Burnett (1785 - November 8, 1845[1]) was the first woman to be executed by the state of Arkansas.[2]\nBorn Lavinia May Sharp, she married Virginia native Crawford Burnett on December 29, 1810 in Patrick County. Sometime during the 1820s, they moved to Trigg County, Kentucky and lived in the home of Crawford's brother Cornelius. Sometime later, Lavinia and Crawford eventually settled in Arkansas.[1] They had at least two children, John (b. 1811), and Minerva (b. 1820).\nLavinia and Crawford were arrested for the shooting murder of Jonathan Selby, who lived near Fayetteville and allegedly kept large sums of money at his residence.[2] Their 15-year-old daughter Minerva and Hardin Sharp, Lavinia's brother or cousin, confessed to authorities that their relatives had planned Selby's murder, and John Burnett, Lavinia and Crawford's son, had carried it out.[2][3]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "29": {
        "link": "/wiki/Westside_Middle_School_shooting",
        "title": "1998 Westside Middle School shooting",
        "date": "March 24, 1998 c. 12:40 p.m. (Central Time)",
        "year": "1998",
        "location": "Craighead County (Jonesboro street address), Arkansas, United States",
        "state": "Arkansas",
        "place": "Jonesboro",
        "county": "Craighead County",
        "paragraph": "\nThe Westside Middle School shooting was a school shooting on March 24, 1998, at Westside Middle School in unincorporated Craighead County, Arkansas near the city of Jonesboro.[1] Perpetrators Mitchell Johnson, 13, and Andrew Golden, 11, fatally shot four students and a teacher with multiple weapons, and both were arrested when they attempted to flee the scene. Ten others were wounded. Golden and Johnson were convicted of five murders and ten assaults, and were imprisoned until each turned 21 years of age. After the 1992 Lindhurst High School shooting that killed four people in Olivehurst, California, the massacre was the deadliest non-college school shooting[2] in contemporary U.S. history until the April 1999 Columbine High School massacre.\nOn the night before the shooting, Golden assisted Johnson in loading his mother's Dodge Caravan with camping supplies, snack foods, nine weapons (Remington 742 .30-06 rifle, Universal .30 M1 carbine replica, Ruger .44 Magnum rifle, Smith & Wesson .38 Special revolver, Double Deuce Buddie .22 caliber two-shot derringer, FIE .380 pistol, Star .380 pistol, Ruger Security Six .357 revolver, Davis Industries .38 two-shot derringer and a Charter Arms .38 Special revolver),[3] all of which had been stolen from Golden's grandfather's house, and 2,000 rounds of ammunition.\n",
        "type": [
            "mass shooting",
            "shooting",
            "assault",
            "mass murder",
            "murder"
        ]
    },
    "30": {
        "link": "/wiki/Riley_Dobi_Noel",
        "title": "Riley Dobi Noel",
        "date": "June 4, 1995",
        "year": "1995",
        "location": "",
        "state": "Arkansas",
        "place": "Varner",
        "county": "Lincoln County",
        "paragraph": "Riley Dobi Noel (May 22, 1972 – July 9, 2003) was an American convicted murderer who was executed for the June 1995 murders of Marcell Young, Mustafa Hussian, and Malak Hussian in Varner, Arkansas.[1]\nOn June 4, 1995, Noel, accompanied by Terry Carroll, Curtis Cochran, and Tracy Calloway, were out driving in Little Rock, Arkansas in Cochran's car while getting high on drugs. A week prior, Noel's brother had been killed in a drive-by shooting, and Noel believed that a daughter of a woman he knew was involved and had set up his brother. Seeking revenge, Noel and his acquaintances headed to the home of the woman; Mary Hussian. Once the group arrived at Hussian's home, Noel ordered three of Hussian's children to get down on the floor.[1]\nAfter they did, Noel shot each of the children in the head. He killed 17-year-old Marcell Young, 12-year-old Mustafa Hussian, and 10-year-old Malak Hussian. In another part of the house, Carroll tried to shoot Mary Hussian with a shotgun, however, the gun jammed, and Mary was able to wrestle it away from him. The daughter who Noel suspected was involved in his brother's death was not at the residence during the murders.[1]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "31": {
        "link": "/wiki/Damien_Echols",
        "title": "Damien Echols",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nDamien Wayne Echols (born Michael Wayne Hutchison; December 11, 1974) is an American writer, best known as one of the West Memphis Three, a group of teenagers convicted of a triple murder. Upon his release from death row in 2011 under an Alford plea, Echols authored several autobiographies and spiritual books. He has been featured in multiple books, documentaries, and podcasts about his spiritual works and the West Memphis Three case.\nDamien Wayne Echols was born on December 11, 1974.[1] He lived with his mother and father until their divorce, when he was 8.[1] The family frequently moved and Echols would attend eight schools before the age of ten.[2]\n",
        "type": [
            "murder"
        ]
    },
    "32": {
        "link": "/wiki/Lynching_of_Earnest_Williams",
        "title": "Lynching of Earnest Williams",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Parkdale",
        "county": "Ashley County",
        "paragraph": "Earnest Williams was an African-American man who was lynched by a mob in Parkdale, Ashley County, Arkansas, in 1908. John R. Steelman, who wrote his PhD dissertation on \"mob action in the South\", listed Williams as one of the cases, and said \"Earnest Williams was thrust into eternity by a band of men who were 'outraged' at him for 'using offensive language'.\"[1]\nCoordinates: 33°7′18″N 91°32′51″W﻿ / ﻿33.12167°N 91.54750°W﻿ / 33.12167; -91.54750\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "33": {
        "link": "/wiki/Thomas_Pleasant_Dockery",
        "title": "Thomas Pleasant Dockery",
        "date": "February 26, 1898(1898-02-26) (aged 64) New York, New York, U.S.",
        "year": "1898",
        "location": "",
        "state": "Arkansas",
        "place": "Montgomery County",
        "county": "Montgomery County",
        "paragraph": "\nBrigadier-General Thomas Pleasant Dockery (December 18, 1833 – February 26, 1898) was a senior officer of the Confederate States Army who served in both the Western and Trans-Mississippi theaters of the American Civil War.\nThomas Pleasant Dockery was born in Montgomery County, North Carolina, to Colonel John Dockery, who had participated in the Indian removals in North Carolina. His father moved first to Hardeman County, Tennessee, and then to Columbia County, Arkansas, where he established a large plantation. John Dockery also played a role in establishing the first railroad in Arkansas.\n",
        "type": []
    },
    "34": {
        "link": "/wiki/Arkansas_militias_during_Reconstruction",
        "title": "Arkansas militias during Reconstruction",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "\nThe Arkansas Militia in Reconstruction was deeply involved in the ongoing civil disturbances which plagued the state until the late 1870s.  In the immediate aftermath of the Civil War, the militia was first utilized by the white population to re-establish control over the newly freed black population. Radical Republicans seized control in 1867 and abolished existing state governments and militia organizations, and disenfranchised former Confederates. The new disenfranchised whites turned to the shadow Ku Klux Klan to attempt to maintain social order.  The Reconstructionist government raised a new militia, primarily of black soldiers with white officers and utilized this new \"Black militia\" to put down the rising power of the Ku Klux Klan.  Armed conflicts between rival parties continued in several counties and the militia was called to re-establish control in Pope and Scott Counties.  The most severe conflict of this period occurred during the so-called Brooks–Baxter War with rival parties, with supporting militias, battling for control of the governorship.  With the end of reconstruction one of the first acts of the new resurgent Democratic state legislature was to abolish the office of adjutant general in retaliation for the use of the militia to enforce the rule of the Reconstruction government.\nAfter the fall of Little Rock in September 1863, a pro-Union government was established in Federally occupied Arkansas, under Isaac Murphy.  Governor Murphy appointed Albert W. Bishop, former lieutenant colonel of the Union 1st Arkansas Cavalry, as adjutant general.  Murphy and Bishop established a  pro-Union state militia organization.[1] Immediately following the official end of the Civil War in the summer of 1865, white southerners began to repopulate the local militia and insurgent groups. They worked to re-establish white control over the newly freed African Americans. In some areas, white militia groups tried to disarm returning black Union veterans.\n",
        "type": []
    },
    "35": {
        "link": "/wiki/John_Edward_Swindler",
        "title": "John Edward Swindler",
        "date": "June 18, 1990(1990-06-18) (aged 46) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "1990",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "John Edward Swindler (May 12, 1944 – June 18, 1990) was an American murderer and suspected serial killer who was executed by the state of Arkansas for the 1976 murder of Patrolman Randy Basnett. He was also convicted of the murders of two teenagers: Greg Becknell and Dorothy Rhodes, in Columbia, South Carolina, and was charged but never convicted of the murder of Jeffrey McNerney in Florida. Swindler was the first person to be executed by the state of Arkansas since 1961, and is the only person to have been executed in the electric chair in Arkansas since the reinstatement of capital punishment in 1976.[1]\nJohn Edward Swindler shot and killed Patrolman Randy Basnett in the afternoon of September 24, 1976. Officer Basnett had stopped at a service station at the Kelly Highway exit in Fort Smith, Arkansas, when Swindler also stopped there in a stolen car with a South Carolina license plate. Swindler was returning to Leavenworth, Kansas to settle some personal grudges that had arisen when he had been imprisoned there. Passing the I-540 exit on I-40 near Van Buren, Arkansas, the illiterate Swindler became confused and exited, driving across the Arkansas River and into Fort Smith. That morning, Basnett had been briefed to be on the lookout for Swindler, who was the suspect in the double murders of teenagers Gregory L. Becknell and Dorothy Ann Rhodes in South Carolina and other felonies in Georgia and South Carolina. The briefing contained information about Swindler's description, the car he was thought to be driving, and the fact that he was considered to be armed and dangerous. After he noted Swindler and the stolen car, Basnett radioed dispatchers that Swindler was at the service station. Back-up officers were immediately dispatched to his location.\nBefore additional help arrived, officer Basnett approached Swindler's car and asked for identification. Without warning, Swindler pulled a revolver and shot Basnett twice in the chest. Basnett, who was standing beside the car, returned fire before collapsing, slightly wounding Swindler. Swindler attempted to flee, but being unfamiliar with Fort Smith, took a road that trailed off into a dead end in a soybean field on the Arkansas River. He was captured there within minutes by police officers who had answered Basnett's call. When officers arrested Swindler, he had several weapons and hundreds of rounds of ammunition in his possession. \n",
        "type": [
            "murder"
        ]
    },
    "36": {
        "link": "/wiki/Alan_Willett",
        "title": "Alan Willett",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Johnson County",
        "county": "Johnson County",
        "paragraph": "Alan Willett (June 27, 1947 – September 8, 1999) was executed at age 52 for the 1993 murders of his 13-year-old son, Eric, and his mentally disabled brother, Roger Willett in Johnson County, Arkansas.  Willett's daughter Ruby Ann Willett and another son, Jonathan, survived the attack.\nAlan Willett was sentenced to death for convictions in the 1993 Johnson County killings of his 13-year-old son, Eric, and his mentally disabled brother, Roger. Alan Willett's daughter and another son survived the attack. Willett said that he wanted to die and waived his right to post-conviction remedies.\nWillett's last meal was beef jerky, barbecue-flavored potato chips, onion dip, garlic dip, buttered popcorn, and Pepsi.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "37": {
        "link": "/wiki/Lynching_of_Jordan_Jameson",
        "title": "Lynching of Jordan Jameson",
        "date": "November 11, 1919",
        "year": "1919",
        "location": "City of Magnolia's public square",
        "state": "Arkansas",
        "place": "Magnolia",
        "county": "Columbia County",
        "paragraph": "African-American man, Jordan Jameson was lynched[a] on November 11, 1919, in the town square of Magnolia, Columbia County, Arkansas. A large white mob seized Jameson after he allegedly shot the local sheriff. They tied him to a stake and burned him alive.[2]\nArkansans were on edge after the deadly Elaine massacre (September 30–October 1, 1919) in rural Elaine, Arkansas. During the riots, hundreds of black people were killed and according to the Encyclopedia of Arkansas, \"the Elaine Massacre was by far the deadliest racial confrontation in Arkansas history and possibly the bloodiest racial conflict in the history of the United States.\"[3]\nOn November 7, 1919, Columbia County Sheriff Benjamin E. Greer, was heading to the Jordan Jameson house along with deputies Duke Emerson and John Althin. While at the house an altercation broke out which escalated to a shoot out where Greer was shot in the head. In the confusion, Jameson escaped into the forest.[1]\n",
        "type": [
            "murder",
            "arson",
            "lynching",
            "riot"
        ]
    },
    "38": {
        "link": "/wiki/Murder_of_Jersey_Bridgeman",
        "title": "Murder of Jersey Bridgeman",
        "date": "November 20, 2012(2012-11-20) (aged 6) Bentonville, Arkansas, USA",
        "year": "2012",
        "location": "",
        "state": "Arkansas",
        "place": "Bentonville",
        "county": "Benton County",
        "paragraph": "Jersey Dianne Bridgeman (November 14, 2006 – November 20, 2012) was a 6-year-old girl who was abducted from her Bentonville, Arkansas home in November, 2012, and later found murdered. Her case garnered considerable international media attention in the US and Europe, and spurred debates about child protection in part due to the prior convictions and lengthy sentences for the perpetrators of aggravated child abuse against her, involving a high-profile trial, and the especially heinous nature of that abuse and circumstances surrounding her subsequent abduction and murder.\nJersey Bridgeman was born and grew up in the city of Bentonville, Arkansas, widely known as the seat of the American Walmart retail chain. Following her parents’ divorce, her father and stepmother, David and Jana Bridgeman, began to chain her to a dresser in an apparent bid to stop her from wandering at night, per their statements, getting into medication. The case generated profound public concern and outrage, leading to their incarceration after both pleaded guilty to false imprisonment, permitting abuse, and endangering the welfare of a minor, with David and Jana Bridgeman sentenced to 18 and 12 years in prison, respectively. [1]\nJersey was then placed in her mother DesaRae's custody and was frequently tended to by a neighbor, Zachary Holly (born October 8, 1984),[2] and his wife, who served as babysitters. They tended to Jersey and her younger sister on the night of November 19, 2012, helping her mother to place the girls in bed after she arrived home late from work. The next morning, DesaRae reported that Jersey was missing, calling on the Hollys for help. Later that day, her daughter was found in a vacant home in the same neighborhood; her body was naked, and she had been raped and suffocated, apparently strangled by her pajama bottoms. Holly was questioned in the wake of Jersey's abduction and noted to be cooperative, providing a DNA sample and his clothes from the day of Jersey's disappearance. However, forensic evidence was found to implicate him in the crime, and he was shortly thereafter arrested and arraigned for involvement in Jersey's abduction.[3][4]\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "39": {
        "link": "/wiki/Murder_of_Jesse_Dirkhising",
        "title": "Murder of Jesse Dirkhising",
        "date": "September 26, 1999(1999-09-26) (aged 13) [1]Rogers, Arkansas, U.S.",
        "year": "1999",
        "location": "",
        "state": "Arkansas",
        "place": "Prairie Grove",
        "county": "Washington County",
        "paragraph": "Jesse William Dirkhising (May 24, 1986 – September 26, 1999), also known as Jesse Yates, was an American teenager from Prairie Grove, Arkansas. He was staying with two men (with his parents’ permission) who bound, drugged, tortured, and repeatedly raped him. He died from drugging and positional asphyxia during the ordeal.[4][5]\nDespite his being at their home with approval from his parents, the defense argued he was complicit in the sexual acts, and therefore the death was accidental.  Considering how he was a minor and the men were adults, this was considered unlikely.  Further details revealed in the court case depicted a gruesome death.\nDirkhising's death received only regional media coverage until a Washington Times article ran a story nearly a month after his death, noting the lack of national coverage in contrast to that given to the 1998 death of Matthew Shepard.[6][page needed][7] The Shepard murder was approaching its first anniversary and was getting another round of national attention, coupled with updates on pending hate crime legislation.[8] Prompted by coverage in The Washington Times, the Dirkhising case gained notoriety as conservative commentators compared media coverage of the two cases and explored the issues of what was considered a hate crime.[7] The added attention resulted in mainstream media also reporting the Dirkhising case in relation to the coverage of the Shepard case, with many attempting to explain why the two were handled differently by the media, and perhaps received differently by readers.[6][page needed][8][9]\n",
        "type": [
            "murder",
            "torture",
            "rape"
        ]
    },
    "40": {
        "link": "/wiki/Charles_Hudspeth_(convict)",
        "title": "Charles Hudspeth (convict)",
        "date": "December 30, 1892Harrison, Arkansas, U.S.",
        "year": "1892",
        "location": "",
        "state": "Arkansas",
        "place": "Marion County",
        "county": "Marion County",
        "paragraph": "Charles Hudspeth (a.k.a. Andrew J. \"Andy\" Hudspeth) was an American man convicted of murder in Marion County, Arkansas, in 1887.[1] On December 30, 1892, he was hanged, although his alleged victim was purportedly later found to be alive.[2][3]\nGeorge Watkins and his wife, Rebecca, moved in 1886 from Kansas to Marion County, Arkansas, where Rebecca apparently soon became intimately involved with Charles Hudspeth. The following year, Watkins disappeared.\nRebecca and Hudspeth were arrested and, after lengthy interrogation, Rebecca allegedly made a statement accusing Hudspeth of murdering Watkins to get him out of the way so they could be married.\n",
        "type": [
            "murder"
        ]
    },
    "41": {
        "link": "/wiki/Cotton_pickers%27_strike_of_1891",
        "title": "Cotton pickers' strike of 1891",
        "date": "",
        "year": "1891",
        "location": "",
        "state": "Arkansas",
        "place": "Lee County",
        "county": "Lee County",
        "paragraph": "The cotton pickers' strike of 1891 was a labor action of African-American sharecroppers in Lee County, Arkansas in September, 1891.  The strike led to open conflict between strikers and plantation owners, racially-motivated violence, and both a sheriff's posse and a lynching party.  One plantation manager, two non-striking workers, and some twelve strikers were killed during the incident.[1]  Nine of those strikers were hung in a mass lynching on the evening of September 29.[2]\nIn 1886 the Colored Farmers' National Alliance and Cooperative Union had been founded by R.M. Humphrey, a white Baptist minister, reformer, and member of the parallel white Farmers' Alliance organization.  Early in September 1891, Humphrey called for a national African-American strike of sharecroppers against planters, in response to the planters setting 50-cent-per-100-pound prices at their summer conventions.[3]\nDespite its extensive claimed membership of millions,[4] and despite Humphrey's announcement of 600,000 members firmly committed to strike for $1 per 100 pounds,[5] the strike promoted for September 12 took hold nowhere. Additionally, many landowners who became aware of the planned strike took steps to suppress or outright prevent the strike through increased police presence and pacification tactics such as smaller raises.[6] Its failure was noted and documented with some satisfaction in newspapers across the cotton-growing south.  The one exception was in Lee County, a location with its own history of conflict, on the Mississippi River and across from Memphis, Tennessee. Ben Patterson, a Black labor organizer from Memphis, traveled to Lee County at the beginning of September 1891 and began to organize a strike among local cotton pickers. Patterson's efforts were significantly more successful than those of Humphrey, garnering the support of at least twenty-five pickers in Lee County.[6]\n",
        "type": [
            "lynching"
        ]
    },
    "42": {
        "link": "/wiki/Thomas_C._Hindman",
        "title": "Thomas C. Hindman",
        "date": "September 28, 1868(1868-09-28) (aged 40) Helena, Arkansas, U.S.",
        "year": "1868",
        "location": "",
        "state": "Arkansas",
        "place": "Helena",
        "county": "Phillips County",
        "paragraph": "\nThomas Carmichael Hindman Jr. (January 28, 1828 – September 28, 1868) was an American lawyer, politician, and a senior officer of the Confederate States Army during the American Civil War.  Born in Knoxville, Tennessee, he later moved to Mississippi and became involved in politics.  Having served in the Mexican–American War from 1846 to 1848, Hindman practiced law and in 1853 was elected to the Mississippi House of Representatives.  After his term expired in 1854, he moved to Helena, Arkansas, where there were more opportunities for his political ambitions.\nQuickly becoming a political leader in Arkansas, Hindman opposed the Know-Nothing party and the ruling Conway-Johnson dynasty. Elected to the United States House of Representatives in 1858, he supported slavery (and was a slaveholder himself) and secession.  Once the American Civil War began in 1861 and Arkansas seceded, Hindman joined the Confederate States Army, first commanding the 2nd Arkansas Infantry Regiment, then a brigade, and then an ad-hoc division at the Battle of Shiloh in April 1862; he was wounded during the battle.\n",
        "type": [
            "murder"
        ]
    },
    "43": {
        "link": "/wiki/Lynching_of_William_Turner",
        "title": "Lynching of William Turner",
        "date": "November 18, 1921",
        "year": "1921",
        "location": "Helena, Phillips County, Arkansas",
        "state": "Arkansas",
        "place": "Phillips County",
        "county": "Phillips County",
        "paragraph": "18-year-old William Turner was lynched on November 18, 1921, for an alleged assault on a 15-year-old white girl.[1] Two years earlier hundreds of African-Americans were killed during the Elaine Race Riot in Hoop Spur a nearby community also in Phillips County, Arkansas.\nEarly November 18, 1921, a 15-year-old was walking to her work at the local telephone exchange when she was allegedly assaulted by William Turner.[2] Before being arrested, the brother of the 15-year-old had shot Turner in the leg.[3]\nAware of the possibility of a lynching, Sheriff Mays tried to drive Turner to Marianna, Arkansas. However, a group of masked white men stopped the sheriff, dragged him out of the car and shot him dead. At the same time, a separate mob stormed the jail in the Phillips County Courthouse.\n",
        "type": [
            "lynching",
            "assault",
            "riot"
        ]
    },
    "44": {
        "link": "/wiki/Ledell_Lee",
        "title": "Ledell Lee",
        "date": "February 9, 1993",
        "year": "1993",
        "location": "",
        "state": "Arkansas",
        "place": "Jacksonville",
        "county": "Pulaski County",
        "paragraph": "\nLedell Lee (July 31, 1965 – April 20, 2017)[2] was an American man convicted and executed for the 1993 murder of his neighbor, Debra Reese. He was convicted in 1995, and the Arkansas Supreme Court affirmed the conviction in 1997, but numerous questions have been raised about the justice of his trial and post-conviction representation.[3][4][5] Issues have included conflict of interest for the judge, inebriation of counsel, and ineffective defense counsel. A request to postpone the execution in order to test DNA on the murder weapon was denied by a circuit judge. After Lee's execution, it was proven that the DNA on the murder weapon belonged to another person,[6] an unknown male.[7]\nDebra Reese (September 27, 1966 – February 9, 1993), 26 years old at the time of her death, was found dead in 1993 in her home in Jacksonville, Arkansas. She had been strangled and beaten with a small wooden bat her husband had given her for protection.\n",
        "type": [
            "murder"
        ]
    },
    "45": {
        "link": "/wiki/Illusions_(Michale_Graves_album)",
        "title": "Illusions (Michale Graves album)",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Illusions is the third solo album by former Misfits vocalist Michale Graves. It is a collaborative album between Graves and West Memphis Three\nmember Damien Echols, featuring written content and backing vocals from Echols. The album was produced in part due to an early example of a successful crowdfunding campaign, and the contributors' names are printed inside the CD booklet.\n",
        "type": []
    },
    "46": {
        "link": "/wiki/Robert_Francis_Catterson",
        "title": "Robert Francis Catterson",
        "date": "March 30, 1914(1914-03-30) (aged 79) San Antonio, Texas, U.S.",
        "year": "1914",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nRobert Francis Catterson (March 22, 1835 – March 30, 1914) was a doctor, Union Army officer in the American Civil War, state legislator, militia officer, U.S. Marshal, and the 30th mayor of Little Rock, Arkansas (from 1871 to 1873).[1] During the American Civil War, he was a senior officer of the Union Army and served as a brigade commander in the Army of the Tennessee.\nCatterson was born on March 22, 1835, in Marion County, Indiana. He was educated at Adrian College in Michigan and Cincinnati Medical College in Ohio, precursor to the University of Cincinnati Academic Health Center. After completing his studies, Catterson established a medical practice in Rockville, Indiana.[2]\n",
        "type": []
    },
    "47": {
        "link": "/wiki/Hoyt_Franklin_Clines",
        "title": "Murder of Donald Lehman",
        "date": "August 3, 1994(1994-08-03) (aged 37) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "1994",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Donald Lehman (1933 – January 8, 1981) was an American man who was murdered in front of his family by four men in Arkansas. All four men: James William Holmes, Hoyt Franklin Clines, Michael Orndorff, and Darryl Richley, were convicted of capital murder and sentenced to death, albeit Orndorff's sentence was reduced to life without parole on appeal. The other three were all executed one by one on August 3, 1994. It was the first triple execution in the United States in the modern era.[1]\nDonald Lehman, his wife, Virginia, and their daughter, Vicki, were at their home when four men wearing ski masks rang the doorbell and forced their way inside. Lehman was shot three times and severely beaten with a motorcycle drive chain in front of his family. More than $1,000 and several guns were stolen, according to court documents. Holmes, Richley, Clines, and Orndorff were arrested later that day. They were each convicted of capital murder and sentenced to death. Orndorff later had his sentence overturned on appeal, and Lehman's family agreed to a life sentence in his case.[2][3][4]\nAfter the U.S. Supreme Court rejected arguments they were being treated like \"hogs at a slaughter\", Clines, Richley, and Holmes were all executed by lethal injection on August 3, 1994. All three of them declined to make final statements. Clines was executed first, and was pronounced dead at 7:11 p.m. Richley was pronounced dead 58 minutes later, followed by Holmes at 9:24 p.m.[5]\n",
        "type": [
            "murder"
        ]
    },
    "48": {
        "link": "/wiki/Frank_Glasgow_Tinker",
        "title": "Frank Glasgow Tinker",
        "date": "June 13, 1939(1939-06-13) (aged 29) Little Rock, Arkansas",
        "year": "1939",
        "location": "",
        "state": "",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "Frank Glasgow Tinker (July 14, 1909 – June 13, 1939) was an American volunteer fighter pilot for the Fuerzas Aéreas de la República Española  (\"Air Forces of the Spanish Republic\"; FARE), during the Spanish Civil War.\nTinker was credited officially with shooting down eight enemy aircraft and was the highest-scoring American air ace of the war.[1] However, Tinker's logbook suggests that he claimed 19 victories, which would make him the sixth-highest scoring pilot in FARE. That relatively few of his claims were officially recognized was due to the complex system of verifying air kills used by FARE and the financial incentive paid to mercenaries: many victories were not verifiable because the downed aircraft crashed in an enemy-held area and/or an incentive would not have to be paid.[2] In addition, Tinker and other pilots from Escuadrilla La Calle (\"La Calle's Squadron\"), also known as 1ª Escuadrilla de Chatos (1st Chato Squadron\"), shared a number of joint kills against Junkers Ju 52 bombers.  He reported narrowly avoiding death at both the hands of enemy aviators and malfunctioning equipment.\nHe left a detailed record of his experiences as a fighter pilot for the Republicans in his memoir Some Still Live, published by Funk & Wagnalls Co in New York, 1938[3] and recently republished by The Clapton Press, London.[4]\n",
        "type": [
            "shooting"
        ]
    },
    "49": {
        "link": "/wiki/Randy_Greenawalt",
        "title": "Randy Greenawalt",
        "date": "January 23, 1997(1997-01-23) (aged 47) Florence State Prizon, Florence, Arizona, U.S.",
        "year": "1997",
        "location": "",
        "state": "Arkansas",
        "place": "Florence",
        "county": "Drew County",
        "paragraph": "Randall Greenawalt (February 24, 1949 – January 23, 1997)[1] was an American serial killer and mass murderer. Originally sentenced to life imprisonment for two murders committed in 1974, Greenawalt later became notorious for escaping together with fellow murderer Gary Tison and his three sons from prison, embarking on a two-week killing spree through Arizona and Colorado that left six people dead in 1978.[2] He was promptly sentenced to death and thereafter executed in 1997, with his case serving as the basis for the Supreme Court decision Tison v. Arizona.[3]\nIn early January 1974, Greenawalt went on a trip down to Miami, Florida, where he planned to exchange his car with a couple from Denver, Colorado.[4] On January 12, the body of 42-year-old Henry A. Weber, a Global Van Lines truck driver who had been shot in the head, was found at a highway rest area in Mississippi County, Arkansas.[4] Initially, nobody could be connected to the crime until four days later, when police officers in Tempe, Arizona detained brothers Randy and James Greenawalt, 25 and 23, respectively, for the January 15 murder of 33-year-old Stanley Edward Sandage at a rest area near Flagstaff.[5] Like Weber, Sandage was a truck driver working for Whitfield Tank Lines who was found shot to death in his tank truck in an apparent robbery, as $42 had been stolen from his wallet.[6]\nThe Greenawalts were arrested for trying to purchase stereo equipment using Sandage's MasterCharge card, and upon inspecting their vehicle, they found a .32-caliber pistol that was positively identified as the murder weapon, and a .243-caliber rifle that might have been the second murder weapon.[5] A third man, 33-year-old George Sanders, an apparent acquaintance of the brothers, was also arrested for federal firearms violations and credit card fraud in relation to the case.[5] Due to the similarity of the two cases, a sheriff from Arkansas was dispatched to question Randy in the earlier killing, but decided to wait until the case in Arizona went first.[4] In a bid to avoid the death penalty, the elder Greenawalt pleaded guilty to the murder and was sentenced to life imprisonment, in exchange for testifying against his brother, who had pleaded innocent on all charges.[7] During the trial, it was made apparent that in the Sandage murder, Randy had pre-emptively painted an \"X\" on the window of the truck before proceeding to open fire and kill his victim.[8] Thanks to his testimony, James was also convicted and sentenced to life imprisonment, which he was to spend at the Florence State Prison.[9] In the meantime, Randy  was extradited to face charges in Arkansas, but despite his willing confession to both this and another murder committed in Colorado, the case fell through and he was returned to serve his sentence in Arizona.[8]\n",
        "type": [
            "robber",
            "mass murder",
            "murder",
            "killing",
            "robbery"
        ]
    },
    "50": {
        "link": "/wiki/Ronald_Gene_Simmons",
        "title": "Ronald Gene Simmons",
        "date": "December 22–28, 1987",
        "year": "1987",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "\nRonald Gene Simmons Sr. (July 15, 1940 – June 25, 1990) was an American mass murderer and spree killer who killed 16 people over a week-long period in Arkansas in 1987. A retired military serviceman, Simmons murdered fourteen members of his family, including a daughter he had sexually abused and the child he had fathered with her, as well as a former co-worker, and a stranger; he also wounded four others. He is the most prolific mass murderer in Arkansas history.[1]\nSimmons was sentenced to death sixteen times, and after refusing to appeal his sentence, was executed in Arkansas on June 25, 1990. His refusal to appeal was the subject of a 1990 Supreme Court Case, Whitmore v. Arkansas.\n",
        "type": [
            "murder",
            "mass murder"
        ]
    },
    "51": {
        "link": "/wiki/Murder_in_Arkansas_law",
        "title": "Murder in Arkansas law",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "\nMurder in Arkansas constitutes the intentional killing, under circumstances defined by law, of people within or under the jurisdiction of the U.S. state of Arkansas.\nThe United States Centers for Disease Control and Prevention reported that in the year 2020, the state had one of the highest murder rates in the country.[1]\nIn the state of Arkansas, the felony murder rule is defined as a  death that is caused \"in the course of\", \"in the furtherance of\" or \"in the immediate flight\" of a felony.  These deaths all must exhibit \"extreme indifference to the value of human life\" to qualify. The following predicate felonies are crimes when causing death automatically qualify the perpetrator for capital punishment in Arkansas:\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "52": {
        "link": "/wiki/Christina_Marie_Riggs",
        "title": "Christina Marie Riggs",
        "date": "May 2, 2000(2000-05-02) (aged 28) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "2000",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Christina Marie Riggs (September 2, 1971 – May 2, 2000) was convicted of the November 1997 murders of her two children, Justin Dalton Thomas (age 5) and Shelby Alexis Riggs (age 2).[2][3] Riggs was a licensed practical nurse, and she planned to kill the children with injections of drugs she obtained from her hospital. When she injected her son with potassium chloride, it caused pain but not death, so she smothered both children to death then attempted suicide. \nDefense attorneys mentioned Riggs's depression and post-traumatic stress disorder during her trial, but Riggs did not put up a defense in the penalty phase. She waived her appeals and was executed by lethal injection less than two years after her convictions. She was the first woman to be executed in Arkansas since 1845.[4]\nRiggs was born Christina Marie Thomas in Lawton, Oklahoma, and she grew up in Oklahoma City. She said she was sexually abused as a child, and she began using alcohol, tobacco and marijuana by the age of 14. She became pregnant for the first time at age 16; she gave the child up for adoption. After finishing high school, Riggs became a licensed practical nurse and worked in home health nursing and for a Veterans Administration hospital.[5]\n",
        "type": [
            "murder"
        ]
    },
    "53": {
        "link": "/wiki/Mark_Alan_Smith",
        "title": "Mark Alan Smith",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "McHenry County",
        "county": "Pulaski County",
        "paragraph": "Mark Alan Smith (born June 27, 1949) is an American serial killer who killed at least four women in Illinois and Arkansas during the 1960s, and was sentenced to 500 years' imprisonment for three of the deaths. Smith later confessed to killing eight women while stationed as a marine in West Germany, for which he was never prosecuted, and authorities believe he could be involved in other murders, both in the USA and overseas.[1]\nSmith was born at the Illinois Masonic Hospital, to marine Charles Gilbert Smith and Delores Rechlin, who had another four children. The couple separated when Mark was 2 to 3 years old, with his mother receiving primary custody. At the age of 7, his mother remarried, and the family moved out to McHenry County, Illinois, where Smith grew up. He attended the local grade school, but anger issues and the difficulty of adjusting to a new locale resulted in his return to Chicago.\nA year later, while a student at Edgebrook Public School, Smith attempted to strangle a female classmate behind the school building. One year after that, he stabbed a 6-year-old playmate with a pen knife more than 20 times. The boy managed to survive, and Mark was sent off to a psychiatrist.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "54": {
        "link": "/wiki/James_Fleming_Fagan",
        "title": "James Fleming Fagan",
        "date": "September 1, 1893(1893-09-01) (aged 65) Little Rock, Arkansas, U.S.",
        "year": "1893",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nJames Fleming Fagan (March 1, 1828 – September 1, 1893) was an American farmer, politician, and senior officer of the Confederate States Army during the American Civil War. His brigade distinguished itself in the Camden Expedition of 1864, helping to drive the U.S. Army's Seventh Corps from southwest Arkansas.[1]\nJames Fleming Fagan was born in Clark County, Kentucky. When he was ten years old, his family moved to Little Rock. His father had been hired to work on the Old State House. His father died during his youth and his mother, Catherine A. Fagan, in 1842 married Samuel Adams, who became acting governor of Arkansas two years later.[1] After his stepfather's death, Fagan took control of the family farm along the Saline River in southern Arkansas. Though he was a member of the Whig Party, he represented the heavily Democratic Saline County for two terms in the General Assembly. Fagan served in the United States Volunteers during the Mexican–American War with Company C, Arkansas Mounted Infantry Regiment, under Colonel Archibald Yell and was promoted to the rank of second lieutenant.[1]\n",
        "type": []
    },
    "55": {
        "link": "/wiki/Ronald_James_Ward",
        "title": "Ronald James Ward",
        "date": "April 11, 2014(2014-04-11) (aged 47–48) Montana State Prison, Deer Lodge, Montana, U.S.",
        "year": "2014",
        "location": "",
        "state": "Arkansas",
        "place": "Deer Lodge",
        "county": "Benton County",
        "paragraph": "Ronald James Ward, Jr. (1966 – April 11, 2014) was an American serial killer who murdered at least three women and one man in the span of several months in 2000. Initially convicted for the murder of Craig Petrich in Montana, he was later linked by DNA evidence to three other murders, which had occurred in Arkansas and California.[1] Ward died serving his sentence in the Montana State Prison in 2014, but the cause of his death was not disclosed.[2]\nWard was born in Hood River, Oregon, but was raised in the areas of Eugene and Springfield. When Ward was 19 his father, Ronald Sr., an abusive womanizer, divorced his wife, whom he had given syphilis. Ward claimed he had had eight stepmothers while growing up, and that he quit school in the sixth grade. At age 19, he married a woman named Donna, who herself had six children.[1]\nHe was a kind father to his adoptive children, taking them out on family walks and other activities he himself hadn't partaken in with his own father. At some point, he held a job as a football coach for the 7th and 8th grades in Coos Bay.[1]\n",
        "type": [
            "murder"
        ]
    },
    "56": {
        "link": "/wiki/Lynching_of_Wade_Thomas",
        "title": "Lynching of Wade Thomas",
        "date": "December 26, 1920",
        "year": "1920",
        "location": "City of Jonesboro's public square",
        "state": "Arkansas",
        "place": "Jonesboro",
        "county": "Craighead County",
        "paragraph": "On December 26, 1920, an African-American man named Wade Thomas was lynched in Jonesboro, Arkansas, by a white mob. The mob seized Thomas from the Jonesboro jail after he allegedly shot local Patrolman Elmer Ragland, and murdered him. \nThe state of Arkansas had been on edge after the deadly Elaine massacre, in which perhaps as many as 237 Black people were killed between September 30 and October 1, 1919. It was \"by far the deadliest racial confrontation in Arkansas history and possibly the bloodiest racial conflict in the history of the United States.\"[1] On December 25, 1920, police raided a dice game. During the raid gun fire broke out and Patrolman Elmer Ragland was killed.[2] Thomas was later arrested at Hoxie, Arkansas and brought to Jonesboro.\nMembers of the white community quietly assembled in Jonesboro until there was a mob of about 400 people. The police initially attempted to protect Thomas; Jonesboro Police Chief Gus Craig and Mayor Gordon Frierson had barricaded the jail.[3] When the mob broke through the two surrendered Wade Thomas without a struggle because, as Mayor Frierson later recalled, \"When the mob opened the door, the first half-a-dozen men standing there were leading citizens — businessmen, leaders of their churches and the community.\"[3] Other Black prisoners were left alone; only Thomas was seized paraded around the town and then hanged from a telegraph pole near where Ragland was shot.[2] His body was then riddled with bullets.\n",
        "type": [
            "murder",
            "arson",
            "lynching",
            "riot"
        ]
    },
    "57": {
        "link": "/wiki/Anne_Pressly",
        "title": "Anne Pressly",
        "date": "October 20, 2008",
        "year": "2008",
        "location": "Little Rock, Arkansas",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nAnne Pressly (August 28, 1982 – October 25, 2008) was an American news anchor for KATV Channel 7 in Little Rock, Arkansas. She was born in Beaufort, South Carolina and grew up in Greenville. She moved to Little Rock during her high school junior year when her mother remarried. On October 20, 2008, she was brutally attacked during a robbery at her home and died five days later.\nAfter earning her B.A. in Political Science from Rhodes College in Memphis, Tennessee, Pressly was hired at KATV in May 2004 to produce Good Morning Arkansas[4] and report for MidDay Arkansas and Saturday Daybreak. She was promoted to a full-time reporter position in November, 2004.[5]\n",
        "type": [
            "murder",
            "robbery",
            "robber"
        ]
    },
    "58": {
        "link": "/wiki/Marmaduke%E2%80%93Walker_duel",
        "title": "Marmaduke–Walker duel",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nJohn S. Marmaduke\nLucius M. Walker\n",
        "type": []
    },
    "59": {
        "link": "/wiki/Killing_of_Don_Henry_and_Kevin_Ives",
        "title": "Killing of Don Henry and Kevin Ives",
        "date": "August 23, 1987(1987-08-23) (aged 17) Alexander, Arkansas, US",
        "year": "1987",
        "location": "",
        "state": "Arkansas",
        "place": "Alexander",
        "county": "Pulaski County",
        "paragraph": "On August 23, 1987, the bodies of 16-year-old Don Henry and 17-year-old Kevin Ives were hit by a freight train in Alexander, Arkansas, United States, as they were laying on the tracks. The locomotive engineer engaged the brakes while blowing the horn, but the train could not stop in time and rolled over the bodies.  A second autopsy revealed that Don Henry had been stabbed in the back and Kevin Ives' skull had been crushed prior to being run over.\nThe deaths were initially ruled an accident, the result of the boys in a deep sleep on the tracks while incapacitated due to high amounts of THC allegedly present in their blood. The parents of the boys insisted on a second autopsy, and after exhumation it was ruled that homicide was likely. Later, another pathologist ruled that Don Henry's shirt showed evidence of a stab wound.\nAbout 4:00 a.m. on August 23, 1987, the crew onboard a 75-car, 6,000-ton Union Pacific freight train, more than a mile long and traveling at a rate more than 50 miles per hour, en route to Little Rock, Arkansas, spotted two boys lying motionless across the tracks, about 300 feet ahead.[1]  Members of the locomotive crew also stated that the bodies were partly covered by a green tarpaulin,[2] though police disputed the existence of any such tarp and none was ever recovered from the scene. Nearby were a .22 caliber rifle and a flashlight. The boys did not move, despite the sound and vibration of the approaching train, its emergency brakes, and its air horn. More than 1,000 feet of the decelerating train crossed the point where the bodies lay before it came to a stop.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "60": {
        "link": "/wiki/Robert_C._Newton",
        "title": "Robert C. Newton",
        "date": "June 7, 1877(1877-06-07) (aged 37) Little Rock, Arkansas",
        "year": "1877",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nRobert Crittenden Newton (June 2, 1840 – June 7, 1877) was a noted lawyer, politician, and Confederate Colonel in Arkansas during the American Civil War. He is most remembered for his involvement in the Brooks-Baxter War. Robert C. Newton Camp # 197 of Little Rock was named for him and was the oldest continually run camp of the Arkansas Division, Sons of Confederate Veterans, as well as the oldest continually active camp west of the Mississippi River.\nBorn in Little Rock, Arkansas, son of Thomas W. Newton and Eliza Allen Newton. His father had been a state legislator and a representative in the 28th Congress. Newton was also the grandson of Col. John Allen, who was killed leading his “Bark” at the Battle of River Rasin, January 22, 1813.[1]\n",
        "type": []
    },
    "61": {
        "link": "/wiki/Elisha_Baxter",
        "title": "Elisha Baxter",
        "date": "May 31, 1899(1899-05-31) (aged 71) Batesville, Arkansas",
        "year": "1899",
        "location": "",
        "state": "Arkansas",
        "place": "Batesville",
        "county": "Independence County",
        "paragraph": "Elisha Baxter (September 1, 1827 – May 31, 1899) was an American businessman and politician who served as the 10th governor of Arkansas from 1873 to 1874.\nBaxter was born in Forest City, North Carolina. He sought and obtained an appointment to the United States Military Academy at West Point. Baxter's father, William, strongly opposed his appointment, and Baxter resigned it.[1] He returned home and became a businessman. He ran a successful mercantile business in Rutherford County with his brother-in-law Spenser Eaves.\nIn 1852, Baxter moved to Batesville, Arkansas, and opened a mercantile business with his brother, Taylor. It soon failed. Baxter joined the Whig party and was elected mayor of Batesville in 1853.  One year later he was elected as state representative from Independence County to the tenth general assembly.[2]  He studied law and, in 1856, was admitted to the Arkansas bar. He was reelected to the House in 1858 and served two terms from Independence County, leaving in 1860.\n",
        "type": []
    },
    "62": {
        "link": "/wiki/George_Floyd_protests_in_Arkansas",
        "title": "George Floyd protests in Arkansas",
        "date": "May 28, 2020 – July 2020",
        "year": "2020",
        "location": "Arkansas, United States",
        "state": "Arkansas",
        "place": "Benton County Sheriff's",
        "county": "Benton County",
        "paragraph": "\nThis is a list of George Floyd protests in Arkansas, United States. Through July 2020, protests occurred in at least thirteen various communities in the state.\nOn June 1, protesters gathered at the Bentonville Town Square; the protest was originally postponed from the original date after receiving online threats, however, over 1,000 individuals still showed up to protest. During the daylight, the protest was peaceful. However, right before sunset the Benton County Sheriff's Office warned the protesters to disperse, declaring the protest to be unlawful and posting officers in riot gear at the front of the Court House Steps. After the protestors did not disperse, the Benton County Sheriff's Office began releasing tear gas and firing beanbag rounds into the crowd. After this, protestors threw water bottles at the officers who were standing on the steps of the Benton County Court House. After having been struck by water bottles and having \"threatening language\" thrown their way, more tear gas was deployed at the front of the square. It was during this time back up from multiple surrounding agencies arrived to support the BCSO. One group seemed to be in military uniform, with batons and a rile strapped to their front, while others only carried large batons. Most protesters left following this, but the protestors continuously returned to continue protesting in front of the Benton County Court House. \n",
        "type": [
            "riot"
        ]
    },
    "63": {
        "link": "/wiki/Jerome_Lambert",
        "title": "Jerome Lambert",
        "date": "August 11, 2007(2007-08-11) (aged 36) Rosston, Arkansas, US",
        "year": "2007",
        "location": "",
        "state": "",
        "place": "Rosston",
        "county": "Nevada County",
        "paragraph": "Joseph Jerome Lambert (May 29, 1971 – August 11, 2007) was an American expatriate basketball player who is best known for leading NCAA Division I in rebounding in 1993–94 while playing for Baylor.[1] A 6 ft 8 in (2.03 m), 215 pound power forward, Lambert accomplished the feat as a junior in his first season of Division I basketball. He had previously played for Westark Community College before enrolling at Baylor.\nDuring Lambert's recruitment to Baylor, then-assistant coach Gary Thomas had committed a major recruiting violation to acquire him.[2] Thomas had faxed a term paper to Westark assistant basketball coach Troy Drummond on April 5, 1993, which was a slight re-write of an article that had previously appeared in a women's magazine.[2] Lambert then handed the faxed paper in to an English class to pass it off as his own.[2] He ultimately chose to play at Baylor, with Drummond \"coincidentally\" becoming a new assistant coach at that school, and news of this violation did not come out until after the 1993–94 season, the season in which Lambert's 14.8 rebounds per game led the NCAA.[1][2] He also garnered many accolades that season, including First Team All-Southwest Conference (SWC), SWC Newcomer of the Year, SWC All-Newcomer Team, one-time SWC Player of the Week and a three-time SWC Newcomer of the Week.[3]\nDue to the scandal, Lambert transferred to Oklahoma State, but because of NCAA transfer rules he had to sit out one full year before becoming eligible to play his final season.[4] In his lone season with the Cowboys, he averaged 13.0 points and 6.6 rebounds per game.[5] He then went on to play professionally in Israel before coming home to work for Danfoss and serve as a firefighter.\n",
        "type": []
    },
    "64": {
        "link": "/wiki/Kenneth_Williams_(serial_killer)",
        "title": "Kenneth Williams (serial killer)",
        "date": "April 27, 2017(2017-04-27) (aged 38) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "2017",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Kenneth Dewayne Williams (February 23, 1979 – April 27, 2017)[1] was an American serial killer who killed four people in Arkansas and Missouri. Originally sentenced to life without parole in Arkansas for killing a cheerleader in 1998, Williams escaped from prison in a 500-gallon barrel of pig slop in 1999. He then shot and killed another man and stole his truck several miles away from the prison, before unintentionally killing another man in a police chase in Missouri. Williams was convicted of the murder he committed shortly after escaping prison and was sentenced to death. In 2005, he confessed to committing another murder in 1998. Williams became the last of four inmates executed in Arkansas in April 2017.\nWilliams' parents both had learning difficulties, and his mother was a drug addict who smoked while she was pregnant. Williams' father abused his wife and his children. According to Williams, he would frequently beat him, his mother, and his brothers. At one point, his father kidnapped his mother, holding her at gunpoint for several days.[2]\nRarely supervised, Williams started smoking marijuana at the age of 6, and joined the Gangster Disciples and started drinking beer at the age of 9. He moved in and out of several foster homes and juvenile reform schools.[3]\n",
        "type": [
            "murder",
            "killing",
            "kidnapped"
        ]
    },
    "65": {
        "link": "/wiki/Little_Rock_recruiting_office_shooting",
        "title": "Little Rock recruiting office shooting",
        "date": "June 1, 2009 (2009-06-01) 10:19 a.m.",
        "year": "2009",
        "location": "9112 North Rodney Parham Road,Little Rock, Arkansas, USA",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "The 2009 Little Rock recruiting office shooting took place on June 1, 2009, when Abdulhakim Mujahid Muhammad, born Carlos Leon Bledsoe, opened fire with a rifle in a drive-by shooting on soldiers in front of a United States military recruiting office in Little Rock, Arkansas. He killed Private William Long and wounded Private Quinton Ezeagwula.\nAfter his arrest, Muhammad acknowledged shooting the men. He told police that he had intended to kill as many Army personnel as possible. He had an SKS rifle, a Mossberg 702 Plinkster rifle, two handguns, 562 rounds of ammunition, and military books in his car. Muhammad was charged with capital murder, attempted capital murder, and 10 counts of unlawful discharge of a weapon. Muhammad also reportedly faced 15 counts of engaging in a terrorist act.[1]\nA convert to Islam, Muhammad had gone to Yemen in 2007 to teach English, staying about 16 months. He was deported from Yemen to the United States, after having been detained for overstaying his visa.\n",
        "type": [
            "murder",
            "shooting",
            "terrorist"
        ]
    },
    "66": {
        "link": "/wiki/Cecil_Dowdy",
        "title": "Cecil Dowdy",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nCecil Dowdy (May 9, 1945 – November 24, 2002) was an American college football player and businessman. He played offensive tackle for the University of Alabama Crimson Tide from 1964 through 1966. He was a member of both the 1964 and 1965 national championship teams. Dowdy was also a unanimous selection to the 1966 College Football All-America Team.\nAfter a successful high school playing career at Cherokee Vocational High School that culminated with his selection to the 16th annual AHSAA All-Star Game in 1963, Dowdy enrolled at the University of Alabama with an athletic scholarship to play on the football team.[1] After he played on the freshman football squad for the 1963 season, Dowdy stated as an offensive tackle for the three years that followed. Over those three seasons, Alabama amassed an overall record of 30 wins, two losses and one tie (30–2–1) and won three Southeastern Conference (SEC) championships and two national championships.[2]\n",
        "type": []
    },
    "67": {
        "link": "/wiki/Dumas_shooting",
        "title": "Dumas, Arkansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Desha County",
        "county": "Desha County",
        "paragraph": "\nDumas is a city in Desha County, Arkansas, United States. The population was 4,706 at the 2010 census.[2]\nIn 1870, a planter, merchant and surveyor of French descent, William B. Dumas, bought acres of farmland from the Abercrombie Holmes family.[3] The area was named Watson District and the town continued to develop. Then, the District was renamed Dumas and was incorporated in 1904.[4]\n",
        "type": []
    },
    "68": {
        "link": "/wiki/Paradise_Lost_2:_Revelations",
        "title": "Paradise Lost 2: Revelations",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "West Memphis",
        "county": "Crittenden County",
        "paragraph": "Paradise Lost 2:  Revelations is a 2000 American documentary film directed and produced by Joe Berlinger and Bruce Sinofsky, and the sequel to their 1996 film Paradise Lost: The Child Murders at Robin Hood Hills, about the trials of the West Memphis Three, three teenage boys accused of the May 1993 murders and sexual mutilation of three prepubescent boys as a part of an alleged satanic ritual in West Memphis, Arkansas.[2]\nRevelations takes place five years after the events depicted in the first film, as Damien Echols, one of the West Memphis Three, who were all named as guilty of the murders in 1994, appeals his lethal injection sentence. It mostly focuses on John Mark Byers, the father of one of the victims who has grown increasingly obsessed with the West Memphis Three, and on a support group who is convinced that the three are innocent. The film was nominated for a Primetime Emmy Award for Outstanding Nonfiction Special, and was later followed by a third film, Paradise Lost 3: Purgatory, in 2011.\nIn Paradise Lost 2, Bruce Sinofsky and Joe Berlinger visit support groups for Damien Echols, sentenced to lethal injection in the first film, and revisit John Mark Byers, who is facing gossip about his possible involvement with the murder of his son. Echols is appealing his sentence and his defense attorney notices what he believes to be bite marks in a photograph of the face of one of the victims; the prosecution argues that the marks are from a belt buckle and not teeth.\n",
        "type": [
            "murder"
        ]
    },
    "69": {
        "link": "/wiki/Randy_Gay",
        "title": "Randy Gay",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Randy William Gay (born September 1, 1958)[1] is an American serial killer who killed three people, including his father-in-law and his biological father, with a shotgun during arguments between 1978 and 2011. He served time in prison for each of the first two murders, and was sentenced to death for the third murder.\nAfter failing to abort him, Randy's mother abandoned him and his sisters when they were young. After their mother left, their father, Glen Harold Gay, became somewhat abusive.[2]\nGloria Lindsey, Randy's older sister, said their father tried his best but had anger issues and was a strict parent who was hard on the family. She said he was often verbally abusive and sometimes physically abusive towards Randy. She also said her brother was sexually abused by some older boys at one point when he was six. Lindsey left home when she was 15 and got married.\n",
        "type": [
            "murder"
        ]
    },
    "70": {
        "link": "/wiki/Lisa_Nichols",
        "title": "Redhead murders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "\nThe Redhead murders is the media epithet used to refer to a series of unsolved homicides of redheaded females in the United States between October 1978 and 1992, believed to have been committed by an unidentified male serial killer. The murders believed to be related have occurred in states including Tennessee, Arkansas, Kentucky, Mississippi, Pennsylvania, and West Virginia.[1][2][3] The murders may have continued until 1992.[4][5][6] The victims, many remaining unidentified for years, were usually women with reddish hair, whose bodies were abandoned along major highways in the United States. Officials believe that the women were likely hitchhiking or may have engaged in sex work.[3][7]\nAuthorities are unsure how many people were responsible for these murders, if they were all performed by the same perpetrator(s), and how many victims there have been.[8] It is believed that there may have been a total of five to fourteen victims.[3][9][10] Of the presumed victims, four were identified by November 2018.[11][8][12][13] The suspect was informally called the \"Bible Belt Strangler\" in 2018, because of the territory where the bodies were found.\n",
        "type": [
            "murder"
        ]
    },
    "71": {
        "link": "/wiki/Pearcy_murders",
        "title": "Pearcy murders",
        "date": "November 11 or 12, 2009  (CST UTC−06:00)",
        "year": "2009",
        "location": "Pearcy, Arkansas, United States",
        "state": "Arkansas",
        "place": "Pearcy",
        "county": "Garland County",
        "paragraph": "The Pearcy murders took place on November 11 or 12, 2009 in Pearcy, Arkansas, a small town in the center of the state right outside of Hot Springs. A total of four related people and the girlfriend of one victim were shot to death during two burglaries; four bodies were found in a mobile home belonging to victims Edward Gentry, Jr. and his wife Pam. The mobile home had been burned to destroy evidence. The fifth victim, Edward Gentry Sr., was found in another structure on the property. Jeremy Pickney, Marvin Stringer and Samuel Conway, all in their early twenties, were quickly identified as suspects due to their possessing stolen goods from the Gentry trailer. Stringer was killed during a shootout in a police raid when authorities attempted to arrest him at the Red Roof Inn on East Grand Ave.\nConway was convicted at trial in June 2011 on multiple counts of capital murder and burglary, and sentenced to life in prison without parole. The Arkansas Supreme Court ordered a retrial of his case due to judicial error. He pleaded guilty and was sentenced to 40 years in prison. Pickney made a plea bargain, pleading guilty in 2011 to conspiracy to commit aggravated residential burglary, and was sentenced to 50 years in prison.\nIn the early morning hours of November 12, 2009, firefighters were alerted to a burning mobile home in Pearcy, Arkansas, approximately 55 miles southwest of Little Rock. Upon investigation, they discovered four bodies. These were later identified as 56-year-old Edward Gentry Jr., his 52-year-old wife Pam, their 24-year-old son Jeremy, and Jeremy's 19-year-old girlfriend Kristyn Warneke. They had all been shot to death. The trailer home had been set on fire and burned so fiercely that the floor collapsed in one area. A few hours later the body of 80-year-old Edward Gentry Sr. was found in another building on the property. He had been bound and shot to death execution style, with two bullets to the head. Police determined that the victims had been burglarized: flat-screen televisions, guns, and two sets of rims and tires had been stolen.[1]\n",
        "type": [
            "murder",
            "mass shooting",
            "burglary",
            "shooting"
        ]
    },
    "72": {
        "link": "/wiki/Lynching_of_Henry_Lowry",
        "title": "Lynching of Henry Lowry",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "El Paso",
        "county": "White County",
        "paragraph": "\nThe lynching of Henry Lowry, on January 26, 1921, was the murder of an African-American man, Henry Lowry, by a mob of white vigilantes in Arkansas. Lowry (also spelled \"Lowery\"), a tenant farmer, had been on the run after a deadly shootout at the house of planter O. T. Craig on Christmas Day of 1920. Lowry went into hiding in El Paso, Texas; when he was discovered and extradited by train, a group of armed white men boarded the train in Sardis, Mississippi, and took Lowry to Nodena, near Wilson, Arkansas. He was doused in gasoline and burned alive before a mob of 500. A reporter from the Memphis Press witnessed the event, and word of the lynching soon spread around the country, aided by an article William Pickens wrote for The Nation, in which he described eastern Arkansas as \"the American Congo\".[1]\nA detailed account comes from William Pickens, then a journalist and an assistant field secretary for the executive secretary of the NAACP.[2] Pickens is the only source for some details on Lowry; his age, for example, being otherwise unknown except for Pickens's estimate of \"forty years or more\".[2] He and his wife Callie are not listed in the 14th United States census, despite having moved to Arkansas in 1918 from Mississippi.[2] O. T. Craig was a planter in Mississippi County, Arkansas, first name not given in most contemporary accounts but revealed by the same census records to be Osben T. Craig, aged 68 at the time; with 62-year-old wife Mary, children Elizabeth (28), Richard (24), Margret (21), and two further sons.[2] Craig had a reputation for being ornery: he mistreated his Black tenants and exploited them.[3] Lowry was a proud, tall man; he was over six feet tall and, according to later testimony from another one of Craig's tenants, Mrs. Lucy Oliver, \"he didn't take nothing off of nobody\". He had attained the highest possible level within his Masonic order, a rank given to those of \"outstanding character and leadership qualities\".[3]\nThe shooting and the lynching were consequences of Lowry's indenture with Craig. Weeks before the events, Lowry had come to ask for his settlement, meaning a complete account of all debts and credits, and of how much money, if any, was due to him. Lowry, who had a wife and child and was a hardworking man who did not drink, had come to work for Craig some two years before. Craig was a powerful man and did not want his workers to leave or have freedom of movement; his son Richard was the local postmaster and clerk of the local court. Lowry needed the settlement if he ever wanted to leave, since without it he could not prove that he was not indebted to Craig, but Craig refused to provide the documents. Richard hit Lowry, who left but made a promise he would be back. He did so a few weeks later, while the Craigs were having their Christmas dinner, and was told to leave; Craig hit him with a piece of wood, and then Richard shot Lowry, who pulled his own gun and returned fire, killing O. T. Craig and his wife, and wounding Richard and his brother. Then, he ran.[4]\n",
        "type": [
            "murder",
            "killing",
            "shooting",
            "lynching"
        ]
    },
    "73": {
        "link": "/wiki/Mindy_McCready",
        "title": "Mindy McCready",
        "date": "February 17, 2013(2013-02-17) (aged 37) [2]Heber Springs, Arkansas, U.S.[3]",
        "year": "2013",
        "location": "",
        "state": "",
        "place": "Springs",
        "county": "Garland County",
        "paragraph": "\nMalinda Gayle McCready (November 30, 1975 – February 17, 2013)[4] was an American country music singer. Active from 1995 until her death in 2013, she recorded a total of five studio albums. Her debut album, 1996's Ten Thousand Angels, was released on BNA Records and was certified 2× Platinum by the RIAA, while 1997's If I Don't Stay the Night was certified Gold. 1999's I'm Not So Tough, her final album for BNA, was less successful, and she left the label. A self-titled fourth album followed in 2002 on Capitol Records. McCready's fifth and final studio album, I'm Still Here, was released in March 2010 on Iconic Records.\nMcCready's first four studio albums yielded twelve singles on the Billboard country singles charts. This figure includes the No. 1 hit \"Guys Do It All the Time\", as well as the Top 10 hits \"Ten Thousand Angels\" and \"A Girl's Gotta Do (What a Girl's Gotta Do)\".\n",
        "type": []
    },
    "74": {
        "link": "/wiki/Ozra_Amander_Hadley",
        "title": "Ozra Amander Hadley",
        "date": "July 18, 1915 (aged 89) Mora County, New Mexico, U.S",
        "year": "1915",
        "location": "",
        "state": "Arkansas",
        "place": "Mora County",
        "county": "Garland County",
        "paragraph": "Ozra (or Ozro) Amander Hadley (June 30, 1826 – July 18, 1915) was an American politician who served as the acting governor of Arkansas from 1871 to 1873.\nHadley was born in Cherry Creek, New York, and was educated in the public schools. He attended Fredonia Academy, now State University of New York at Fredonia. Hadley moved to Rochester, Minnesota in 1855, where he was a farmer and became active in local politics and government, including appointment as Olmsted County Auditor. In 1865, he moved to Little Rock, Arkansas, where he opened a general store.\nHadley was elected as a Republican to serve in the Arkansas Senate from 1869 to 1871; he was elected president of the Senate in 1871.[1] In 1871, as part of a political compromise (see: Brooks-Baxter War), Hadley was appointed acting governor after the resignation of his fellow Republican, Powell Clayton, a controversial figure associated with the Brooks-Baxter War.  During his two-year term, Hadley sided with the Radical Republicans during the Reconstruction Era, including efforts to assist former slaves to obtain schooling, own land, vote, and hold office. After his gubernatorial term, Hadley served as registrar of the U.S. Land Office. He was appointed as Little Rock's postmaster in 1878, and served until 1882.\n",
        "type": []
    },
    "75": {
        "link": "/wiki/Henry_Wharton_Conway",
        "title": "Henry Wharton Conway",
        "date": "November 9, 1827(1827-11-09) (aged 34) Napoleon, Arkansas Territory, U.S.",
        "year": "1827",
        "location": "",
        "state": "",
        "place": "Napoleon",
        "county": "Independence County",
        "paragraph": "\nHenry Wharton Conway (March 18, 1793 – November 9, 1827) was a United States naval officer during the War of 1812 and a politician in Arkansas Territory, who was elected as a territorial delegate (1823–1827) to the United States House of Representatives for three consecutive congresses. He died in 1827 as a result of wounds from a duel with Robert Crittenden, a former friend and political ally.[1]\nConway was born into a planter family on March 18, 1793, as the son of Thomas and Ann (née  Rector) Conway, in Greene County, Tennessee. He was educated by private tutors. He had two younger brothers who followed him into politics in the West.\n",
        "type": []
    },
    "76": {
        "link": "/wiki/Ebby_Steppach",
        "title": "Murder of Ebby Steppach",
        "date": "October 25, 2015(2015-10-25) (aged 18) Little Rock, U.S.",
        "year": "2015",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "Ebby Jane Steppach (March 31, 1997 – October 25, 2015)[2] was an American woman who disappeared under mysterious circumstances in Little Rock, Arkansas.[3] Days before her disappearance, she had accused four men of gang-raping her at a party she had attended. On October 25, 2015, she placed an erratic phone call to her older brother, Trevor; this was the last known contact anyone had with her.\nOn October 27, her abandoned car was discovered in Chalamont Park in west Little Rock. Searches of the woods in the park were undertaken, but no sign of Steppach was found. She remained a missing person for nearly three years before her body was discovered in a drainage pipe in Chalamont Park in May 2018, in the immediate vicinity of where her car had been found. She had been dead since the time her car was found three years prior. Her death has been classified as a homicide.[1]\nEbby Jane Steppach was an 18 year-old high school student in Little Rock, Arkansas who was completing her senior year at Little Rock Central High School.[4] She had previously attended a private school, but transferred to a public school that year.[4] Wanting independence from her parents, Steppach decided to move out of her family's home at the beginning of the school year,[5] but was mainly staying with her grandparents and friends.[4] On October 21, 2015, Steppach missed school.[4] On Friday, October 23, she attended a party at some point during the evening.[4]\n",
        "type": [
            "murder"
        ]
    },
    "77": {
        "link": "/wiki/Paradise_Lost_3:_Purgatory",
        "title": "Paradise Lost 3: Purgatory",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "West Memphis",
        "county": "Crittenden County",
        "paragraph": "Paradise Lost 3: Purgatory is a 2011 American documentary film directed by Joe Berlinger and Bruce Sinofsky, and sequel to their films Paradise Lost: The Child Murders at Robin Hood Hills (1996) and Paradise Lost 2: Revelations (2000). The three films are about West Memphis Three, three teenage boys accused of the May 1993 murders and sexual mutilation of three prepubescent boys as a part of an alleged satanic ritual in West Memphis, Arkansas.[1] Purgatory offers an update on the case of the West Memphis Three, who were all recognized guilty of the murders in 1994 but kept on claiming their innocence since then, before culminating with the trio's attempt at an Alford plea.\nThe film premiered at the 2011 Toronto International Film Festival on September 11, 2011, before airing on HBO on January 12, 2012. It received a nomination for the Academy Award for Best Documentary Feature, as well as Primetime Emmy Award nominations for Exceptional Merit in Documentary Filmmaking and Outstanding Directing for Nonfiction Programming.\nJoe Berlinger and Bruce Sinofsky update the case of the West Memphis Three since the release of Paradise Lost 2: Revelations in 2000. Damien Echols's defense team has hired some of the most renowned forensic scientists to collect DNA and other evidence that had never been tested during the 1994 trials in hopes of getting a new trial. The defense teams and supporters of Echols, Jason Baldwin, and Jessie Misskelley have uncovered new details that occurred during the trial that led to guilty verdicts against them.\n",
        "type": [
            "murder"
        ]
    },
    "78": {
        "link": "/wiki/John_M._Clayton_(Arkansas_politician)",
        "title": "John M. Clayton (Arkansas politician)",
        "date": "January 29, 1889(1889-01-29) (aged 48) Conway County, Arkansas, U.S.",
        "year": "1889",
        "location": "",
        "state": "Arkansas",
        "place": "Conway County",
        "county": "Conway County",
        "paragraph": "John Middleton Clayton (October 13, 1840 – January 29, 1889) was an American politician who served as a Republican member of the Arkansas House of Representatives for Jefferson County from 1871 to 1873 and the Arkansas State Senate for Jefferson County. In 1888, he ran for a seat in the United States House of Representatives but lost to Clifton R. Breckinridge. Clayton challenged the results and was assassinated in 1889 during the challenge to the election. He was declared the winner of the election posthumously. The identity of his assassin remains unknown.\nHe was the brother of Arkansas Governor and U.S. Senator Powell Clayton, President Judge of the Thirty-Second Judicial District of Pennsylvania Thomas J. Clayton and twin-brother to U.S. Attorney W.H.H. Clayton.\nClayton was born on a farm in Bethel Township, Pennsylvania, to John and Ann Glover Clayton.[1] The Clayton family was descended from early Quaker settlers of Pennsylvania. Clayton's ancestor William Clayton emigrated from Chichester, England, was a personal friend of William Penn, one of nine justices who sat at the Upland Court in 1681, and a member of Penn's Council.[2]\n",
        "type": [
            "murder"
        ]
    },
    "79": {
        "link": "/wiki/Elijah_Wood_(murderer)",
        "title": "Elijah Wood (murderer)",
        "date": "July 14, 1913 (aged 35) Pulaski County Jail, Little Rock, Arkansas, U.S.",
        "year": "1913",
        "location": "",
        "state": "Arkansas",
        "place": "Pulaski County Jail",
        "county": "Pulaski County",
        "paragraph": "Elijah Green Wood (1878 – July 14, 1913) was an American murderer and accused serial killer. Convicted, sentenced to death and executed for killing a woman in Little Rock, Arkansas in 1912, he was posthumously accused by another death row inmate for three additional murders committed in 1910. Due to the fact he was already dead, Wood was never prosecuted for them and the three murders officially remain unsolved.\nOn November 28, 1912, a black woman named Alice Turner was shot and killed near the Frazier Pike in Little Rock in an apparent robbery. Initially, police arrested preacher W. A. Pearson on suspicion of being the killer, as it was determined that his shotgun had been used in the murder - however, Pearson convinced the authorities that it had been stolen from him and was then released.[1] On December 3, Wood, a laborer who worked at a nearby sawmill, was arrested for the murder after officers concluded that he had sold the murder weapon at a pawn shop. His wife Sarah was briefly detained on suspicion of harboring a fugitive, but was released after she promised to help the officers locate the stolen money.[2]\nAfter extensive questioning, Wood confessed that he had killed Turner because he wanted to steal a $10 bill she had shown to him, and that he had stolen $75 after killing her. He claimed that he alone was responsible, and that his brother James – who had been arrested as an accomplice – had nothing to do with the case.[1] As a result of this confession, James Wood was released, while Elijah was charged with first-degree murder and ordered to stand trial on January 9, 1913.[3]\n",
        "type": [
            "robber",
            "murder",
            "killing",
            "arson",
            "robbery"
        ]
    },
    "80": {
        "link": "/wiki/Clay_King_Smith",
        "title": "Clay King Smith",
        "date": "March 25, 1998",
        "year": "1998",
        "location": "",
        "state": "Arkansas",
        "place": "Pine Bluff",
        "county": "Jefferson County",
        "paragraph": "Clay King Smith (July 25, 1970 – May 8, 2001) was an American mass murderer executed by the state of Arkansas for the March 25, 1998, murders of Misty Erwin (age 20), Shelley Sorg (24), Shelley's two children Sean Sorg (5) and Taylor Sorg (3), and babysitter Samantha Rhodes (12) at his home near Pine Bluff, Arkansas.[1][2]\nSmith's girlfriend, Misty Erwin, reported that Smith battered her and requested police assistance to move out of the house. However, when police arrived, she withdrew her complaint and decided to stay with Smith. Two days later, her body was found in the house along with a cousin, two small children, and a babysitter. All were shot to death with a rifle.[3]\nSmith was arrested the day after the bodies were discovered. His capture followed a shootout with authorities near Star City in Lincoln County, Arkansas. Smith fled into a wooded area when police tracked him down to a house belonging to a local hunting club. Smith held police at bay for an hour with a rifle, which later proved to be the murder weapon. He was shot in an arm after he refused to put down the rifle. During the stand-off, he yelled at the police, \"I sent three of them to Heaven; I don't know where the other two went.\" Smith made several admissions during the stand-off, until he was shot in the arm by police. He claimed that the murders were drug-induced.[4]\n",
        "type": [
            "murder",
            "mass murder"
        ]
    },
    "81": {
        "link": "/wiki/Linda_Collins",
        "title": "Linda Collins",
        "date": "May 28, 2019(2019-05-28) (aged 57) Pocahontas, Arkansas, U.S.",
        "year": "2019",
        "location": "",
        "state": "Arkansas",
        "place": "Pocahontas",
        "county": "Randolph County",
        "paragraph": "\nLinda F. Collins (April 17, 1962 – May 28, 2019); known as Linda Collins-Smith until her divorce) was an American businesswoman and politician who served a single term from 2015 to 2019 as a Republican member of the Arkansas Senate.[1]\nOn June 4, 2019, she was found stabbed to death. Rebecca Lynn O'Donnell, a former campaign worker, was convicted of the murder.\n",
        "type": [
            "murder"
        ]
    },
    "82": {
        "link": "/wiki/Harris_Flanagin",
        "title": "Harris Flanagin",
        "date": "October 23, 1874(1874-10-23) (aged 56) Arkadelphia, Arkansas, U.S.",
        "year": "1874",
        "location": "",
        "state": "Arkansas",
        "place": "Arkadelphia",
        "county": "Clark County",
        "paragraph": "\nHarris Flanagin (November 3, 1817 – October 23, 1874) was an American politician and lawyer who served as the 7th governor of Arkansas from 1862 to 1864, and in exile from 1864 to 1865. Prior to this he was a Confederate States Army officer who commanded infantry in the Western Theater of the American Civil War.\nFlanagin was born in Roadstown, New Jersey, to James, a farmer and cabinetmaker, and Mary (née Harris) Flanagin. He was educated at a Quaker school in New Jersey and then went on to teach at Clermont Seminary in Frankford (present-day Philadelphia). Soon after he moved to Illinois, where he again tried teaching and while at this work studied law.[2] In 1838 Flanagin moved to Arkansas, settling first at Pine Bluff, then Little Rock, then Clark County in 1839, and Arkadelphia in 1842. He served in the Arkansas House of Representatives from 1842 to 1844 and the Arkansas Senate from 1848 to 1850. He was married on July 3, 1851, to Miss Martha Eliza Nash of Lafayette County.[3] During the American Civil War Flanagin was promoted to colonel,[4] commanding the 2d Arkansas Mounted Rifles.[5]\n",
        "type": []
    },
    "83": {
        "link": "/wiki/Thomas_James_Churchill",
        "title": "Thomas James Churchill",
        "date": "May 14, 1905(1905-05-14) (aged 81) Little Rock, Arkansas, U.S.",
        "year": "1905",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nThomas James Churchill (March 10, 1824 – May 14, 1905) was an American politician who served as the 13th governor of Arkansas from 1881 to 1883. Prior to that, he was a senior officer of the Confederate States Army who commanded infantry in the Western and Trans-Mississippi theaters of the American Civil War.\nThomas James Churchill was born near Louisville, Kentucky.[a] He graduated from St. Mary's College in Bardstown in 1844, then studied law at Transylvania University in Lexington. He served during the Mexican War, rising to the rank of first lieutenant in the 1st Kentucky Cavalry Regiment. He was captured by the Mexicans and remained a prisoner of war until near the end of that conflict. In 1848, he moved to Little Rock, Arkansas, married the daughter of United States Senator Ambrose H. Sevier, and became a planter. Appointed by President James Buchanan, he served as postmaster from September 1857 to March 1861.[1]\n",
        "type": []
    },
    "84": {
        "link": "/wiki/Paradise_Lost:_The_Child_Murders_at_Robin_Hood_Hills",
        "title": "Paradise Lost: The Child Murders at Robin Hood Hills",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "West Memphis",
        "county": "Crittenden County",
        "paragraph": "Paradise Lost: The Child Murders at Robin Hood Hills is a 1996 American documentary film directed, produced and edited by Joe Berlinger and Bruce Sinofsky about the trials of the West Memphis Three, three teenage youths accused of the May 1993 murders and sexual mutilation of three prepubescent boys as a part of an alleged satanic ritual in West Memphis, Arkansas.\nThe film uses the music of Metallica instead of an original soundtrack, the first time that the band authorized their music to be used in a film.[1] It was well received by critics, and won the Primetime Emmy Award for Outstanding Informational Programming. It was followed by two sequels, also made by Berlinger and Sinofsky, which followed the evolution of the case through the years: Paradise Lost 2: Revelations in 2000, and  Paradise Lost 3: Purgatory in 2011.\nThe film documents the events following the arrests of Misskelley, Echols and Baldwin for the murders of Christopher Byers, Michael Moore and Stevie Branch, whose naked and hogtied bodies were discovered in a ditch in a wooded area of West Memphis, Arkansas, known as \"Robin Hood Hills\".\n",
        "type": [
            "murder"
        ]
    },
    "85": {
        "link": "/wiki/James_M._Hinds",
        "title": "James M. Hinds",
        "date": "October 22, 1868(1868-10-22) (aged 34) near Indian Bay, Arkansas, U.S.",
        "year": "1868",
        "location": "",
        "state": "Arkansas",
        "place": "Hinds",
        "county": "Pike County",
        "paragraph": "\nJames M. Hinds (December 5, 1833 – October 22, 1868) was an American politician during the Reconstruction era following the Civil War. He represented Arkansas in the United States House of Representatives for the 2nd congressional district from June 24, 1868, until his assassination four months later by the Ku Klux Klan. Hinds was an advocate of civil rights for former slaves.\nBorn and raised in a small town in upstate New York, Hinds went west at the age of nineteen and graduated in 1856 from the Cincinnati Law School in Cincinnati, Ohio. He settled in Minnesota, where he opened a private law practice and was elected district attorney of his county. Looking for a fresh start, Hinds moved to the capital city of Little Rock, Arkansas in 1865. In 1867, he was elected to represent Pulaski County as a Republican at the Arkansas Constitutional Convention. The convention was tasked with rewriting the constitution to allow Arkansas' readmission to the Union following its secession and the American Civil War. At that convention, Hinds successfully advocated for constitutional provisions establishing the right to vote for adult freedmen, and for public education for both black and white children.\n",
        "type": [
            "murder"
        ]
    },
    "86": {
        "link": "/wiki/West_Memphis_Three",
        "title": "West Memphis Three",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "West Memphis",
        "county": "Crittenden County",
        "paragraph": "\nThe West Memphis Three are three men convicted as teenagers in 1994 of the 1993 murders of three boys in West Memphis, Arkansas, United States. Damien Echols was sentenced to death, Jessie Misskelley Jr. to life imprisonment plus two 20-year sentences, and Jason Baldwin to life imprisonment. During the trial, the prosecution asserted that the juveniles killed the children as part of a Satanic ritual.[1][2][3]\nDue to the dubious nature of the evidence as well as the suspected presence of emotional bias in court, the case generated widespread controversy and was the subject of several documentaries. Celebrities and musicians held fundraisers to support efforts to free the men.[4]\n",
        "type": [
            "murder"
        ]
    },
    "87": {
        "link": "/wiki/Gordon_Kahl",
        "title": "Gordon Kahl",
        "date": "June 4, 1983 (aged 63) Smithville, Arkansas",
        "year": "1983",
        "location": "",
        "state": "",
        "place": "Smithville",
        "county": "Lawrence County",
        "paragraph": "\nGordon Wendell Kahl (January 8, 1920 – June 3, 1983) was an American member of the far right Posse Comitatus movement who was involved in two fatal shootouts with law enforcement officers in the United States in 1983.[1]\nGordon Kahl was born in Wells County, North Dakota, on January 8, 1920. Kahl had one sister, Loreen, who died in 1937 at the age of seven. Raised on a farm,[2] Kahl was a highly decorated turret gunner during World War II.[3] After the war, \"he had a 400-acre (1.6 km2) farm near Heaton, Wells County, North Dakota,[4] [but] bounced around the Texas oilfields in later life as a mechanic and general worker.\"[2]\n",
        "type": [
            "murder"
        ]
    },
    "88": {
        "link": "/wiki/Brooks%E2%80%93Baxter_War",
        "title": "Brooks–Baxter War",
        "date": "April 15 – May 15, 1874 (30 days)",
        "year": "1874",
        "location": "Little Rock and New Gascony, Arkansas",
        "state": "Arkansas",
        "place": "New Gascony",
        "county": "Jefferson County",
        "paragraph": "\nElisha Baxter\nJoseph Brooks\n",
        "type": []
    },
    "89": {
        "link": "/wiki/Lynching_of_Aaron_and_Anthony_(Arkansas,_1856)",
        "title": "Lynching of Aaron and Anthony (Arkansas, 1856)",
        "date": "",
        "year": "1856",
        "location": "",
        "state": "Arkansas",
        "place": "Washington County",
        "county": "Washington County",
        "paragraph": "\nAaron, Anthony, and Randall were three enslaved Black men who died of racial terror. Aaron and Anthony were lynched in 1856 in Washington County, Arkansas, after being accused of a murder and released by the court, one because he was proven and the other for lack of evidence. Randall was hanged for that crime. An oral history recounts that the white man who had been killed, the enslaver James Boone, had sexually assaulted a Black woman, who killed him in self-defense, and that the three men were implicated by Boone's family.[1]\nAaron and Anthony, who were enslaved by James Boone (in Richland Township, near Elkins, Arkansas), were accused of having murdered him. Both men were tried on July 7, 1856, in the courthouse of Washington County. Anthony was proven innocent, and for Aaron there was no evidence to convict. A white mob kidnapped them from the courthouse, and lynched them. Later, on August 1, another enslaved man named Randall who had been found guilty of that murder by an all-white jury, was hanged, probably at Fayetteville National Cemetery. An oral history, uncovered by a Washington County historian, explained that \"on May 29, 1856, James Boone attempted to sexually assault an enslaved Black woman who fatally assaulted him in self-defense. The Boone family then implicated Aaron, Anthony and Randall in Boone's death\".[1]\n",
        "type": [
            "murder",
            "lynching",
            "kidnapped",
            "assault"
        ]
    },
    "90": {
        "link": "/wiki/Murder_of_Lisa_Rene",
        "title": "Murder of Lisa Rene",
        "date": "November 19, 2020(2020-11-19) (aged 49) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "Lisa Rene (1978 – September 26, 1994) was an American teenage girl who was kidnapped from her apartment in Texas, raped over the course of two days, and buried alive in Arkansas. She was kidnapped on September 24, 1994, by four men: 23-year-old Orlando Cordia Hall, 21-year-old Bruce Carneil Webster, 19-year-old Demetrius Kenyon Hall, and 22-year-old Steven Christopher Beckley.[1][2] Another man, 23-year-old Marvin Terrance Holloway, did not directly participate in her kidnapping, rape, or murder, but was present at times and provided financial assistance to the group.\nOrlando Hall, considered to be the ringleader in the crime, was sentenced to death and executed by the federal government in 2020.\nLisa Rene was born in 1978 in Saint Croix on the U.S. Virgin Islands. Prior to her death, she had moved to Texas to study. Rene was 16 years old when she died.[3] She had wanted to become a doctor.[4]\n",
        "type": [
            "murder",
            "kidnapped",
            "kidnapping",
            "rape"
        ]
    },
    "91": {
        "link": "/wiki/James_B._Grinder",
        "title": "James B. Grinder",
        "date": "2010(2010-00-00) (aged 64–65)",
        "year": "2010",
        "location": "",
        "state": "Arkansas",
        "place": "Macon County",
        "county": "Pulaski County",
        "paragraph": "\nJames B. Grinder (1945–2010) was an American serial killer and rapist who murdered three teenage girls in Arkansas and a woman in Missouri between 1976 and 1984.[1] Grinder wasn't apprehended until his confession in March 1998. However, authorities still had little evidence tying Grinder to the murders, so they used a technique known as brain fingerprinting to help prove his guilt. In 1999, Grinder was convicted of the four murders and sentenced to life imprisonment. He remained imprisoned until his death in 2010.[2]\nJames B. Grinder was born in 1945.[1] In 1980, Grinder had a daughter, but he and his child's mother split-up soon afterward. He later moved to Macon County, Missouri.[2]\n",
        "type": [
            "murder"
        ]
    },
    "92": {
        "link": "/wiki/James_D._Johnson",
        "title": "James D. Johnson",
        "date": "February 13, 2010(2010-02-13) (aged 85) Conway, Arkansas",
        "year": "2010",
        "location": "",
        "state": "Arkansas",
        "place": "Conway",
        "county": "Conway County",
        "paragraph": "James Douglas Johnson (August 20, 1924 – February 13, 2010), known as \"Justice Jim\" Johnson, was an Arkansas legislator and jurist known for outspoken support of racial segregation during the mid-20th century. He served as an associate justice of the Arkansas Supreme Court from 1959 to 1966, and in the Arkansas Senate from 1951 to 1957. Johnson unsuccessfully sought several elected positions, including Governor of Arkansas in 1956 and 1966, and the United States Senate in 1968.[6] A segregationist, Johnson was frequently compared to George Wallace of Alabama.[7] He joined the Republican Party in 1983.\nJohnson was a native of Crossett in southern Arkansas near the Louisiana state line. He was the son of T. W. and Myrtle née Long Johnson, who owned and operated a grocery store in the sawmill town. During World War II, Johnson was drafted into the United States Marine Corps, serving in the Pacific Theater. After the war, Johnson attended Cumberland University, married Conway-native Virginia Lillian Morris, and returned to Crossett to start a law practice.[8] She would serve as his legal secretary for the rest of her life.\nJohnson was said to have admired the political style of Huey Long, but was to Long's political right.[citation needed] His interest in politics grew following the 1948 Democratic National Convention and formation of the Dixiecrat party.[8] When former Governor of Arkansas Benjamin T. Laney recommended Johnson run for office, he sought the District 27 seat in the Arkansas Senate, which covered Ashley and Chicot counties. He was seated in the 58th Arkansas General Assembly.[3]\n",
        "type": []
    },
    "93": {
        "link": "/wiki/Lynching_of_John_Carter",
        "title": "Lynching of John Carter",
        "date": "May 4, 1927Little Rock, Arkansas, United States",
        "year": "1927",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nJohn Carter was an African-American man who was murdered in Little Rock, Arkansas, on May 4, 1927.[1] Grabbed by a mob after another Black man had been apprehended for the alleged murder of a white girl, Carter was hanged from a telephone pole, shot, dragged through the streets, and then burned in the center of the city's Black part of town with materials that a white crowd of perhaps 5,000 people had looted from nearby stores and businesses.[2]\nNoted as \"one of the most notorious incidents of racial violence in the state's history\", the prelude to the lynching of John Carter happened on April 30, 1927, with the discovery of the body of a young white girl, found in the First Presbyterian Church. The body was found by the janitor named Dixon, and the next day the police arrested him and his \"mulatto\" son,[2] Lonnie Dixon. They were moved to the city jail of Texarkana, because the local authorities feared unrest, and that night a crowd of thousands gathered at the city hall hoping to kill the two.  On May 1 people were searching nearby jails in Arkansas to find where the Dixons had been moved to, and crowds were still assembling outside the state penitentiary demanding the Dixons on the night of May 2.  Tensions over the murder remained high over the next few days, and when on May 4 a Black man, John Carter, was accused of assaulting a white woman and her daughter, an armed posse went looking for him.[2][3] When they found him, on the outskirts of Little Rock, they pistol-whipped him before they hanged him from a telephone pole and took shots at him with rifles, hitting more than 200 times.[4][5]\n",
        "type": [
            "murder",
            "lynching",
            "assault"
        ]
    },
    "94": {
        "link": "/wiki/Long_line_rider",
        "title": "Long line rider",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "Long line rider was a person in the Arkansas prison system of the twentieth century who supervised inmates, particularly in the area of field production. He was second in command to the inmate yardman.[1] Bobby Darin's song \"Long Line Rider\"[2] highlighted the terror of the Cummins Prison Farm (Cummins Unit), where the skeletons of three prisoners were discovered in January 1968.[3]\nLong line riders were armed guards who rode on horseback. They were overseers of inmates who were swinging hoes. In instances when inmates escaped, long line riders released bloodhounds to track them.[4] Long line riders at the Cummins Prison farm were made up of inmates, called trusties, who were often serving long prison sentences for armed robbery or murder.[3]\n",
        "type": [
            "murder",
            "robbery",
            "robber"
        ]
    },
    "95": {
        "link": "/wiki/Devil%27s_Knot:_The_True_Story_of_the_West_Memphis_Three",
        "title": "Devil's Knot: The True Story of the West Memphis Three",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "West Memphis",
        "county": "Crittenden County",
        "paragraph": "Devil's Knot: The True Story of the West Memphis Three is a 2002 true crime book by Mara Leveritt, about the 1993 murders of three eight-year-old children and the subsequent trials of three teenagers charged with and convicted of the crimes. The names of the three teens convicted - Damien Echols, Jason Baldwin, and Jessie Misskelley - would come to be known as the West Memphis Three. Leveritt's book revolves around the central idea that the three teenagers' convictions stemmed from \"Satanic panic\" rather than actual evidence. The book also focuses on one of the victim's stepfathers and his possible connection with the murders. All three teenagers convicted were released on August 19, 2011. A film based on the book, Devil's Knot, was released in 2013.[1]\nOn May 5, 1993, Christopher Byers, Michael Moore, and Steven Branch went missing from their homes in West Memphis, Arkansas.  The next day, their bodies were found in the woods near their homes with evidence showing they had been brutally beaten and savagely murdered. In Byers' case the evidence revealed that he had been castrated, and his genitals skinned before he was killed. News of the boys' deaths and the manner in which it happened soon reached the inhabitants of the small community. The rumor then spread that the nature of Byers' death, in particular  hinted that the deaths may have been related to a Satanic ritual.\nWeeks after the murders, a local woman, Vicki Hutcheson, brought her eight-year-old son Aaron to see the police. Aaron claimed to have witnessed the kidnapping of his three friends. Vicki volunteered to help the investigation by becoming \"involved\" with both Jessie and Damien. Hutcheson was a neighbor of Jessie's and coaxed him into setting up a \"meeting\" with Damien, so Hutcheson and Damien could get to know each other. Vicki would later claim to the police that she had attended an Esbat with both men. Years after the trials, Hutcheson would admit that she had lied about attending the Esbat. Over the months that led up to the arrests and trials, her son Aaron would also change his account of what happened numerous times; each time the story became more outrageous and unbelievable.\n",
        "type": [
            "murder",
            "kidnapping"
        ]
    },
    "96": {
        "link": "/wiki/Joseph_Gerald_Branch_II",
        "title": "Joseph Gerald Branch II",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Desha",
        "county": "Desha County",
        "paragraph": "Joseph Gerald Branch II (died November 22, 1867; also known as Joseph Gerald Branch III and Joseph Branch II) was a state  legislator in Florida at the age of 21, worked as a lawyer, and had a plantation in Desha, Arkansas. He was assassinated on his plantation. His father was Joseph Branch,[1] a lawyer and the first attorney general in Florida.[2]\nJoseph Branch was in the Branch family that included North Carolina Governor John Branch and Confederate Army Brigadier General Lawrence O'Bryan Branch.\nHe married Mary Polk, also of a prominent family. They lived on the plantations of Branch's in-laws and had many slaves.[3]\n",
        "type": [
            "murder"
        ]
    },
    "97": {
        "link": "/wiki/Old_State_House_(Little_Rock,_Arkansas)",
        "title": "Old State House (Little Rock, Arkansas)",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nThe Old State House, formerly called the Arkansas State House, is the oldest surviving state capitol building west of the Mississippi River. It was the site of the secession convention, as well as the fourth constitutional convention when delegates agreed to ensure voting rights for freedmen and establish public education.\nCommissioned by Governor John Pope, the State House was constructed between 1833 and 1842.[3] Architect Gideon Shryock, who previously designed the Kentucky State Capitol in Frankfort, chose a Greek Revival style for the building. The original design was too expensive for the territory, so Shryock's assistant George Weigart changed the plans and oversaw construction. The Arkansas General Assembly moved into the building while construction was ongoing. On December 4, 1837, in the first session of the General Assembly, Speaker John Wilson killed Representative Joseph J. Anthony in a knife fight on the floor of the state House of Representatives.\n",
        "type": []
    },
    "98": {
        "link": "/wiki/Joseph_Brooks_(politician)",
        "title": "Joseph Brooks (politician)",
        "date": "April 30, 1877(1877-04-30) (aged 64) Little Rock, Arkansas, U.S.",
        "year": "1877",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nJoseph Brooks (November 1, 1821 – April 30, 1877) was a Methodist minister, newspaper editor, and politician who served as the 19th postmaster of Little Rock, Arkansas, from 1875 to 1877.[1] During the Reconstruction Period in Arkansas (1864–74), Brooks and the \"Brindle Tails\" faction of the state's Republican Party led a coalition group in an attempt to overthrow Republican governor Elisha Baxter. The Spring 1874 coup d'état attempt came to be known as the Brooks–Baxter War.\nJoseph Brooks was born in Cincinnati, Ohio, and worked as a minister, preacher, and Methodist church official in Illinois and Missouri from 1840 to 1862. He also worked as a newspaper editor for the Central Christian Advocate in St. Louis. In 1862, he joined the United States Volunteers as a chaplain. In 1863 Brooks, an ardent abolitionist since the 1850s, became chaplain of the 56th United States Colored Infantry. Brooks resigned from the U.S. Volunteers on February 1, 1865.[2]\n",
        "type": []
    },
    "99": {
        "link": "/wiki/Redhead_murders",
        "title": "Redhead murders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "\nThe Redhead murders is the media epithet used to refer to a series of unsolved homicides of redheaded females in the United States between October 1978 and 1992, believed to have been committed by an unidentified male serial killer. The murders believed to be related have occurred in states including Tennessee, Arkansas, Kentucky, Mississippi, Pennsylvania, and West Virginia.[1][2][3] The murders may have continued until 1992.[4][5][6] The victims, many remaining unidentified for years, were usually women with reddish hair, whose bodies were abandoned along major highways in the United States. Officials believe that the women were likely hitchhiking or may have engaged in sex work.[3][7]\nAuthorities are unsure how many people were responsible for these murders, if they were all performed by the same perpetrator(s), and how many victims there have been.[8] It is believed that there may have been a total of five to fourteen victims.[3][9][10] Of the presumed victims, four were identified by November 2018.[11][8][12][13] The suspect was informally called the \"Bible Belt Strangler\" in 2018, because of the territory where the bodies were found.\n",
        "type": [
            "murder"
        ]
    },
    "100": {
        "link": "/wiki/Charles_Laverne_Singleton",
        "title": "Charles Laverne Singleton",
        "date": "June 1, 1979",
        "year": "1979",
        "location": "",
        "state": "Arkansas",
        "place": "Hamburg",
        "county": "Ashley County",
        "paragraph": "Charles Laverne Singleton (March 29, 1959 – January 6, 2004)[1] was an American convicted murderer, who, at the time of his execution, lived on death row in Arkansas longer than any other state inmate.[2] He was executed in 2004 for the June 1, 1979, murder of 19-year-old Hamburg store owner Mary Lou York.[3][4]\nMary Lou York was attacked in York's Grocery Store, of which she was the owner. She died in the hospital from loss of blood as a result of two stab wounds in her neck.[4]\nThe evidence of Charles Singleton's guilt was overwhelming. Patti Franklin (a relative of Singleton) and Lenora Howard, who were both witnesses at the scene, identified him as having attacked York. Prior to her death, en route to the hospital, York also identified Singleton as her attacker. She told both police officer Strother, first to arrive at the scene, and her personal physician, Dr. J.D. Rankin, that she was dying and that Singleton did it. He was 20 years old at the time.[4]\n",
        "type": [
            "murder"
        ]
    },
    "101": {
        "link": "/wiki/Jacob_D._Robida",
        "title": "Jacob D. Robida",
        "date": "February 5, 2006(2006-02-05) (aged 18) Springfield, Missouri, United States",
        "year": "2006",
        "location": "",
        "state": "Arkansas",
        "place": "Springfield",
        "county": "Conway County",
        "paragraph": "Jacob D. Robida (June 13, 1987 – February 5, 2006) was an American neo-Nazi and murderer. Robida attacked three patrons at a gay bar in New Bedford, Massachusetts on February 2, 2006 before fleeing by vehicle to Charleston, West Virginia, where he picked up passenger Jennifer Rena Bailey and drove southwest. He was stopped for a traffic violation by Gassville, Arkansas police officer James W. Sell, whom Robida shot and killed before fleeing east. Robida lost control of his vehicle in Norfork, Arkansas shortly after running over a spike strip laid by police. He then engaged in a firefight with police, during which he fatally shot Bailey and then shot himself in the head.\nRobida died in a hospital in Springfield, Missouri at 03:38 CST on February 5, 2006.\nAbout midnight on February 2, 2006, Robida entered Puzzles Lounge, a popular gay bar in New Bedford, Massachusetts, 50 miles (80 km) south of Boston. The 18-year-old, dressed in black, proceeded to order a drink allegedly using a fake ID indicating he was 23.  After downing his first drink, he asked the bartender if the lounge was a gay bar. The bartender confirmed it was. After a second drink Robida then swung a hatchet at a patron's head, injuring him. Other patrons tackled him and relieved him of the weapon, whereupon Robida produced a handgun and began shooting, wounding at least three more people. Police treated the incident as a hate crime, and Robida was sought by police for three counts of attempted murder.\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "102": {
        "link": "/wiki/Jack_Harold_Jones",
        "title": "Jack Harold Jones",
        "date": "April 24, 2017(2017-04-24) (aged 52) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "2017",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Jack Harold Jones Jr. (August 10, 1964 – April 24, 2017)[1] was an American serial killer who murdered at least three women in Florida and Arkansas between 1983 and 1995. Convicted of two murders during his lifetime and executed in 2017,[2] he was posthumously linked via DNA to the third murder, for which another man was imprisoned.[3]\nOn May 2, 1983, Regina Harrison, a 20-year-old college student, left her parents' home for a nightly bike ride in Hollywood's North Beach neighborhood, but failed to return home.[4] Friends and family found her nude body in the woods in West Lake Park.[3] She had been strangled to death and her body discarded. During the subsequent investigation, witnesses reported that they had seen the woman riding accompanied by a skinny, long-haired man on a black bike.[4]\nThere were no leads in the case for five months, until a detective from Fort Lauderdale, John Curcio, saw a program airing the case on TV. He had been a member of an investigative unit which had captured Ronald Henry Stewart, a serial rapist who had terrorized women in Broward County and Harrison County, Mississippi during the late 1980s,[5] and took notice that Stewart resembled the suspect sketch, in addition to being in possession of a black bike at the time of his arrest.[4] A witness who said they had seen Regina and her alleged killer on the beach pointed to Ronald as the man she had seen, and he was soon charged with Harrison's murder. In order to avoid the death penalty, Stewart entered a plea of no contest and was given 50 years imprisonment in January 1985, to run concurrently with his other sentences for the sexual offenses.[3] Although several factors pointed towards his innocence in the case, including the fact that his fingerprints did not match those found at the crime scene, Stewart confessed to the crime. He never repudiated the confession nor claimed it was coerced while serving his time.[4] Stewart died behind bars from cancer in 2008.[5]\n",
        "type": [
            "murder"
        ]
    },
    "103": {
        "link": "/wiki/Lynching_of_Winston_Pounds",
        "title": "Lynching of Winston Pounds",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Wilmot",
        "county": "Ashley County",
        "paragraph": "Winston Pounds was an African-American man who was lynched by a mob in Wilmot, Arkansas, on August 25[1] or 26, 1927.[2][3]\nAccording to white newspapers, Pounds was hanged after being accused of breaking into and entering the house of a white man, and then allegedly assaulting his wife. An armed mob of fifty white men took him from the sheriff and his deputies, and hanged him a mile and a half away from town. A Black newspaper, however, noted that there had been bad blood, and that the white man, J. W. McGarry, had been seeking revenge on Pounds because Pounds's father had gotten the best of McGarry's father years earlier. There was no other evidence other than bloodhounds supposedly following the alleged assailant's tracks. White newspapers likewise didn't report on the torture that Pounds had to suffer while being hanged; they did note that the deputies recognized no one from the mob, and the result of the inquest was that \"Pounds had died at the hands of persons unknown\".\nAccording to the US Census, Winston Pounds Jr. was born to Winston and Florence Pounds, farmers, around 1906. The lynching involved him and a white man called J. W. McGarry. Pounds was described in one newspaper as \"a good young man, who was never known to be in any kind of trouble with anyone.\"[1] He was 20 years old at the time of his murder.[4]\n",
        "type": [
            "murder",
            "lynching",
            "torture",
            "assault"
        ]
    },
    "104": {
        "link": "/wiki/Marion_Albert_Pruett",
        "title": "Marion Albert Pruett",
        "date": "April 12, 1999(1999-04-12) (aged 49) Cummins Unit, Grady, Arkansas, U.S.",
        "year": "1999",
        "location": "",
        "state": "Arkansas",
        "place": "Atlanta",
        "county": "Columbia County",
        "paragraph": "Marion Albert Pruett (October 4, 1949 – April 12, 1999)[2][3] was an American serial killer.\nIn 1979, Pruett was given $800, a new name (Charles \"Sonny\" Pearson), and placed in the United States Federal Witness Protection Program after testifying about a federal prison slaying in Atlanta, Georgia. He then began his crime spree under his alias.  Pruett would later claim that he had perpetrated the prison murder, contradicting his previous testimony for which he had received federal protection.\nPruett killed Peggy Lowe after he kidnapped her on September 17, 1981 while robbing the Metrocenter Branch of Unifirst Bank (later Trustmark National Bank) in Jackson, Mississippi where she worked; Bobbie Jean Robertson, a convenience store clerk in Fort Smith, Arkansas; and Anthony Taitt and James Balderson, two convenience store clerks in Colorado. He received the death penalty for Lowe's murder, two more life sentences for the murders in Colorado, and the death penalty for Robertson's murder.\n",
        "type": [
            "murder",
            "kidnapped",
            "arson"
        ]
    },
    "105": {
        "link": "/wiki/Fort_Chaffee_crisis",
        "title": "Fort Chaffee crisis",
        "date": "May - June, 1980",
        "year": "1980",
        "location": "Arkansas",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "Law enforcement\nBill Clinton\nThe Fort Chaffee crisis occurred during the Mariel boatlift in 1980 when over 19,000 Cuban refugees were detained at Fort Chaffee. They could not be released into the public because they were not United States citizens. After a promise of quick release many processing setbacks occurred and many refugees remained still detained at the center. Frustrated with the conditions at the facility and the slow processing many refugees rioted, 62 refugees were injured (some by gunfire) and 46 others were arrested. Refugees at the center would go on to refer to the riot as El Domingo. After the riots Governor Bill Clinton put heavy fortifications at the center. Clinton would lose the later Arkansas election after his opponent would use the incident against him.[1]\n",
        "type": [
            "riot"
        ]
    },
    "106": {
        "link": "/wiki/Death_of_Chavis_Carter",
        "title": "Death of Chavis Carter",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "The death of Chavis Carter occurred on July 29, 2012. Carter, a 21-year-old Black American man, was found dead from a gunshot while handcuffed in the back of a police patrol car. His death was ruled a suicide by the Arkansas State Crime Lab.[1][2]\nCarter was in the passenger seat of a pickup truck which was stopped by the Jonesboro Police Department of Jonesboro, Arkansas.[3] It was reported that an officer found small amounts of cannabis on his person after a body search and ran his information through the police computer network.[3] The officers discovered that he had an outstanding warrant, so they placed him under arrest, searching him again and handcuffing his hands behind his back before placing him in the patrol vehicle.[3]\nMinutes later, the officers discovered that Chavis Carter was shot in the head. The officers found a semi-automatic, .380-caliber Cobra pistol near the body.[1] The Jonesboro Police Department believe that he had hidden the gun on his person that the officers did not detect through the two searches and used it on himself.[4] Carter's mother disagreed, claiming that Carter had no history of suicidal thoughts or actions, and addressed the fact that he had made arrangements with his girlfriend to meet him at the prison the next day, and that the police killed him.[1] In addition, she states that he was left-handed[1] and was handcuffed behind his back, yet the bullet entered through his right temple. The two officers at the scene were placed on administrative leave and an investigation was started.[5]\n",
        "type": []
    },
    "107": {
        "link": "/wiki/Anthony_House_(Little_Rock,_Arkansas)",
        "title": "Anthony House (Little Rock, Arkansas)",
        "date": "",
        "year": "",
        "location": "Little Rock, Arkansas",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nThe Anthony House was a famous 22 room hotel on the southwest corner of Markham and Scott streets in Little Rock. Construction on the hotel began in 1838. It served as the headquarters for Arkansas governor Elisha Baxter during the Brooks-Baxter War.[1] The hotel was destroyed by fire on September 19, 1875.[2]\n\n",
        "type": []
    },
    "108": {
        "link": "/wiki/John_E._Bennett_(judge)",
        "title": "John E. Bennett (judge)",
        "date": "December 31, 1893(1893-12-31) (aged 60) Pierre, South Dakota",
        "year": "1893",
        "location": "",
        "state": "Arkansas",
        "place": "Pierre",
        "county": "Washington County",
        "paragraph": "John Emory Bennett (March 18, 1833 – December 31, 1893) was a justice of the Arkansas Supreme Court from 1871 to 1874, and a justice of the South Dakota Supreme Court from 1889 until his death.\nBorn in East Bethany, Genesee County, New York, Bennett was educated at Genesee Wesleyan Seminary of Lima, New York, graduating in 1852.[1]\nHe moved to Illinois, where he was the first postmaster of Morrison, Illinois.[1] At the breaking out of the American Civil War, he joined the Union Army and was elected as Lieutenant Colonel of the 75th Illinois Volunteer Infantry Regiment, and in December 1862, was promoted to Colonel and served throughout the war.[1] After the war he served for some time as judge advocate in the regular army, and after Arkansas was reconstructed he was elected Judge of the First Circuit, in 1868.[1] He was appointed to the first Board of Trustees of the Arkansas Industrial University, known now as the University of Arkansas, in 1871 and introduced the motion to name Fayetteville, Arkansas as its location.[2] He was then elected as a justice of the Arkansas Supreme Court in 1871.[1]\n",
        "type": []
    },
    "109": {
        "link": "/wiki/Arthur_Hodges",
        "title": "Arthur Hodges",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Clark County",
        "county": "Clark County",
        "paragraph": "Arthur Hodges (c. 1893 – December 18, 1914) was a white man who became the first person in Clark County, Arkansas to be executed by means of the electric chair. Prior to that all executions were carried out by way of hanging or firing squad. He was the fourth person so executed in Arkansas and one of eight men executed by the state in a 16-day period. The eight executions in a 16-day period were the subject of an article, \"Eight to Die in Arkansas\", published in The Kansas City Star.\nThe 21-year-old Hodges was convicted of killing a Clark County constable while resisting arrest. As described in court documents, Clark County Constable Morgan Garner, assisted by citizen J.E. Chancellor, arrested Hodges for the theft of a pistol and some small items of value. Hodges inquired as to whether Garner had a warrant for his arrest, to which Garner replied he did not. Hodges then refused to be arrested, at which point Garner produced his service pistol, ordering Hodges to put his hands up and submit to a search. Hodges did have a pistol on his person, but Garner, by Hodges' own admission, failed to find the weapon during a search of him. Hodges claimed that he was abused physically by Garner, and that while en route to the jail Garner threatened to shoot him. Hodges then claimed that he produced his own pistol, which Garner had not located, and fired in an effort to frighten Garner. Instead, Garner was shot twice, killing him. Hodges appealed his Clark County conviction and sentence of execution, but the Clark County decision was upheld. He was executed on December 18, 1914.\n\n",
        "type": [
            "murder",
            "killing",
            "theft"
        ]
    },
    "110": {
        "link": "/wiki/Frank_Stanford",
        "title": "Frank Stanford",
        "date": "June 3, 1978(1978-06-03) (aged 29) Fayetteville, Arkansas, U.S.",
        "year": "1978",
        "location": "",
        "state": "Arkansas",
        "place": "Fayetteville",
        "county": "Washington County",
        "paragraph": "Frank Stanford (born Francis Gildart Smith; August 1, 1948 – June 3, 1978) was an American poet. He is most known for his epic, The Battlefield Where The Moon Says I Love You – a labyrinthine poem without stanzas or punctuation. In addition, Stanford published six shorter books of poetry throughout his twenties, and three posthumous collections of his writings (as well as a book of selected poems) have also been published.\nFrank Stanford was born Francis Gildart Smith on August 1, 1948, to widow Dorothy Margaret Smith at the Emery Memorial Home in Richton, Mississippi.[1][2][3] He was soon adopted by a single divorcee named Dorothy Gilbert Alter (1911–2000),[4] who was Firestone's first female manager.[1][5] In 1952, Gilbert married successful Memphis levee engineer[5] Albert Franklin Stanford (1884–1963),[6] who subsequently also adopted \"Frankie\" and his younger, adoptive sister, \"Ruthie\" (Bettina Ruth). Stanford attended Sherwood Elementary School and Sherwood Junior High School in Memphis until 1961 when the family moved to Mountain Home, Arkansas, following A. F. Stanford's retirement;[2][7] Stanford finished junior high school in Mountain Home.[7] The elder Stanford died after the poet's freshman year at Mountain Home High School.[2][6][7]\nIn 1964, as a junior,[7] Stanford entered Subiaco Academy near Paris, Arkansas, in the Ouachita Mountains. He entered the University of Arkansas in Fayetteville where he started to write poetry, and soon became known throughout the Fayetteville literary community,[5][8] and published poetry in the student literary magazine, Preview.[9] However, he left the university, never earning a degree.[10]\n",
        "type": []
    },
    "111": {
        "link": "/wiki/Elaine_massacre",
        "title": "Elaine massacre",
        "date": "September 30, 1919",
        "year": "1919",
        "location": "Hoop Spur, Phillips County, Arkansas, U.S.",
        "state": "Arkansas",
        "place": "Phillips County",
        "county": "Phillips County",
        "paragraph": "The Elaine massacre occurred on September 30–October 2, 1919 at Hoop Spur in the vicinity of Elaine in rural Phillips County, Arkansas. As many as several hundred African Americans and five white men were killed.[4] Estimates of deaths made in the immediate aftermath of the Elaine Massacre by eyewitnesses range from 50 to \"more than a hundred\".[5] Walter Francis White, an NAACP attorney who visited Elaine shortly after the incident, stated \"... twenty-five Negroes killed, although some place the Negro fatalities as high as one hundred\".[6] More recent estimates in the 21st century of the number of black people killed during this violence are higher than estimates provided by the eyewitnesses, and have ranged into the hundreds.[3][2] Robert Whitaker estimated 856 people were killed in his 2008 book on this topic.[7] The white mobs were aided by federal troops (requested by Arkansas governor Charles Hillman Brough) and terrorist organizations such as the newly revived Ku Klux Klan.[8]  Gov. Brough led a contingent of 583 US soldiers from Camp Pike, with a 12-gun  machine gun battalion.[7]\nAccording to the Encyclopedia of Arkansas, \"the Elaine Massacre was by far the deadliest racial confrontation in Arkansas history and possibly the bloodiest racial conflict in the history of the United States\".[9][10]\nAfter the massacre, state officials concocted an elaborate cover-up, claiming that blacks were planning an insurrection.[8] National newspapers repeated the falsehood that blacks in Arkansas were staging an insurrection.[8] A New York Times headline read, \"Planned Massacre of Whites Today,\" and the Arkansas Gazette (the leading newspaper in Arkansas) wrote that Elaine was \"a zone of negro insurrection\".[8] Subsequent to this reporting, more than 100 African Americans were indicted, with 12 being sentenced to death by electrocution.[8] After a years-long legal battle by the NAACP, the 12 men were acquitted.[8]\n",
        "type": [
            "lynching",
            "terrorist",
            "riot"
        ]
    },
    "112": {
        "link": "/wiki/Bill_Gwatney",
        "title": "Bill Gwatney",
        "date": "August 13, 2008(2008-08-13) (aged 48) Little Rock, Arkansas, U.S.",
        "year": "2008",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nWilliam A. Gwatney (August 26, 1959 – August 13, 2008) was an American politician who served as the State Chair of the Democratic Party of Arkansas.[3] He had previously served as a State Senator for ten years and as the financial chair of Mike Beebe's campaign for Governor of Arkansas in 2006. Gwatney was selected as a superdelegate at the 2008 Democratic National Convention, but was assassinated before the convention.[4]\nOn August 13, 2008, Gwatney was killed by Timothy Dale Johnson,[5][6] who entered Democratic Party headquarters in Little Rock, Arkansas, and shot Gwatney three times.[7] Gwatney was taken to a hospital, but died later that day.[8]\n",
        "type": [
            "murder"
        ]
    },
    "113": {
        "link": "/wiki/Elias_W._Rector",
        "title": "Elias W. Rector",
        "date": "January 29, 1917(1917-01-29) (aged 67) Hot Springs, Arkansas, U.S.",
        "year": "1917",
        "location": "",
        "state": "Arkansas",
        "place": "Hot Springs",
        "county": "Garland County",
        "paragraph": "\nElias William Rector (June 11, 1849 – January 29, 1917) was an American politician who served as the 28th speaker of the Arkansas House of Representatives from January 1891 to January 1893.\nElias William Rector was a member of the Arkansas House of Representatives, serving from 1886 to 1900. A member of the Democratic Party,[1][2][3] He was an elector for Grover Cleveland in the presidential election of 1892, and was a candidate for the Democratic nomination for Governor of Arkansas in 1889 and 1902.[4]\n",
        "type": []
    },
    "114": {
        "link": "/wiki/2010_West_Memphis_police_shootings",
        "title": "2010 West Memphis police shootings",
        "date": "May 20, 2010 (2010-05-20) 11:36 a.m. (CDT)",
        "year": "2010",
        "location": "West Memphis, Arkansas, United States",
        "state": "Arkansas",
        "place": "West Memphis",
        "county": "Crittenden County",
        "paragraph": "\nTwo police officers in West Memphis, Arkansas were shot and killed during a traffic stop on May 20, 2010. Police killed two suspects, 45-year-old Jerry R. Kane Jr. (b. 1964), and his 16-year-old son Joseph T. Kane (b. 1993).[1] The two were later identified as members of the sovereign citizen movement.[2] Footage of the shooting and ensuing shootout with police was shown in a season 5 episode of World's Wildest Police Videos.\nAround 11:36 a.m. CDT, West Memphis police officer Bill Evans initiated a traffic stop on a white Plymouth Voyager minivan that was travelling on Interstate 40 eastbound toward Airport Road.[3] According to a spokesperson for the Arkansas State Police, Officer Evans was \"running drug interdiction\"; the vehicle, driven by Jerry Kane, had unusual  Ohio license plates. Sergeant Brandon Paudert provided backup for Evans. As a sovereign citizen, Jerry Kane did not have a driver's license and his van was not properly registered. He was also carrying a brick of marijuana and there were two arrest warrants for him, one in Ohio and one in New Mexico.[4]\n",
        "type": [
            "murder",
            "mass shooting",
            "shooting"
        ]
    },
    "115": {
        "link": "/wiki/Kelly_(murder_victim)",
        "title": "Kelly (murder victim)",
        "date": "July 10, 1991 (aged 23) El Dorado, Arkansas, U.S.",
        "year": "1991",
        "location": "",
        "state": "Arkansas",
        "place": "El Dorado",
        "county": "Union County",
        "paragraph": "\nKelly (1968 – July 10, 1991)[1] was the first name of a 23-year-old American woman and identity thief who was murdered on July 10, 1991 in El Dorado, Arkansas, in Room 121 of the now-demolished Whitehall Motel. She used multiple names while alive, including Mercedes (which is how her friends knew her), Cheryl Ann Wick (which was the name on the identification card found with her body), Kelly Lee Carr, Kelly Karr, Shannon Wiley, Cheryl Kaufman, and Sharon Wiley; none of which were found to be her real name.\nAs an unidentified victim, she was known to have lived in various states prior to her death, including Texas and Louisiana, and was alleged to have engaged in sex work. While alive, she shared varying accounts of her past, suggesting that she had been arrested at one point, had one or two children, and had possibly been involved in a bank robbery on the East Coast.[2] Her murderer was identified as her ex-boyfriend and alleged pimp James McAlphin; McAlphin was quickly convicted, but her true identity remained unknown until 2022.[2] On May 24, 2022, her first name was revealed in an article by forensic specialist Yolanda McClary, who withheld her surname out of privacy concerns.[1]\n",
        "type": [
            "murder",
            "thief",
            "robbery",
            "robber"
        ]
    },
    "116": {
        "link": "/wiki/Killing_of_Joseph_Erin_Hamley",
        "title": "Killing of Joseph Erin Hamley",
        "date": "March 7, 2006",
        "year": "2006",
        "location": "",
        "state": "Arkansas",
        "place": "West Fork",
        "county": "Washington County",
        "paragraph": "On March 7, 2006, Joseph Erin Hamley (February 3, 1985 – March 7, 2006),[1] an unarmed man, was fatally shot by Arkansas State Trooper Larry P. Norman of West Fork, Arkansas.[2] At 7 a.m. on March 7, 2006, Hamley, who had cerebral palsy, was walking alone on U.S. Route 412, just outside the community of Tontitown along the Benton-Washington county line when several Washington County deputies surrounded him. Four minutes later, before being identified, and while lying on the ground, a shotgun slug fired by Norman, an Arkansas State Trooper breaking police protocol and procedure killed Hamley. The fatal shooting was recorded from multiple vantage points on dashboard cameras of the various police cruisers present. Norman was indicted on and pled guilty to negligent homicide.\nAfter the negligent homicide, the Washington County Sheriffs Department and Arkansas State Police stated they believed the mentally disabled Joseph Erin Hamley to be Adam Lee Leadford whom they described as an escaped convict.[3]\nJoseph Erin Hamley stood 5 ft 10 in (1.78 m) and weighed 175 pounds (79 kg). Leadford was 5 ft 6 in (1.68 m) and 160 pounds (73 kg).[4] Leadford, then 18, was a Michigan teenager who ran away from a court-sponsored boot camp, where he was sentenced for vandalizing school buses and then struggling with an officer while resisting arrest. An unarmed Leadford was later shot in the throat by Springdale Police and arrested in a parking lot of a Wal-Mart on the evening of Joseph Erin Hamley's shooting death.\n",
        "type": [
            "killing",
            "shooting"
        ]
    },
    "117": {
        "link": "/wiki/John_Barfield",
        "title": "John Barfield",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "John David Barfield (October 15, 1964 – December 24, 2016) was a Major League Baseball pitcher. He played during three seasons (1989 to 1991) at the major league level for the Texas Rangers. He pitched in the affiliated minor leagues through 1997 and concluded his career the next year in the independent Atlantic League of Professional Baseball. He died in a shooting in Little Rock, Arkansas.\nBarfield attended Pine Bluff High School in Pine Bluff, Arkansas. He starred for the baseball team, which won a state championship.[1] One of his teammates on the Pine Bluff baseball team was future Rangers pitcher Mike Jeffcoat.[2] Barfield played college baseball at Crowder College in Neosho, Missouri, and at Oklahoma City University.[3] He was drafted by the Rangers in the 11th round (267th overall) of the 1986 amateur draft.\nBarfield played his first professional season with the Class A-Advanced Daytona Beach Admirals and Salem Redbirds in 1986. By 1988, he had advanced to the Class AA Tulsa Drillers, where he was on the pitching staff with future major leaguers Kevin Brown, Kenny Rogers and Steve Wilson. Barfield was a Texas League All-Star and finished with a 9–9 record with a 2.88 earned run average (ERA).[4]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "118": {
        "link": "/wiki/Powell_Clayton",
        "title": "Powell Clayton",
        "date": "August 25, 1914(1914-08-25) (aged 81) Washington, D.C., U.S.",
        "year": "1914",
        "location": "",
        "state": "Arkansas",
        "place": "D.C.",
        "county": "Ouachita County",
        "paragraph": "\nPowell Foulk Clayton (August 7, 1833 – August 25, 1914) was an American politician, diplomat, and businessman who served as the 9th governor of Arkansas from 1868 to 1871, as a Republican member of the U.S. Senate for Arkansas from 1871 to 1877 and as U.S. Ambassador to Mexico from 1897 to 1905.\nDuring the American Civil War, he served as a senior officer of United States Volunteers and commanded cavalry in the Trans-Mississippi Theater. After the war, he married a woman from Arkansas, purchased a plantation and settled in Jefferson County.  He was active in the Arkansas Republican party and became governor after military rule was lifted and the Arkansas state constitution was ratified by Congress.  He was viewed as a carpetbagger and implemented martial law in Arkansas for four months due to the rise of the Ku Klux Klan and violence against African-Americans and Republicans. The Arkansas Republican party splintered during Clayton's governorship.  Clayton and his followers were known as Minstrels and a more conservative faction led by Joseph Brooks were known as Brindletails.  The power struggle between the groups resulted in the impeachment of Clayton in 1871 and the Brooks-Baxter War.\n",
        "type": []
    },
    "119": {
        "link": "/wiki/Darryl_Richley",
        "title": "Murder of Donald Lehman",
        "date": "August 3, 1994(1994-08-03) (aged 37) Cummins Unit, Lincoln County, Arkansas, U.S.",
        "year": "1994",
        "location": "",
        "state": "Arkansas",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Donald Lehman (1933 – January 8, 1981) was an American man who was murdered in front of his family by four men in Arkansas. All four men: James William Holmes, Hoyt Franklin Clines, Michael Orndorff, and Darryl Richley, were convicted of capital murder and sentenced to death, albeit Orndorff's sentence was reduced to life without parole on appeal. The other three were all executed one by one on August 3, 1994. It was the first triple execution in the United States in the modern era.[1]\nDonald Lehman, his wife, Virginia, and their daughter, Vicki, were at their home when four men wearing ski masks rang the doorbell and forced their way inside. Lehman was shot three times and severely beaten with a motorcycle drive chain in front of his family. More than $1,000 and several guns were stolen, according to court documents. Holmes, Richley, Clines, and Orndorff were arrested later that day. They were each convicted of capital murder and sentenced to death. Orndorff later had his sentence overturned on appeal, and Lehman's family agreed to a life sentence in his case.[2][3][4]\nAfter the U.S. Supreme Court rejected arguments they were being treated like \"hogs at a slaughter\", Clines, Richley, and Holmes were all executed by lethal injection on August 3, 1994. All three of them declined to make final statements. Clines was executed first, and was pronounced dead at 7:11 p.m. Richley was pronounced dead 58 minutes later, followed by Holmes at 9:24 p.m.[5]\n",
        "type": [
            "murder"
        ]
    },
    "120": {
        "link": "/wiki/Little_Rock_nightclub_shooting",
        "title": "Little Rock nightclub shooting",
        "date": "July 1, 2017 (2017-07-01) c. 2:30am (CST)",
        "year": "2017",
        "location": "Little Rock, Arkansas, U.S.",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nAround 2:30 am on July 1, 2017, a shootout occurred at the Power Ultra Lounge nightclub in downtown Little Rock, Arkansas, United States. Twenty-eight people were injured and one hospitalized. No suspects have been identified.\nOn July 1, 2017 a mass shooting occurred at the Power Ultra Lounge in downtown Little Rock, Arkansas, around 2:30 AM CST.[1] The shootout lasted eleven seconds and started about thirty seconds into a break from a concert by rapper Finesse2tymes.[2][3] An eyewitness stated that the attack happened during the performance and was unexpected, with a large number of individuals lying on the floor in an attempt to avoid the bullets. He also stated, \"People didn't know whether to run or stay down cause you couldn't see where he was. You could hear the gun shots. As soon as you saw people trying to run you see them run right back in.\"[4]\n",
        "type": [
            "mass shooting",
            "shooting"
        ]
    },
    "121": {
        "link": "/wiki/Parley_P._Pratt",
        "title": "Parley P. Pratt",
        "date": "May 13, 1857(1857-05-13) (aged 50) Alma, Arkansas, United States",
        "year": "1857",
        "location": "",
        "state": "",
        "place": "Alma",
        "county": "Crawford County",
        "paragraph": "Parley Parker Pratt Sr. (April 12, 1807 – May 13, 1857) was an early leader of the Latter Day Saint movement whose writings became a significant early nineteenth-century exposition of the Latter Day Saint faith. Named in 1835 as one of the first members of the Quorum of the Twelve Apostles, Pratt was part of the Quorum's successful mission to Great Britain from 1839 to 1841. Pratt has been called \"the Apostle Paul of Mormonism\" for his promotion of distinctive Mormon doctrines.[3]\nPratt explored and surveyed Parley's Canyon in Salt Lake City, Utah (named in his honor), and subsequently built and maintained the first road for public transportation in the canyon.\nPratt practiced plural marriage. He was murdered in 1857 by the estranged husband of his twelfth wife. Pratt fathered thirty children. His living descendants in 2011 were estimated to number 30,000 to 50,000. He is the great-great-grandfather of Mitt Romney, the 2012 Republican candidate for President of the United States, and Jon Huntsman Jr., diplomat and former Governor of Utah, who served as the U.S. Ambassador to Russia from 2017 to 2019.[4]\n",
        "type": [
            "murder"
        ]
    },
    "122": {
        "link": "/wiki/Lynching_of_John_West",
        "title": "Lynching of John West",
        "date": "July 28, 1922",
        "year": "1922",
        "location": "Guernsey, Hempstead County, Arkansas",
        "state": "Arkansas",
        "place": "Hempstead County",
        "county": "Hempstead County",
        "paragraph": "John West was a 50-year-old African-American man who was lynched in Guernsey, Hempstead County, Arkansas by a group of men on the Hope-Texarkana train on July 28, 1922. According to the United States Senate Committee on the Judiciary it was the 41st of 61 lynchings during 1922 in the United States. [1]\nJohn West was born in Emporia, Kansas and had moved to Hope, Arkansas two weeks prior to his murder.[2] He\nwas short in stature and weighed about 165 pounds (75 kg). The contemporary media noted that he wore his beard in goatee fashion.[3]\nAndrew Worthing and John West worked for the Kaw Paving Company, which engaged in street paving work in Hope, Arkansas. A fight broke out over the crew's common drinking cup and the statement that West was as good as any white worker.[4][5] At one point West struck Worthing with a sledgehammer but \"the white man was not dangerously injured.\"[3]\n",
        "type": [
            "murder",
            "lynching",
            "riot"
        ]
    },
    "123": {
        "link": "/wiki/University_of_Central_Arkansas_shooting",
        "title": "University of Central Arkansas shooting",
        "date": "October 26, 2008 (2008-10-26) c. 9:00 pm (CDT)",
        "year": "2008",
        "location": "University of Central Arkansas, Conway, Arkansas, United States",
        "state": "Arkansas",
        "place": "Conway",
        "county": "Conway County",
        "paragraph": "The University of Central Arkansas shooting was a school shooting that took place on the 12,500-student campus of the University of Central Arkansas in Conway, Arkansas on Sunday, October 26, 2008.[1]\nThe shooting occurred after 9:00pm CDT outside of the Arkansas Hall dormitory. Two students – Ryan Henderson, 18, and Chavares Block, 19 – were fatally shot. A third person, 19-year-old Martrevis Norman, a non-student visiting the campus, was shot in the leg and was treated at the nearby Conway Regional Medical Center.[2]\nFour suspects were charged in the shooting: Kawin Brockton, 19, Kelsey Perry, 19, Mario Tony, 20, and Brandon Wade, 20. However, only Perry was convicted, and he pleaded guilty to two counts of first-degree murder and other charges and was sentenced to 40 years in prison.[3]\n",
        "type": [
            "murder",
            "killing",
            "shooting"
        ]
    },
    "124": {
        "link": "/wiki/U._M._Rose",
        "title": "U. M. Rose",
        "date": "",
        "year": "",
        "location": "",
        "state": "Arkansas",
        "place": "",
        "county": "",
        "paragraph": "Uriah Milton Rose (March 5, 1834 – August 12, 1913) was an American lawyer [1]: 181  and Confederate sympathizer.[1]: 176  \"Approachable, affable, and kind,\"[2] graceful and courteous,[3]: 18  he was called \"the most scholarly lawyer in America\"[4]: 676  and \"one of the leading legal lights of the nation\",[5] \"a towering figure in the...life of Little Rock\".[2] He was a founder of the American Bar Association, of which he was twice president, 1891–92 and 1901-02.[6]\nAnother Arkansas judge, J. T. Coston, described him thus:\nArkansas is the home of the late U. M. Rose, a scholar and statesman. Judge Rose was one of the great lawyers not only of Arkansas but of the United States. Cultured, refined and modest as a woman, with a titanic intellect, he was a general favorite wherever he was known. Judge Dillon, after being thrown with him on numerous occasions at long intervals, pronounced Judge Rose the most cultured man he had ever known. He loved his profession, and I heard him state only a year or two before he died, while attending the Arkansas Bar Association, that during his more than half a century experience in the practice of law he had never had a serious misunderstanding with a brother lawyer.[7]",
        "type": []
    },
    "125": {
        "link": "/wiki/Tower_Building_of_the_Little_Rock_Arsenal",
        "title": "Tower Building of the Little Rock Arsenal",
        "date": "",
        "year": "",
        "location": "503 E. 9th St.,Little Rock, Arkansas",
        "state": "Arkansas",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nThe Tower Building of the Little Rock Arsenal, also known as the Main Building of the U.S. Arsenal at Little Rock,[2] or Headquarters Building of the Little Rock Barracks, is the home of the MacArthur Museum of Arkansas Military History. It is also a part of the MacArthur Park Historic District, in Little Rock, Arkansas.\nBuilt between 1840 and 1841, it was part of Little Rock's first U.S. military installation. Since decommissioning, the building has housed two local museums. It was home to the Arkansas Museum of Natural History and Antiquities from 1942 to 1997 and the MacArthur Museum of Arkansas Military History since 2001. It has also housed the Little Rock Æsthetic Club since 1894. The building receives its name from its distinct octagonal tower.[2][3] Besides being the last remaining structure of the original U.S. military installation and one of the oldest buildings in central Arkansas, it was also the birthplace of General Douglas MacArthur, who became the supreme commander of U.S. forces in the South Pacific during World War II. It was also the starting place of the Camden Expedition during the American Civil War.\n",
        "type": []
    },
    "126": {
        "link": "/wiki/Lucius_M._Walker",
        "title": "Lucius M. Walker",
        "date": "September 7, 1863 (aged 33) Little Rock, Arkansas, C.S.",
        "year": "1863",
        "location": "",
        "state": "",
        "place": "Little Rock",
        "county": "Pulaski County",
        "paragraph": "\nBrigadier-General Lucius Marshall \"Marsh\" Walker (October 18, 1829 – September 7, 1863) was a Confederate general during the American Civil War. He was mortally wounded in a duel with fellow general John S. Marmaduke.\nLucius Marshall Walker was born in Columbia, Tennessee. He was a nephew of President James K. Polk. Walker graduated from the United States Military Academy in 1850, placing 15th of a class of 44. He was brevetted second lieutenant of dragoons and served on frontier duty in Texas. He was commissioned a second lieutenant in 1852, shortly before resigning to return to Tennessee, where he established a successful mercantile business.\n",
        "type": []
    },
    "127": {
        "link": "/wiki/Killing_of_Hunter_Brittain",
        "title": "Killing of Hunter Brittain",
        "date": "June 23, 2021; 19 months ago (2021-06-23) c. 3:00 a.m. (CDT)",
        "year": "2021",
        "location": "Near Cabot, Arkansas, U.S.",
        "state": "Arkansas",
        "place": "Cabot",
        "county": "Lonoke County",
        "paragraph": "\nAt approximately 3:00 am (CDT) on Wednesday, June 23, 2021, 17-year-old Hunter Brittain, who was unarmed, was shot by Lonoke County sheriff's deputy Sgt. Michael Davis near Cabot, Arkansas, United States. He later died at North Little Rock Hospital.[2]\nBrittain was attempting to use a jug of antifreeze to stop his truck from rolling into the officer's vehicle when the deputy shot him.[2] Brittain's family claimed he was test driving a truck, which he had been working on when he was pulled over by the deputy.[3]\n",
        "type": [
            "killing"
        ]
    },
    "128": {
        "link": "/wiki/Lester_Brockelhurst",
        "title": "Lester Brockelhurst",
        "date": "March 18, 1938 (aged 24) Tucker Unit, Tucker, Arkansas, U.S.",
        "year": "1938",
        "location": "",
        "state": "Arkansas",
        "place": "Tucker",
        "county": "Jefferson County",
        "paragraph": "Lester Warfel Brockelhurst, Jr. (1914 – March 18, 1938), known as The Crime Tourist, was an American spree killer who, together with his girlfriend Bernice Felton, killed at least three men in holdups during a six-week crime spree across multiple states in 1937.[1] Found guilty of the final murder, Brockelhurst was executed at the Tucker Unit the following year.\nLester Jr. was born in Galesburg, Illinois, the first son of Mormon couple Lester Warfel Brockelhurst, Sr. and his wife Edyth (née DuPree). Another son, Karl, was born in 1930. Little is known about Lester's upbringing and early life, but after graduating from school, he took on a job as a teacher at a Sunday school in Galesburg.[1] In 1935, he was arrested and convicted for armed robbery in Chicago, for which he served a two-year prison term at the Joliet Penitentiary. Brockelhurst was paroled in 1937 and went to Rockford, where he met 18-year-old Bernice Felton, who was also from Galesburg. The two quickly befriended and fell in love with each other, and on March 31 of that year, the couple embarked on a 18-state wide crime spree.[1]\nOn the same day as their sudden disappearance from the city, a 47-year-old local tailor named John Albin Theander disappeared along with his car. Some time later, his body was found on the outskirts of Rockford, with a single bullet hole in his head.[1] After killing him, Brockelhurst and Felton travelled to Salt Lake City and then onto Dallas, before winding up in Fort Worth on April 28. There, they held up a tavern owned by a man named Jack Griffith, who attempted to defend his property from the two criminals. In response, Lester shot and killed him on the spot, and the couple fled the state.[1] Their next destination was Little Rock, Arkansas, and on May 6, they ditched Theander's car and travelled to Memphis, Tennessee on foot. There, they were picked up by Victor A. Gates, a wealthy landowner who resided in Little Rock, who drove them there. When they reached Arkansas, Brockelhurst shot Gates in the head, robbed him of his money and valuables and then threw the body into a ditch.[1]\n",
        "type": [
            "murder",
            "killing",
            "robbery",
            "robber"
        ]
    },
    "129": {
        "link": "/wiki/1998_Westside_Middle_School_shooting",
        "title": "1998 Westside Middle School shooting",
        "date": "March 24, 1998 c. 12:40 p.m. (Central Time)",
        "year": "1998",
        "location": "Craighead County (Jonesboro street address), Arkansas, United States",
        "state": "Arkansas",
        "place": "Jonesboro",
        "county": "Craighead County",
        "paragraph": "\nThe Westside Middle School shooting was a school shooting on March 24, 1998, at Westside Middle School in unincorporated Craighead County, Arkansas near the city of Jonesboro.[1] Perpetrators Mitchell Johnson, 13, and Andrew Golden, 11, fatally shot four students and a teacher with multiple weapons, and both were arrested when they attempted to flee the scene. Ten others were wounded. Golden and Johnson were convicted of five murders and ten assaults, and were imprisoned until each turned 21 years of age. After the 1992 Lindhurst High School shooting that killed four people in Olivehurst, California, the massacre was the deadliest non-college school shooting[2] in contemporary U.S. history until the April 1999 Columbine High School massacre.\nOn the night before the shooting, Golden assisted Johnson in loading his mother's Dodge Caravan with camping supplies, snack foods, nine weapons (Remington 742 .30-06 rifle, Universal .30 M1 carbine replica, Ruger .44 Magnum rifle, Smith & Wesson .38 Special revolver, Double Deuce Buddie .22 caliber two-shot derringer, FIE .380 pistol, Star .380 pistol, Ruger Security Six .357 revolver, Davis Industries .38 two-shot derringer and a Charter Arms .38 Special revolver),[3] all of which had been stolen from Golden's grandfather's house, and 2,000 rounds of ammunition.\n",
        "type": [
            "mass shooting",
            "shooting",
            "assault",
            "mass murder",
            "murder"
        ]
    },
    "130": {
        "link": "/wiki/Lynching_of_Fred_Rouse",
        "title": "Lynching of Fred Rouse",
        "date": "December 11, 1921",
        "year": "1921",
        "location": "Hung on a tree at the corner of NE 12th Street and Samuels Avenue in Fort Worth, Texas, Tarrant County, Texas",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "33-year-old meatpacker Fred Rouse was lynched on December 11, 1921, in Fort Worth, Texas.\nIn 1921, the whites-only union workers at the Swift & Co. meatpacking plant in the Niles City Stockyards (now part of Fort Worth) went on strike. The owners attempted to replace them with black strikebreakers. During union protests, there was a scuffle between African-American worker Fred Rouse and some of the strikers. This resulted in Rouse firing his gun, wounding two white strikers who happened to be brothers.[1][2]\nEnraged, the whites seized, beat, and stabbed him. He was presumed to be dead. However, when the police retrieved his body from the mob, they realized that he was still alive. They took him to the City & County Hospital (330 E. 4th St.).[3][4] He spent several days recovering in the segregated ward, which was located in the basement. When members of the striking union heard that Rouse was still alive, a mob of about 30 men snuck into the hospital and were able to identify him by his severe skull injury. Despite the pleas of the night nurse to spare him, the mob dragged him out of the hospital in his nightgown. He was strung up on a tree at the corner of NE 12th Street and Samuels Avenue in Fort Worth, Texas. The white mob took turns riddling his mutilated body with gunshots.[4]\n",
        "type": [
            "lynching",
            "riot"
        ]
    },
    "131": {
        "link": "/wiki/Huntsville_massacre",
        "title": "Huntsville massacre",
        "date": "January 10, 1863",
        "year": "1863",
        "location": "Huntsville, Arkansas36°05′15″N 93°44′12″W﻿ / ﻿36.08761124°N 93.73662152°W﻿ / 36.08761124; -93.73662152",
        "state": "Arkansas",
        "place": "Huntsville",
        "county": "Madison County",
        "paragraph": "The Huntsville massacre refers to the execution during the Civil War of nine local men, including three Confederate soldiers, by Union soldiers on January 10, 1863, in Huntsville, Arkansas. No formal charges were filed, and the US Army discharged the commanding officer. The prisoners may have been suspected of being Confederate sympathizers. A few months before, guerrillas had attacked a force of 25 Union troops in the area.\nThe event was discussed secretly and nearly lost until a historian wrote about it in a history quarterly in 1974. More research has been published on this topic, and a memorial to the victims was erected in 2006. \nIn 1862, after the Battle of Pea Ridge in Arkansas, Isaac Murphy of Huntsville had received death threats and was forced to flee his home. He had represented Madison County in the state House but was known to have voted against secession at the start of the war. He was with the Army in Missouri. By the fall of 1862, his daughters wished to visit him in Pea Ridge, Missouri. The Union Army escorted them to return to their home of Huntsville, then under Union control.\n",
        "type": [
            "murder",
            "mass murder"
        ]
    }
}