[
    {
        "link": "/wiki/Lynching_of_Aaron_and_Anthony_(Arkansas,_1856)",
        "title": "Lynching of Aaron and Anthony (Arkansas, 1856)",
        "date": "",
        "location": "",
        "paragraph": "\nAaron, Anthony, and Randall were three enslaved Black men who died of racial terror. Aaron and Anthony were lynched in 1856 in Washington County, Arkansas, after being accused of a murder and released by the court, one because he was proven and the other for lack of evidence. Randall was hanged for that crime. An oral history recounts that the white man who had been killed, the enslaver James Boone, had sexually assaulted a Black woman, who killed him in self-defense, and that the three men were implicated by Boone's family.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Carter",
        "title": "Lynching of John Carter",
        "date": "",
        "location": "",
        "paragraph": "\nJohn Carter was an African-American man who was murdered in Little Rock, Arkansas, on May 4, 1927.[1] Grabbed by a mob after another Black man had been apprehended for the alleged murder of a white girl, Carter was hanged from a telephone pole, shot, dragged through the streets, and then burned in the center of the city's Black part of town with materials that a white crowd of perhaps 5,000 people had looted from nearby stores and businesses.[2]\n"
    },
    {
        "link": "/wiki/Elaine_massacre",
        "title": "Elaine massacre",
        "date": "September 30, 1919",
        "location": "Hoop Spur, Phillips County, Arkansas, U.S.",
        "paragraph": "The Elaine massacre occurred on September 30–October 2, 1919 at Hoop Spur in the vicinity of Elaine in rural Phillips County, Arkansas. As many as several hundred African Americans and five white men were killed.[4] Estimates of deaths made in the immediate aftermath of the Elaine Massacre by eyewitnesses range from 50 to \"more than a hundred\".[5] Walter Francis White, an NAACP attorney who visited Elaine shortly after the incident, stated \"... twenty-five Negroes killed, although some place the Negro fatalities as high as one hundred\".[6] More recent estimates in the 21st century of the number of black people killed during this violence are higher than estimates provided by the eyewitnesses, and have ranged into the hundreds.[3][2] Robert Whitaker estimated 856 people were killed in his 2008 book on this topic.[7] The white mobs were aided by federal troops (requested by Arkansas governor Charles Hillman Brough) and terrorist organizations such as the newly revived Ku Klux Klan.[8]  Gov. Brough led a contingent of 583 US soldiers from Camp Pike, with a 12-gun  machine gun battalion.[7]\nAccording to the Encyclopedia of Arkansas, \"the Elaine Massacre was by far the deadliest racial confrontation in Arkansas history and possibly the bloodiest racial conflict in the history of the United States\".[9][10]\n"
    },
    {
        "link": "/wiki/Lynching_of_Owen_Flemming",
        "title": "Lynching of Owen Flemming",
        "date": "",
        "location": "",
        "paragraph": "\nOwen Flemming or Flemings[1] was an African-American man who was lynched by a mob near Mellwood, Arkansas, on June 8, 1927, after an altercation with a white man who attempted to force him to work on a levee during the Great Mississippi Flood of 1927.\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Harrison",
        "title": "Lynching of John Harrison",
        "date": "February 2, 1922",
        "location": "Malvern, Hot Spring County, Arkansas",
        "paragraph": "John Henry Harrison (also referred to as Harry Harrison[1] and John Harris[2]) was a 38-year-old African-American man who was lynched in Malvern, Hot Spring County, Arkansas, by masked men on February 2, 1922. According to the United States Senate Committee on the Judiciary it was the 10th of 61 lynchings in America and 1 of 5 lynchings in the State of Arkansas during 1922.[1]\nAccording to the 1920 census John Harrison was thirty-eight years old, married, and worked as a laborer in a Malvern lumber mill.[3] In 1917, when he registered for the military draft, he was living at 405 Vine Street in Malvern.[4] In early 1922 he began to show troubling behavior including stalking and threatening women. One of these woman reported his actions to Hot Spring County, Arkansas Sheriff Donald F. Bray who arrested Harrison in February 1922.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Jordan_Jameson",
        "title": "Lynching of Jordan Jameson",
        "date": "November 11, 1919",
        "location": "City of Magnolia's public square",
        "paragraph": "African-American man, Jordan Jameson was lynched[a] on November 11, 1919, in the town square of Magnolia, Columbia County, Arkansas. A large white mob seized Jameson after he allegedly shot the local sheriff. They tied him to a stake and burned him alive.[2]\nArkansans were on edge after the deadly Elaine massacre (September 30–October 1, 1919) in rural Elaine, Arkansas. During the riots, hundreds of black people were killed and according to the Encyclopedia of Arkansas, \"the Elaine Massacre was by far the deadliest racial confrontation in Arkansas history and possibly the bloodiest racial conflict in the history of the United States.\"[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Henry_Lowry",
        "title": "Lynching of Henry Lowry",
        "date": "",
        "location": "",
        "paragraph": "\nThe lynching of Henry Lowry, on January 26, 1921, was the murder of an African-American man, Henry Lowry, by a mob of white vigilantes in Arkansas. Lowry (also spelled \"Lowery\"), a tenant farmer, had been on the run after a deadly shootout at the house of planter O. T. Craig on Christmas Day of 1920. Lowry went into hiding in El Paso, Texas; when he was discovered and extradited by train, a group of armed white men boarded the train in Sardis, Mississippi, and took Lowry to Nodena, near Wilson, Arkansas. He was doused in gasoline and burned alive before a mob of 500. A reporter from the Memphis Press witnessed the event, and word of the lynching soon spread around the country, aided by an article William Pickens wrote for The Nation, in which he described eastern Arkansas as \"the American Congo\".[1]\nA detailed account comes from William Pickens, then a journalist and an assistant field secretary for the executive secretary of the NAACP.[2] Pickens is the only source for some details on Lowry; his age, for example, being otherwise unknown except for Pickens's estimate of \"forty years or more\".[2] He and his wife Callie are not listed in the 14th United States census, despite having moved to Arkansas in 1918 from Mississippi.[2] O. T. Craig was a planter in Mississippi County, Arkansas, first name not given in most contemporary accounts but revealed by the same census records to be Osben T. Craig, aged 68 at the time; with 62-year-old wife Mary, children Elizabeth (28), Richard (24), Margret (21), and two further sons.[2] Craig had a reputation for being ornery: he mistreated his Black tenants and exploited them.[3] Lowry was a proud, tall man; he was over six feet tall and, according to later testimony from another one of Craig's tenants, Mrs. Lucy Oliver, \"he didn't take nothing off of nobody\". He had attained the highest possible level within his Masonic order, a rank given to those of \"outstanding character and leadership qualities\".[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Mr_Norman",
        "title": "Lynching of Mr Norman",
        "date": "February 11, 1922",
        "location": "Texarkana, Miller County, Arkansas",
        "paragraph": "Mr. Norman (referree to as P. Norman[1] and N. Norman[2]) was an African-American man who was lynched in Texarkana, Miller County, Arkansas by masked men on February 11, 1922. According to the 1926 report of the United States Senate Committee on the Judiciary, this was  the 12th of 61 lynchings during 1922 in the United States. [3]\nTexarkana is a city that straddles the state border of Texas and Arkansas. The west of the city is in Bowie County, Texas and the east is in Miller County, Arkansas. It was developed at a 19th-century junction of two major railroads.\n"
    },
    {
        "link": "/wiki/Lynching_of_Winston_Pounds",
        "title": "Lynching of Winston Pounds",
        "date": "",
        "location": "",
        "paragraph": "Winston Pounds was an African-American man who was lynched by a mob in Wilmot, Arkansas, on August 25[1] or 26, 1927.[2][3]\nAccording to white newspapers, Pounds was hanged after being accused of breaking into and entering the house of a white man, and then allegedly assaulting his wife. An armed mob of fifty white men took him from the sheriff and his deputies, and hanged him a mile and a half away from town. A Black newspaper, however, noted that there had been bad blood, and that the white man, J. W. McGarry, had been seeking revenge on Pounds because Pounds's father had gotten the best of McGarry's father years earlier. There was no other evidence other than bloodhounds supposedly following the alleged assailant's tracks. White newspapers likewise didn't report on the torture that Pounds had to suffer while being hanged; they did note that the deputies recognized no one from the mob, and the result of the inquest was that \"Pounds had died at the hands of persons unknown\".\n"
    },
    {
        "link": "/wiki/Lynching_of_Wade_Thomas",
        "title": "Lynching of Wade Thomas",
        "date": "December 26, 1920",
        "location": "City of Jonesboro's public square",
        "paragraph": "On December 26, 1920, an African-American man named Wade Thomas was lynched in Jonesboro, Arkansas, by a white mob. The mob seized Thomas from the Jonesboro jail after he allegedly shot local Patrolman Elmer Ragland, and murdered him. \nThe state of Arkansas had been on edge after the deadly Elaine massacre, in which perhaps as many as 237 Black people were killed between September 30 and October 1, 1919. It was \"by far the deadliest racial confrontation in Arkansas history and possibly the bloodiest racial conflict in the history of the United States.\"[1] On December 25, 1920, police raided a dice game. During the raid gun fire broke out and Patrolman Elmer Ragland was killed.[2] Thomas was later arrested at Hoxie, Arkansas and brought to Jonesboro.\n"
    },
    {
        "link": "/wiki/Lynching_of_William_Turner",
        "title": "Lynching of William Turner",
        "date": "November 18, 1921",
        "location": "Helena, Phillips County, Arkansas",
        "paragraph": "18-year-old William Turner was lynched on November 18, 1921, for an alleged assault on a 15-year-old white girl.[1] Two years earlier hundreds of African-Americans were killed during the Elaine Race Riot in Hoop Spur a nearby community also in Phillips County, Arkansas.\nEarly November 18, 1921, a 15-year-old was walking to her work at the local telephone exchange when she was allegedly assaulted by William Turner.[2] Before being arrested, the brother of the 15-year-old had shot Turner in the leg.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_John_West",
        "title": "Lynching of John West",
        "date": "July 28, 1922",
        "location": "Guernsey, Hempstead County, Arkansas",
        "paragraph": "John West was a 50-year-old African-American man who was lynched in Guernsey, Hempstead County, Arkansas by a group of men on the Hope-Texarkana train on July 28, 1922. According to the United States Senate Committee on the Judiciary it was the 41st of 61 lynchings during 1922 in the United States. [1]\nJohn West was born in Emporia, Kansas and had moved to Hope, Arkansas two weeks prior to his murder.[2] He\nwas short in stature and weighed about 165 pounds (75 kg). The contemporary media noted that he wore his beard in goatee fashion.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Earnest_Williams",
        "title": "Lynching of Earnest Williams",
        "date": "",
        "location": "",
        "paragraph": "Earnest Williams was an African-American man who was lynched by a mob in Parkdale, Ashley County, Arkansas, in 1908. John R. Steelman, who wrote his PhD dissertation on \"mob action in the South\", listed Williams as one of the cases, and said \"Earnest Williams was thrust into eternity by a band of men who were 'outraged' at him for 'using offensive language'.\"[1]\nCoordinates: 33°7′18″N 91°32′51″W﻿ / ﻿33.12167°N 91.54750°W﻿ / 33.12167; -91.54750\n"
    },
    {
        "link": "/wiki/1998_Westside_Middle_School_shooting",
        "title": "1998 Westside Middle School shooting",
        "date": "March 24, 1998 c. 12:40 p.m. (Central Time)",
        "location": "Craighead County (Jonesboro street address), Arkansas, United States",
        "paragraph": "\nThe Westside Middle School shooting was a school shooting on March 24, 1998, at Westside Middle School in unincorporated Craighead County, Arkansas near the city of Jonesboro.[1] Perpetrators Mitchell Johnson, 13, and Andrew Golden, 11, fatally shot four students and a teacher with multiple weapons, and both were arrested when they attempted to flee the scene. Ten others were wounded. Golden and Johnson were convicted of five murders and ten assaults, and were imprisoned until each turned 21 years of age. After the 1992 Lindhurst High School shooting that killed four people in Olivehurst, California, the massacre was the deadliest non-college school shooting[2] in contemporary U.S. history until the April 1999 Columbine High School massacre.\n"
    },
    {
        "link": "/wiki/Dumas_shooting",
        "title": "Dumas, Arkansas",
        "date": "",
        "location": "",
        "paragraph": "\nDumas is a city in Desha County, Arkansas, United States. The population was 4,706 at the 2010 census.[2]\n"
    },
    {
        "link": "/wiki/Little_Rock_nightclub_shooting",
        "title": "Little Rock nightclub shooting",
        "date": "July 1, 2017 (2017-07-01) c. 2:30am (CST)",
        "location": "Little Rock, Arkansas, U.S.",
        "paragraph": "\nAround 2:30 am on July 1, 2017, a shootout occurred at the Power Ultra Lounge nightclub in downtown Little Rock, Arkansas, United States. Twenty-eight people were injured and one hospitalized. No suspects have been identified.\n"
    },
    {
        "link": "/wiki/Pearcy_murders",
        "title": "Pearcy murders",
        "date": "November 11 or 12, 2009  (CST UTC−06:00)",
        "location": "Pearcy, Arkansas, United States",
        "paragraph": "The Pearcy murders took place on November 11 or 12, 2009 in Pearcy, Arkansas, a small town in the center of the state right outside of Hot Springs. A total of four related people and the girlfriend of one victim were shot to death during two burglaries; four bodies were found in a mobile home belonging to victims Edward Gentry, Jr. and his wife Pam. The mobile home had been burned to destroy evidence. The fifth victim, Edward Gentry Sr., was found in another structure on the property. Jeremy Pickney, Marvin Stringer and Samuel Conway, all in their early twenties, were quickly identified as suspects due to their possessing stolen goods from the Gentry trailer. Stringer was killed during a shootout in a police raid when authorities attempted to arrest him at the Red Roof Inn on East Grand Ave.\nConway was convicted at trial in June 2011 on multiple counts of capital murder and burglary, and sentenced to life in prison without parole. The Arkansas Supreme Court ordered a retrial of his case due to judicial error. He pleaded guilty and was sentenced to 40 years in prison. Pickney made a plea bargain, pleading guilty in 2011 to conspiracy to commit aggravated residential burglary, and was sentenced to 50 years in prison.\n"
    },
    {
        "link": "/wiki/2010_West_Memphis_police_shootings",
        "title": "2010 West Memphis police shootings",
        "date": "May 20, 2010 (2010-05-20) 11:36 a.m. (CDT)",
        "location": "West Memphis, Arkansas, United States",
        "paragraph": "\nTwo police officers in West Memphis, Arkansas were shot and killed during a traffic stop on May 20, 2010. Police killed two suspects, 45-year-old Jerry R. Kane Jr. (b. 1964), and his 16-year-old son Joseph T. Kane (b. 1993).[1] The two were later identified as members of the sovereign citizen movement.[2] Footage of the shooting and ensuing shootout with police was shown in a season 5 episode of World's Wildest Police Videos.\n"
    },
    {
        "link": "/wiki/Westside_Middle_School_shooting",
        "title": "1998 Westside Middle School shooting",
        "date": "March 24, 1998 c. 12:40 p.m. (Central Time)",
        "location": "Craighead County (Jonesboro street address), Arkansas, United States",
        "paragraph": "\nThe Westside Middle School shooting was a school shooting on March 24, 1998, at Westside Middle School in unincorporated Craighead County, Arkansas near the city of Jonesboro.[1] Perpetrators Mitchell Johnson, 13, and Andrew Golden, 11, fatally shot four students and a teacher with multiple weapons, and both were arrested when they attempted to flee the scene. Ten others were wounded. Golden and Johnson were convicted of five murders and ten assaults, and were imprisoned until each turned 21 years of age. After the 1992 Lindhurst High School shooting that killed four people in Olivehurst, California, the massacre was the deadliest non-college school shooting[2] in contemporary U.S. history until the April 1999 Columbine High School massacre.\n"
    },
    {
        "link": "/wiki/West_Memphis_Three",
        "title": "West Memphis Three",
        "date": "",
        "location": "",
        "paragraph": "\nThe West Memphis Three are three men convicted as teenagers in 1994 of the 1993 murders of three boys in West Memphis, Arkansas, United States. Damien Echols was sentenced to death, Jessie Misskelley Jr. to life imprisonment plus two 20-year sentences, and Jason Baldwin to life imprisonment. During the trial, the prosecution asserted that the juveniles killed the children as part of a Satanic ritual.[1][2][3]\n"
    },
    {
        "link": "/wiki/Devil%27s_Knot_(film)",
        "title": "Devil's Knot (film)",
        "date": "",
        "location": "",
        "paragraph": "\nDevil's Knot is a 2013 American biographical crime drama film directed by Atom Egoyan. Adapted from Mara Leveritt's 2002 book of the same name, the film is about the true story of three murdered children, and the three teenagers known as the West Memphis Three who were convicted of killing them, during the Satanic ritual abuse panic. The teenagers were subsequently sentenced to death (Echols) and life imprisonment (Baldwin and Misskelley), before all were released after eighteen years.[6] Produced by Elizabeth Fowler, Richard Saperstein, Clark Peterson, Christopher Woodrow, and Paul Harris Boardman, the film stars Colin Firth, Reese Witherspoon, Dane DeHaan, Mireille Enos, Bruce Greenwood, Elias Koteas, Stephen Moyer, Alessandro Nivola, Amy Ryan, and Martin Henderson.\n"
    },
    {
        "link": "/wiki/Devil%27s_Knot:_The_True_Story_of_the_West_Memphis_Three",
        "title": "Devil's Knot: The True Story of the West Memphis Three",
        "date": "",
        "location": "",
        "paragraph": "Devil's Knot: The True Story of the West Memphis Three is a 2002 true crime book by Mara Leveritt, about the 1993 murders of three eight-year-old children and the subsequent trials of three teenagers charged with and convicted of the crimes. The names of the three teens convicted - Damien Echols, Jason Baldwin, and Jessie Misskelley - would come to be known as the West Memphis Three. Leveritt's book revolves around the central idea that the three teenagers' convictions stemmed from \"Satanic panic\" rather than actual evidence. The book also focuses on one of the victim's stepfathers and his possible connection with the murders. All three teenagers convicted were released on August 19, 2011. A film based on the book, Devil's Knot, was released in 2013.[1]\nOn May 5, 1993, Christopher Byers, Michael Moore, and Steven Branch went missing from their homes in West Memphis, Arkansas.  The next day, their bodies were found in the woods near their homes with evidence showing they had been brutally beaten and savagely murdered. In Byers' case the evidence revealed that he had been castrated, and his genitals skinned before he was killed. News of the boys' deaths and the manner in which it happened soon reached the inhabitants of the small community. The rumor then spread that the nature of Byers' death, in particular  hinted that the deaths may have been related to a Satanic ritual.\n"
    },
    {
        "link": "/wiki/Damien_Echols",
        "title": "Damien Echols",
        "date": "",
        "location": "",
        "paragraph": "\nDamien Wayne Echols (born Michael Wayne Hutchison; December 11, 1974) is an American writer, best known as one of the West Memphis Three, a group of teenagers convicted of a triple murder. Upon his release from death row in 2011 under an Alford plea, Echols authored several autobiographies and spiritual books. He has been featured in multiple books, documentaries, and podcasts about his spiritual works and the West Memphis Three case.\n"
    },
    {
        "link": "/wiki/Illusions_(Michale_Graves_album)",
        "title": "Illusions (Michale Graves album)",
        "date": "",
        "location": "",
        "paragraph": "Illusions is the third solo album by former Misfits vocalist Michale Graves. It is a collaborative album between Graves and West Memphis Three\nmember Damien Echols, featuring written content and backing vocals from Echols. The album was produced in part due to an early example of a successful crowdfunding campaign, and the contributors' names are printed inside the CD booklet.\n"
    },
    {
        "link": "/wiki/Paradise_Lost_2:_Revelations",
        "title": "Paradise Lost 2: Revelations",
        "date": "",
        "location": "",
        "paragraph": "Paradise Lost 2:  Revelations is a 2000 American documentary film directed and produced by Joe Berlinger and Bruce Sinofsky, and the sequel to their 1996 film Paradise Lost: The Child Murders at Robin Hood Hills, about the trials of the West Memphis Three, three teenage boys accused of the May 1993 murders and sexual mutilation of three prepubescent boys as a part of an alleged satanic ritual in West Memphis, Arkansas.[2]\nRevelations takes place five years after the events depicted in the first film, as Damien Echols, one of the West Memphis Three, who were all named as guilty of the murders in 1994, appeals his lethal injection sentence. It mostly focuses on John Mark Byers, the father of one of the victims who has grown increasingly obsessed with the West Memphis Three, and on a support group who is convinced that the three are innocent. The film was nominated for a Primetime Emmy Award for Outstanding Nonfiction Special, and was later followed by a third film, Paradise Lost 3: Purgatory, in 2011.\n"
    },
    {
        "link": "/wiki/Paradise_Lost_3:_Purgatory",
        "title": "Paradise Lost 3: Purgatory",
        "date": "",
        "location": "",
        "paragraph": "Paradise Lost 3: Purgatory is a 2011 American documentary film directed by Joe Berlinger and Bruce Sinofsky, and sequel to their films Paradise Lost: The Child Murders at Robin Hood Hills (1996) and Paradise Lost 2: Revelations (2000). The three films are about West Memphis Three, three teenage boys accused of the May 1993 murders and sexual mutilation of three prepubescent boys as a part of an alleged satanic ritual in West Memphis, Arkansas.[1] Purgatory offers an update on the case of the West Memphis Three, who were all recognized guilty of the murders in 1994 but kept on claiming their innocence since then, before culminating with the trio's attempt at an Alford plea.\nThe film premiered at the 2011 Toronto International Film Festival on September 11, 2011, before airing on HBO on January 12, 2012. It received a nomination for the Academy Award for Best Documentary Feature, as well as Primetime Emmy Award nominations for Exceptional Merit in Documentary Filmmaking and Outstanding Directing for Nonfiction Programming.\n"
    },
    {
        "link": "/wiki/Paradise_Lost:_The_Child_Murders_at_Robin_Hood_Hills",
        "title": "Paradise Lost: The Child Murders at Robin Hood Hills",
        "date": "",
        "location": "",
        "paragraph": "Paradise Lost: The Child Murders at Robin Hood Hills is a 1996 American documentary film directed, produced and edited by Joe Berlinger and Bruce Sinofsky about the trials of the West Memphis Three, three teenage youths accused of the May 1993 murders and sexual mutilation of three prepubescent boys as a part of an alleged satanic ritual in West Memphis, Arkansas.\nThe film uses the music of Metallica instead of an original soundtrack, the first time that the band authorized their music to be used in a film.[1] It was well received by critics, and won the Primetime Emmy Award for Outstanding Informational Programming. It was followed by two sequels, also made by Berlinger and Sinofsky, which followed the evolution of the case through the years: Paradise Lost 2: Revelations in 2000, and  Paradise Lost 3: Purgatory in 2011.\n"
    },
    {
        "link": "/wiki/Rise_Above:_24_Black_Flag_Songs_to_Benefit_the_West_Memphis_Three",
        "title": "Rise Above: 24 Black Flag Songs to Benefit the West Memphis Three",
        "date": "",
        "location": "",
        "paragraph": "\nRise Above: 24 Black Flag Songs to Benefit the West Memphis Three is a 2002 tribute album.[2] It consists of covers of Black Flag songs performed by the Rollins Band, with vocalists from various well-known rock, hip hop, punk and metal artists (as well as certain members of Black Flag) singing. All money raised from sales of the album were donated to the legal funds of the West Memphis Three.\n"
    },
    {
        "link": "/wiki/West_of_Memphis",
        "title": "West of Memphis",
        "date": "",
        "location": "",
        "paragraph": "\nWest of Memphis is a 2012 New Zealand-American documentary film directed and co-written by Amy J. Berg, produced by Peter Jackson and Damien Echols, and released in the US by Sony Pictures Classics to critical acclaim. It received a nomination for Best Documentary Screenplay from the Writers Guild of America.[2]\n"
    },
    {
        "link": "/wiki/Kelly_(murder_victim)",
        "title": "Kelly (murder victim)",
        "date": "",
        "location": "",
        "paragraph": "\nKelly (1968 – July 10, 1991)[1] was the first name of a 23-year-old American woman and identity thief who was murdered on July 10, 1991 in El Dorado, Arkansas, in Room 121 of the now-demolished Whitehall Motel. She used multiple names while alive, including Mercedes (which is how her friends knew her), Cheryl Ann Wick (which was the name on the identification card found with her body), Kelly Lee Carr, Kelly Karr, Shannon Wiley, Cheryl Kaufman, and Sharon Wiley; none of which were found to be her real name.\n"
    },
    {
        "link": "/wiki/Redhead_murders",
        "title": "Redhead murders",
        "date": "",
        "location": "",
        "paragraph": "\nThe Redhead murders is the media epithet used to refer to a series of unsolved homicides of redheaded females in the United States between October 1978 and 1992, believed to have been committed by an unidentified male serial killer. The murders believed to be related have occurred in states including Tennessee, Arkansas, Kentucky, Mississippi, Pennsylvania, and West Virginia.[1][2][3] The murders may have continued until 1992.[4][5][6] The victims, many remaining unidentified for years, were usually women with reddish hair, whose bodies were abandoned along major highways in the United States. Officials believe that the women were likely hitchhiking or may have engaged in sex work.[3][7]\n"
    },
    {
        "link": "/wiki/Elisha_Baxter",
        "title": "Elisha Baxter",
        "date": "",
        "location": "",
        "paragraph": "Elisha Baxter (September 1, 1827 – May 31, 1899) was an American businessman and politician who served as the 10th governor of Arkansas from 1873 to 1874.\nBaxter was born in Forest City, North Carolina. He sought and obtained an appointment to the United States Military Academy at West Point. Baxter's father, William, strongly opposed his appointment, and Baxter resigned it.[1] He returned home and became a businessman. He ran a successful mercantile business in Rutherford County with his brother-in-law Spenser Eaves.\n"
    },
    {
        "link": "/wiki/John_E._Bennett_(judge)",
        "title": "John E. Bennett (judge)",
        "date": "",
        "location": "",
        "paragraph": "John Emory Bennett (March 18, 1833 – December 31, 1893) was a justice of the Arkansas Supreme Court from 1871 to 1874, and a justice of the South Dakota Supreme Court from 1889 until his death.\nBorn in East Bethany, Genesee County, New York, Bennett was educated at Genesee Wesleyan Seminary of Lima, New York, graduating in 1852.[1]\n"
    },
    {
        "link": "/wiki/Joseph_Brooks_(politician)",
        "title": "Joseph Brooks (politician)",
        "date": "",
        "location": "",
        "paragraph": "\nJoseph Brooks (November 1, 1821 – April 30, 1877) was a Methodist minister, newspaper editor, and politician who served as the 19th postmaster of Little Rock, Arkansas, from 1875 to 1877.[1] During the Reconstruction Period in Arkansas (1864–74), Brooks and the \"Brindle Tails\" faction of the state's Republican Party led a coalition group in an attempt to overthrow Republican governor Elisha Baxter. The Spring 1874 coup d'état attempt came to be known as the Brooks–Baxter War.\n"
    },
    {
        "link": "/wiki/Robert_Francis_Catterson",
        "title": "Robert Francis Catterson",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Francis Catterson (March 22, 1835 – March 30, 1914) was a doctor, Union Army officer in the American Civil War, state legislator, militia officer, U.S. Marshal, and the 30th mayor of Little Rock, Arkansas (from 1871 to 1873).[1] During the American Civil War, he was a senior officer of the Union Army and served as a brigade commander in the Army of the Tennessee.\n"
    },
    {
        "link": "/wiki/Thomas_James_Churchill",
        "title": "Thomas James Churchill",
        "date": "",
        "location": "",
        "paragraph": "\nThomas James Churchill (March 10, 1824 – May 14, 1905) was an American politician who served as the 13th governor of Arkansas from 1881 to 1883. Prior to that, he was a senior officer of the Confederate States Army who commanded infantry in the Western and Trans-Mississippi theaters of the American Civil War.\n"
    },
    {
        "link": "/wiki/Powell_Clayton",
        "title": "Powell Clayton",
        "date": "",
        "location": "",
        "paragraph": "\nPowell Foulk Clayton (August 7, 1833 – August 25, 1914) was an American politician, diplomat, and businessman who served as the 9th governor of Arkansas from 1868 to 1871, as a Republican member of the U.S. Senate for Arkansas from 1871 to 1877 and as U.S. Ambassador to Mexico from 1897 to 1905.\n"
    },
    {
        "link": "/wiki/Thomas_Pleasant_Dockery",
        "title": "Thomas Pleasant Dockery",
        "date": "",
        "location": "",
        "paragraph": "\nBrigadier-General Thomas Pleasant Dockery (December 18, 1833 – February 26, 1898) was a senior officer of the Confederate States Army who served in both the Western and Trans-Mississippi theaters of the American Civil War.\n"
    },
    {
        "link": "/wiki/James_Fleming_Fagan",
        "title": "James Fleming Fagan",
        "date": "",
        "location": "",
        "paragraph": "\nJames Fleming Fagan (March 1, 1828 – September 1, 1893) was an American farmer, politician, and senior officer of the Confederate States Army during the American Civil War. His brigade distinguished itself in the Camden Expedition of 1864, helping to drive the U.S. Army's Seventh Corps from southwest Arkansas.[1]\n"
    },
    {
        "link": "/wiki/Sandford_C._Faulkner",
        "title": "Sandford C. Faulkner",
        "date": "",
        "location": "",
        "paragraph": "\nSandford C. Faulkner (March 3, 1803 – August 4, 1874), better known as Sandy Faulkner, was an American planter, raconteur and fiddler who personified the mid-19th century folk song \"Arkansas Traveler,\" for which he received writing credit. It has since gone on to become the official state historic song of Arkansas.\n"
    },
    {
        "link": "/wiki/Harris_Flanagin",
        "title": "Harris Flanagin",
        "date": "",
        "location": "",
        "paragraph": "\nHarris Flanagin (November 3, 1817 – October 23, 1874) was an American politician and lawyer who served as the 7th governor of Arkansas from 1862 to 1864, and in exile from 1864 to 1865. Prior to this he was a Confederate States Army officer who commanded infantry in the Western Theater of the American Civil War.\n"
    },
    {
        "link": "/wiki/Read_Fletcher",
        "title": "Read Fletcher",
        "date": "",
        "location": "",
        "paragraph": "\nRead Fletcher (c. 1829 – November 21, 1889) was an American politician, lawyer, co-founder and editor of the Pine Bluff Graphic.[1] Besides service on state court benches,[2] he represented Jefferson County in the Arkansas House of Representatives.[3] He previously served with the Confederate army during the Civil War.[4]\n"
    },
    {
        "link": "/wiki/Ozra_Amander_Hadley",
        "title": "Ozra Amander Hadley",
        "date": "",
        "location": "",
        "paragraph": "Ozra (or Ozro) Amander Hadley (June 30, 1826 – July 18, 1915) was an American politician who served as the acting governor of Arkansas from 1871 to 1873.\nHadley was born in Cherry Creek, New York, and was educated in the public schools. He attended Fredonia Academy, now State University of New York at Fredonia. Hadley moved to Rochester, Minnesota in 1855, where he was a farmer and became active in local politics and government, including appointment as Olmsted County Auditor. In 1865, he moved to Little Rock, Arkansas, where he opened a general store.\n"
    },
    {
        "link": "/wiki/Robert_C._Newton",
        "title": "Robert C. Newton",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Crittenden Newton (June 2, 1840 – June 7, 1877) was a noted lawyer, politician, and Confederate Colonel in Arkansas during the American Civil War. He is most remembered for his involvement in the Brooks-Baxter War. Robert C. Newton Camp # 197 of Little Rock was named for him and was the oldest continually run camp of the Arkansas Division, Sons of Confederate Veterans, as well as the oldest continually active camp west of the Mississippi River.\n"
    },
    {
        "link": "/wiki/Elias_W._Rector",
        "title": "Elias W. Rector",
        "date": "",
        "location": "",
        "paragraph": "\nElias William Rector (June 11, 1849 – January 29, 1917) was an American politician who served as the 28th speaker of the Arkansas House of Representatives from January 1891 to January 1893.\n"
    },
    {
        "link": "/wiki/U._M._Rose",
        "title": "U. M. Rose",
        "date": "",
        "location": "",
        "paragraph": "Uriah Milton Rose (March 5, 1834 – August 12, 1913) was an American lawyer [1]: 181  and Confederate sympathizer.[1]: 176  \"Approachable, affable, and kind,\"[2] graceful and courteous,[3]: 18  he was called \"the most scholarly lawyer in America\"[4]: 676  and \"one of the leading legal lights of the nation\",[5] \"a towering figure in the...life of Little Rock\".[2] He was a founder of the American Bar Association, of which he was twice president, 1891–92 and 1901-02.[6]\nAnother Arkansas judge, J. T. Coston, described him thus:\n"
    }
]