[
    {
        "link": "/wiki/Colorado_Springs_nightclub_shooting",
        "title": "Colorado Springs nightclub shooting",
        "date": "November 19–20, 2022 c. 11:56 p.m.[1] – 12:02 a.m. (MST)",
        "location": "Club Q, Colorado Springs, Colorado, U.S.",
        "paragraph": "\nOn November 19–20, 2022, a mass shooting occurred at Club Q, an LGBTQ nightclub in Colorado Springs, Colorado, United States. Five people were killed, and 25 others were injured, 19 of them by gunfire. The accused, 22-year-old Anderson Lee Aldrich, was also injured and taken to a local hospital.[6][7][8][9] Aldrich was charged and remanded in custody.\n"
    },
    {
        "link": "/wiki/Fred_N._Selak",
        "title": "Grand Lake, Colorado",
        "date": "",
        "location": "",
        "paragraph": "The Town of Grand Lake is a statutory town located in Grand County, Colorado, United States.[1] The town population was 410 at the 2020 United States Census.[3]\nEstablished in 1881, Grand Lake sits at an elevation of 8,369 feet (2,551 m) and derives its name from the lake on whose shores it is situated: Grand Lake, the largest natural body of water in Colorado. The town of Grand Lake was originally an outfitting and supply point for the mining settlements of Lulu City, Teller City, and Gaskill, but today is a tourist destination adjacent to the western entrance to Rocky Mountain National Park, which surrounds the lake and the town on three sides. Grand Lake was the Grand County seat of government from 1882 to 1888. It was incorporated on June 23, 1944.[2]\n"
    },
    {
        "link": "/wiki/Alan_Berg",
        "title": "Alan Berg",
        "date": "",
        "location": "",
        "paragraph": "\nAlan Harrison Berg (January 18, 1934 – June 18, 1984) was an American talk radio show host in Denver, Colorado. Born to a Jewish family, he had outspoken atheistic and liberal views and a confrontational interview style. Berg was murdered by members of the white supremacist group The Order, who believed in killing all Jews and sending all black people to Africa.[1] Those involved in the killing were part of a group planning to kill prominent Jews such as Berg. Two of them, David Lane and neo-Nazi[1] Bruce Pierce, were convicted on charges of civil rights violations, although neither was charged with murder. They were sentenced to 190 years and 252 years in prison, respectively.\n"
    },
    {
        "link": "/wiki/Cassie_Bernall",
        "title": "Cassie Bernall",
        "date": "",
        "location": "",
        "paragraph": "\nCassie René Bernall (November 6, 1981 – April 20, 1999) was a student who was killed in the Columbine High School massacre, where 11 more students and a teacher were killed by Eric Harris and Dylan Klebold, who then committed suicide. It was reported that Bernall had been asked whether or not she believed in God, and she said \"Yes\", before being shot during the massacre. However, investigators concluded the person asked about their belief in God was Valeen Schnurr, who survived the shooting.[4][5][6][7]\n"
    },
    {
        "link": "/wiki/Henry_Callahan",
        "title": "Henry Callahan",
        "date": "",
        "location": "",
        "paragraph": "Henry Callahan (1957–1982) was a player and ambassador of Ultimate and helped bring the sport to the University of Oregon, formally establishing a team in 1978.[1] In 1982, he was murdered during a robbery while working in Boulder, Colorado.[2] Both the Callahan Award, given each year to the best male and female college Ultimate players and the Callahan Rules of Ultimate are named after him. The idea and the award were founded by Charles Kerr, a long-time coach.[3]\nThere is also a move in Ultimate named after Callahan called a Callahan.  A Callahan is when a defensive player intercepts the disc in the opponent's end zone for a point.  It is a rare occurrence, because it requires a defender to intercept, rather than simply block, a pass in the offense's own end zone. Under normal circumstances, the offense does not start a possession within their own end zone, so opportunities for a Callahan are limited to situations where the offense has been forced into their own end zone (either by a good pull or defensive pressure) or backward passes near the end zone.  The move is so called because it was first legalized as a goal (rather than needing to be put into play from the goal line) in the Callahan version of the rules, which differed from the Ultimate Player Association's current rules at the time.  The rules were subsequently changed in both the UPA (now USA Ultimate) and the World Flying Disc Federation to make a Callahan a legal goal under all rule sets used for Ultimate. \n"
    },
    {
        "link": "/wiki/Heather_Dawn_Church",
        "title": "Robert Charles Browne",
        "date": "",
        "location": "",
        "paragraph": "Robert Charles Browne (born October 31, 1952) is an American murderer who is currently serving two life sentences for the murders of two teenage girls in Colorado Springs, Colorado, committed in 1987 and 1991, respectively. A few years into his sentence, he sent letters to the El Paso County Sheriff's Office in which he claimed to be a serial killer who has killed approximately 48 or 49 people since 1970 across several states.\nThough most of his claims remain uncorroborated, Browne is considered a credible suspect in at least seven further killings, for which he has never been charged.\n"
    },
    {
        "link": "/wiki/Tom_Clements_(public_official)",
        "title": "Tom Clements (public official)",
        "date": "",
        "location": "",
        "paragraph": "Thomas Lynn Clements (October 2, 1954 – March 19, 2013) was head of the Colorado Department of Corrections until he was assassinated on March 19, 2013.[1]\nClements was born in St. Louis, Missouri.[2] He married Lisa Smith in 1984 and had two daughters.[2]  Before moving to Colorado to lead the Colorado Department of Corrections (DOC), Clements had worked in a similar position in Missouri.\n"
    },
    {
        "link": "/wiki/Arthur_L._Collins",
        "title": "Arthur L. Collins",
        "date": "",
        "location": "",
        "paragraph": "\nArthur Launcelot Collins (8 July 1868 – 22 November 1902) was a British metallurgist, mining engineer and mine manager of properties in Mexico and the United States. He was born 8 July 1868 in Truro, Cornwall, England, the son of a prominent mining expert, Joseph Henry Collins, and brother of Henry, George, and Edgar Collins[1] and William Collins, the Bishop of Gibraltar. Joseph H. Collins founded, and with his sons Henry, Arthur, and George, operated J. H. Collins & Sons, Mining and Metallurgical Engineers, an international mining consulting business headquartered in London, England.[2]\n"
    },
    {
        "link": "/wiki/Adolph_Coors_III",
        "title": "Adolph Coors III",
        "date": "",
        "location": "",
        "paragraph": "Adolph Coors III (January 12, 1915 – February 9, 1960) was the grandson of Adolph Coors and heir to the Coors Brewing Company empire.\nCoors was born on January 12, 1915, the son of Alice May (née Kistler; 1885–1970) and Adolph Coors Jr. He attended Phillips Exeter Academy in New Hampshire. Like his father and his youngest brother Joseph Coors, Adolph graduated from Cornell University, where he was president of the Quill and Dagger society and a member of the Kappa Alpha Society. Coors was also a semiprofessional baseball player. At the time of his death, he was CEO and chairman of the board of the Coors Brewing Company in Golden, Colorado.[1] Coors married Mary Urquhart Grant in November 1940. The couple had four children together.[2]\n"
    },
    {
        "link": "/wiki/Julie_Cunningham",
        "title": "Ted Bundy",
        "date": "",
        "location": "",
        "paragraph": "\nTheodore Robert Bundy (born Cowell; November 24, 1946 – January 24, 1989) was an American serial killer who kidnapped, raped and murdered numerous young women and girls during the 1970s and possibly earlier. After more than a decade of denials, he confessed to 30 murders committed in seven states between 1974 and 1978. His true victim total is unknown and likely significantly higher.[6]\n"
    },
    {
        "link": "/wiki/T._J._Cunningham",
        "title": "T. J. Cunningham",
        "date": "",
        "location": "",
        "paragraph": "Anthony \"T. J.\" Cunningham Jr. (October 24, 1972 – February 18, 2019) was a safety in the National Football League, playing for the Seattle Seahawks in 1996. Cunningham decided to retire after only one season. He played college football for Colorado.\nCunningham was born in Aurora, Colorado. He graduated from Overland High School.[1]\n"
    },
    {
        "link": "/wiki/LeAnn_Emry",
        "title": "Scott Lee Kimball",
        "date": "",
        "location": "",
        "paragraph": "\nScott Lee Kimball (born September 21, 1966) is a convicted serial killer, con man and fraudster from Boulder County, Colorado, who murdered at least four people over a two-year period; investigators strongly suspect him in as many as 21 other unsolved killings.[1][2] For the first year of his murder activity, he worked as an informant for the FBI, which both paid him and protected him from facing justice over some of his fraud schemes. Almost none of the information he gave the bureau was of any use in prosecuting other crimes, and much of it later proved false; the case greatly embarrassed the bureau. The agent who oversaw him during this period was disciplined; he insists he was not the only one responsible for enabling Kimball.[3]\n"
    },
    {
        "link": "/wiki/Robert_Ford_(outlaw)",
        "title": "Robert Ford (outlaw)",
        "date": "",
        "location": "",
        "paragraph": "Robert Newton Ford (January 31, 1862 – June 8, 1892) was an American outlaw who killed fellow outlaw Jesse James on April 3, 1882. He and his brother Charley, both members of the James–Younger Gang under James’s leadership, went on to perform paid re-enactments of the killing at publicity events. Ford would spend his later years operating multiple saloons and dance halls in the West.\nTen years after James's death, Ford was himself the victim of a fatal shot to the neck by Edward Capehart O'Kelley in Creede, Colorado, dying at only 30 years old. While initially buried in Creede, his remains were later exhumed and reinterred in his hometown of Richmond, Missouri.\n"
    },
    {
        "link": "/wiki/Murder_of_Neveah_Gallegos",
        "title": "Murder of Neveah Gallegos",
        "date": "",
        "location": "",
        "paragraph": "Neveah Janey Gallegos (August 1, 2004 – September 21, 2007) was a child in Denver, Colorado who was murdered by her mother's live-in boyfriend. After her death, Denver's Department of Human Services said that they would make improvements to their agency.[1]\nOn September 21, 2007, the Denver Police Department received a 911 call from Miriam Gallegos, the mother of Neveah. She claimed that her daughter had been kidnapped, having been snatched from her arms.[2][3] Gallegos gave a description of the supposed kidnapper and the car he was in, adding that he was the passenger and that she was unable to see the driver. Gallegos gave police permission to enter her apartment in order for them to obtain a photograph of her daughter to aid them in their search. Once inside the apartment police noticed a \"paper towel on the floor of the living room that had blood or some other type of bodily fluid on it\".[3]\n"
    },
    {
        "link": "/wiki/Neveah_Gallegos",
        "title": "Murder of Neveah Gallegos",
        "date": "",
        "location": "",
        "paragraph": "Neveah Janey Gallegos (August 1, 2004 – September 21, 2007) was a child in Denver, Colorado who was murdered by her mother's live-in boyfriend. After her death, Denver's Department of Human Services said that they would make improvements to their agency.[1]\nOn September 21, 2007, the Denver Police Department received a 911 call from Miriam Gallegos, the mother of Neveah. She claimed that her daughter had been kidnapped, having been snatched from her arms.[2][3] Gallegos gave a description of the supposed kidnapper and the car he was in, adding that he was the passenger and that she was unable to see the driver. Gallegos gave police permission to enter her apartment in order for them to obtain a photograph of her daughter to aid them in their search. Once inside the apartment police noticed a \"paper towel on the floor of the living room that had blood or some other type of bodily fluid on it\".[3]\n"
    },
    {
        "link": "/wiki/Ken_Gorman",
        "title": "Ken Gorman",
        "date": "",
        "location": "",
        "paragraph": "Ken Gorman (July 12, 1946 – February 17, 2007) was a marijuana rights activist who was shot and killed in his home on February 17, 2007 in Colorado.[1] He ran for Colorado state governor as a write-in candidate and supported pro-legalization candidates, particularly Libertarian candidate Ralph Shnelvar in the 1990s.\nGorman graduated from Denver's Lincoln High School in 1964. As his father had before him, Gorman joined the US Air Force, working as an air traffic controller. He worked in Vietnam, Papua New Guinea, and the Philippines. He was stationed near Miyakojima in Japan at a long-range radar facility during the Vietnam War. His first wife introduced him to marijuana in Loveland, Colorado in 1969.[2] Gorman was often quoted as saying \"It has been a friend of mine ever since.\" He went on to a career with the FAA as an air traffic controller. On August 5, 1981, while stationed in Hawaii, he was fired by Ronald Reagan along with 11,358 other PATCO (Professional Air Traffic Controllers Organization) members who were on strike.  \n"
    },
    {
        "link": "/wiki/Peggy_Hettrick_murder_case",
        "title": "Peggy Hettrick murder case",
        "date": "",
        "location": "",
        "paragraph": "The Peggy Hettrick murder case concerns the unsolved 1987 death of Peggy Hettrick in Fort Collins, Colorado. Timothy Lee \"Tim\" Masters enlisted in the United States Navy following a high school career plagued by police accusation of murder when he was a sophomore at Fort Collins High School. After eight years in the Navy, he was honorably discharged. Masters worked for Learjet as an aviation mechanic until 1997, when he was arrested for the murder of Peggy Hettrick.[1] He was charged and convicted of the Hettrick murder in 1999 and sentenced to life imprisonment without parole. His sentence was vacated in January 2008 when DNA evidence from the original crime scene indicated that he was not the responsible party.[2] Three years after his release from prison, Masters was exonerated by the Colorado Attorney General on June 28, 2011.  To date, no one else has been charged with Hettrick's murder.\nOn the morning of February 11, 1987, a bicyclist investigated what he thought was a mannequin and discovered the dead body of 37-year-old Peggy Hettrick in a field in southern Fort Collins. According to the coroner, she died from a single stab wound in the upper left back, likely very early in the morning. Her body had been \"sexually mutilated,\" with the precise removal of her left nipple and areola, as well as a female \"circumcision\",[3] including what one doctor described as a partial vulvectomy; a procedure that requires high skill and quality surgical equipment to perform.[4]\n"
    },
    {
        "link": "/wiki/Jason_Horsley",
        "title": "Malaika Griffin",
        "date": "",
        "location": "",
        "paragraph": "Malaika Tamu Griffin (born May 11, 1971) is an American woman serving a life sentence at the DWCF in Denver, Colorado for shooting her neighbor Jason Patrick Horsley to death in May 1999. After the shooting, Griffin became a fugitive from justice for six years, but after she was profiled on Fox's America's Most Wanted, Griffin was captured in El Cajon, California, a suburb of San Diego, in June 2005.[1]\nMalaika Tamu Griffin was born in Mississippi on May 11, 1971.[2] In 1999, she moved to Denver, Colorado, where she was working in a pharmacy and was renting a room in a house next door to a white couple: Jason Patrick Horsley and his girlfriend Deborah Loiselle. Horsley was a carpenter, and Griffin became angry when she laid his tools on the sidewalk in front of her house after work. A bitter argument ensued on May 18, 1999.[3]\n"
    },
    {
        "link": "/wiki/Terry_Kimball",
        "title": "Scott Lee Kimball",
        "date": "",
        "location": "",
        "paragraph": "\nScott Lee Kimball (born September 21, 1966) is a convicted serial killer, con man and fraudster from Boulder County, Colorado, who murdered at least four people over a two-year period; investigators strongly suspect him in as many as 21 other unsolved killings.[1][2] For the first year of his murder activity, he worked as an informant for the FBI, which both paid him and protected him from facing justice over some of his fraud schemes. Almost none of the information he gave the bureau was of any use in prosecuting other crimes, and much of it later proved false; the case greatly embarrassed the bureau. The agent who oversaw him during this period was disciplined; he insists he was not the only one responsible for enabling Kimball.[3]\n"
    },
    {
        "link": "/wiki/Lean_Bear",
        "title": "Lean Bear",
        "date": "",
        "location": "",
        "paragraph": "Lean Bear (Cheyenne name Awoninahku, 1813–1864), alternatively translated as Starving Bear,[1] was a Cheyenne peace chief.[2] He was a member of the Council of Forty-four,[3] a tribal governance devoted to maintaining peace with encroaching United States settlers. Lean Bear's most notable peace deals include the Treaty of Fort Wise[4] and a meeting with US President Abraham Lincoln.[5] His work towards peace between his people and the American settlers in the Southern Plains was cut short when he was killed by the 1st Colorado Cavalry Regiment and violent retaliations ensued.[4]\nLean Bear suffered from vertigo, which commonly ran in the family. During a meeting with President Abraham Lincoln in 1863, he suffered an attack and spoke while seated in a chair.[5] Lean Bear brushed it off as a result of him simply being too nervous to stand.[6]\n"
    },
    {
        "link": "/wiki/John_Levi_(American_football)",
        "title": "John Levi (American football)",
        "date": "",
        "location": "",
        "paragraph": "John C. \"Skee\" Levi (June 14, 1898 – January 22, 1946) was an Arapaho Indian athlete,[1] playing college football for the Haskell Indians.[2] Allegedly Jim Thorpe called him the greatest athlete he'd ever seen.[3] He then coached at his alma mater.[4]\nLevi died on January 22, 1946, at Denver General Hospital in Denver, Colorado, after he was fatally stabbed by Fannie Stabler. In May 1946, Stabler was convicted of voluntary manslaughter.[5][6]\n"
    },
    {
        "link": "/wiki/Los_Seis_de_Boulder",
        "title": "Los Seis de Boulder",
        "date": "",
        "location": "",
        "paragraph": "Los Seis de Boulder (transl. The Boulder Six) were six Chicano activists and students killed in two car bombings in Boulder, Colorado.[1][2] The bombings occurred at the end of May 1974, with the name Los Seis de Boulder coined posthumously. The students were protesting the negative treatment of Mexican-American students at the University of Colorado, Boulder at the time of their death.[1] A monument was erected for them in Chautauqua Park on May 27, 2020.[1]\nLos Seis were active in the UMAS (United Mexican American Students) at the University of Colorado Boulder. At the time [1967-1979][3][better source needed], Colorado was one of fewer than 10 U.S. states in which Chicanos (mid-20th century political/cultural term used by some Mexican Americans) were initiating the original MECha groups. As of 2012, there are over 500 chapters.[4] Although these groups originally concentrated more on education issues, this led to participation in political campaigns and protests against widespread issues such as police brutality and the U.S. war in Southeast Asia.[5]  Outside of Colorado, the Brown Berets, a Chicano youth group which began in California, took on a more militant and nationalistic ideology.[6] At the University of Colorado Boulder today, UMAS and MEChA have combined into a single coalition simply referred to as \"UMAS y MEXA\".[7]\n"
    },
    {
        "link": "/wiki/Phillip_Mankoff",
        "title": "Father's Day Bank Massacre",
        "date": "June 16, 1991 9:14 a.m. – 9:56 a.m. (MDT)",
        "location": "Downtown, Denver, Colorado, U.S.",
        "paragraph": "The Father's Day Bank Massacre was a bank robbery and shooting that took place on Sunday, June 16, 1991, at the United Bank Tower (now the Wells Fargo Center) in Denver, Colorado. The perpetrator killed four unarmed bank guards and held up six tellers in the bank's cash vault. An estimated $200,000 was stolen from the bank. Nearly three weeks later, on July 4, 1991, authorities arrested retired police officer James W. King for the crime. The subsequent trial was broadcast nationally on Court TV. After days of deliberation, the jury acquitted King. None of the stolen money was ever found. The crime remains unsolved and is considered a cold case.[1][2]\nThe United Bank Tower had previously allowed its guards to be armed, but had changed their policy less than a year before the robbery, requiring the guards to be unarmed.[3]\n"
    },
    {
        "link": "/wiki/Jennifer_Marcum",
        "title": "Scott Lee Kimball",
        "date": "",
        "location": "",
        "paragraph": "\nScott Lee Kimball (born September 21, 1966) is a convicted serial killer, con man and fraudster from Boulder County, Colorado, who murdered at least four people over a two-year period; investigators strongly suspect him in as many as 21 other unsolved killings.[1][2] For the first year of his murder activity, he worked as an informant for the FBI, which both paid him and protected him from facing justice over some of his fraud schemes. Almost none of the information he gave the bureau was of any use in prosecuting other crimes, and much of it later proved false; the case greatly embarrassed the bureau. The agent who oversaw him during this period was disciplined; he insists he was not the only one responsible for enabling Kimball.[3]\n"
    },
    {
        "link": "/wiki/Jonelle_Matthews",
        "title": "Murder of Jonelle Matthews",
        "date": "",
        "location": "",
        "paragraph": "Jonelle Matthews was a 12-year-old American girl who disappeared near Greeley, Colorado, on December 20, 1984.[3] Her remains were discovered on July 24, 2019, by construction workers putting in a new pipeline 15 mi (24 km) from her home.[4] Her killer, Steven Pankey, was sentenced to life imprisonment on October 31, 2022 after his arrest in 2020.[5]\nJonelle Matthews was born at Cottage Hospital in Santa Barbara, California on February 9, 1972 to 13-year-old Terri Vierra. Jonelle was adopted in March 1972 by James \"Jim\" and Gloria Matthews, a married couple with a daughter, living in Greeley, Colorado.  At the time of her disappearance, Jonelle's father was the principal of Platte Valley Elementary School in Kersey, Colorado.[6]\n"
    },
    {
        "link": "/wiki/Murder_of_Jonelle_Matthews",
        "title": "Murder of Jonelle Matthews",
        "date": "",
        "location": "",
        "paragraph": "Jonelle Matthews was a 12-year-old American girl who disappeared near Greeley, Colorado, on December 20, 1984.[3] Her remains were discovered on July 24, 2019, by construction workers putting in a new pipeline 15 mi (24 km) from her home.[4] Her killer, Steven Pankey, was sentenced to life imprisonment on October 31, 2022 after his arrest in 2020.[5]\nJonelle Matthews was born at Cottage Hospital in Santa Barbara, California on February 9, 1972 to 13-year-old Terri Vierra. Jonelle was adopted in March 1972 by James \"Jim\" and Gloria Matthews, a married couple with a daughter, living in Greeley, Colorado.  At the time of her disappearance, Jonelle's father was the principal of Platte Valley Elementary School in Kersey, Colorado.[6]\n"
    },
    {
        "link": "/wiki/Scott_McCarthy_(security_guard)",
        "title": "Father's Day Bank Massacre",
        "date": "June 16, 1991 9:14 a.m. – 9:56 a.m. (MDT)",
        "location": "Downtown, Denver, Colorado, U.S.",
        "paragraph": "The Father's Day Bank Massacre was a bank robbery and shooting that took place on Sunday, June 16, 1991, at the United Bank Tower (now the Wells Fargo Center) in Denver, Colorado. The perpetrator killed four unarmed bank guards and held up six tellers in the bank's cash vault. An estimated $200,000 was stolen from the bank. Nearly three weeks later, on July 4, 1991, authorities arrested retired police officer James W. King for the crime. The subsequent trial was broadcast nationally on Court TV. After days of deliberation, the jury acquitted King. None of the stolen money was ever found. The crime remains unsolved and is considered a cold case.[1][2]\nThe United Bank Tower had previously allowed its guards to be armed, but had changed their policy less than a year before the robbery, requiring the guards to be unarmed.[3]\n"
    },
    {
        "link": "/wiki/William_McCullum_Jr.",
        "title": "Father's Day Bank Massacre",
        "date": "June 16, 1991 9:14 a.m. – 9:56 a.m. (MDT)",
        "location": "Downtown, Denver, Colorado, U.S.",
        "paragraph": "The Father's Day Bank Massacre was a bank robbery and shooting that took place on Sunday, June 16, 1991, at the United Bank Tower (now the Wells Fargo Center) in Denver, Colorado. The perpetrator killed four unarmed bank guards and held up six tellers in the bank's cash vault. An estimated $200,000 was stolen from the bank. Nearly three weeks later, on July 4, 1991, authorities arrested retired police officer James W. King for the crime. The subsequent trial was broadcast nationally on Court TV. After days of deliberation, the jury acquitted King. None of the stolen money was ever found. The crime remains unsolved and is considered a cold case.[1][2]\nThe United Bank Tower had previously allowed its guards to be armed, but had changed their policy less than a year before the robbery, requiring the guards to be unarmed.[3]\n"
    },
    {
        "link": "/wiki/Kaysi_McLeod",
        "title": "Scott Lee Kimball",
        "date": "",
        "location": "",
        "paragraph": "\nScott Lee Kimball (born September 21, 1966) is a convicted serial killer, con man and fraudster from Boulder County, Colorado, who murdered at least four people over a two-year period; investigators strongly suspect him in as many as 21 other unsolved killings.[1][2] For the first year of his murder activity, he worked as an informant for the FBI, which both paid him and protected him from facing justice over some of his fraud schemes. Almost none of the information he gave the bureau was of any use in prosecuting other crimes, and much of it later proved false; the case greatly embarrassed the bureau. The agent who oversaw him during this period was disciplined; he insists he was not the only one responsible for enabling Kimball.[3]\n"
    },
    {
        "link": "/wiki/Chief_Niwot",
        "title": "Chief Niwot",
        "date": "",
        "location": "",
        "paragraph": "Chief Niwot (Hinóno'eitíít/Arapaho: Nowoo3 [nɔ'wɔːθ]) or Left Hand(-ed) (c. 1825–1864) was a Southern Arapaho chief, diplomat, and interpreter who negotiated for peace between white settlers and the Cheyenne and Arapaho tribes during the Pike's Peak Gold Rush and Colorado War. \nNiwot lived along the Front Range, and wintered near the site of modern-day Boulder, Colorado. A fluent English speaker, Niwot was often relied on as a translator and interpreter in negotiations between tribal leaders and settlers.[1] Niwot was a prominent advocate of peace during the negotiations, and sought to de-escalate growing tension between native groups and settlers.  \n"
    },
    {
        "link": "/wiki/Denise_Oliverson",
        "title": "Ted Bundy",
        "date": "",
        "location": "",
        "paragraph": "\nTheodore Robert Bundy (born Cowell; November 24, 1946 – January 24, 1989) was an American serial killer who kidnapped, raped and murdered numerous young women and girls during the 1970s and possibly earlier. After more than a decade of denials, he confessed to 30 murders committed in seven states between 1974 and 1978. His true victim total is unknown and likely significantly higher.[6]\n"
    },
    {
        "link": "/wiki/Park_Hee-byung",
        "title": "Park Hee-byung",
        "date": "",
        "location": "",
        "paragraph": "Park Hee Byung (1871, Gangwon, Korea – June 13, 1907, Denver, Colorado) was a Korean independence activist and one of the first Korean immigrants to the U.S. state of Colorado.[1]\nPark first came to the United States in 1900 with Yi Gang, fifth son of Emperor Gojong; the two studied together at Roanoke College in Salem, Virginia.[1] After his graduation, Park established a mining school in his homeland, but soon returned to North America, where he first went to Mexico in August 1905 before coming to Colorado in January 1906. He rose to prominence as a local community leader there along with Yun Byeong-gu and his nephew Pak Yong-man, helping to organise Denver-area Koreans for the Korean independence movement. He hoped to campaign for Korea's freedom at the 1908 Democratic National Convention, but was killed under mysterious circumstances in a suspected assassination in 1907 and buried in an unmarked grave at Denver's Riverside Cemetery, where he lay forgotten for almost a century.[2][3]\n"
    },
    {
        "link": "/wiki/Murder_of_Nancy_Pfister",
        "title": "Murder of Nancy Pfister",
        "date": "",
        "location": "",
        "paragraph": "Nancy Merle Pfister was an American woman who was found murdered on February 26, 2014 in a walk-in closet of her secluded home in the Rocky Mountains. She had been beaten in the head and chest with a hammer, ax, and lamp. Pfister has been described as having been a \"small-town socialite\" and was well known in her small community. In October 2014, Trey and Nancy Styler, Pfister's former roommates were charged with the crime. Shortly thereafter, Trey Styler confessed to her murder, and received life imprisonment in exchange for the charges against his wife to be dropped.\nStyler claimed he killed Pfister as \"punishment\" for adding an interest rate to the couple's rent after they refused to pay for over three months. The Stylers had stopped paying rent after living with Pfister for 2 months, due to minor broken utilities in the home that she refused to fix. The case gained national notoriety and sparked many debates on renter's rights.\n"
    },
    {
        "link": "/wiki/Ernie_Pitts",
        "title": "Ernie Pitts",
        "date": "",
        "location": "",
        "paragraph": "\nErnie Pitts (March 8, 1935 – September 24, 1970) was a Canadian Football League wide receiver and defensive back for the Winnipeg Blue Bombers and the BC Lions in a 14-year career in the CFL from 1957 to 1970. He won four Grey Cups with Winnipeg.\nIn August 2019 he was inducted into the Canadian Football League Hall of Fame.\n"
    },
    {
        "link": "/wiki/JonBen%C3%A9t_Ramsey",
        "title": "Killing of JonBenét Ramsey",
        "date": "",
        "location": "",
        "paragraph": "\nJonBenét Patricia Ramsey (August 6, 1990 – December 25 or 26, 1996)[1] was an American child beauty queen who was killed at the age of six in her family's home in Boulder, Colorado. A long handwritten ransom note was found in the home. Her father, John, found the girl's body in the basement of their house about seven hours after she had been reported missing. She had sustained a broken skull from a blow to the head and had been strangled; a garrote was found tied around her neck. The autopsy report stated that JonBenét's official cause of death was \"asphyxia by strangulation associated with craniocerebral trauma\".[2][1] Her death was ruled a homicide.[3] The case generated worldwide public and media interest, in part because her mother Patsy Ramsey, a former beauty queen, had entered JonBenét into a series of child beauty pageants. The crime is still considered a cold case and remains an open investigation with the Boulder Police Department.\n"
    },
    {
        "link": "/wiki/Jessica_Ridgeway",
        "title": "Murder of Jessica Ridgeway",
        "date": "",
        "location": "",
        "paragraph": "\nJessica Ridgeway (January 23, 2002 – October 5, 2012) was an American girl who, at the age of 10, was kidnapped in Westminster, Colorado, and murdered by Austin Sigg (born January 17, 1995) on October 5, 2012.[3]\n"
    },
    {
        "link": "/wiki/Rachel_Scott",
        "title": "Rachel Scott",
        "date": "",
        "location": "",
        "paragraph": "\nRachel Joy Scott (August 5, 1981 – April 20, 1999) was an American student who was the first fatality of the Columbine High School massacre, in which 11 other students and a teacher were also murdered by Eric Harris and Dylan Klebold, who then died by suicide.\n"
    },
    {
        "link": "/wiki/Fred_N._Selak",
        "title": "Grand Lake, Colorado",
        "date": "",
        "location": "",
        "paragraph": "The Town of Grand Lake is a statutory town located in Grand County, Colorado, United States.[1] The town population was 410 at the 2020 United States Census.[3]\nEstablished in 1881, Grand Lake sits at an elevation of 8,369 feet (2,551 m) and derives its name from the lake on whose shores it is situated: Grand Lake, the largest natural body of water in Colorado. The town of Grand Lake was originally an outfitting and supply point for the mining settlements of Lulu City, Teller City, and Gaskill, but today is a tourist destination adjacent to the western entrance to Rocky Mountain National Park, which surrounds the lake and the town on three sides. Grand Lake was the Grand County seat of government from 1882 to 1888. It was incorporated on June 23, 1944.[2]\n"
    },
    {
        "link": "/wiki/Disappearances_of_Paul_and_Sarah_Skiba_and_Lorenzo_Chivers",
        "title": "Disappearances of Paul and Sarah Skiba and Lorenzo Chivers",
        "date": "February 7, 1999",
        "location": "7010 Raleigh Street, #5Westminster, Colorado, U.S.[a]",
        "paragraph": "Paul Carroll Skiba (born February 23, 1960),[3] his daughter Sarah Arielle Skiba (born July 27, 1989),[4] and Lorenzo DeShawn Chivers (born November 5, 1962),[5] an employee of Skiba's moving business, disappeared under mysterious circumstances in Westminster, Colorado, United States, on February 7, 1999.[6]\nOn the day they went missing, Sarah accompanied her father Paul, who owned the Tuff Movers company in Westminster, on a job along with his employee Chivers. The three were last seen in Morrison that evening. Sarah was reported missing by her mother after Paul failed to return her home from her weekend visitation; at this time, it was discovered that Paul and Chivers were also missing. A moving truck located at the Tuff Movers lot was subsequently discovered with bullet holes in its side, blood evidence, as well as a portion of human scalp near its windshield; a metal extension ramp for the truck was also missing from the lot.\n"
    },
    {
        "link": "/wiki/Silas_Soule",
        "title": "Silas Soule",
        "date": "",
        "location": "",
        "paragraph": "Indian Wars\nSilas Stillman Soule (/ˈsoʊl/ [sole])[1] (July 26, 1838 – April 23, 1865) was an American abolitionist, Kansas Territory Jayhawker, whose family aligned themselves with John Brown and Walt Whitman. Later, during the American Civil War, he joined the Colorado volunteers, rising to the rank of captain in the Union Army. Soule was in command of Company D, 1st Colorado Cavalry, which was present at Sand Creek on November 29, 1864, when he refused an order to join the Sand Creek massacre. During the subsequent inquiry, Soule testified against the massacre's commanding officer, John Chivington. Soon afterwards, Soule was murdered by one of the men who took part in the massacre; dying at 26, Soule is remembered as having led a life of \"moral courage\" at great personal risk.[2]\n"
    },
    {
        "link": "/wiki/Garrett_Swasey",
        "title": "Garrett Swasey",
        "date": "",
        "location": "",
        "paragraph": " Garrett Preston Russell Swasey (November 16, 1971 – November 27, 2015) was an American competitive ice skater, figure skating coach, and police officer. As an ice dancer, he won the 1992 U.S. junior ice dance title at the U.S. Figure Skating Championships and went on to participate twice more at the senior level. He coached along with Doreen Denny. Swasey was shot and killed in the line of duty during the Colorado Springs Planned Parenthood shooting in 2015.\nSwasey began skating competitively as a youngster in the Boston area under coach Keith Lichtman.[4] One of his closest childhood friends and training mates was Nancy Kerrigan, who later became a two-time Olympic medalist in ladies singles.[5][6] Swasey competed with three ice dance partners in his skating career.\n"
    },
    {
        "link": "/wiki/Al_Swearengen",
        "title": "Al Swearengen",
        "date": "",
        "location": "",
        "paragraph": "Ellis Alfred Swearengen (July 8, 1845 – November 15, 1904) was an American pimp and entertainment entrepreneur who ran the Gem Theater, a notorious brothel, in Deadwood, South Dakota, for 22 years during the late 19th century.\nSwearengen (sometimes spelled Swearingen, Swearengin, Swearngir, Swegen, etc.) and his twin brother Lemuel were the eldest two of eight children of Dutch American farmer Daniel J. Swearingen and Keziah \"Katie\" Montgomery of Oskaloosa, Iowa.[1] Swearengen remained at home well into his adult years and only arrived in Deadwood in May 1876, with his wife, Nettie Swearengen.[2] Nettie later divorced him on the grounds of spousal abuse.[3] Swearengen married two more times; both of these marriages ended in divorce.[1]\n"
    },
    {
        "link": "/wiki/Eric_Talley_(police_officer)",
        "title": "2021 Boulder shooting",
        "date": "March 22, 2021 (2021-03-22) c. 2:30 – 3:28 p.m. (MDT)",
        "location": "Table Mesa neighborhood of Boulder, Colorado, U.S.",
        "paragraph": "\nOn March 22, 2021, a mass shooting occurred at a King Soopers supermarket in Boulder, Colorado, United States. Ten people were killed, including a local on-duty police officer.[3] The alleged shooter, 21-year-old Ahmad Al Aliwi Al-Issa, was arrested after being shot in the right leg. He was temporarily hospitalized[6][7] before being moved to the county jail.[8] After undergoing mental evaluations during the legal proceedings, Al-Issa was found mentally incompetent to stand trial in December 2021 and in April 2022.\n"
    },
    {
        "link": "/wiki/Darrent_Williams",
        "title": "Darrent Williams",
        "date": "",
        "location": "",
        "paragraph": "\nDarrent Demarcus Williams (September 27, 1982 – January 1, 2007) was an American football player for the Denver Broncos of the National Football League. After attending high school in Fort Worth, Texas, Williams played football at Oklahoma State University. He was a second-round draft pick by the Broncos in 2005. Williams was killed in a drive-by shooting the day after he finished his second season with the Broncos.\n"
    },
    {
        "link": "/wiki/Todd_Wilson_(security_guard)",
        "title": "Father's Day Bank Massacre",
        "date": "June 16, 1991 9:14 a.m. – 9:56 a.m. (MDT)",
        "location": "Downtown, Denver, Colorado, U.S.",
        "paragraph": "The Father's Day Bank Massacre was a bank robbery and shooting that took place on Sunday, June 16, 1991, at the United Bank Tower (now the Wells Fargo Center) in Denver, Colorado. The perpetrator killed four unarmed bank guards and held up six tellers in the bank's cash vault. An estimated $200,000 was stolen from the bank. Nearly three weeks later, on July 4, 1991, authorities arrested retired police officer James W. King for the crime. The subsequent trial was broadcast nationally on Court TV. After days of deliberation, the jury acquitted King. None of the stolen money was ever found. The crime remains unsolved and is considered a cold case.[1][2]\nThe United Bank Tower had previously allowed its guards to be armed, but had changed their policy less than a year before the robbery, requiring the guards to be unarmed.[3]\n"
    },
    {
        "link": "/wiki/Murder_of_Angie_Zapata",
        "title": "Murder of Angie Zapata",
        "date": "",
        "location": "",
        "paragraph": "\nAngie Zapata (August 5, 1989 – July 17, 2008) was an American trans woman beaten to death in Greeley, Colorado. Her killer, Allen Andrade, was convicted of first-degree murder and committing a hate crime, because he murdered her after learning she was transgender. The case was the first in the nation to get a conviction for a hate crime involving a transgender victim, which occurred in 2009.[1] Zapata's story and murder were featured on Univision's November 1, 2009 Aquí y Ahora television show.\n"
    },
    {
        "link": "/wiki/Aurora_protest_car_attack",
        "title": "George Floyd protests in Colorado",
        "date": "May 28, 2020 – October 2020",
        "location": "Colorado, United States",
        "paragraph": "\nThis is a list of George Floyd protests in Colorado, United States.\n"
    },
    {
        "link": "/wiki/Colorado_Coalfield_War",
        "title": "Colorado Coalfield War",
        "date": "First stage:September 23, 1913 (1913-09-23) – April 20, 1914 (1914-04-20)Ten Days War:April 20, 1914 (1914-04-20) – April 30, 1914 (1914-04-30)Final stage:April 29, 1914 (1914-04-29) – December 1914 (1914-12)",
        "location": "Southern Colorado, United States",
        "paragraph": "\nStrike leaders:  Louis Tikas X  John R. Lawson   Support from:  Mother Jones[3]\n"
    },
    {
        "link": "/wiki/Columbine_Mine_massacre",
        "title": "Columbine Mine massacre",
        "date": "November 21, 1927",
        "location": "Serene, Colorado, United States40°01′31″N 105°01′38″W﻿ / ﻿40.02528°N 105.02722°W﻿ / 40.02528; -105.02722Coordinates: 40°01′31″N 105°01′38″W﻿ / ﻿40.02528°N 105.02722°W﻿ / 40.02528; -105.02722",
        "paragraph": "Adam Bell;  Amelia Milka Sablich\nJesse F. Welborn; Louis Scherf\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Colorado",
        "title": "George Floyd protests in Colorado",
        "date": "May 28, 2020 – October 2020",
        "location": "Colorado, United States",
        "paragraph": "\nThis is a list of George Floyd protests in Colorado, United States.\n"
    },
    {
        "link": "/wiki/Ludlow_Massacre",
        "title": "Ludlow Massacre",
        "date": "April 20, 1914 (1914-04-20)",
        "location": "Ludlow, Colorado, U.S.37°20′21″N 104°35′02″W﻿ / ﻿37.33917°N 104.58389°W﻿ / 37.33917; -104.58389Coordinates: 37°20′21″N 104°35′02″W﻿ / ﻿37.33917°N 104.58389°W﻿ / 37.33917; -104.58389",
        "paragraph": "\nLouis Tikas (Organiser, UMWA) †James Fyler (Financial Secretary, UMWA)John R. Lawson  (POW)\n"
    },
    {
        "link": "/wiki/Sherman_Bell",
        "title": "Sherman Bell",
        "date": "",
        "location": "",
        "paragraph": "Adjutant General Sherman M. Bell was a controversial leader of the Colorado National Guard during the Colorado Labor Wars of 1903–04. While Bell received high praise from Theodore Roosevelt and others, he was vilified as a tyrant by members of them Western Federation of Miners (WFM).[2]\nSherman Bell, a former deputy United States marshal in Cripple Creek, Colorado, participated in the Spanish–American War as one of Roosevelt's Rough Riders. General Bell was active in the Masonic Order and the Order of Elks, and was honored by the Knights of Pythias. A former hardrock mine manager, Bell took the side of the Mine Owners' Association against the strikers during a strike of smelter workers, which ultimately included the miners of the Cripple Creek District.[3]\n"
    },
    {
        "link": "/wiki/Alphen_aan_den_Rijn_shopping_mall_shooting",
        "title": "Alphen aan den Rijn shopping mall shooting",
        "date": "9 April 2011[1] 12:02",
        "location": "Alphen aan den Rijn, Netherlands[1]",
        "paragraph": "\nOn 9 April 2011, six people were killed by a gunman who entered the Ridderhof mall in Alphen aan den Rijn, Netherlands,[8] a town approximately 33 kilometres (21 mi) south-west of Amsterdam.[9] Using a rifle, 24-year-old Tristan van der Vlis shot several people and then killed himself, reportedly with a different firearm.[10] There were seven deaths, including the killer, and 17 wounded,[7] making it the deadliest attack in the Netherlands since the 2009 attack on the Dutch royal family.[11]\n"
    },
    {
        "link": "/wiki/Bend,_Oregon_shooting",
        "title": "Bend, Oregon shooting",
        "date": "August 28, 2022 c. 7:00 – 7:08 p.m. (PDT)",
        "location": "Bend, Oregon, United States",
        "paragraph": "\nOn August 28, 2022, a gunman opened fire at a Safeway grocery store in Bend, Oregon, killing two senior citizens, one of whom was an employee, and wounding two other people before committing suicide.[1]\n"
    },
    {
        "link": "/wiki/Colegio_Cervantes_shooting",
        "title": "Colegio Cervantes shooting",
        "date": "January 10, 2020 (2020-01-10) c. 08:40 a.m. (CST)",
        "location": "Torreón, Coahuila, Mexico",
        "paragraph": "On January 10, 2020, an 11-year-old student identified as José Ángel Ramos Betts, armed with two guns, opened fire at the facilities of Colegio Cervantes Campus Bosque, a private school in Torreón, Coahuila, Mexico, killing a teacher and wounding multiple teachers and classmates. The assailant wore a white t-shirt that read \"Natural selection\" and pants with black suspenders, which were reported as referring to Eric Harris, one of the perpetrators of the Columbine High School massacre.[3][4]\nAt 8:00 a.m. on January 10, 2020, Betts arrived at the institution with two weapons in his backpack: an automatic .40 caliber and another .22 caliber, both owned by his grandfather.[5][6] At 8:20 a.m., he asked his teacher for permission to go to the bathroom.[6] About 15 minutes later, after noticing that he was taking too long, she went to look for him.[6] Around 8:40 a.m., he left the bathroom having changed clothes and armed himself with the two guns. María Assaf Medina, Betts' English teacher, confronted him and asked him to stop shooting. Media outlets stated that he attacked while dressed in white t-shirt, suspenders and black pants, clothes similar to those worn by Eric Harris, one of the perpetrators of the Columbine High School massacre.[3][7] Before firing, he said \"Hoy va a ser el día\" (\"Today is going to be the day\").[6][8][9] He started firing at the physical education teacher and five other classmates, injuring all of them.[6] He then shot María Assaf Medina, who died instantly,[6] before committing suicide at around 8:43 a.m.[6][8]\n"
    },
    {
        "link": "/wiki/2007_Colorado_YWAM_and_New_Life_shootings",
        "title": "2007 Colorado YWAM and New Life shootings",
        "date": "December 9, 2007 (2007-12-09) c. 12:30 a.m.[1] – c. 1:00 p.m.[2]",
        "location": "Arvada and Colorado Springs, Colorado, U.S.",
        "paragraph": "\nIn the early morning hours of December 9, 2007, 24-year-old Matthew John Murray opened fire at the Youth With A Mission training center in Arvada, Colorado, killing two and wounding two others before escaping. Later that afternoon, he attacked the New Life Church in Colorado Springs, Colorado, with a number of firearms, killing two more people and injuring three before being shot by Jeanne Assam, a member of the church's safety team. Murray then committed suicide by shooting himself in the head.[3]\n"
    },
    {
        "link": "/wiki/Dawson_College_shooting",
        "title": "Dawson College shooting",
        "date": "September 13, 2006; 16 years ago (2006-09-13) 12:42 – 12:48 p.m. (EDT)",
        "location": "Montreal, Quebec, Canada",
        "paragraph": "\nThe Dawson College shooting occurred on September 13, 2006, at Dawson College, a CEGEP located in  downtown Montreal, Quebec, Canada. The perpetrator, Kimveer Singh Gill, began shooting outside the de Maisonneuve Boulevard entrance to the school, and moved towards the atrium by the cafeteria on the main floor.[1][2] One victim died at the scene, while another 19 were injured, eight of whom were listed in critical condition, with six requiring surgery.[3][4][5] The shooter later committed suicide, after being shot in the arm by a police officer.[6] It was the third fatal school shooting in Montreal, after the École Polytechnique massacre in 1989 and the shooting spree at Concordia University in 1992.\n"
    },
    {
        "link": "/wiki/Erfurt_school_massacre",
        "title": "Erfurt school massacre",
        "date": "26 April 2002 c. 10:58 a.m. – c. 11:17 a.m. (CEST)",
        "location": "Erfurt, Thuringia, Germany",
        "paragraph": "\nThe Erfurt massacre was a school shooting that occurred on 26 April 2002 at the Gutenberg-Gymnasium, a secondary school in Erfurt, Germany. 19-year-old expelled student Robert Steinhäuser shot and killed 16 people, including 13 staff members, 2 students, and 1 police officer before committing suicide. One person was also wounded by a bullet fragment. According to students, he ignored them and aimed only for the teachers and administrators, although 2 students were unintentionally killed by shots fired through a locked door.[2]\n"
    },
    {
        "link": "/wiki/Franklin_Regional_High_School_stabbing",
        "title": "Franklin Regional High School stabbing",
        "date": "April 9, 2014 (2014-04-09) c. 7:13 a.m. – c. 7:18 a.m.[1][2]",
        "location": "Murrysville, Pennsylvania, United States",
        "paragraph": "\nThe Franklin Regional High School stabbing was a mass stabbing that occurred on April 9, 2014, at Franklin Regional High School in Murrysville, Pennsylvania. Alex Hribal, a 16-year-old sophomore at the school, used a pair of eight-inch kitchen knives to stab and slash 20 students and a security guard. Four students sustained life-threatening injuries, but all survived.[3]\n"
    },
    {
        "link": "/wiki/Halifax_mass_shooting_plot",
        "title": "Halifax mass shooting plot",
        "date": "Saturday, February 14, 2015",
        "location": "Halifax, Nova Scotia, Canada",
        "paragraph": "\nThe Halifax mass shooting plot was an event that chiefly occurred between February 12, 2015, to February 14, 2015. Police were alerted to three people, identified as Lindsay Souvannarath, Randall Shepherd, and James Gamble, who were reportedly conspiring to commit a mass killing at the Halifax Shopping Centre. Souvannarath and Shepherd were arrested and convicted of conspiracy to commit murder, while Gamble was found dead of a self-inflicted gunshot wound soon after finding out of the impending police investigation.\n"
    },
    {
        "link": "/wiki/Izhevsk_school_shooting",
        "title": "Izhevsk school shooting",
        "date": "26 September 2022",
        "location": "Pushkinskaya Ulitsa, 285, Izhevsk, Udmurtia, Russia, 426011[1]",
        "paragraph": "\nOn 26 September 2022, a mass shooting occurred at a school in Izhevsk, Udmurtia, in west-central Russia.[4] Eighteen people were killed and 23 others were wounded before the gunman, identified as Artem Kazantsev, committed suicide.[5][6][7]\n"
    },
    {
        "link": "/wiki/Jokela_school_shooting",
        "title": "Jokela school shooting",
        "date": "7 November 2007 (2007-11-07) 11:42–12:04[1] (UTC+2)",
        "location": "Jokela, Tuusula, Finland",
        "paragraph": "The Jokela High School shooting occurred on 7 November 2007, at Jokela High School in the town of Jokela, Tuusula, Finland. The gunman, 18-year old Pekka-Eric Auvinen, entered the school that morning armed with a semi-automatic pistol. He killed eight people and wounded one person in the toe before shooting himself in the head; twelve others were also injured by flying glass or sprained ankles.[4] Auvinen died later that evening in a Helsinki hospital.\nThis was the second school shooting in the history of Finland. The previous incident occurred in 1989 at the Raumanmeri school in Rauma, when a 14-year-old fatally shot two fellow students.[5] Less than one year after the Jokela school massacre, the Kauhajoki school shooting occurred, which is thought to have been heavily inspired by Auvinen.\n"
    },
    {
        "link": "/wiki/Kerch_Polytechnic_College_massacre",
        "title": "Kerch Polytechnic College massacre",
        "date": "17 October 2018 (2018-10-17) 11:40 (UTC+3:00)",
        "location": "Kerch Polytechnic College, Kerch, Crimea Russia (de facto)Ukraine (de jure)",
        "paragraph": "\nThe Kerch Polytechnic College massacre was a school shooting and bomb attack that occurred in Kerch, Crimea, on 17 October 2018. 18-year-old student Vladislav Roslyakov killed 20 people and wounded 70 others before committing suicide. It was the deadliest school attack in the former Soviet Union since the 2004 Beslan school siege.[2]\n"
    },
    {
        "link": "/wiki/2014_Las_Vegas_shootings",
        "title": "2014 Las Vegas shootings",
        "date": "June 8, 2014 (2014-06-08) 11:22 a.m. - 12:00 a.m.[1] (PDT)",
        "location": "Las Vegas, Nevada, U.S.",
        "paragraph": "\nThe 2014 Las Vegas shootings occurred on June 8, 2014, when a married couple, Jerad and Amanda Miller, committed a shooting in northeastern Las Vegas, Nevada. Five people died, including the two shooters. The couple, who espoused extreme anti-government views, first killed two Las Vegas police officers at a restaurant before fleeing into a Walmart, where they killed an intervening armed civilian named Joseph Wilcox. The couple died after engaging responding officers in a shootout in Walmart; police shot and killed Jerad, while Amanda committed suicide after being wounded.[7][8][9][4]\n"
    },
    {
        "link": "/wiki/Martin_Peyerl",
        "title": "Martin Peyerl",
        "date": "1 November 1999",
        "location": "",
        "paragraph": "\nMartin Peyerl (11 August 1983 – 1 November 1999) was a German student who, on 1 November 1999 (the day of All Saints), fired from his bedroom window, killing four people and wounding seven others before committing suicide.\n"
    },
    {
        "link": "/wiki/Santana_High_School_shooting",
        "title": "Santana High School shooting",
        "date": "March 5, 2001",
        "location": "Santee, California, U.S.",
        "paragraph": "\nOn March 5, 2001, a school shooting occurred at Santana High School in Santee, California. The gunman, 15-year-old Charles Andrew Williams, opened fire with an eight-shot .22-caliber revolver, killing two students and wounding 13 others. Williams was then apprehended by responding police officers and convicted. He is currently serving 50 years to life in prison.\n"
    },
    {
        "link": "/wiki/Murder_of_Cassie_Jo_Stoddart",
        "title": "Murder of Cassie Jo Stoddart",
        "date": "",
        "location": "",
        "paragraph": "The murder of Cassie Jo Stoddart took place in Bannock County, Idaho, United States, on September 22, 2006, when Stoddart (born December 21, 1989), a student at Pocatello High School, was stabbed to death by classmates Brian Lee Draper (born March 21, 1990) and Torey Michael Adamcik (born June 14, 1990).[1] Both perpetrators received sentences of life imprisonment without parole on August 21, 2007.[2]\nAfter spending most of his childhood in Utah, Brian Draper moved with his family to Pocatello, Idaho. He met Torey Adamcik when they were both students at Pocatello High School. Both boys were interested in films and started recording on their own. The victim, Cassie Jo Stoddart, also attended the same school; she and both killers were in 11th grade.\n"
    },
    {
        "link": "/wiki/W._R._Myers_High_School_shooting",
        "title": "W. R. Myers High School shooting",
        "date": "April 28, 1999 11:30–12:45",
        "location": "Taber, Alberta, Canada",
        "paragraph": "The W. R. Myers High School shooting was a school shooting that occurred on April 28, 1999, at W. R. Myers High School in Taber, Alberta, Canada. The gunman, 14-year-old school dropout Todd Cameron Smith, walked into his school and began firing at  students in a hallway, then went to the central hub of the school in front of the band room, killed one student and wounded another one. It was the first fatal high-school shooting in Canada since the St. Pius X High School shooting, 24 years earlier.\nThe incident began when Smith entered the school campus armed with a .22-caliber Ruger 10/22 semi-automatic rifle and 375 rounds of ammunition (350 rounds of live ammunition in his coat pocket and 25 rounds loaded into the rifle).[citation needed] As lunch concluded, he fired at three students in a hallway adjacent to the cafeteria. He fatally shot 17-year-old Jason Lang at point-blank range, and then shot at one other student. Gym coach Cheyno Finnie managed to wrestle Smith to the floor. He was arrested without further incident by a Taber constable, who also served as the school's resource officer.[1] He was charged with one count of first-degree murder, and one count of attempted murder.\n"
    },
    {
        "link": "/wiki/Eaton_Township_Weis_Markets_shooting",
        "title": "Eaton Township Weis Markets shooting",
        "date": "June 8, 2017 12:57 a.m. – 1:01 a.m. (EDT)",
        "location": "Eaton Township, Pennsylvania, U.S.",
        "paragraph": "In the early hours on the morning of June 8, 2017, employees at a Weis Markets supermarket in Eaton Township, Pennsylvania, United States, were stocking and closing the store for the night. Shortly before 1:00 a.m., 24-year-old Randy Stair barricaded the exits of the store and proceeded to shoot and kill three of his co-workers before fatally shooting himself.[1]\nRandy Stair, 24, arrived for his late-night shift at Weis Markets in Eaton Township, Pennsylvania (just south of Tunkhannock), on the evening of June 7, 2017, during closing time at approximately 11:00 p.m. Stair went to the back of the store to the crew area and blocked an emergency exit at the far back of the store. He then continued with his duties, stocking shelves and cleaning up from the previous day. At 12:10 a.m., he sent out links to multiple files and videos which detailed his plans via his Twitter account; these files were labeled \"Journal\", \"Suicide Tapes\", and \"Digital set\".[2][3][4]\n"
    },
    {
        "link": "/wiki/Columbine_effect",
        "title": "Columbine effect",
        "date": "",
        "location": "",
        "paragraph": "\nThe Columbine effect is the legacy and impact of the 1999 Columbine High School massacre. The shooting has had an effect on school safety, policing tactics, prevention methods (including gun control and metal detectors), and inspired numerous copycat crimes, with many killers taking their inspiration from Eric Harris and Dylan Klebold by describing the two perpetrators as being martyrs or heroes.\nThe shooting has also had a significant impact on popular culture, with Harris and Klebold often seen and mentioned in several forms of media.\n"
    },
    {
        "link": "/wiki/Diablo_II",
        "title": "Diablo II",
        "date": "",
        "location": "",
        "paragraph": "\nDiablo II is an action role-playing hack-and-slash video game developed by Blizzard North and published by Blizzard Entertainment in 2000 for Microsoft Windows, Classic Mac OS, and macOS. The game, with its dark fantasy and horror themes, was conceptualized and designed by David Brevik and Erich Schaefer, who, with Max Schaefer, acted as project leads on the game. The producers were Matthew Householder and Bill Roper. The game was developed over a three-year period, with a crunch time of a year and a half.[5]\n"
    },
    {
        "link": "/wiki/Earshot_(Buffy_the_Vampire_Slayer)",
        "title": "Earshot (Buffy the Vampire Slayer)",
        "date": "",
        "location": "",
        "paragraph": "\"Earshot\" is the twenty second episode of the third season of the television show Buffy the Vampire Slayer. It was written by Jane Espenson, directed by Regis Kimble, and first broadcast, out of sequence, on September 21, 1999. The originally scheduled broadcast was postponed following the Columbine High School massacre on April 20, 1999.\nOn patrol, Buffy runs into two mouthless demons and succeeds in killing one, but some of its blood is absorbed through her skin. When her hand starts itching, Giles explains that she may be infected with an aspect of the demon. Buffy worries about what aspect she will be getting and is horrified when Willow wonders if the demon was male.\n"
    },
    {
        "link": "/wiki/Graduation_Day_(Buffy_the_Vampire_Slayer)",
        "title": "Graduation Day (Buffy the Vampire Slayer)",
        "date": "",
        "location": "",
        "paragraph": "\"Graduation Day\" is the season finale of the WB Television Network's third season of the drama television series Buffy the Vampire Slayer, consisting of the twenty-first and twenty-second episodes. They were written and directed by series creator Joss Whedon. \"Part 1\" first aired on May 18, 1999 and \"Part 2\" first aired on July 13, 1999. The second part was to originally be aired on May 25, 1999, but was postponed due to the episode's content and the occurrence of the Columbine High School shootings one month prior.\nThe episodes are the last to feature David Boreanaz and Charisma Carpenter as series regulars due to their starring in the spin-off series Angel.\n"
    },
    {
        "link": "/wiki/Halifax_mass_shooting_plot",
        "title": "Halifax mass shooting plot",
        "date": "Saturday, February 14, 2015",
        "location": "Halifax, Nova Scotia, Canada",
        "paragraph": "\nThe Halifax mass shooting plot was an event that chiefly occurred between February 12, 2015, to February 14, 2015. Police were alerted to three people, identified as Lindsay Souvannarath, Randall Shepherd, and James Gamble, who were reportedly conspiring to commit a mass killing at the Halifax Shopping Centre. Souvannarath and Shepherd were arrested and convicted of conspiracy to commit murder, while Gamble was found dead of a self-inflicted gunshot wound soon after finding out of the impending police investigation.\n"
    },
    {
        "link": "/wiki/Marilyn_Manson%E2%80%93Columbine_High_School_massacre_controversy",
        "title": "Marilyn Manson–Columbine High School massacre controversy",
        "date": "",
        "location": "",
        "paragraph": "Following the massacre at Columbine High School on April 20, 1999, one common view was that the violent actions perpetrated by the two shooters, Eric Harris and Dylan Klebold, were due to violent influences in entertainment, specifically those in the music of Marilyn Manson.\nIn music, there is Marilyn Manson, an individual who chooses the name of a mass murderer as part of his name. The lyrics of his music are consistent with his choice of name. They are violent and nihilistic, and there are groups all over the world who do this, some German groups and others. I guess what I am saying is, a person already troubled in this modern high-tech world can be in their car and hear the music, they can be in their room and see the video, they can go into the chat rooms and act out these video games and even take it to real life. Something there is very much of a problem.\n"
    },
    {
        "link": "/wiki/Teaching_Mrs._Tingle",
        "title": "Teaching Mrs. Tingle",
        "date": "",
        "location": "",
        "paragraph": "Teaching Mrs. Tingle is a 1999 American teen black comedy thriller film written and directed by Kevin Williamson, in his directorial debut, and starring Helen Mirren, Katie Holmes, Marisa Coughlan, Barry Watson, and Jeffrey Tambor. It follows a trio of high school seniors who must prove their innocence to their vindictive history teacher, who accuses them of cheating on their final exams. Williamson wrote the script before his work on Scream and Dawson's Creek. Following the success of those projects, his script was picked up and production of the film proceeded.\nReleased in the United States on August 20, 1999, the film was originally titled Killing Mrs. Tingle, but was delayed and retitled due to the uproar over teen violence in films after the Columbine High School massacre. The film received mostly negative reviews from critics and was a box-office bomb. Williamson has not directed another film since.\n"
    },
    {
        "link": "/wiki/Youth_of_the_Nation",
        "title": "Youth of the Nation",
        "date": "",
        "location": "",
        "paragraph": "\n\"Youth of the Nation\" is a song by American Christian metal band P.O.D. It was released on November 27, 2001, as the second single to come from their second major label album, Satellite. It was inspired in part by the school shootings at Santana High School and Columbine High School. \"Youth of the Nation\" was the band's only No. 1 hit on the Modern Rock chart and reached No. 28 on the Billboard Hot 100, their only single to reach the top 40, and No. 6 on the Mainstream Rock chart. The song was included in \"Weird Al\" Yankovic's polka medley \"Angry White Boy Polka\" from his 2003 album Poodle Hat, despite lead singer Sonny Sandoval's mixed-race background.\n"
    },
    {
        "link": "/wiki/After_(Prose_novel)",
        "title": "After (Prose novel)",
        "date": "",
        "location": "",
        "paragraph": "After is a young adult novel written by Francine Prose. It was first published in 2003, and the nearby school shooting is reminiscent of the Columbine High School massacre in 1999.\nAfter a school shooting 50 miles away, the new grief and crisis counselor (Dr. Willner) attempts to control the students' lives, using the recent tragedy as an excuse for increasingly restricting their lives. The school gradually is controlled by the grip of the administration, and students who do not comply with the new rules disappear, never to be seen again.\n"
    },
    {
        "link": "/wiki/American_Yearbook",
        "title": "American Yearbook",
        "date": "",
        "location": "",
        "paragraph": "American Yearbook is a 2004 American drama film written, produced, edited, and directed by Brian Ging. While the film itself is finished, and has been shown at various film festivals, there is currently no public release date.\nWill Nash (Nick Tagas) is the kid-next-door, a typical upbeat high schooler, but his dreams of being a photographer quickly fade, as he is relentlessly terrorized by school bullies Ian (Chris Peter) and Jason (Ryan Nixon). Will adores Amanda (Giovannie Pico), but her best friend Kristy (Jennifer Noble) is dating the head bully Ian. Confused and angry, Will meets a mysterious, brooding character named Chance (Jon Carlo Alvarez), both of them outsiders. Chance eventually convinces Will that they should get a gun and take the bullies out: pull a Columbine. Amanda pleads with Will to set revenge aside, but can Will stop what he and Chance have started, or are Will's emotions too strong for him to just walk away?\n"
    },
    {
        "link": "/wiki/April_Showers_(2009_film)",
        "title": "April Showers (2009 film)",
        "date": "",
        "location": "",
        "paragraph": "April Showers is a 2009 American independent drama film written and directed by Andrew Robinson. It stars Kelly Blatz, Daryl Sabara, Ellen Woglom, Illeana Douglas, Janel Parrish, and Tom Arnold. It is based on the Columbine High School shootings, of which Robinson is a survivor. The film was shot at Plattsmouth High School in Plattsmouth, Nebraska, in May 2008.[1]\nIn the aftermath of a school shooting, several survivors have evacuated to the elementary school to wait for more survivors to arrive. A senior named Sean Ryan calls his friend Vicki at a coffee shop, who tells him that the shooter is Ben Harris, a friend of Sean's. Sean is left speechless.\n"
    },
    {
        "link": "/wiki/Bang_Bang_You%27re_Dead_(film)",
        "title": "Bang Bang You're Dead (film)",
        "date": "",
        "location": "",
        "paragraph": "Bang Bang You're Dead is a 2002 American thriller drama television film directed by Guy Ferland and written by William Mastrosimone. It stars Tom Cavanagh, Ben Foster, Randy Harrison, and Janel Moloney. Based on Mastrosimone's 1999 play of the same name, the film is not a direct adaptation; it follows a troubled high school student played by Foster who participates in his school's production of the play while attempting to avoid going down the same path as the play's lead character.\nThe film premiered at the Seattle International Film Festival on June 7, 2002, and aired on Showtime on October 13, 2002.\n"
    },
    {
        "link": "/wiki/Bowling_for_Columbine",
        "title": "Bowling for Columbine",
        "date": "",
        "location": "",
        "paragraph": "Bowling for Columbine is a 2002 documentary film written, produced, directed, and narrated by Michael Moore. The film explores what Moore suggests are the primary causes for the Columbine High School massacre in 1999 and other acts of gun violence. He focuses on the background and environment in which the massacre took place and some common public opinions and assumptions about related issues. The film also looks into the nature of violence in the United States, and American violence abroad.[4]\nA critical and commercial success, the film brought Moore international attention as a rising filmmaker and won numerous awards, including the Academy Award for Best Documentary Feature, the Independent Spirit Award for Best Documentary Feature, a special 55th Anniversary Prize at the 2002 Cannes Film Festival,[5] and the César Award for Best Foreign Film.[6] The film is widely considered one of the greatest documentary films of all time.[7][8][9][10]\n"
    },
    {
        "link": "/wiki/Columbine_(book)",
        "title": "Columbine (book)",
        "date": "",
        "location": "",
        "paragraph": "Columbine is a non-fiction book written by Dave Cullen and published by Twelve (Hachette Book Group) on April 6, 2009. It is an examination of the Columbine High School massacre, on April 20, 1999, and the perpetrators Eric Harris and Dylan Klebold.[1] The book covers two major storylines: the killer's evolution leading up to the attack, and the survivors' struggles with the aftermath over the next decade. Chapters alternate between the two stories. Graphic depictions of parts of the attack are included, in addition to the actual names of friends and family (the only exception being the pseudonym \"Harriet\", which is used for a female Columbine student referred to in Klebold’s journal entries, with whom he was obsessively in love).\nCullen says he spent ten years researching and writing the book. He previously contributed to The New York Times, The Washington Post, The Times of London, and The Guardian. He is best known for his work for Slate and Salon.com. His Slate story \"The Depressive and the Psychopath\" five years earlier, offered the first diagnosis of the killers by the team of psychologists and psychiatrists brought into the case by the FBI.[2] Publication was timed to coincide with the tenth anniversary of the massacre, which occurred on April 20, 1999. The book spent eight weeks on The New York Times bestseller list in the spring of 2009, peaking at #3.[3][4]\n"
    },
    {
        "link": "/wiki/Columbinus",
        "title": "columbinus",
        "date": "",
        "location": "",
        "paragraph": "columbinus is a play written by Stephen Karam and PJ Paparelli, with contributions by Josh Barrett, Sean McNall, Karl Miller, Michael Milligan and Will Rogers, created by the United States Theatre Project. The play looks at issues of alienation, hostility and social pressure in high schools and was suggested by the April 1999 massacre at Columbine High School in Jefferson County, Colorado. The play premiered in Silver Spring, Maryland in 2005 and then Off-Broadway in 2006.\ncolumbinus includes excerpts from discussions with parents, survivors and community leaders in Littleton as well as diaries and home video footage to reveal what it refers to as \"the dark recesses of American adolescence\".\n"
    },
    {
        "link": "/wiki/Dawn_Anna",
        "title": "Dawn Anna",
        "date": "",
        "location": "",
        "paragraph": "Dawn Anna is a 2005 American dramatic television film written by Robert Munic, Arliss Howard, and James Howard, and directed by Arliss Howard. The film, based upon real events surrounding the Columbine High School massacre, premiered on Lifetime Television January 10, 2005.[1][2][3][4]\nThis film was produced by Tom Cox, Peter Lhotka, Murray Ord and Jordy Randall, and co-produced by Arliss Howard. Executive producers of this film were Tom Patricia, Madeleine Sherak, William Sherak and Jason Shuman.[5]\n"
    },
    {
        "link": "/wiki/Duck!_The_Carbine_High_Massacre",
        "title": "Duck! The Carbine High Massacre",
        "date": "",
        "location": "",
        "paragraph": "Duck! The Carbine High Massacre is a 1999 American teen black comedy crime film about a school shooting. Released just over six months after the Columbine High School massacre event, it was written, produced and directed by William Hellfire and Joey Smack, who also starred.[1][2]  After the film was released, Hellfire and Smack were arrested for possession of weapons on school property. The film is said to have helped pay for Hellfire's legal fees.[3][4][5]\nDerwin (William Hellfire) and Derick (Joey Smack) are trench coat-wearing neo-Nazis from deprived families. They find a website selling top secret missiles and order one with the credit card of Derick's mother. The next day at school they encounter the school janitor who warns them of their unusual wardrobe. They launch the missile the following day, but discover it is a dud. While walking home, Derwin is assaulted by jocks and left in critical condition where the janitor finds him. He and Derick both fail their presentation on the topic of the internet due to Derwin's absence. They then form a plan to kill students at their school and then commit suicide with the janitor’s offered assistance. The pair buy two shotguns and several handguns from a black market dealer next door to a heavy metal band concert. He also offers them cocaine and sexual intercourse with an underage girl being held hostage, which they refuse. The next day the janitor arrives first with a propane bomb and leaves it in the cafeteria. Derwin and Derick appear and open fire in the cafeteria, killing several people before going to the basement where they simultaneously kill each other. The two die holding hands. A police officer (Karl Pitt) and the school principal (Larry Wellman) enter the school to find a bomb that was placed there by the janitor (Rodney Sleurtols). While the policeman attempts to defuse it, the janitor is seen running away to safety before the policeman accidentally sets the bomb off. The aftermath involves the parents along with a teacher and the principal sharing their thoughts on Derwin and Derick as well as the victims. A scientist then expresses his theory of alien influence as a motive, hinting the janitor was an alien.\n"
    },
    {
        "link": "/wiki/Elephant_(2003_film)",
        "title": "Elephant (2003 film)",
        "date": "",
        "location": "",
        "paragraph": "Elephant is a 2003 American psychological drama film written, directed, and edited by Gus Van Sant. It takes place in the fictional Watt High School, in the suburbs of Portland, Oregon, and chronicles the events surrounding a school shooting, based in part on the 1999 Columbine High School massacre. The film begins a short time before the shooting occurs, following the lives of several characters both in and out of school, who are unaware of what is about to unfold. The film stars mostly new or non-professional actors, including John Robinson, Alex Frost, and Eric Deulen.\nElephant is the second film in Van Sant's \"Death Trilogy\"—the first is Gerry (2002) and the third Last Days (2005)—all three of which are based on actual events.\n"
    },
    {
        "link": "/wiki/Give_a_Boy_a_Gun",
        "title": "Give a Boy a Gun",
        "date": "",
        "location": "",
        "paragraph": "Give a Boy a Gun is an epistolary novel for young adults by Todd Strasser, first published in 2000. The novel describes the events and social circumstances that lead up to, and form the aftermath of, a fictional school shooting. The story is presented in the form of segments of transcribed post-incident interviews with students, parents, teachers, and community members, compiled by Denise Shipley, a journalism student who is the stepsister of one of the shooters.[1] The interviews provide a variety of viewpoints on the incident – some sympathetic, others hostile. Interspersed through the book are footnotes providing statistical information about guns and gun violence.\nThe plot has some similarities to the real-life Columbine High School massacre of April 20, 1999, although Strasser began research on the book before the Columbine shooting.[2] The book was the first book relating to school shootings published after Columbine.[2]\n"
    },
    {
        "link": "/wiki/Heart_of_America_(film)",
        "title": "Heart of America (film)",
        "date": "",
        "location": "",
        "paragraph": "Heart of America (also released as Home Room) is a 2002 Canadian-German drama film written and directed by Uwe Boll about the events leading up to and revolving around a shooting on the final day of school. The film features an ensemble cast including Jürgen Prochnow, Michael Paré, Elisabeth Moss, Patrick Muldoon, Clint Howard, and Brendan Fletcher. The film also addresses the issue of school bullying.\nThe last day of school contains many problems for both teachers and students of Riverside High School, and there are multiple storylines about this.\n"
    },
    {
        "link": "/wiki/Home_Room_(2002_film)",
        "title": "Home Room (2002 film)",
        "date": "",
        "location": "",
        "paragraph": "\nHome Room is an independent film starring Erika Christensen, Busy Philipps and Victor Garber. It premiered in the Taos Talking Pictures Film Festival on 12 April 2002, and made its limited theatrical release on 5 September 2003.\n"
    },
    {
        "link": "/wiki/I%27m_Not_Ashamed",
        "title": "I'm Not Ashamed",
        "date": "",
        "location": "",
        "paragraph": "\nI'm Not Ashamed is a 2016 American biographical drama film directed by Brian Baugh and based on the journals of Rachel Scott, the first victim of the 1999 Columbine High School massacre in Columbine, Colorado. Scott, played by Masey McLain, serves as the protagonist of the film; the story of both gunmen, Eric Harris and Dylan Klebold, is intertwined with hers. The film was distributed by Pure Flix Entertainment. It received negative reviews from critics and audiences.  It performed poorly at the box office as well, with revenue of $2.1 million compared to the $1.5 million budget of the film.\n"
    },
    {
        "link": "/wiki/The_Library_(play)",
        "title": "The Library (play)",
        "date": "",
        "location": "",
        "paragraph": "The Library is a 2014 play written by Scott Z. Burns concerning the aftermath of a school shooting that takes place in the school library. It was inspired by Dave Cullen's book Columbine about the Columbine High School massacre.\nThe original production ran from March 25 to April 27, 2014, at the Public Theater in New York City, directed by Steven Soderbergh and starred Chloë Grace Moretz.[1][2][3]\n"
    },
    {
        "link": "/wiki/Lullaby_for_Columbine",
        "title": "Lullaby for Columbine",
        "date": "",
        "location": "",
        "paragraph": "Lullaby for Columbine, Love Endures is the name of a benefit CD released in 1999 shortly after the Columbine High School massacre where twelve students and a teacher were murdered by Eric Harris and Dylan Klebold before they committed suicide. It was previously the deadliest high school shooting in United States history. The name is synonymous with both the title cut featured on the album and the non-profit organization that produced it, whose full name is \"The Lullaby for Columbine Project.\"\nThe CD was produced by musical composer/producer Michael Tamburello through the organization, based in Littleton, Colorado that he cofounded with his daughter Nina Tamburello. The CD features several notable artists including Rachael Lampa, Taylor Mesplé, and Adrian Belew, among others. Music from the CD has been aired worldwide and has been featured on NBC's Today Show with Katie Couric.\n"
    },
    {
        "link": "/wiki/A_Mother%27s_Reckoning",
        "title": "A Mother's Reckoning",
        "date": "",
        "location": "",
        "paragraph": "A Mother's Reckoning: Living in the Aftermath of Tragedy  is a 2016 memoir by Sue Klebold, the mother of Dylan Klebold.[2] Along with Eric Harris, Dylan was one of the perpetrators of the Columbine High School massacre in 1999. The book details the childhood and teenage years of her son, and what she says are signs she missed that Dylan was suffering from clinical depression. The book also examines her grieving process in dealing with the fallout of the massacre.[3]\nIn his foreword to the book, author Andrew Solomon wrote, “The ultimate message of this book is terrifying: you may not know your own children, and worse yet, your children may be unknowable to you. The stranger you fear may be your own son or daughter.”[4] Sue Klebold donated all of her profits from the book to mental health charities.[5]\n"
    },
    {
        "link": "/wiki/The_Nobodies_(song)",
        "title": "The Nobodies (song)",
        "date": "",
        "location": "",
        "paragraph": "\"The Nobodies\" is a song by American rock band Marilyn Manson. It is the third and final single from their fourth studio album, Holy Wood (In the Shadow of the Valley of Death), released in 2000. The song addresses Eric Harris and Dylan Klebold, perpetrators of the Columbine High School massacre in 1999. The song's title is from a quote by John Lennon's murderer, Mark David Chapman, who once lamented that he \"felt like a nobody.\"[1]\nAs early as February 10, 2001, Manson had made indications that the song would be chosen as the album's third single.[2][3] The third single was released in physical format on September 3, 2001 in the UK, and on October 6, 2001 in the US.[4][5][6]\n"
    },
    {
        "link": "/wiki/Nobody_Left_to_Hate",
        "title": "Nobody Left to Hate",
        "date": "",
        "location": "",
        "paragraph": "Nobody Left to Hate: Teaching Compassion after Columbine is a book by social psychologist Elliot Aronson that explores the implications of the attacks at Columbine.[1][2]\n\n"
    },
    {
        "link": "/wiki/The_Only_Way_(2004_film)",
        "title": "The Only Way (2004 film)",
        "date": "",
        "location": "",
        "paragraph": "The Only Way is a 2004 American film about a school shooting directed by David Zimmerman III and Levi Obery. The film is loosely based on the April 20, 1999 tragedy at Columbine High School. The film was shot on location in Metamora, Illinois, Washington, Illinois, Pekin, Illinois, and Peoria, Illinois with Metamora Township High School, the same high school from which the film's directors graduated, serving as the principal location.[1]\nDevon Browning (Billy Kearney) is a bullied outcast who has a family member dead, causing him to be depressed. As a result, He shoots up his school, killing his bullies and his date, Jamie (Victoria Corwin), before he is arrested.\n"
    },
    {
        "link": "/wiki/Rachel%27s_Tears",
        "title": "Rachel's Tears",
        "date": "",
        "location": "",
        "paragraph": "Rachel's Tears: The Spiritual Journey of Columbine Martyr Rachel Scott is a non-fiction book about Rachel Scott, the first victim of the Columbine High School massacre.\nWritten by her parents, including her journal entries, it is part of a nationwide school outreach program and ministry. They present Rachel as being killed for her Christian affirmation.[1][2]\n"
    },
    {
        "link": "/wiki/She_Said_Yes:_The_Unlikely_Martyrdom_of_Cassie_Bernall",
        "title": "She Said Yes: The Unlikely Martyrdom of Cassie Bernall",
        "date": "",
        "location": "",
        "paragraph": "She Said Yes: The Unlikely Martyrdom of Cassie Bernall is a memoir by Misty Bernall about the life of her daughter Cassie Bernall who was killed during the Columbine High School massacre on April 20, 1999.\nThe book was published by Plough Publishing and released on September 1, 1999.[1][2][3] It includes a foreword by Madeleine L'Engle.\n"
    },
    {
        "link": "/wiki/Super_Columbine_Massacre_RPG!",
        "title": "Super Columbine Massacre RPG!",
        "date": "",
        "location": "",
        "paragraph": "\nSuper Columbine Massacre RPG! is a role-playing video game created by Danny Ledonne and released in April 2005. The game recreates the 1999 Columbine High School shootings near Littleton, Colorado. Players assume the roles of gunmen Eric Harris and Dylan Klebold and act out the massacre, with flashbacks relating parts of Harris and Klebold's past experiences. The game begins on the day of the shootings and follows Harris and Klebold after their suicides to fictional adventures in perdition.\n"
    },
    {
        "link": "/wiki/This_Is_Your_Time_(Michael_W._Smith_album)",
        "title": "This Is Your Time (Michael W. Smith album)",
        "date": "",
        "location": "",
        "paragraph": "\nThis Is Your Time is Michael W. Smith's fourteenth studio album, released on November 23, 1999. All the songs from this album, except \"This Is Your Time\" and \"This Is Your Time (Reprise)\", were originally recorded for his previous studio album Live the Life, but did not make the final cut for the album.[2]\n"
    },
    {
        "link": "/wiki/Time_Stands_Still_(Degrassi:_The_Next_Generation)",
        "title": "Time Stands Still (Degrassi: The Next Generation)",
        "date": "",
        "location": "",
        "paragraph": "\n\"Time Stands Still\" is a two-part episode of the Canadian teen drama Degrassi: The Next Generation. It aired on CTV in Canada on 5 & 12 October 2004. In the two-part episode, Rick Murray (Ephraim Ellis), ostracized after he physically abused his girlfriend in the previous season, brings a gun to school and shoots and paralyzes Jimmy Brooks (Aubrey Graham), when a prank pulled on Rick is blamed on Jimmy. Rick is then accidentally killed by Sean Cameron (Daniel Clark) in his attempt to stop the shooting. Despite being a two-part episode, many events were still unresolved until later in the season. It aired on the American cable channel Noggin during its programming block for teenagers, The N, on 3 and 10 December 2004.\n"
    },
    {
        "link": "/wiki/The_Way_I_Am_(Eminem_song)",
        "title": "The Way I Am (Eminem song)",
        "date": "",
        "location": "",
        "paragraph": "\"The Way I Am\" is a song written, produced, and performed by American rapper Eminem from his third album The Marshall Mathers LP (2000). It was released as the second single from the album on October 3, 2000, later being featured on his 2005 compilation album, Curtain Call: The Hits. In the tradition of most of Eminem's follow-up singles, \"The Way I Am\" is one of the rare songs for which he has sole songwriting credit. It features a much darker and emotionally driven sound than the album's lead single \"The Real Slim Shady\". \"The Way I Am\" peaked at number 58 on the Billboard Hot 100. Outside the United States, \"The Way I Am\" peaked within the top ten of the charts in Belgium (Wallonia), Finland, Netherlands, Ireland, Sweden, and United Kingdom.\nThe song was written by Eminem to express the negative side of the fame that he had gained. The song makes points such as him not being able to go out in public and live a normal life due to him being harassed by fans. He also vents about the pressure put on him to top his earlier work on The Slim Shady LP. The song has also been remixed by Danny Lohner featuring Marilyn Manson, who has performed the song with Eminem live on stage. In 2005, it was re-released on the album Curtain Call: The Hits. \"The Way I Am\" was certified Gold in Sweden, selling over 20,000 copies.[2]\n"
    },
    {
        "link": "/wiki/With_Tired_Eyes,_Tired_Minds,_Tired_Souls,_We_Slept",
        "title": "With Tired Eyes, Tired Minds, Tired Souls, We Slept",
        "date": "",
        "location": "",
        "paragraph": "\"With Tired Eyes, Tired Minds, Tired Souls, We Slept \" is the 16th episode of One Tree Hill's third season. It first aired on The WB television network in the United States on March 1, 2006. It was written by Mark Schwahn and directed by Greg Prange,  and revolves around a school shooting.[1]\nThe episode was well-received by critics and fans, and was characterized as a landmark episode for the series.[2] Set at Tree Hill High School, it centers on bullied student Jimmy Edwards, who brings a gun to school seeking revenge on his tormentors. His former friend, Lucas Scott, and Lucas's brother, Nathan Scott, put themselves at risk to protect their classmates and loved ones.\n"
    },
    {
        "link": "/wiki/Zero_Day_(2003_film)",
        "title": "Zero Day (2003 film)",
        "date": "",
        "location": "",
        "paragraph": "Zero Day is a 2003 American found footage drama film written and directed by Ben Coccio and starring Andre Keuck and Cal Robertson revolving  around a plot about a duo planning a school shooting.[2]\nAndre Kriegman (Born July 17, 1982) and Calvin \n \"Cal\" Gabriel (Born February 5, 1983), announce their intention to attack their High school, Iroquois High School,[3] calling their plan \"Zero Day\". They keep a video diary on the camera, carefully hiding their plans from their friends and families. The majority of the film is portrayed through their video filming, and shows them planning, preparing, and mentioning some of their motives.\n"
    },
    {
        "link": "/wiki/Zero_Hour_(2004_TV_series)",
        "title": "Zero Hour (2004 TV series)",
        "date": "",
        "location": "",
        "paragraph": "\nZero Hour is a documentary-style television series. It aired on History Television in Canada, on the BBC in the United Kingdom, and on The History Channel in the United States. Zero Hour has also aired on Channel Seven in Australia (third series aired on Network Ten from 1 May 2010 and now plays on 7mate); on Discovery Channel in Africa, Asia, New Zealand, Brazil, and the Netherlands. The program focuses on retelling the details of tragic man-made disasters which each unfolded in less than an hour.\n"
    },
    {
        "link": "/wiki/Death_of_Jaryd_Atadero",
        "title": "Death of Jaryd Atadero",
        "date": "",
        "location": "",
        "paragraph": "Jaryd Atadero was a three-year-old American boy who went missing on October 2, 1999, while hiking with a Christian social group on Big South Trail, a part of the Arapaho & Roosevelt National Forest in Colorado. His partial remains were found by two businessmen on a hiking trip on May 6, 2003.[1] Atadero's disappearance and killing remain a cold case and anomaly noted for the fact that the boy's cause of death has never been officially classified. While often reported as a mountain lion attack, experts on felids have argued that the discovered remains do not meet the typical patterns of a mountain lion attack. Other experts believed that Atadero had been the victim of an abduction and murder. Owing in part to the sensationalism surrounding the Colorado case of child glitz pageant contestant JonBenét Ramsey, the media was heavily involved during the search of Atadero.[2][3]\nJaryd Atadero was the three-year-old son of Allyn Atadero and Stacie Mckissick, and had an older sister, then six-year-old Josallyn Atadero. Allyn Atadero was a divorcee raising both children, and he had recently joined the Christian Singles Network group, a local religious club. The club was known to have aided Allyn in daily life as a single father, and the Atadero Family became heavily intertwined with group activities among the club. Allyn himself, a physical education teacher at a local junior high school, found comfort in the religious devotion.[4][5]\n"
    },
    {
        "link": "/wiki/Denver_Prostitute_Killer",
        "title": "Denver Prostitute Killer",
        "date": "",
        "location": "",
        "paragraph": "The Denver Prostitute Killer was an unidentified  American serial killer responsible for the murder of at least 17 women and girls in Denver and its various suburbs between 1975 and 1995, however in 2005, based upon results from DNA Profiling, it was determined that the most likely killer was Billy Edwin Reid who was previously arrested and charged with the 1989 murder of Lannell Williams and Lisa Kelly.  Reid was convicted and sentenced to life imprisonment for those specific murders, The killings were grouped together only in 2008 – until then, each of these crimes were considered to have been committed by different people.[1]\nThe killer chose young girls and women, aged 15–25, as his victims, most of whom went missing in different areas in Denver and were later found dead. A common pattern was for them to be hitchhikers, to have visited bars or fast food restaurants, and a majority of them being engaged in prostitution. The victims were beaten and strangled, and their bodies dumped in the countryside along Interstate 70. Some of the bodies were posed in humiliating positions.[1] According to investigators, the offender is responsible for the murder of 18-year-old Karolyn Walker, who disappeared on July 4, 1987, after meeting with her fiancé. After being kidnapped she was raped and strangled. During the course of the investigation, police found no incriminating evidence or witnesses, despite the fact that Walker likely resisted fiercely, as she was a good swimmer, did gymnastics and had considerable physical strength.[2]\n"
    },
    {
        "link": "/wiki/2019_Lakewood_semi-truck_crash",
        "title": "2019 Lakewood semi-truck crash",
        "date": "April 25, 2019 4:45 PM MDT",
        "location": "I-70 and Denver West Marriott Blvd. in Lakewood",
        "paragraph": "On April 25, 2019, a deadly traffic collision occurred on Interstate 70 near Lakewood, Colorado, United States, when a semi-trailer truck's brakes allegedly malfunctioned, causing the truck to crash into 12 cars and three other semi-trailer trucks, resulting in multiple fires and explosions, killing four people. The truck was driven by Rogel Lazaro Aguilera Mederos, who was later convicted of vehicular homicide.\nJust after 4:00 p.m. MDT on April 25, 2019, an unrelated semi-trailer truck crashed into a Jefferson County Public Schools school bus on Interstate 70 at the Ward Road exit causing 10 injuries.[1] This caused Interstate 70 to be closed eastbound from Ward Road (Exit 266) to Kipling Street (Exit 267),[2] causing heavy backups all the way to Colorado Mills Parkway (Exit 263). About 30 minutes later, all but the far left lane remained closed, continuing congestion into Colorado Mills Parkway.[3]\n"
    },
    {
        "link": "/wiki/STEM_School_Highlands_Ranch_shooting",
        "title": "STEM School Highlands Ranch shooting",
        "date": "May 7, 2019 1:53 pm (MDT (UTC−6))",
        "location": "Highlands Ranch, Colorado, U.S.",
        "paragraph": "\nOn May 7, 2019, a school shooting occurred at STEM School Highlands Ranch, a charter school located in Douglas County, Colorado, United States, in the Denver suburb of Highlands Ranch. One student was killed and eight others were injured. Two teenagers, both students at the school, were convicted on dozens of charges and sentenced to life imprisonment.[4]\n"
    },
    {
        "link": "/wiki/2021_Boulder_shooting",
        "title": "2021 Boulder shooting",
        "date": "March 22, 2021 (2021-03-22) c. 2:30 – 3:28 p.m. (MDT)",
        "location": "Table Mesa neighborhood of Boulder, Colorado, U.S.",
        "paragraph": "\nOn March 22, 2021, a mass shooting occurred at a King Soopers supermarket in Boulder, Colorado, United States. Ten people were killed, including a local on-duty police officer.[3] The alleged shooter, 21-year-old Ahmad Al Aliwi Al-Issa, was arrested after being shot in the right leg. He was temporarily hospitalized[6][7] before being moved to the county jail.[8] After undergoing mental evaluations during the legal proceedings, Al-Issa was found mentally incompetent to stand trial in December 2021 and in April 2022.\n"
    },
    {
        "link": "/wiki/Colorado_Springs_nightclub_shooting",
        "title": "Colorado Springs nightclub shooting",
        "date": "November 19–20, 2022 c. 11:56 p.m.[1] – 12:02 a.m. (MST)",
        "location": "Club Q, Colorado Springs, Colorado, U.S.",
        "paragraph": "\nOn November 19–20, 2022, a mass shooting occurred at Club Q, an LGBTQ nightclub in Colorado Springs, Colorado, United States. Five people were killed, and 25 others were injured, 19 of them by gunfire. The accused, 22-year-old Anderson Lee Aldrich, was also injured and taken to a local hospital.[6][7][8][9] Aldrich was charged and remanded in custody.\n"
    },
    {
        "link": "/wiki/2021_Colorado_Springs_shooting",
        "title": "2021 Colorado Springs shooting",
        "date": "May 9, 2021 (2021-05-09) 12:18 a.m. (MDT)",
        "location": "Colorado Springs, Colorado, U.S.",
        "paragraph": "\nOn May 9, 2021, a mass shooting occurred at a birthday party in Colorado Springs, Colorado, United States. Seven people were killed, including the gunman who committed suicide.[3]\n"
    },
    {
        "link": "/wiki/2021_Denver_shootings",
        "title": "Timeline of Denver",
        "date": "",
        "location": "",
        "paragraph": "\nThe following is a timeline of the history of the city of Denver, Colorado, United States from its founding in 1858 to the present.\n"
    },
    {
        "link": "/wiki/Alphen_aan_den_Rijn_shopping_mall_shooting",
        "title": "Alphen aan den Rijn shopping mall shooting",
        "date": "9 April 2011[1] 12:02",
        "location": "Alphen aan den Rijn, Netherlands[1]",
        "paragraph": "\nOn 9 April 2011, six people were killed by a gunman who entered the Ridderhof mall in Alphen aan den Rijn, Netherlands,[8] a town approximately 33 kilometres (21 mi) south-west of Amsterdam.[9] Using a rifle, 24-year-old Tristan van der Vlis shot several people and then killed himself, reportedly with a different firearm.[10] There were seven deaths, including the killer, and 17 wounded,[7] making it the deadliest attack in the Netherlands since the 2009 attack on the Dutch royal family.[11]\n"
    },
    {
        "link": "/wiki/Bend,_Oregon_shooting",
        "title": "Bend, Oregon shooting",
        "date": "August 28, 2022 c. 7:00 – 7:08 p.m. (PDT)",
        "location": "Bend, Oregon, United States",
        "paragraph": "\nOn August 28, 2022, a gunman opened fire at a Safeway grocery store in Bend, Oregon, killing two senior citizens, one of whom was an employee, and wounding two other people before committing suicide.[1]\n"
    },
    {
        "link": "/wiki/Colegio_Cervantes_shooting",
        "title": "Colegio Cervantes shooting",
        "date": "January 10, 2020 (2020-01-10) c. 08:40 a.m. (CST)",
        "location": "Torreón, Coahuila, Mexico",
        "paragraph": "On January 10, 2020, an 11-year-old student identified as José Ángel Ramos Betts, armed with two guns, opened fire at the facilities of Colegio Cervantes Campus Bosque, a private school in Torreón, Coahuila, Mexico, killing a teacher and wounding multiple teachers and classmates. The assailant wore a white t-shirt that read \"Natural selection\" and pants with black suspenders, which were reported as referring to Eric Harris, one of the perpetrators of the Columbine High School massacre.[3][4]\nAt 8:00 a.m. on January 10, 2020, Betts arrived at the institution with two weapons in his backpack: an automatic .40 caliber and another .22 caliber, both owned by his grandfather.[5][6] At 8:20 a.m., he asked his teacher for permission to go to the bathroom.[6] About 15 minutes later, after noticing that he was taking too long, she went to look for him.[6] Around 8:40 a.m., he left the bathroom having changed clothes and armed himself with the two guns. María Assaf Medina, Betts' English teacher, confronted him and asked him to stop shooting. Media outlets stated that he attacked while dressed in white t-shirt, suspenders and black pants, clothes similar to those worn by Eric Harris, one of the perpetrators of the Columbine High School massacre.[3][7] Before firing, he said \"Hoy va a ser el día\" (\"Today is going to be the day\").[6][8][9] He started firing at the physical education teacher and five other classmates, injuring all of them.[6] He then shot María Assaf Medina, who died instantly,[6] before committing suicide at around 8:43 a.m.[6][8]\n"
    },
    {
        "link": "/wiki/2007_Colorado_YWAM_and_New_Life_shootings",
        "title": "2007 Colorado YWAM and New Life shootings",
        "date": "December 9, 2007 (2007-12-09) c. 12:30 a.m.[1] – c. 1:00 p.m.[2]",
        "location": "Arvada and Colorado Springs, Colorado, U.S.",
        "paragraph": "\nIn the early morning hours of December 9, 2007, 24-year-old Matthew John Murray opened fire at the Youth With A Mission training center in Arvada, Colorado, killing two and wounding two others before escaping. Later that afternoon, he attacked the New Life Church in Colorado Springs, Colorado, with a number of firearms, killing two more people and injuring three before being shot by Jeanne Assam, a member of the church's safety team. Murray then committed suicide by shooting himself in the head.[3]\n"
    },
    {
        "link": "/wiki/Dawson_College_shooting",
        "title": "Dawson College shooting",
        "date": "September 13, 2006; 16 years ago (2006-09-13) 12:42 – 12:48 p.m. (EDT)",
        "location": "Montreal, Quebec, Canada",
        "paragraph": "\nThe Dawson College shooting occurred on September 13, 2006, at Dawson College, a CEGEP located in  downtown Montreal, Quebec, Canada. The perpetrator, Kimveer Singh Gill, began shooting outside the de Maisonneuve Boulevard entrance to the school, and moved towards the atrium by the cafeteria on the main floor.[1][2] One victim died at the scene, while another 19 were injured, eight of whom were listed in critical condition, with six requiring surgery.[3][4][5] The shooter later committed suicide, after being shot in the arm by a police officer.[6] It was the third fatal school shooting in Montreal, after the École Polytechnique massacre in 1989 and the shooting spree at Concordia University in 1992.\n"
    },
    {
        "link": "/wiki/Erfurt_school_massacre",
        "title": "Erfurt school massacre",
        "date": "26 April 2002 c. 10:58 a.m. – c. 11:17 a.m. (CEST)",
        "location": "Erfurt, Thuringia, Germany",
        "paragraph": "\nThe Erfurt massacre was a school shooting that occurred on 26 April 2002 at the Gutenberg-Gymnasium, a secondary school in Erfurt, Germany. 19-year-old expelled student Robert Steinhäuser shot and killed 16 people, including 13 staff members, 2 students, and 1 police officer before committing suicide. One person was also wounded by a bullet fragment. According to students, he ignored them and aimed only for the teachers and administrators, although 2 students were unintentionally killed by shots fired through a locked door.[2]\n"
    },
    {
        "link": "/wiki/Franklin_Regional_High_School_stabbing",
        "title": "Franklin Regional High School stabbing",
        "date": "April 9, 2014 (2014-04-09) c. 7:13 a.m. – c. 7:18 a.m.[1][2]",
        "location": "Murrysville, Pennsylvania, United States",
        "paragraph": "\nThe Franklin Regional High School stabbing was a mass stabbing that occurred on April 9, 2014, at Franklin Regional High School in Murrysville, Pennsylvania. Alex Hribal, a 16-year-old sophomore at the school, used a pair of eight-inch kitchen knives to stab and slash 20 students and a security guard. Four students sustained life-threatening injuries, but all survived.[3]\n"
    },
    {
        "link": "/wiki/Halifax_mass_shooting_plot",
        "title": "Halifax mass shooting plot",
        "date": "Saturday, February 14, 2015",
        "location": "Halifax, Nova Scotia, Canada",
        "paragraph": "\nThe Halifax mass shooting plot was an event that chiefly occurred between February 12, 2015, to February 14, 2015. Police were alerted to three people, identified as Lindsay Souvannarath, Randall Shepherd, and James Gamble, who were reportedly conspiring to commit a mass killing at the Halifax Shopping Centre. Souvannarath and Shepherd were arrested and convicted of conspiracy to commit murder, while Gamble was found dead of a self-inflicted gunshot wound soon after finding out of the impending police investigation.\n"
    },
    {
        "link": "/wiki/Izhevsk_school_shooting",
        "title": "Izhevsk school shooting",
        "date": "26 September 2022",
        "location": "Pushkinskaya Ulitsa, 285, Izhevsk, Udmurtia, Russia, 426011[1]",
        "paragraph": "\nOn 26 September 2022, a mass shooting occurred at a school in Izhevsk, Udmurtia, in west-central Russia.[4] Eighteen people were killed and 23 others were wounded before the gunman, identified as Artem Kazantsev, committed suicide.[5][6][7]\n"
    },
    {
        "link": "/wiki/Jokela_school_shooting",
        "title": "Jokela school shooting",
        "date": "7 November 2007 (2007-11-07) 11:42–12:04[1] (UTC+2)",
        "location": "Jokela, Tuusula, Finland",
        "paragraph": "The Jokela High School shooting occurred on 7 November 2007, at Jokela High School in the town of Jokela, Tuusula, Finland. The gunman, 18-year old Pekka-Eric Auvinen, entered the school that morning armed with a semi-automatic pistol. He killed eight people and wounded one person in the toe before shooting himself in the head; twelve others were also injured by flying glass or sprained ankles.[4] Auvinen died later that evening in a Helsinki hospital.\nThis was the second school shooting in the history of Finland. The previous incident occurred in 1989 at the Raumanmeri school in Rauma, when a 14-year-old fatally shot two fellow students.[5] Less than one year after the Jokela school massacre, the Kauhajoki school shooting occurred, which is thought to have been heavily inspired by Auvinen.\n"
    },
    {
        "link": "/wiki/Kerch_Polytechnic_College_massacre",
        "title": "Kerch Polytechnic College massacre",
        "date": "17 October 2018 (2018-10-17) 11:40 (UTC+3:00)",
        "location": "Kerch Polytechnic College, Kerch, Crimea Russia (de facto)Ukraine (de jure)",
        "paragraph": "\nThe Kerch Polytechnic College massacre was a school shooting and bomb attack that occurred in Kerch, Crimea, on 17 October 2018. 18-year-old student Vladislav Roslyakov killed 20 people and wounded 70 others before committing suicide. It was the deadliest school attack in the former Soviet Union since the 2004 Beslan school siege.[2]\n"
    },
    {
        "link": "/wiki/2014_Las_Vegas_shootings",
        "title": "2014 Las Vegas shootings",
        "date": "June 8, 2014 (2014-06-08) 11:22 a.m. - 12:00 a.m.[1] (PDT)",
        "location": "Las Vegas, Nevada, U.S.",
        "paragraph": "\nThe 2014 Las Vegas shootings occurred on June 8, 2014, when a married couple, Jerad and Amanda Miller, committed a shooting in northeastern Las Vegas, Nevada. Five people died, including the two shooters. The couple, who espoused extreme anti-government views, first killed two Las Vegas police officers at a restaurant before fleeing into a Walmart, where they killed an intervening armed civilian named Joseph Wilcox. The couple died after engaging responding officers in a shootout in Walmart; police shot and killed Jerad, while Amanda committed suicide after being wounded.[7][8][9][4]\n"
    },
    {
        "link": "/wiki/Martin_Peyerl",
        "title": "Martin Peyerl",
        "date": "1 November 1999",
        "location": "",
        "paragraph": "\nMartin Peyerl (11 August 1983 – 1 November 1999) was a German student who, on 1 November 1999 (the day of All Saints), fired from his bedroom window, killing four people and wounding seven others before committing suicide.\n"
    },
    {
        "link": "/wiki/Santana_High_School_shooting",
        "title": "Santana High School shooting",
        "date": "March 5, 2001",
        "location": "Santee, California, U.S.",
        "paragraph": "\nOn March 5, 2001, a school shooting occurred at Santana High School in Santee, California. The gunman, 15-year-old Charles Andrew Williams, opened fire with an eight-shot .22-caliber revolver, killing two students and wounding 13 others. Williams was then apprehended by responding police officers and convicted. He is currently serving 50 years to life in prison.\n"
    },
    {
        "link": "/wiki/Murder_of_Cassie_Jo_Stoddart",
        "title": "Murder of Cassie Jo Stoddart",
        "date": "",
        "location": "",
        "paragraph": "The murder of Cassie Jo Stoddart took place in Bannock County, Idaho, United States, on September 22, 2006, when Stoddart (born December 21, 1989), a student at Pocatello High School, was stabbed to death by classmates Brian Lee Draper (born March 21, 1990) and Torey Michael Adamcik (born June 14, 1990).[1] Both perpetrators received sentences of life imprisonment without parole on August 21, 2007.[2]\nAfter spending most of his childhood in Utah, Brian Draper moved with his family to Pocatello, Idaho. He met Torey Adamcik when they were both students at Pocatello High School. Both boys were interested in films and started recording on their own. The victim, Cassie Jo Stoddart, also attended the same school; she and both killers were in 11th grade.\n"
    },
    {
        "link": "/wiki/W._R._Myers_High_School_shooting",
        "title": "W. R. Myers High School shooting",
        "date": "April 28, 1999 11:30–12:45",
        "location": "Taber, Alberta, Canada",
        "paragraph": "The W. R. Myers High School shooting was a school shooting that occurred on April 28, 1999, at W. R. Myers High School in Taber, Alberta, Canada. The gunman, 14-year-old school dropout Todd Cameron Smith, walked into his school and began firing at  students in a hallway, then went to the central hub of the school in front of the band room, killed one student and wounded another one. It was the first fatal high-school shooting in Canada since the St. Pius X High School shooting, 24 years earlier.\nThe incident began when Smith entered the school campus armed with a .22-caliber Ruger 10/22 semi-automatic rifle and 375 rounds of ammunition (350 rounds of live ammunition in his coat pocket and 25 rounds loaded into the rifle).[citation needed] As lunch concluded, he fired at three students in a hallway adjacent to the cafeteria. He fatally shot 17-year-old Jason Lang at point-blank range, and then shot at one other student. Gym coach Cheyno Finnie managed to wrestle Smith to the floor. He was arrested without further incident by a Taber constable, who also served as the school's resource officer.[1] He was charged with one count of first-degree murder, and one count of attempted murder.\n"
    },
    {
        "link": "/wiki/Eaton_Township_Weis_Markets_shooting",
        "title": "Eaton Township Weis Markets shooting",
        "date": "June 8, 2017 12:57 a.m. – 1:01 a.m. (EDT)",
        "location": "Eaton Township, Pennsylvania, U.S.",
        "paragraph": "In the early hours on the morning of June 8, 2017, employees at a Weis Markets supermarket in Eaton Township, Pennsylvania, United States, were stocking and closing the store for the night. Shortly before 1:00 a.m., 24-year-old Randy Stair barricaded the exits of the store and proceeded to shoot and kill three of his co-workers before fatally shooting himself.[1]\nRandy Stair, 24, arrived for his late-night shift at Weis Markets in Eaton Township, Pennsylvania (just south of Tunkhannock), on the evening of June 7, 2017, during closing time at approximately 11:00 p.m. Stair went to the back of the store to the crew area and blocked an emergency exit at the far back of the store. He then continued with his duties, stocking shelves and cleaning up from the previous day. At 12:10 a.m., he sent out links to multiple files and videos which detailed his plans via his Twitter account; these files were labeled \"Journal\", \"Suicide Tapes\", and \"Digital set\".[2][3][4]\n"
    },
    {
        "link": "/wiki/Columbine_effect",
        "title": "Columbine effect",
        "date": "",
        "location": "",
        "paragraph": "\nThe Columbine effect is the legacy and impact of the 1999 Columbine High School massacre. The shooting has had an effect on school safety, policing tactics, prevention methods (including gun control and metal detectors), and inspired numerous copycat crimes, with many killers taking their inspiration from Eric Harris and Dylan Klebold by describing the two perpetrators as being martyrs or heroes.\nThe shooting has also had a significant impact on popular culture, with Harris and Klebold often seen and mentioned in several forms of media.\n"
    },
    {
        "link": "/wiki/Diablo_II",
        "title": "Diablo II",
        "date": "",
        "location": "",
        "paragraph": "\nDiablo II is an action role-playing hack-and-slash video game developed by Blizzard North and published by Blizzard Entertainment in 2000 for Microsoft Windows, Classic Mac OS, and macOS. The game, with its dark fantasy and horror themes, was conceptualized and designed by David Brevik and Erich Schaefer, who, with Max Schaefer, acted as project leads on the game. The producers were Matthew Householder and Bill Roper. The game was developed over a three-year period, with a crunch time of a year and a half.[5]\n"
    },
    {
        "link": "/wiki/Earshot_(Buffy_the_Vampire_Slayer)",
        "title": "Earshot (Buffy the Vampire Slayer)",
        "date": "",
        "location": "",
        "paragraph": "\"Earshot\" is the twenty second episode of the third season of the television show Buffy the Vampire Slayer. It was written by Jane Espenson, directed by Regis Kimble, and first broadcast, out of sequence, on September 21, 1999. The originally scheduled broadcast was postponed following the Columbine High School massacre on April 20, 1999.\nOn patrol, Buffy runs into two mouthless demons and succeeds in killing one, but some of its blood is absorbed through her skin. When her hand starts itching, Giles explains that she may be infected with an aspect of the demon. Buffy worries about what aspect she will be getting and is horrified when Willow wonders if the demon was male.\n"
    },
    {
        "link": "/wiki/Graduation_Day_(Buffy_the_Vampire_Slayer)",
        "title": "Graduation Day (Buffy the Vampire Slayer)",
        "date": "",
        "location": "",
        "paragraph": "\"Graduation Day\" is the season finale of the WB Television Network's third season of the drama television series Buffy the Vampire Slayer, consisting of the twenty-first and twenty-second episodes. They were written and directed by series creator Joss Whedon. \"Part 1\" first aired on May 18, 1999 and \"Part 2\" first aired on July 13, 1999. The second part was to originally be aired on May 25, 1999, but was postponed due to the episode's content and the occurrence of the Columbine High School shootings one month prior.\nThe episodes are the last to feature David Boreanaz and Charisma Carpenter as series regulars due to their starring in the spin-off series Angel.\n"
    },
    {
        "link": "/wiki/Halifax_mass_shooting_plot",
        "title": "Halifax mass shooting plot",
        "date": "Saturday, February 14, 2015",
        "location": "Halifax, Nova Scotia, Canada",
        "paragraph": "\nThe Halifax mass shooting plot was an event that chiefly occurred between February 12, 2015, to February 14, 2015. Police were alerted to three people, identified as Lindsay Souvannarath, Randall Shepherd, and James Gamble, who were reportedly conspiring to commit a mass killing at the Halifax Shopping Centre. Souvannarath and Shepherd were arrested and convicted of conspiracy to commit murder, while Gamble was found dead of a self-inflicted gunshot wound soon after finding out of the impending police investigation.\n"
    },
    {
        "link": "/wiki/Marilyn_Manson%E2%80%93Columbine_High_School_massacre_controversy",
        "title": "Marilyn Manson–Columbine High School massacre controversy",
        "date": "",
        "location": "",
        "paragraph": "Following the massacre at Columbine High School on April 20, 1999, one common view was that the violent actions perpetrated by the two shooters, Eric Harris and Dylan Klebold, were due to violent influences in entertainment, specifically those in the music of Marilyn Manson.\nIn music, there is Marilyn Manson, an individual who chooses the name of a mass murderer as part of his name. The lyrics of his music are consistent with his choice of name. They are violent and nihilistic, and there are groups all over the world who do this, some German groups and others. I guess what I am saying is, a person already troubled in this modern high-tech world can be in their car and hear the music, they can be in their room and see the video, they can go into the chat rooms and act out these video games and even take it to real life. Something there is very much of a problem.\n"
    },
    {
        "link": "/wiki/Teaching_Mrs._Tingle",
        "title": "Teaching Mrs. Tingle",
        "date": "",
        "location": "",
        "paragraph": "Teaching Mrs. Tingle is a 1999 American teen black comedy thriller film written and directed by Kevin Williamson, in his directorial debut, and starring Helen Mirren, Katie Holmes, Marisa Coughlan, Barry Watson, and Jeffrey Tambor. It follows a trio of high school seniors who must prove their innocence to their vindictive history teacher, who accuses them of cheating on their final exams. Williamson wrote the script before his work on Scream and Dawson's Creek. Following the success of those projects, his script was picked up and production of the film proceeded.\nReleased in the United States on August 20, 1999, the film was originally titled Killing Mrs. Tingle, but was delayed and retitled due to the uproar over teen violence in films after the Columbine High School massacre. The film received mostly negative reviews from critics and was a box-office bomb. Williamson has not directed another film since.\n"
    },
    {
        "link": "/wiki/Youth_of_the_Nation",
        "title": "Youth of the Nation",
        "date": "",
        "location": "",
        "paragraph": "\n\"Youth of the Nation\" is a song by American Christian metal band P.O.D. It was released on November 27, 2001, as the second single to come from their second major label album, Satellite. It was inspired in part by the school shootings at Santana High School and Columbine High School. \"Youth of the Nation\" was the band's only No. 1 hit on the Modern Rock chart and reached No. 28 on the Billboard Hot 100, their only single to reach the top 40, and No. 6 on the Mainstream Rock chart. The song was included in \"Weird Al\" Yankovic's polka medley \"Angry White Boy Polka\" from his 2003 album Poodle Hat, despite lead singer Sonny Sandoval's mixed-race background.\n"
    },
    {
        "link": "/wiki/After_(Prose_novel)",
        "title": "After (Prose novel)",
        "date": "",
        "location": "",
        "paragraph": "After is a young adult novel written by Francine Prose. It was first published in 2003, and the nearby school shooting is reminiscent of the Columbine High School massacre in 1999.\nAfter a school shooting 50 miles away, the new grief and crisis counselor (Dr. Willner) attempts to control the students' lives, using the recent tragedy as an excuse for increasingly restricting their lives. The school gradually is controlled by the grip of the administration, and students who do not comply with the new rules disappear, never to be seen again.\n"
    },
    {
        "link": "/wiki/American_Yearbook",
        "title": "American Yearbook",
        "date": "",
        "location": "",
        "paragraph": "American Yearbook is a 2004 American drama film written, produced, edited, and directed by Brian Ging. While the film itself is finished, and has been shown at various film festivals, there is currently no public release date.\nWill Nash (Nick Tagas) is the kid-next-door, a typical upbeat high schooler, but his dreams of being a photographer quickly fade, as he is relentlessly terrorized by school bullies Ian (Chris Peter) and Jason (Ryan Nixon). Will adores Amanda (Giovannie Pico), but her best friend Kristy (Jennifer Noble) is dating the head bully Ian. Confused and angry, Will meets a mysterious, brooding character named Chance (Jon Carlo Alvarez), both of them outsiders. Chance eventually convinces Will that they should get a gun and take the bullies out: pull a Columbine. Amanda pleads with Will to set revenge aside, but can Will stop what he and Chance have started, or are Will's emotions too strong for him to just walk away?\n"
    },
    {
        "link": "/wiki/April_Showers_(2009_film)",
        "title": "April Showers (2009 film)",
        "date": "",
        "location": "",
        "paragraph": "April Showers is a 2009 American independent drama film written and directed by Andrew Robinson. It stars Kelly Blatz, Daryl Sabara, Ellen Woglom, Illeana Douglas, Janel Parrish, and Tom Arnold. It is based on the Columbine High School shootings, of which Robinson is a survivor. The film was shot at Plattsmouth High School in Plattsmouth, Nebraska, in May 2008.[1]\nIn the aftermath of a school shooting, several survivors have evacuated to the elementary school to wait for more survivors to arrive. A senior named Sean Ryan calls his friend Vicki at a coffee shop, who tells him that the shooter is Ben Harris, a friend of Sean's. Sean is left speechless.\n"
    },
    {
        "link": "/wiki/Bang_Bang_You%27re_Dead_(film)",
        "title": "Bang Bang You're Dead (film)",
        "date": "",
        "location": "",
        "paragraph": "Bang Bang You're Dead is a 2002 American thriller drama television film directed by Guy Ferland and written by William Mastrosimone. It stars Tom Cavanagh, Ben Foster, Randy Harrison, and Janel Moloney. Based on Mastrosimone's 1999 play of the same name, the film is not a direct adaptation; it follows a troubled high school student played by Foster who participates in his school's production of the play while attempting to avoid going down the same path as the play's lead character.\nThe film premiered at the Seattle International Film Festival on June 7, 2002, and aired on Showtime on October 13, 2002.\n"
    },
    {
        "link": "/wiki/Bowling_for_Columbine",
        "title": "Bowling for Columbine",
        "date": "",
        "location": "",
        "paragraph": "Bowling for Columbine is a 2002 documentary film written, produced, directed, and narrated by Michael Moore. The film explores what Moore suggests are the primary causes for the Columbine High School massacre in 1999 and other acts of gun violence. He focuses on the background and environment in which the massacre took place and some common public opinions and assumptions about related issues. The film also looks into the nature of violence in the United States, and American violence abroad.[4]\nA critical and commercial success, the film brought Moore international attention as a rising filmmaker and won numerous awards, including the Academy Award for Best Documentary Feature, the Independent Spirit Award for Best Documentary Feature, a special 55th Anniversary Prize at the 2002 Cannes Film Festival,[5] and the César Award for Best Foreign Film.[6] The film is widely considered one of the greatest documentary films of all time.[7][8][9][10]\n"
    },
    {
        "link": "/wiki/Columbine_(book)",
        "title": "Columbine (book)",
        "date": "",
        "location": "",
        "paragraph": "Columbine is a non-fiction book written by Dave Cullen and published by Twelve (Hachette Book Group) on April 6, 2009. It is an examination of the Columbine High School massacre, on April 20, 1999, and the perpetrators Eric Harris and Dylan Klebold.[1] The book covers two major storylines: the killer's evolution leading up to the attack, and the survivors' struggles with the aftermath over the next decade. Chapters alternate between the two stories. Graphic depictions of parts of the attack are included, in addition to the actual names of friends and family (the only exception being the pseudonym \"Harriet\", which is used for a female Columbine student referred to in Klebold’s journal entries, with whom he was obsessively in love).\nCullen says he spent ten years researching and writing the book. He previously contributed to The New York Times, The Washington Post, The Times of London, and The Guardian. He is best known for his work for Slate and Salon.com. His Slate story \"The Depressive and the Psychopath\" five years earlier, offered the first diagnosis of the killers by the team of psychologists and psychiatrists brought into the case by the FBI.[2] Publication was timed to coincide with the tenth anniversary of the massacre, which occurred on April 20, 1999. The book spent eight weeks on The New York Times bestseller list in the spring of 2009, peaking at #3.[3][4]\n"
    },
    {
        "link": "/wiki/Columbinus",
        "title": "columbinus",
        "date": "",
        "location": "",
        "paragraph": "columbinus is a play written by Stephen Karam and PJ Paparelli, with contributions by Josh Barrett, Sean McNall, Karl Miller, Michael Milligan and Will Rogers, created by the United States Theatre Project. The play looks at issues of alienation, hostility and social pressure in high schools and was suggested by the April 1999 massacre at Columbine High School in Jefferson County, Colorado. The play premiered in Silver Spring, Maryland in 2005 and then Off-Broadway in 2006.\ncolumbinus includes excerpts from discussions with parents, survivors and community leaders in Littleton as well as diaries and home video footage to reveal what it refers to as \"the dark recesses of American adolescence\".\n"
    },
    {
        "link": "/wiki/Dawn_Anna",
        "title": "Dawn Anna",
        "date": "",
        "location": "",
        "paragraph": "Dawn Anna is a 2005 American dramatic television film written by Robert Munic, Arliss Howard, and James Howard, and directed by Arliss Howard. The film, based upon real events surrounding the Columbine High School massacre, premiered on Lifetime Television January 10, 2005.[1][2][3][4]\nThis film was produced by Tom Cox, Peter Lhotka, Murray Ord and Jordy Randall, and co-produced by Arliss Howard. Executive producers of this film were Tom Patricia, Madeleine Sherak, William Sherak and Jason Shuman.[5]\n"
    },
    {
        "link": "/wiki/Duck!_The_Carbine_High_Massacre",
        "title": "Duck! The Carbine High Massacre",
        "date": "",
        "location": "",
        "paragraph": "Duck! The Carbine High Massacre is a 1999 American teen black comedy crime film about a school shooting. Released just over six months after the Columbine High School massacre event, it was written, produced and directed by William Hellfire and Joey Smack, who also starred.[1][2]  After the film was released, Hellfire and Smack were arrested for possession of weapons on school property. The film is said to have helped pay for Hellfire's legal fees.[3][4][5]\nDerwin (William Hellfire) and Derick (Joey Smack) are trench coat-wearing neo-Nazis from deprived families. They find a website selling top secret missiles and order one with the credit card of Derick's mother. The next day at school they encounter the school janitor who warns them of their unusual wardrobe. They launch the missile the following day, but discover it is a dud. While walking home, Derwin is assaulted by jocks and left in critical condition where the janitor finds him. He and Derick both fail their presentation on the topic of the internet due to Derwin's absence. They then form a plan to kill students at their school and then commit suicide with the janitor’s offered assistance. The pair buy two shotguns and several handguns from a black market dealer next door to a heavy metal band concert. He also offers them cocaine and sexual intercourse with an underage girl being held hostage, which they refuse. The next day the janitor arrives first with a propane bomb and leaves it in the cafeteria. Derwin and Derick appear and open fire in the cafeteria, killing several people before going to the basement where they simultaneously kill each other. The two die holding hands. A police officer (Karl Pitt) and the school principal (Larry Wellman) enter the school to find a bomb that was placed there by the janitor (Rodney Sleurtols). While the policeman attempts to defuse it, the janitor is seen running away to safety before the policeman accidentally sets the bomb off. The aftermath involves the parents along with a teacher and the principal sharing their thoughts on Derwin and Derick as well as the victims. A scientist then expresses his theory of alien influence as a motive, hinting the janitor was an alien.\n"
    },
    {
        "link": "/wiki/Elephant_(2003_film)",
        "title": "Elephant (2003 film)",
        "date": "",
        "location": "",
        "paragraph": "Elephant is a 2003 American psychological drama film written, directed, and edited by Gus Van Sant. It takes place in the fictional Watt High School, in the suburbs of Portland, Oregon, and chronicles the events surrounding a school shooting, based in part on the 1999 Columbine High School massacre. The film begins a short time before the shooting occurs, following the lives of several characters both in and out of school, who are unaware of what is about to unfold. The film stars mostly new or non-professional actors, including John Robinson, Alex Frost, and Eric Deulen.\nElephant is the second film in Van Sant's \"Death Trilogy\"—the first is Gerry (2002) and the third Last Days (2005)—all three of which are based on actual events.\n"
    },
    {
        "link": "/wiki/Give_a_Boy_a_Gun",
        "title": "Give a Boy a Gun",
        "date": "",
        "location": "",
        "paragraph": "Give a Boy a Gun is an epistolary novel for young adults by Todd Strasser, first published in 2000. The novel describes the events and social circumstances that lead up to, and form the aftermath of, a fictional school shooting. The story is presented in the form of segments of transcribed post-incident interviews with students, parents, teachers, and community members, compiled by Denise Shipley, a journalism student who is the stepsister of one of the shooters.[1] The interviews provide a variety of viewpoints on the incident – some sympathetic, others hostile. Interspersed through the book are footnotes providing statistical information about guns and gun violence.\nThe plot has some similarities to the real-life Columbine High School massacre of April 20, 1999, although Strasser began research on the book before the Columbine shooting.[2] The book was the first book relating to school shootings published after Columbine.[2]\n"
    },
    {
        "link": "/wiki/Heart_of_America_(film)",
        "title": "Heart of America (film)",
        "date": "",
        "location": "",
        "paragraph": "Heart of America (also released as Home Room) is a 2002 Canadian-German drama film written and directed by Uwe Boll about the events leading up to and revolving around a shooting on the final day of school. The film features an ensemble cast including Jürgen Prochnow, Michael Paré, Elisabeth Moss, Patrick Muldoon, Clint Howard, and Brendan Fletcher. The film also addresses the issue of school bullying.\nThe last day of school contains many problems for both teachers and students of Riverside High School, and there are multiple storylines about this.\n"
    },
    {
        "link": "/wiki/Home_Room_(2002_film)",
        "title": "Home Room (2002 film)",
        "date": "",
        "location": "",
        "paragraph": "\nHome Room is an independent film starring Erika Christensen, Busy Philipps and Victor Garber. It premiered in the Taos Talking Pictures Film Festival on 12 April 2002, and made its limited theatrical release on 5 September 2003.\n"
    },
    {
        "link": "/wiki/I%27m_Not_Ashamed",
        "title": "I'm Not Ashamed",
        "date": "",
        "location": "",
        "paragraph": "\nI'm Not Ashamed is a 2016 American biographical drama film directed by Brian Baugh and based on the journals of Rachel Scott, the first victim of the 1999 Columbine High School massacre in Columbine, Colorado. Scott, played by Masey McLain, serves as the protagonist of the film; the story of both gunmen, Eric Harris and Dylan Klebold, is intertwined with hers. The film was distributed by Pure Flix Entertainment. It received negative reviews from critics and audiences.  It performed poorly at the box office as well, with revenue of $2.1 million compared to the $1.5 million budget of the film.\n"
    },
    {
        "link": "/wiki/The_Library_(play)",
        "title": "The Library (play)",
        "date": "",
        "location": "",
        "paragraph": "The Library is a 2014 play written by Scott Z. Burns concerning the aftermath of a school shooting that takes place in the school library. It was inspired by Dave Cullen's book Columbine about the Columbine High School massacre.\nThe original production ran from March 25 to April 27, 2014, at the Public Theater in New York City, directed by Steven Soderbergh and starred Chloë Grace Moretz.[1][2][3]\n"
    },
    {
        "link": "/wiki/Lullaby_for_Columbine",
        "title": "Lullaby for Columbine",
        "date": "",
        "location": "",
        "paragraph": "Lullaby for Columbine, Love Endures is the name of a benefit CD released in 1999 shortly after the Columbine High School massacre where twelve students and a teacher were murdered by Eric Harris and Dylan Klebold before they committed suicide. It was previously the deadliest high school shooting in United States history. The name is synonymous with both the title cut featured on the album and the non-profit organization that produced it, whose full name is \"The Lullaby for Columbine Project.\"\nThe CD was produced by musical composer/producer Michael Tamburello through the organization, based in Littleton, Colorado that he cofounded with his daughter Nina Tamburello. The CD features several notable artists including Rachael Lampa, Taylor Mesplé, and Adrian Belew, among others. Music from the CD has been aired worldwide and has been featured on NBC's Today Show with Katie Couric.\n"
    },
    {
        "link": "/wiki/A_Mother%27s_Reckoning",
        "title": "A Mother's Reckoning",
        "date": "",
        "location": "",
        "paragraph": "A Mother's Reckoning: Living in the Aftermath of Tragedy  is a 2016 memoir by Sue Klebold, the mother of Dylan Klebold.[2] Along with Eric Harris, Dylan was one of the perpetrators of the Columbine High School massacre in 1999. The book details the childhood and teenage years of her son, and what she says are signs she missed that Dylan was suffering from clinical depression. The book also examines her grieving process in dealing with the fallout of the massacre.[3]\nIn his foreword to the book, author Andrew Solomon wrote, “The ultimate message of this book is terrifying: you may not know your own children, and worse yet, your children may be unknowable to you. The stranger you fear may be your own son or daughter.”[4] Sue Klebold donated all of her profits from the book to mental health charities.[5]\n"
    },
    {
        "link": "/wiki/The_Nobodies_(song)",
        "title": "The Nobodies (song)",
        "date": "",
        "location": "",
        "paragraph": "\"The Nobodies\" is a song by American rock band Marilyn Manson. It is the third and final single from their fourth studio album, Holy Wood (In the Shadow of the Valley of Death), released in 2000. The song addresses Eric Harris and Dylan Klebold, perpetrators of the Columbine High School massacre in 1999. The song's title is from a quote by John Lennon's murderer, Mark David Chapman, who once lamented that he \"felt like a nobody.\"[1]\nAs early as February 10, 2001, Manson had made indications that the song would be chosen as the album's third single.[2][3] The third single was released in physical format on September 3, 2001 in the UK, and on October 6, 2001 in the US.[4][5][6]\n"
    },
    {
        "link": "/wiki/Nobody_Left_to_Hate",
        "title": "Nobody Left to Hate",
        "date": "",
        "location": "",
        "paragraph": "Nobody Left to Hate: Teaching Compassion after Columbine is a book by social psychologist Elliot Aronson that explores the implications of the attacks at Columbine.[1][2]\n\n"
    },
    {
        "link": "/wiki/The_Only_Way_(2004_film)",
        "title": "The Only Way (2004 film)",
        "date": "",
        "location": "",
        "paragraph": "The Only Way is a 2004 American film about a school shooting directed by David Zimmerman III and Levi Obery. The film is loosely based on the April 20, 1999 tragedy at Columbine High School. The film was shot on location in Metamora, Illinois, Washington, Illinois, Pekin, Illinois, and Peoria, Illinois with Metamora Township High School, the same high school from which the film's directors graduated, serving as the principal location.[1]\nDevon Browning (Billy Kearney) is a bullied outcast who has a family member dead, causing him to be depressed. As a result, He shoots up his school, killing his bullies and his date, Jamie (Victoria Corwin), before he is arrested.\n"
    },
    {
        "link": "/wiki/Rachel%27s_Tears",
        "title": "Rachel's Tears",
        "date": "",
        "location": "",
        "paragraph": "Rachel's Tears: The Spiritual Journey of Columbine Martyr Rachel Scott is a non-fiction book about Rachel Scott, the first victim of the Columbine High School massacre.\nWritten by her parents, including her journal entries, it is part of a nationwide school outreach program and ministry. They present Rachel as being killed for her Christian affirmation.[1][2]\n"
    },
    {
        "link": "/wiki/She_Said_Yes:_The_Unlikely_Martyrdom_of_Cassie_Bernall",
        "title": "She Said Yes: The Unlikely Martyrdom of Cassie Bernall",
        "date": "",
        "location": "",
        "paragraph": "She Said Yes: The Unlikely Martyrdom of Cassie Bernall is a memoir by Misty Bernall about the life of her daughter Cassie Bernall who was killed during the Columbine High School massacre on April 20, 1999.\nThe book was published by Plough Publishing and released on September 1, 1999.[1][2][3] It includes a foreword by Madeleine L'Engle.\n"
    },
    {
        "link": "/wiki/Super_Columbine_Massacre_RPG!",
        "title": "Super Columbine Massacre RPG!",
        "date": "",
        "location": "",
        "paragraph": "\nSuper Columbine Massacre RPG! is a role-playing video game created by Danny Ledonne and released in April 2005. The game recreates the 1999 Columbine High School shootings near Littleton, Colorado. Players assume the roles of gunmen Eric Harris and Dylan Klebold and act out the massacre, with flashbacks relating parts of Harris and Klebold's past experiences. The game begins on the day of the shootings and follows Harris and Klebold after their suicides to fictional adventures in perdition.\n"
    },
    {
        "link": "/wiki/This_Is_Your_Time_(Michael_W._Smith_album)",
        "title": "This Is Your Time (Michael W. Smith album)",
        "date": "",
        "location": "",
        "paragraph": "\nThis Is Your Time is Michael W. Smith's fourteenth studio album, released on November 23, 1999. All the songs from this album, except \"This Is Your Time\" and \"This Is Your Time (Reprise)\", were originally recorded for his previous studio album Live the Life, but did not make the final cut for the album.[2]\n"
    },
    {
        "link": "/wiki/Time_Stands_Still_(Degrassi:_The_Next_Generation)",
        "title": "Time Stands Still (Degrassi: The Next Generation)",
        "date": "",
        "location": "",
        "paragraph": "\n\"Time Stands Still\" is a two-part episode of the Canadian teen drama Degrassi: The Next Generation. It aired on CTV in Canada on 5 & 12 October 2004. In the two-part episode, Rick Murray (Ephraim Ellis), ostracized after he physically abused his girlfriend in the previous season, brings a gun to school and shoots and paralyzes Jimmy Brooks (Aubrey Graham), when a prank pulled on Rick is blamed on Jimmy. Rick is then accidentally killed by Sean Cameron (Daniel Clark) in his attempt to stop the shooting. Despite being a two-part episode, many events were still unresolved until later in the season. It aired on the American cable channel Noggin during its programming block for teenagers, The N, on 3 and 10 December 2004.\n"
    },
    {
        "link": "/wiki/The_Way_I_Am_(Eminem_song)",
        "title": "The Way I Am (Eminem song)",
        "date": "",
        "location": "",
        "paragraph": "\"The Way I Am\" is a song written, produced, and performed by American rapper Eminem from his third album The Marshall Mathers LP (2000). It was released as the second single from the album on October 3, 2000, later being featured on his 2005 compilation album, Curtain Call: The Hits. In the tradition of most of Eminem's follow-up singles, \"The Way I Am\" is one of the rare songs for which he has sole songwriting credit. It features a much darker and emotionally driven sound than the album's lead single \"The Real Slim Shady\". \"The Way I Am\" peaked at number 58 on the Billboard Hot 100. Outside the United States, \"The Way I Am\" peaked within the top ten of the charts in Belgium (Wallonia), Finland, Netherlands, Ireland, Sweden, and United Kingdom.\nThe song was written by Eminem to express the negative side of the fame that he had gained. The song makes points such as him not being able to go out in public and live a normal life due to him being harassed by fans. He also vents about the pressure put on him to top his earlier work on The Slim Shady LP. The song has also been remixed by Danny Lohner featuring Marilyn Manson, who has performed the song with Eminem live on stage. In 2005, it was re-released on the album Curtain Call: The Hits. \"The Way I Am\" was certified Gold in Sweden, selling over 20,000 copies.[2]\n"
    },
    {
        "link": "/wiki/With_Tired_Eyes,_Tired_Minds,_Tired_Souls,_We_Slept",
        "title": "With Tired Eyes, Tired Minds, Tired Souls, We Slept",
        "date": "",
        "location": "",
        "paragraph": "\"With Tired Eyes, Tired Minds, Tired Souls, We Slept \" is the 16th episode of One Tree Hill's third season. It first aired on The WB television network in the United States on March 1, 2006. It was written by Mark Schwahn and directed by Greg Prange,  and revolves around a school shooting.[1]\nThe episode was well-received by critics and fans, and was characterized as a landmark episode for the series.[2] Set at Tree Hill High School, it centers on bullied student Jimmy Edwards, who brings a gun to school seeking revenge on his tormentors. His former friend, Lucas Scott, and Lucas's brother, Nathan Scott, put themselves at risk to protect their classmates and loved ones.\n"
    },
    {
        "link": "/wiki/Zero_Day_(2003_film)",
        "title": "Zero Day (2003 film)",
        "date": "",
        "location": "",
        "paragraph": "Zero Day is a 2003 American found footage drama film written and directed by Ben Coccio and starring Andre Keuck and Cal Robertson revolving  around a plot about a duo planning a school shooting.[2]\nAndre Kriegman (Born July 17, 1982) and Calvin \n \"Cal\" Gabriel (Born February 5, 1983), announce their intention to attack their High school, Iroquois High School,[3] calling their plan \"Zero Day\". They keep a video diary on the camera, carefully hiding their plans from their friends and families. The majority of the film is portrayed through their video filming, and shows them planning, preparing, and mentioning some of their motives.\n"
    },
    {
        "link": "/wiki/Zero_Hour_(2004_TV_series)",
        "title": "Zero Hour (2004 TV series)",
        "date": "",
        "location": "",
        "paragraph": "\nZero Hour is a documentary-style television series. It aired on History Television in Canada, on the BBC in the United Kingdom, and on The History Channel in the United States. Zero Hour has also aired on Channel Seven in Australia (third series aired on Network Ten from 1 May 2010 and now plays on 7mate); on Discovery Channel in Africa, Asia, New Zealand, Brazil, and the Netherlands. The program focuses on retelling the details of tragic man-made disasters which each unfolded in less than an hour.\n"
    }
]