[
    {
        "link": "/wiki/Canaan_Union_Depot",
        "title": "Canaan Union Depot",
        "date": "",
        "location": "North Canaan, Connecticut",
        "paragraph": "The Canaan Union Depot, also known as the Union Depot, is located in Canaan Village, in the town of North Canaan, Connecticut, and is a former union station.  It was built in 1872 at the junction of the Housatonic Railroad and the Connecticut Western Railroad which was acquired by the Central New England Railway.[2]\nThe station was located at the level junction between the two rail lines, making an almost right angle at 85 degrees right at the crossover.  The angle of the building has a 3-story tower, at the top of which sat the electric telegraph operator.  The two 90-foot (27-meter) wings of the building were occupied by the two railroad companies. The first floor of the station had a large restaurant that was especially important before the development of the dining car. Eventually, both the Central New England and the Housatonic Railroad became a part of the New York, New Haven and Hartford Railroad. The New Haven was later merged into the Penn Central Transportation.[2]\n"
    },
    {
        "link": "/wiki/Cheshire_home_invasion_murders",
        "title": "Cheshire home invasion murders",
        "date": "July 23, 2007; 15 years ago (2007-07-23)",
        "location": "Cheshire, Connecticut, U.S.",
        "paragraph": "\nOn July 23, 2007, Linda Hayes (born Steven Hayes) and Joshua Komisarjevsky invaded the residence of the Petit family in Cheshire, Connecticut. Though initially planning only to rob the house, she[b] and Komisarjevsky murdered Jennifer Hawke-Petit and her two daughters, 17-year-old Hayley Petit and 11-year-old Michaela Petit. Their father Dr. William Petit escaped with severe injuries.\n"
    },
    {
        "link": "/wiki/Gulliver%27s_nightclub_fire",
        "title": "Gulliver's nightclub fire",
        "date": "June 30, 1974 (1974-06-30) Early Morning",
        "location": "Port Chester, New York",
        "paragraph": "\nThe Gulliver's nightclub fire occurred in the early hours of June 30, 1974, on the border of Port Chester, New York and Greenwich, Connecticut. The fire killed 24 patrons and injured 19 patrons and 13 firemen.[1] The fire was caused by arson in an adjacent bowling alley that had been set to cover up a minor burglary there.\nThe restaurant was formally known as Gulliver's Restaurant Inc. and opened in 1971.[2] It attracted crowds of young people, particularly Connecticut residents, since while both states had a drinking age of 18, NY had last call much later. \"For decades, youths from southern Connecticut, where the drinking age was 18 since 1972, had flocked to this part-leafy, part-scruffy miniature city so they could take advantage of New York's later last call hour.\"[2] The restaurant was originally the Old Post Grill, but that burned in 1962; then it was Lucy's, which had a fire in 1968.[2] The building was owned by the Port Chester Electrical Construction Corporation.[3]\n"
    },
    {
        "link": "/wiki/Hartford_circus_fire",
        "title": "Hartford circus fire",
        "date": "July 6, 1944 (1944-07-06)",
        "location": "Hartford, Connecticut, U.S.",
        "paragraph": "\nThe Hartford circus fire, which occurred on July 6, 1944, in Hartford, Connecticut, was one of the worst fire disasters in United States history.[3] The fire occurred during an afternoon performance of the Ringling Bros. and Barnum & Bailey Circus that was attended by 6,000 to 8,000 people. The fire killed at least 167 people,[4] and more than 700 were injured.\n"
    },
    {
        "link": "/wiki/Bra_murders",
        "title": "Bra murders",
        "date": "",
        "location": "",
        "paragraph": "The bra murders were a series of murders committed against five prostitutes from 1967 to 1971 in Stamford, Connecticut. Most of the victims were black prostitutes or drug addicts, each had been strangled, sometimes with their own bras, from which the murders' moniker originated.\nBenjamin Franklin Miller, a self-styled preacher from Norwalk, was charged and later acquitted by reason of insanity, spending the rest of his life in a mental institution. His guilt has been questioned and remains the subject of debate to this day.[1]\n"
    },
    {
        "link": "/wiki/Bryan_Cirigliano",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "location": "Manchester, Connecticut, USA",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\n"
    },
    {
        "link": "/wiki/George_Colvocoresses",
        "title": "George Colvocoresses",
        "date": "",
        "location": "",
        "paragraph": "George Musalas \"Colvos\" Colvocoresses (October 22, 1816 – June 3, 1872) was a Greek-American Navy officer who commanded the Saratoga during the American Civil War. From 1838 up until 1842, he took part in the United States Exploring Expedition, which explored large regions of the Pacific Ocean.\nHe was born on the island of Chios in the Greek Archipelago on October 22, 1816. As a member of a prominent Greek family, he was kidnapped along with his mother and two sisters and ransomed from the Turks after the massacre of the Greek population of the island in 1822, during the Greek War of Independence. His family's fortunes were devastated by the massacre. Most close relatives, including six brothers, were killed. He was enslaved at 6 years of age, but his father managed to buy back his freedom.\n"
    },
    {
        "link": "/wiki/Murder_of_Helle_Crafts",
        "title": "Murder of Helle Crafts",
        "date": "",
        "location": "",
        "paragraph": "Helle Crafts  (English: /ˈhɛlə ˈkræfts/ (listen); born Helle Lorck Nielsen; July 7, 1947 – November 19, 1986) was a Danish flight attendant who was murdered by her husband, Eastern Air Lines pilot Richard Crafts. Her death led to the state of Connecticut's first murder conviction without the victim's body.[1][2]\nHelle Nielsen married Richard Crafts in 1975 and settled with him in Newtown, Connecticut, United States. Helle continued working as a flight attendant while raising their three children. In 1986, Helle began to suspect that Richard was engaged in extramarital sexual activity, and confronted him about suspicious long-distance phone calls, which angered Richard.[3] Helle met with a divorce attorney and hired a private investigator, Keith Mayo, who snapped photos of Richard kissing another flight attendant outside her New Jersey residence.[3]\n"
    },
    {
        "link": "/wiki/Louis_Felder",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "location": "Manchester, Connecticut, USA",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\n"
    },
    {
        "link": "/wiki/Jasper_Howard",
        "title": "Jasper Howard",
        "date": "",
        "location": "",
        "paragraph": "\nJasper Tyrone \"Jazz\" Howard (January 28, 1989 – October 18, 2009) was an American football cornerback for the University of Connecticut Huskies from 2007 to 2009. He was fatally stabbed on October 18, 2009, hours after UConn's win over the Louisville Cardinals.\n"
    },
    {
        "link": "/wiki/Victor_James_(murder_victim)",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "location": "Manchester, Connecticut, USA",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\n"
    },
    {
        "link": "/wiki/Suzanne_Jovin",
        "title": "Murder of Suzanne Jovin",
        "date": "",
        "location": "",
        "paragraph": "Suzanne Nahuela Jovin (January 26, 1977 – December 4, 1998) was a German senior at Yale University in New Haven, Connecticut, when she was brutally stabbed to death off campus. The city of New Haven and Yale University have offered a combined $150,000 for information that leads to the arrest and conviction of Jovin's killer.[1] The crime remains unsolved. At Yale, Jovin volunteered as a tutor through the Yale Tutoring in Elementary Schools program, sang in both the Freshman Chorus and the Bach Society Orchestra, co-founded the German Club, and worked for three years in the Davenport dining hall.[2]\nAfter dropping off the penultimate draft of her senior essay on the terrorist leader Osama bin Laden, at approximately 4:15 pm on Friday December 4, 1998, Suzanne Jovin began preparations for a pizza-making party she had organized at the Trinity Lutheran Church on 292 Orange Street for the local chapter of Best Buddies, an international organization that brings together students and mentally disabled adults. By 8:30 pm, after staying late to help clean up, she was driving another volunteer home in a borrowed university station wagon. Around 8:45, she returned the car to the Yale-owned lot on the corner of Edgewood Avenue and Howe Street, and proceeded to walk two blocks to her second-floor apartment at 258 Park Street, upstairs from a Yale police substation.\n"
    },
    {
        "link": "/wiki/Murder_of_Suzanne_Jovin",
        "title": "Murder of Suzanne Jovin",
        "date": "",
        "location": "",
        "paragraph": "Suzanne Nahuela Jovin (January 26, 1977 – December 4, 1998) was a German senior at Yale University in New Haven, Connecticut, when she was brutally stabbed to death off campus. The city of New Haven and Yale University have offered a combined $150,000 for information that leads to the arrest and conviction of Jovin's killer.[1] The crime remains unsolved. At Yale, Jovin volunteered as a tutor through the Yale Tutoring in Elementary Schools program, sang in both the Freshman Chorus and the Bach Society Orchestra, co-founded the German Club, and worked for three years in the Davenport dining hall.[2]\nAfter dropping off the penultimate draft of her senior essay on the terrorist leader Osama bin Laden, at approximately 4:15 pm on Friday December 4, 1998, Suzanne Jovin began preparations for a pizza-making party she had organized at the Trinity Lutheran Church on 292 Orange Street for the local chapter of Best Buddies, an international organization that brings together students and mentally disabled adults. By 8:30 pm, after staying late to help clean up, she was driving another volunteer home in a borrowed university station wagon. Around 8:45, she returned the car to the Yale-owned lot on the corner of Edgewood Avenue and Howe Street, and proceeded to walk two blocks to her second-floor apartment at 258 Park Street, upstairs from a Yale police substation.\n"
    },
    {
        "link": "/wiki/Murder_of_Andrew_Kissel",
        "title": "Murder of Andrew Kissel",
        "date": "",
        "location": "",
        "paragraph": "\nAndrew Michael Kissel (August 23, 1959 – April 3, 2006) was an American real estate developer who was found murdered at his rented Greenwich, Connecticut estate. Kissel had been accused of defrauding a New York co-op board of millions of dollars.\nHis body was found by workers from a moving company. He had been stabbed to death in the basement of the home. The motive for his murder was a mystery, as there were many people who had problems with him, including those from the U.S. Justice Department, several multi-billion dollar corporations/conglomerates, and his own wife. Kissel's chauffeur and his cousin were later found guilty in association with the murder.\n"
    },
    {
        "link": "/wiki/Nancy_Lanza",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\n"
    },
    {
        "link": "/wiki/Annie_Le",
        "title": "Murder of Annie Le",
        "date": "September 8, 2009; 13 years ago (2009-09-08)",
        "location": "10 Amistad StreetNew Haven, Connecticut, U.S.",
        "paragraph": "The murder of Annie Le occurred on September 8, 2009, while she was working in the New Haven, Connecticut campus of Yale University. Annie Marie Thu Le (July 3, 1985 – September 8, 2009) was a 24-year-old doctoral student at the Yale School of Medicine's Department of Pharmacology. She was last seen in a research building on the New Haven campus on September 8. On September 13, the day that she was to be married, she was found dead inside the building.[2]\nOn September 17, police arrested the perpetrator, Raymond J. Clark III, a Yale laboratory technician who worked in the building.[1][3] Clark pleaded guilty to the murder on March 17, 2011.[4] Clark was sentenced to 44 years imprisonment on June 3.[5] The case generated frenetic media coverage.\n"
    },
    {
        "link": "/wiki/Little_Miss_1565",
        "title": "Hartford circus fire",
        "date": "July 6, 1944 (1944-07-06)",
        "location": "Hartford, Connecticut, U.S.",
        "paragraph": "\nThe Hartford circus fire, which occurred on July 6, 1944, in Hartford, Connecticut, was one of the worst fire disasters in United States history.[3] The fire occurred during an afternoon performance of the Ringling Bros. and Barnum & Bailey Circus that was attended by 6,000 to 8,000 people. The fire killed at least 167 people,[4] and more than 700 were injured.\n"
    },
    {
        "link": "/wiki/Eugene_Mallove",
        "title": "Eugene Mallove",
        "date": "",
        "location": "",
        "paragraph": "Eugene Franklin Mallove (June 9, 1947 – May 14, 2004) was an American scientist, science writer, editor, and publisher of Infinite Energy magazine, and founder of the nonprofit organization New Energy Foundation.  He was a proponent of cold fusion, and a supporter of its research and related exploratory alternative energy topics, several of which are sometimes characterised as \"fringe science\".\nMallove authored Fire from Ice, a book detailing the 1989 report of tabletop cold fusion from Stanley Pons and Martin Fleischmann at the University of Utah. Among other things, the book claims the team did produce \"greater-than-unity\" output energy in an experiment successfully replicated on several occasions, but that the results were suppressed through an organized campaign of ridicule from mainstream physicists, including those studying controlled thermonuclear fusion, trying to protect their research and funding.[1]\n"
    },
    {
        "link": "/wiki/Craig_Pepin",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "location": "Manchester, Connecticut, USA",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\n"
    },
    {
        "link": "/wiki/Michaela_Petit",
        "title": "Cheshire home invasion murders",
        "date": "July 23, 2007; 15 years ago (2007-07-23)",
        "location": "Cheshire, Connecticut, U.S.",
        "paragraph": "\nOn July 23, 2007, Linda Hayes (born Steven Hayes) and Joshua Komisarjevsky invaded the residence of the Petit family in Cheshire, Connecticut. Though initially planning only to rob the house, she[b] and Komisarjevsky murdered Jennifer Hawke-Petit and her two daughters, 17-year-old Hayley Petit and 11-year-old Michaela Petit. Their father Dr. William Petit escaped with severe injuries.\n"
    },
    {
        "link": "/wiki/Frank_Piccolo",
        "title": "Frank Piccolo",
        "date": "",
        "location": "",
        "paragraph": "Frank Louis Piccolo also known as Frank Lanza (July 2, 1921 – September 19, 1981), was a caporegime in the Gambino crime family in Bridgeport, Connecticut who became involved in a famous extortion case with singer Wayne Newton.[citation needed]\nBorn on July 2, 1921, in New York City, Piccolo was the only son of Francesco Piccolo and Fannie Lanza. Frank Piccolo stood at 6 ft (1.8 m) tall and weighed 200 pounds (91 kg) with black hair, brown eyes, and had a husky build. He was married to Virginia Paglinco and was the father of four children.[1]  Piccolo and his family lived in Bridgeport, Connecticut. He was the cousin of Guido Penosi.[2]\n"
    },
    {
        "link": "/wiki/Murder_of_Christian_Prince",
        "title": "Murder of Christian Prince",
        "date": "",
        "location": "",
        "paragraph": "Christian Haley Prince (July 8, 1971 – February 17, 1991) was a Yale University student whose murder in New Haven, Connecticut, highlighted racial and class tensions between town and gown.\nPrince, the son of Edward and Sally Prince of Chevy Chase, Maryland, was a fourth-generation Yale student, a member of the class of 1993 in his sophomore year, in Pierson College. The evening of February 16, 1991, after having dined at Mory's and attending a party at Sterling-Sheffield-Strathcona Hall, Prince left his friends and began walking to his off-campus apartment on Whitney Avenue to rest for lacrosse practice the next day.[1] Prince was found lying on the steps of St. Mary's Church, New Haven on Hillhouse Avenue, dead of a bullet wound to the heart, in the early morning hours of February 17.[1][2] He was the first Yale student killed on campus since the murder of Gary Stein during a robbery near Grove Street Cemetery in 1974.[1]\n"
    },
    {
        "link": "/wiki/Alex_Rackley",
        "title": "Alex Rackley",
        "date": "",
        "location": "",
        "paragraph": "Alex Rackley (June 2, 1949 – May 20, 1969)[1] was an American activist who was a member of the New York chapter of the Black Panther Party (BPP) in the late-1960s. In May 1969, Rackley was suspected by other Panthers of being a police informant. He was brought to Panther headquarters in New Haven, Connecticut, held captive and tortured there for several days, condemned to death, taken to the wetlands of Middlefield, Connecticut, and murdered there.[2]\nHis killing was the crime at the center of the 1970 New Haven Black Panther trials.\n"
    },
    {
        "link": "/wiki/Victoria_Leigh_Soto",
        "title": "Victoria Leigh Soto",
        "date": "",
        "location": "",
        "paragraph": "\nVictoria Leigh Soto (November 4, 1985 – December 14, 2012) was an American teacher who was killed in the Sandy Hook Elementary School shooting. After the gunman, Adam Lanza entered the school, she hid her students; when the students later ran from their hiding places, she was reportedly shot four times by Lanza and died trying to shield them with her body.[1][2] She has since been hailed as a hero.[3][4][2] She is a posthumous recipient of the Presidential Citizens Medal.\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Connecticut",
        "title": "George Floyd protests in Connecticut",
        "date": "May 28, 2020 – August 25, 2020",
        "location": "Connecticut, United States",
        "paragraph": "\nThis is a list of George Floyd protests in Connecticut, United States.\n"
    },
    {
        "link": "/wiki/New_London_riots_of_1919",
        "title": "New London riots of 1919",
        "date": "Late May and June 1919",
        "location": "New London, Connecticut",
        "paragraph": "The New London riots of 1919 were a series of racial riots between white and black Navy sailors and Marines stationed in New London and Groton, Connecticut.\nWhite and black sailors and marines occupied separate living quarters at the Naval submarine base in Groton, Connecticut in 1919. Racial tensions were high in the Groton and New London area from May to June, and there were several confrontations between the two groups. Black sailors reported that white sailors attacked them, and white Marines accused the black sailors of waiting for them after dark when they crossed Long Cove Bridge.[1] The police arrested two white \"Blue Jackets\", and white sailors attacked the Hotel Bristol on Bank Street where the black sailors spent most of their free time, throwing a group of blacks out of the hotel on the street and beating them. The police and fire brigades were called but could not stop the rioting. The Marine Corps were eventually called, and they regained control.[1]\n"
    },
    {
        "link": "/wiki/Sandy_Hook_Elementary_School_shooting",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\n"
    },
    {
        "link": "/wiki/Americans_for_Responsible_Solutions",
        "title": "Americans for Responsible Solutions",
        "date": "",
        "location": "Washington, D.C.",
        "paragraph": "\nAmericans for Responsible Solutions (ARS) was a United States non-profit organization and super PAC that supports gun control.[2][3] The group's stated goal was \"to encourage elected officials to stand up for solutions to prevent gun violence and protect responsible gun ownership.\"[4] It typically supported Democratic politicians in elections.[5] In 2016, the organization merged with the Law Center to Prevent Gun Violence to become Giffords.[6]\n"
    },
    {
        "link": "/wiki/Sandy_Hook_Elementary_School_shooting_conspiracy_theories",
        "title": "Sandy Hook Elementary School shooting conspiracy theories",
        "date": "",
        "location": "",
        "paragraph": "\n\n\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut. The perpetrator, Adam Lanza, fatally shot his mother before murdering 20 students and six staff members at Sandy Hook Elementary School, and later committed suicide.[1] A number of fringe figures have promoted conspiracy theories that doubt or dispute what occurred at Sandy Hook. Various conspiracy theorists have claimed, for example, that the massacre was actually orchestrated by the U.S. government as part of an elaborate plot to promote stricter gun control laws.[2]\nThe more common conspiracy theory, adopted initially by James H. Fetzer, James Tracy, and others, and further popularized by Alex Jones, denied that the massacre actually occurred, asserting that it was faked. The massacre was described by Fetzer and Tracy as a classified training exercise involving members of federal and local law enforcement, the news media, and crisis actors, which they claim was modeled on Operation Closed Campus, an Iowa school-shooting drill that was canceled in 2011 amid threats and public outcry. Jones described the shooting incident as \"synthetic, completely fake with actors; in my view, manufactured [...] it just shows how bold they are that they clearly used actors.\"[3][4]\n"
    },
    {
        "link": "/wiki/Gun_control_after_the_Sandy_Hook_Elementary_School_shooting",
        "title": "Gun control after the Sandy Hook Elementary School shooting",
        "date": "",
        "location": "",
        "paragraph": "After the Sandy Hook Elementary School shooting, multiple gun laws were proposed in the United States at the federal and state levels. The shooting renewed debate about gun control. The debates focused on requiring background checks on all firearm sales (called universal background checks), and on passing new and expanded assault weapon and high-capacity magazine bans.\nOn December 14, 2012, twenty children and six adults were murdered at Sandy Hook Elementary School in Newtown, Connecticut.[1] One other adult had been murdered before the shooter went to the school. It was the deadliest primary school shooting,[2] the fourth-deadliest mass shooting by a single person,[3] and one of the deadliest mass shootings in U.S. history.[4]\n"
    },
    {
        "link": "/wiki/Adam_Lanza",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\n"
    },
    {
        "link": "/wiki/JT_Lewis",
        "title": "JT Lewis",
        "date": "",
        "location": "",
        "paragraph": "Joseph Theodore Lewis[2] (born May 18, 2000) is an American school safety advocate. Lewis started Newtown Helps Rwanda,[3] a charity that raised money for survivors of the 1994 Rwandan genocide as well as former child soldiers in Uganda. He previously was a candidate in the 2020 elections for Connecticut state senator for the 28th district,[4] dropping out before the August primaries[5] to work on a national campaign. He is the older brother of first grade student Jesse Lewis,[6] a victim of the 2012 Sandy Hook Elementary School shooting in Newtown, Connecticut.[7]\nJT Lewis was born Joseph Theodore Lewis on May 18, 2000,[1] to Scarlett Lewis.[8] He is the older brother of six-year-old Jesse Lewis,[9] who was a first grade student at Sandy Hook Elementary School when he and others were killed in a shooting at the school on December 14, 2012.[10] He was a twelve-year-old seventh grade student when his brother died.[11] Lewis was raised on a farm with his younger brother and they had horses, dogs, and chickens, which their mother bought in 1998.[12] Several days after the shooting, former president Barack Obama met with Lewis, his mother, and the victims' families at Newtown High School.[13] Lewis recalled the event years later saying that \"President Obama treated me with the utmost respect and class. More importantly, [he] honored my brother’s memory.\"[14] Lewis attended Newtown High School and was on the varsity football team, graduating in 2018.[15] \nLewis currently attends University of Connecticut as a political science major.[11] He played on the UConn football team as a walk-on kicker his Freshman year.[16]\n"
    },
    {
        "link": "/wiki/Moms_Demand_Action",
        "title": "Everytown for Gun Safety",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Leonard_Pozner",
        "title": "Leonard Pozner",
        "date": "",
        "location": "",
        "paragraph": "Leonard Pozner is the father of a Sandy Hook Elementary School shooting victim, Noah Pozner. He is the founder of the HONR Network, which supports the victims of mass casualty violence as well as the targets of online hate speech and harassment.\nOn December 14, 2012, 20 year old Adam Lanza took a Bushmaster XM-15 semi-automatic rifle into Sandy Hook Elementary school and killed 20 children and 6 teachers. One of the children killed was Pozner's six-year-old son Noah.[1] Shortly afterwards, conspiracy theorists used Facebook, YouTube, blogs and other social media platforms to claim the massacre was a hoax and a false flag operation and that the victims were actually crisis actors. Among them was radio-show host Alex Jones, who repeatedly used the conspiracy theory to tell the audience listening to his InfoWars radio program to rise up and \"find out the truth\", insisting that the shooting was staged by the federal government to destroy the Second Amendment and citizens' right to bear arms.[1]\n"
    },
    {
        "link": "/wiki/Reactions_to_the_Sandy_Hook_Elementary_School_shooting",
        "title": "Reactions to the Sandy Hook Elementary School shooting",
        "date": "",
        "location": "",
        "paragraph": "\nThe December 14, 2012, Sandy Hook Elementary School shooting—in which the perpetrator shot and killed his mother at home, 20 school children, 6 teachers, and then himself—received international attention. Governments and world leaders offered their condolences, while tributes and vigils by people were made in honor of the victims. U.S. President Barack Obama gave a televised address on the day of the shootings, saying, \"We're going to have to come together and take meaningful action to prevent more tragedies like this, regardless of the politics.\"[1] Obama paused twice during the address to compose himself and wipe away tears, and expressed \"enormous sympathy for families that are affected\".[2][3][4][5] He also ordered flags to be flown at half-staff at the White House and other U.S. federal government facilities worldwide in respect for the victims.[6] Three days after the massacre, 151,000 Americans had signed up at the Obama administration's We the People petitioning website in support of a renewed national debate on gun control.[7] Obama attended and spoke at an interfaith vigil on December 16 in Newtown, Connecticut.[8]\nThere were tributes and vigils by people in Moscow, Bangalore,[43] Karachi[44] and in Monrovia, Liberia.[45] An organized candlelight vigil was held in India and a makeshift memorial set up at the U.S. embassy in Moscow.[46][47][48] Media in the United Kingdom compared the shooting to the Dunblane school massacre, another school shooting that occurred in 1996, in which 16 children and one teacher were killed before the shooter, 43-year-old Thomas Hamilton, committed suicide.[49] In the Marshall Islands students of Majuro Cooperative school dressed in the green and white colors of Sandy Hook Elementary and presented a condolence card to the American ambassador.[50]\n"
    },
    {
        "link": "/wiki/Sandy_Hoax",
        "title": "Sandy Hook Elementary School shooting conspiracy theories",
        "date": "",
        "location": "",
        "paragraph": "\n\n\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut. The perpetrator, Adam Lanza, fatally shot his mother before murdering 20 students and six staff members at Sandy Hook Elementary School, and later committed suicide.[1] A number of fringe figures have promoted conspiracy theories that doubt or dispute what occurred at Sandy Hook. Various conspiracy theorists have claimed, for example, that the massacre was actually orchestrated by the U.S. government as part of an elaborate plot to promote stricter gun control laws.[2]\nThe more common conspiracy theory, adopted initially by James H. Fetzer, James Tracy, and others, and further popularized by Alex Jones, denied that the massacre actually occurred, asserting that it was faked. The massacre was described by Fetzer and Tracy as a classified training exercise involving members of federal and local law enforcement, the news media, and crisis actors, which they claim was modeled on Operation Closed Campus, an Iowa school-shooting drill that was canceled in 2011 amid threats and public outcry. Jones described the shooting incident as \"synthetic, completely fake with actors; in my view, manufactured [...] it just shows how bold they are that they clearly used actors.\"[3][4]\n"
    },
    {
        "link": "/wiki/Sandy_Hook_Memorial",
        "title": "Sandy Hook Memorial",
        "date": "",
        "location": "",
        "paragraph": "\nThe Sandy Hook Permanent Memorial is a memorial in Sandy Hook, Connecticut, that honors the twenty children and six educators who were victims of the Sandy Hook Elementary School shooting on the morning of December 14, 2012. The memorial is located at 28 Riverside Road in the woods adjacent to the new Sandy Hook Elementary School, built near the site of the original school that was razed.[1]\n"
    },
    {
        "link": "/wiki/Sandy_Hook:_An_American_Tragedy",
        "title": "Sandy Hook: An American Tragedy",
        "date": "",
        "location": "",
        "paragraph": "Conspiracies.\nSocial media.\nTrue Crime / Murder / Mass Murder.\nSandy Hook: An American Tragedy and the Battle for Truth is a nonfiction book written by journalist Elizabeth Williamson and published in 2022 by Dutton, an imprint of Penguin Random House.[1][2][3][4][5][6]\n"
    },
    {
        "link": "/wiki/Victoria_Leigh_Soto",
        "title": "Victoria Leigh Soto",
        "date": "",
        "location": "",
        "paragraph": "\nVictoria Leigh Soto (November 4, 1985 – December 14, 2012) was an American teacher who was killed in the Sandy Hook Elementary School shooting. After the gunman, Adam Lanza entered the school, she hid her students; when the students later ran from their hiding places, she was reportedly shot four times by Lanza and died trying to shield them with her body.[1][2] She has since been hailed as a hero.[3][4][2] She is a posthumous recipient of the Presidential Citizens Medal.\n"
    },
    {
        "link": "/wiki/Sandy_Hook_Elementary_School_shooting",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\n"
    },
    {
        "link": "/wiki/Americans_for_Responsible_Solutions",
        "title": "Americans for Responsible Solutions",
        "date": "",
        "location": "Washington, D.C.",
        "paragraph": "\nAmericans for Responsible Solutions (ARS) was a United States non-profit organization and super PAC that supports gun control.[2][3] The group's stated goal was \"to encourage elected officials to stand up for solutions to prevent gun violence and protect responsible gun ownership.\"[4] It typically supported Democratic politicians in elections.[5] In 2016, the organization merged with the Law Center to Prevent Gun Violence to become Giffords.[6]\n"
    },
    {
        "link": "/wiki/Sandy_Hook_Elementary_School_shooting_conspiracy_theories",
        "title": "Sandy Hook Elementary School shooting conspiracy theories",
        "date": "",
        "location": "",
        "paragraph": "\n\n\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut. The perpetrator, Adam Lanza, fatally shot his mother before murdering 20 students and six staff members at Sandy Hook Elementary School, and later committed suicide.[1] A number of fringe figures have promoted conspiracy theories that doubt or dispute what occurred at Sandy Hook. Various conspiracy theorists have claimed, for example, that the massacre was actually orchestrated by the U.S. government as part of an elaborate plot to promote stricter gun control laws.[2]\nThe more common conspiracy theory, adopted initially by James H. Fetzer, James Tracy, and others, and further popularized by Alex Jones, denied that the massacre actually occurred, asserting that it was faked. The massacre was described by Fetzer and Tracy as a classified training exercise involving members of federal and local law enforcement, the news media, and crisis actors, which they claim was modeled on Operation Closed Campus, an Iowa school-shooting drill that was canceled in 2011 amid threats and public outcry. Jones described the shooting incident as \"synthetic, completely fake with actors; in my view, manufactured [...] it just shows how bold they are that they clearly used actors.\"[3][4]\n"
    },
    {
        "link": "/wiki/Gun_control_after_the_Sandy_Hook_Elementary_School_shooting",
        "title": "Gun control after the Sandy Hook Elementary School shooting",
        "date": "",
        "location": "",
        "paragraph": "After the Sandy Hook Elementary School shooting, multiple gun laws were proposed in the United States at the federal and state levels. The shooting renewed debate about gun control. The debates focused on requiring background checks on all firearm sales (called universal background checks), and on passing new and expanded assault weapon and high-capacity magazine bans.\nOn December 14, 2012, twenty children and six adults were murdered at Sandy Hook Elementary School in Newtown, Connecticut.[1] One other adult had been murdered before the shooter went to the school. It was the deadliest primary school shooting,[2] the fourth-deadliest mass shooting by a single person,[3] and one of the deadliest mass shootings in U.S. history.[4]\n"
    },
    {
        "link": "/wiki/Adam_Lanza",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\n"
    },
    {
        "link": "/wiki/JT_Lewis",
        "title": "JT Lewis",
        "date": "",
        "location": "",
        "paragraph": "Joseph Theodore Lewis[2] (born May 18, 2000) is an American school safety advocate. Lewis started Newtown Helps Rwanda,[3] a charity that raised money for survivors of the 1994 Rwandan genocide as well as former child soldiers in Uganda. He previously was a candidate in the 2020 elections for Connecticut state senator for the 28th district,[4] dropping out before the August primaries[5] to work on a national campaign. He is the older brother of first grade student Jesse Lewis,[6] a victim of the 2012 Sandy Hook Elementary School shooting in Newtown, Connecticut.[7]\nJT Lewis was born Joseph Theodore Lewis on May 18, 2000,[1] to Scarlett Lewis.[8] He is the older brother of six-year-old Jesse Lewis,[9] who was a first grade student at Sandy Hook Elementary School when he and others were killed in a shooting at the school on December 14, 2012.[10] He was a twelve-year-old seventh grade student when his brother died.[11] Lewis was raised on a farm with his younger brother and they had horses, dogs, and chickens, which their mother bought in 1998.[12] Several days after the shooting, former president Barack Obama met with Lewis, his mother, and the victims' families at Newtown High School.[13] Lewis recalled the event years later saying that \"President Obama treated me with the utmost respect and class. More importantly, [he] honored my brother’s memory.\"[14] Lewis attended Newtown High School and was on the varsity football team, graduating in 2018.[15] \nLewis currently attends University of Connecticut as a political science major.[11] He played on the UConn football team as a walk-on kicker his Freshman year.[16]\n"
    },
    {
        "link": "/wiki/Moms_Demand_Action",
        "title": "Everytown for Gun Safety",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Leonard_Pozner",
        "title": "Leonard Pozner",
        "date": "",
        "location": "",
        "paragraph": "Leonard Pozner is the father of a Sandy Hook Elementary School shooting victim, Noah Pozner. He is the founder of the HONR Network, which supports the victims of mass casualty violence as well as the targets of online hate speech and harassment.\nOn December 14, 2012, 20 year old Adam Lanza took a Bushmaster XM-15 semi-automatic rifle into Sandy Hook Elementary school and killed 20 children and 6 teachers. One of the children killed was Pozner's six-year-old son Noah.[1] Shortly afterwards, conspiracy theorists used Facebook, YouTube, blogs and other social media platforms to claim the massacre was a hoax and a false flag operation and that the victims were actually crisis actors. Among them was radio-show host Alex Jones, who repeatedly used the conspiracy theory to tell the audience listening to his InfoWars radio program to rise up and \"find out the truth\", insisting that the shooting was staged by the federal government to destroy the Second Amendment and citizens' right to bear arms.[1]\n"
    },
    {
        "link": "/wiki/Reactions_to_the_Sandy_Hook_Elementary_School_shooting",
        "title": "Reactions to the Sandy Hook Elementary School shooting",
        "date": "",
        "location": "",
        "paragraph": "\nThe December 14, 2012, Sandy Hook Elementary School shooting—in which the perpetrator shot and killed his mother at home, 20 school children, 6 teachers, and then himself—received international attention. Governments and world leaders offered their condolences, while tributes and vigils by people were made in honor of the victims. U.S. President Barack Obama gave a televised address on the day of the shootings, saying, \"We're going to have to come together and take meaningful action to prevent more tragedies like this, regardless of the politics.\"[1] Obama paused twice during the address to compose himself and wipe away tears, and expressed \"enormous sympathy for families that are affected\".[2][3][4][5] He also ordered flags to be flown at half-staff at the White House and other U.S. federal government facilities worldwide in respect for the victims.[6] Three days after the massacre, 151,000 Americans had signed up at the Obama administration's We the People petitioning website in support of a renewed national debate on gun control.[7] Obama attended and spoke at an interfaith vigil on December 16 in Newtown, Connecticut.[8]\nThere were tributes and vigils by people in Moscow, Bangalore,[43] Karachi[44] and in Monrovia, Liberia.[45] An organized candlelight vigil was held in India and a makeshift memorial set up at the U.S. embassy in Moscow.[46][47][48] Media in the United Kingdom compared the shooting to the Dunblane school massacre, another school shooting that occurred in 1996, in which 16 children and one teacher were killed before the shooter, 43-year-old Thomas Hamilton, committed suicide.[49] In the Marshall Islands students of Majuro Cooperative school dressed in the green and white colors of Sandy Hook Elementary and presented a condolence card to the American ambassador.[50]\n"
    },
    {
        "link": "/wiki/Sandy_Hoax",
        "title": "Sandy Hook Elementary School shooting conspiracy theories",
        "date": "",
        "location": "",
        "paragraph": "\n\n\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut. The perpetrator, Adam Lanza, fatally shot his mother before murdering 20 students and six staff members at Sandy Hook Elementary School, and later committed suicide.[1] A number of fringe figures have promoted conspiracy theories that doubt or dispute what occurred at Sandy Hook. Various conspiracy theorists have claimed, for example, that the massacre was actually orchestrated by the U.S. government as part of an elaborate plot to promote stricter gun control laws.[2]\nThe more common conspiracy theory, adopted initially by James H. Fetzer, James Tracy, and others, and further popularized by Alex Jones, denied that the massacre actually occurred, asserting that it was faked. The massacre was described by Fetzer and Tracy as a classified training exercise involving members of federal and local law enforcement, the news media, and crisis actors, which they claim was modeled on Operation Closed Campus, an Iowa school-shooting drill that was canceled in 2011 amid threats and public outcry. Jones described the shooting incident as \"synthetic, completely fake with actors; in my view, manufactured [...] it just shows how bold they are that they clearly used actors.\"[3][4]\n"
    },
    {
        "link": "/wiki/Sandy_Hook_Memorial",
        "title": "Sandy Hook Memorial",
        "date": "",
        "location": "",
        "paragraph": "\nThe Sandy Hook Permanent Memorial is a memorial in Sandy Hook, Connecticut, that honors the twenty children and six educators who were victims of the Sandy Hook Elementary School shooting on the morning of December 14, 2012. The memorial is located at 28 Riverside Road in the woods adjacent to the new Sandy Hook Elementary School, built near the site of the original school that was razed.[1]\n"
    },
    {
        "link": "/wiki/Sandy_Hook:_An_American_Tragedy",
        "title": "Sandy Hook: An American Tragedy",
        "date": "",
        "location": "",
        "paragraph": "Conspiracies.\nSocial media.\nTrue Crime / Murder / Mass Murder.\nSandy Hook: An American Tragedy and the Battle for Truth is a nonfiction book written by journalist Elizabeth Williamson and published in 2022 by Dutton, an imprint of Penguin Random House.[1][2][3][4][5][6]\n"
    },
    {
        "link": "/wiki/Victoria_Leigh_Soto",
        "title": "Victoria Leigh Soto",
        "date": "",
        "location": "",
        "paragraph": "\nVictoria Leigh Soto (November 4, 1985 – December 14, 2012) was an American teacher who was killed in the Sandy Hook Elementary School shooting. After the gunman, Adam Lanza entered the school, she hid her students; when the students later ran from their hiding places, she was reportedly shot four times by Lanza and died trying to shield them with her body.[1][2] She has since been hailed as a hero.[3][4][2] She is a posthumous recipient of the Presidential Citizens Medal.\n"
    }
]