{
    "0": {
        "link": "/wiki/%C3%81guila_Blanca_(heist)",
        "title": "Águila Blanca (heist)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "West Hartford",
        "county": "Capitol Region COG",
        "paragraph": "Águila Blanca (named after José Maldonado Román and meaning \"White Eagle\" in English) was the name given by Los Macheteros (a guerrilla group seeking Puerto Rican independence from the United States) to its robbery of a Wells Fargo depot on September 12, 1983, a day coinciding with the birth date of Puerto Rican Nationalist Dr. Pedro Albizu Campos.[1] The robbery took place in West Hartford, Connecticut, and netted more than $7 million ($19 million today).[2] At the time of the robbery, it was the largest cash heist in U.S. history.[3]\nThe specific cell responsible for it was known as Los Taínos.[4] According to the Macheteros, part of the money was given to the poor communities of Puerto Rico to fund education, food, housing, clothing and toys for children.[1] According to prosecutors, the money was used to finance Los Macheteros. About $80,000 in what was believed to be stolen money was seized by Federal Bureau of Investigation (FBI) agents during searches in Puerto Rico and Boston.  The  federal government contends that the group spent about $1 million, moved more than $2 million to Cuba, and hid $4 million in safe deposit boxes, certificates of deposit, savings accounts and farmhouse cellars in Puerto Rico.[5]\nThe FBI charges for this robbery include obstruction of commerce by robbery and conspiracy, bank robbery, aggravated robbery, theft from interstate shipment, foreign and interstate transportation of stolen money, and conspiracy to interfere with commerce by robbery.[6]\n",
        "type": [
            "robber",
            "robbery",
            "robberies",
            "theft"
        ]
    },
    "1": {
        "link": "/wiki/Sandy_Hook_Elementary_School_shooting",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "year": "2012",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\nThe incident is the deadliest mass shooting at an elementary school in U.S. history, and the fourth-deadliest mass shooting overall.[a] The shooting prompted renewed debate about gun control in the United States, including proposals to make the background-check system universal, and for new federal and state gun legislation banning the sale and manufacture of certain types of semi-automatic firearms and magazines which can hold more than ten rounds of ammunition.\n",
        "type": [
            "mass murder",
            "mass shooting",
            "murder",
            "shooting"
        ]
    },
    "2": {
        "link": "/wiki/Travis_(chimpanzee)",
        "title": "Travis (chimpanzee)",
        "date": "February 16, 2009 (aged 13) Stamford, Connecticut, U.S.",
        "year": "2009",
        "location": "",
        "state": "",
        "place": "Stamford",
        "county": "Western Connecticut COG",
        "paragraph": "\nTravis (October 21, 1995 – February 16, 2009)[3] was a male common chimpanzee who, as an animal actor, appeared in several television shows and commercials, including spots for Coca-Cola,[4] as well as on television programs including The Maury Povich Show and The Man Show,[5][6] which is disputed.[7] On February 16, 2009, Travis attacked and mauled his owner's friend in Stamford, Connecticut,[8] blinding her, severing several body parts and lacerating her face, before he was shot and killed by a responding police officer.[9] The incident became an international news story.\nTravis was born near Festus, Missouri on October 21, 1995, at Mike and Connie Braun Casey's compound, currently named the Missouri Chimpanzee Sanctuary. In a separate incident, Travis' mother Suzy was fatally shot following an escape in 2001.[10] Sandra and Jerome Herold purchased Travis for $50,000 from a breeder after he was taken from his mother when he was three days old.[3][11] They named the chimpanzee for Sandra's favorite singer, Travis Tritt.[12] The Herolds raised Travis at their home at Rock Rimmon Road in the North Stamford section of Stamford, Connecticut.[13] Travis was the Herolds' constant companion and would often accompany them to work and on their shopping excursions in town.[13] The Herolds owned a towing company, and Travis would pose for photos at the shop and ride with the tow truck, his seatbelt buckled as he wore a baseball shirt. Travis became well known in the town and had been known to greet police officers they would encounter when towing cars.[13]\n",
        "type": []
    },
    "3": {
        "link": "/wiki/Canaan_Union_Depot",
        "title": "Canaan Union Depot",
        "date": "",
        "year": "",
        "location": "North Canaan, Connecticut",
        "state": "Connecticut",
        "place": "North Canaan",
        "county": "Northwest Hills COG",
        "paragraph": "The Canaan Union Depot, also known as the Union Depot, is located in Canaan Village, in the town of North Canaan, Connecticut, and is a former union station.  It was built in 1872 at the junction of the Housatonic Railroad and the Connecticut Western Railroad which was acquired by the Central New England Railway.[2]\nThe station was located at the level junction between the two rail lines, making an almost right angle at 85 degrees right at the crossover.  The angle of the building has a 3-story tower, at the top of which sat the electric telegraph operator.  The two 90-foot (27-meter) wings of the building were occupied by the two railroad companies. The first floor of the station had a large restaurant that was especially important before the development of the dining car. Eventually, both the Central New England and the Housatonic Railroad became a part of the New York, New Haven and Hartford Railroad. The New Haven was later merged into the Penn Central Transportation.[2]\nThe station had been a junction and transfer point for passengers shifting from north-south NYNHH trains (Berkshire Division) to east-west CNE trains (mainline: Campbell Hall to Springfield and Hartford). Passenger service on the CNE line through the station ended in 1927 when the NYNHH acquired the CNE.[3]\n",
        "type": []
    },
    "4": {
        "link": "/wiki/Victoria_Leigh_Soto",
        "title": "Victoria Leigh Soto",
        "date": "December 14, 2012 (aged 27) Newtown, Connecticut, U.S.",
        "year": "2012",
        "location": "",
        "state": "",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\nVictoria Leigh Soto (November 4, 1985 – December 14, 2012) was an American teacher who was killed in the Sandy Hook Elementary School shooting. After the gunman, Adam Lanza entered the school, she hid her students; when the students later ran from their hiding places, she was reportedly shot four times by Lanza and died trying to shield them with her body.[1][2] She has since been hailed as a hero.[3][4][2] She is a posthumous recipient of the Presidential Citizens Medal.\nPlans and petitions to honor her by name via scholarships, roads, and schools were announced in late 2012 and 2013.[5][6][7][8][9] The Stratford Town Council unanimously approved a resolution to name a school after Soto and the city of Bayamón, Puerto Rico, birthplace of Soto's father, is planning to name a public facility after her.[10]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "5": {
        "link": "/wiki/Helen_Curry",
        "title": "Helen Curry",
        "date": "November 15, 1931(1931-11-15) (aged 35) Norwalk, Connecticut, US",
        "year": "1931",
        "location": "",
        "state": "",
        "place": "Norwalk",
        "county": "Western Connecticut COG",
        "paragraph": "\nHelen Curry (October 22, 1896 – November 15, 1931) was an American stage actress.\nHelen Curry was born October 22, 1896, in Chester, Pennsylvania[1] to Thomas A. Curry and Sarah Jeffries both of whom were playwrights.[2] Curry had one brother, pulp fiction writer Tom Curry (1900-1976).[1]  In 1916, Curry married author F. R. Buckley.[3]\n",
        "type": []
    },
    "6": {
        "link": "/wiki/Hartford_circus_fire",
        "title": "Hartford circus fire",
        "date": "July 6, 1944 (1944-07-06)",
        "year": "1944",
        "location": "Hartford, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Hartford",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford circus fire, which occurred on July 6, 1944, in Hartford, Connecticut, was one of the worst fire disasters in United States history.[3] The fire occurred during an afternoon performance of the Ringling Bros. and Barnum & Bailey Circus that was attended by 6,000 to 8,000 people. The fire killed at least 167 people,[4] and more than 700 were injured.\nIn mid-20th century America, a typical circus traveled from town to town by train, performing under a huge canvas tent commonly called a \"big top\". The Ringling Brothers and Barnum & Bailey Circus was no exception; what made it stand out was that it was the largest circus in the country.\n",
        "type": [
            "arson"
        ]
    },
    "7": {
        "link": "/wiki/Suzanne_Jovin",
        "title": "Murder of Suzanne Jovin",
        "date": "December 4, 1998(1998-12-04) (aged 21) New Haven, Connecticut, United States",
        "year": "1998",
        "location": "",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "Suzanne Nahuela Jovin (January 26, 1977 – December 4, 1998) was a German senior at Yale University in New Haven, Connecticut, when she was brutally stabbed to death off campus. The city of New Haven and Yale University have offered a combined $150,000 for information that leads to the arrest and conviction of Jovin's killer.[1] The crime remains unsolved. At Yale, Jovin volunteered as a tutor through the Yale Tutoring in Elementary Schools program, sang in both the Freshman Chorus and the Bach Society Orchestra, co-founded the German Club, and worked for three years in the Davenport dining hall.[2]\nAfter dropping off the penultimate draft of her senior essay on the terrorist leader Osama bin Laden, at approximately 4:15 pm on Friday December 4, 1998, Suzanne Jovin began preparations for a pizza-making party she had organized at the Trinity Lutheran Church on 292 Orange Street for the local chapter of Best Buddies, an international organization that brings together students and mentally disabled adults. By 8:30 pm, after staying late to help clean up, she was driving another volunteer home in a borrowed university station wagon. Around 8:45, she returned the car to the Yale-owned lot on the corner of Edgewood Avenue and Howe Street, and proceeded to walk two blocks to her second-floor apartment at 258 Park Street, upstairs from a Yale police substation.\nSometime prior to 8:50 pm, a few friends passed by Jovin's window and asked her if she wanted to join them at the movies. Jovin declined, stating that she planned to do school work that night. At 9:02, Jovin logged onto her Yale e-mail account and told a female friend in German she was going to leave some GRE books for her in Jovin's apartment building's lobby, once she had retrieved them from an unnamed person who had borrowed them from her. She also provided the access code for her door. This unnamed person has never been identified.[3] Whether Jovin met this unnamed person that night remains unknown. At 9:10, she logged off. If she made or received any calls is unknown; calls within Yale's telephone system were not traceable. She wore the same soft, low-cut hiking boots, jeans, and maroon fleece pullover she had worn at the pizza party.[2]\n",
        "type": [
            "terrorist",
            "murder"
        ]
    },
    "8": {
        "link": "/wiki/Richard_Crafts",
        "title": "Murder of Helle Crafts",
        "date": "November 19, 1986 (aged 39) Newtown, Connecticut, U.S.",
        "year": "1986",
        "location": "",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "Helle Crafts  (English: /ˈhɛlə ˈkræfts/ (listen); born Helle Lorck Nielsen; July 7, 1947 – November 19, 1986) was a Danish flight attendant who was murdered by her husband, Eastern Air Lines pilot Richard Crafts. Her death led to the state of Connecticut's first murder conviction without the victim's body.[1][2]\nHelle Nielsen married Richard Crafts in 1975 and settled with him in Newtown, Connecticut, United States. Helle continued working as a flight attendant while raising their three children. In 1986, Helle began to suspect that Richard was engaged in extramarital sexual activity, and confronted him about suspicious long-distance phone calls, which angered Richard.[3] Helle met with a divorce attorney and hired a private investigator, Keith Mayo, who snapped photos of Richard kissing another flight attendant outside her New Jersey residence.[3]\nOn November 18, 1986, friends dropped Helle off at the couple's Newtown residence after she had worked a long flight from Frankfurt, West Germany. She was never seen again. That night, a snowstorm hit the area. The next morning, Richard said he was taking Helle and their children to his sister's house in Westport. When he arrived, Helle was not with him. Over the next few weeks, Richard gave Helle's friends a variety of stories as to why they were unable to reach her: that she was visiting her mother in Denmark, that she was visiting the Canary Islands with a friend, or that he simply did not know her whereabouts.[4] Helle's friends were aware that Richard had a volatile temper and grew concerned. Helle had told some of them, \"If something happens to me, don't assume it was an accident.\"[5][6] On December 1, the private investigator Keith Mayo reported her missing to the Newtown Police.[3] Richard Crafts was known to local law enforcement for his work as a volunteer police officer in Newtown, and in 1986 Crafts was working as a part-time police officer in the nearby town of Brookfield.[7] According to Mayo, Newtown Police initially dismissed his concerns, saying that Helle would probably return.[3]\n",
        "type": [
            "murder"
        ]
    },
    "9": {
        "link": "/wiki/Sandy_Hook:_An_American_Tragedy",
        "title": "Sandy Hook: An American Tragedy",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "Conspiracies.\nSocial media.\nTrue Crime / Murder / Mass Murder.\nSandy Hook: An American Tragedy and the Battle for Truth is a nonfiction book written by journalist Elizabeth Williamson and published in 2022 by Dutton, an imprint of Penguin Random House.[1][2][3][4][5][6]\nIn the book, Williamson presents evidence that the universe of counterfactual narratives that have become embedded in our society began with the Sandy Hook Elementary School shooting. Hence, according to the New York Times' book review, \"Williamson promises to connect the dots ... from that horrible December [2012] morning in Newtown to that despicable January [2021] afternoon in Washington when Donald Trump's supporters stormed the Capitol, leading to seven lost lives\".[1] Williamson additionally says that the proliferation of injurious Sandy Hook fictional truths led to Pizzagate, QAnon, and the 2021 United States Capitol attack.[3]\n",
        "type": [
            "mass murder",
            "murder",
            "shooting"
        ]
    },
    "10": {
        "link": "/wiki/Gulliver%27s_nightclub_fire",
        "title": "Gulliver's nightclub fire",
        "date": "June 30, 1974 (1974-06-30) Early Morning",
        "year": "1974",
        "location": "Port Chester, New York",
        "state": "Connecticut",
        "place": "Greenwich",
        "county": "Western Connecticut COG",
        "paragraph": "\nThe Gulliver's nightclub fire occurred in the early hours of June 30, 1974, on the border of Port Chester, New York and Greenwich, Connecticut. The fire killed 24 patrons and injured 19 patrons and 13 firemen.[1] The fire was caused by arson in an adjacent bowling alley that had been set to cover up a minor burglary there.\nThe restaurant was formally known as Gulliver's Restaurant Inc. and opened in 1971.[2] It attracted crowds of young people, particularly Connecticut residents, since while both states had a drinking age of 18, NY had last call much later. \"For decades, youths from southern Connecticut, where the drinking age was 18 since 1972, had flocked to this part-leafy, part-scruffy miniature city so they could take advantage of New York's later last call hour.\"[2] The restaurant was originally the Old Post Grill, but that burned in 1962; then it was Lucy's, which had a fire in 1968.[2] The building was owned by the Port Chester Electrical Construction Corporation.[3]\nThe building housing Gulliver's was on the border of Port Chester and Greenwich and so spanned the county and state line between Westchester County, New York and Fairfield County, Connecticut.[4] Gulliver's was a restaurant and bar with its entrance on the Greenwich side. Most of Gulliver's was considered on the New York side, and had been inspected by Port Chester fire authorities two months before the fire.[5] The other businesses in the building were considered to be in Greenwich and had not been inspected since 1964 when the last equipment was installed.[5]\n",
        "type": [
            "mass murder",
            "burglary",
            "murder",
            "arson"
        ]
    },
    "11": {
        "link": "/wiki/J._Henry_Roraback",
        "title": "J. Henry Roraback",
        "date": "",
        "year": "new 1849",
        "location": "",
        "state": "Connecticut",
        "place": "Sheffield",
        "county": "Western Connecticut COG",
        "paragraph": "\nJohn Henry Roraback (April 5, 1870 – May 19, 1937) was an American lawyer, businessman, and Republican political boss in the state of Connecticut. He was one of the most influential figures in early 20th century Connecticut, and had a national impact as well.\nRoraback's father John C. Roraback was a farmer, the descendant of German immigrants from one of several settlements named \"Rohrbach\" in Lorraine who had settled in Columbia County, New York around 1700. He moved his family to Sheffield, Massachusetts in the Berkshires around 1846. Henry (as he seems to have been usually called) was born in 1870 in Sheffield, Massachusetts. He was educated in the local Sheffield schools and then attended high school in Great Barrington. At 19 he moved to North Canaan, Connecticut, where a number of his much older siblings were already established. Living with a sister there, he taught school nearby and studied law with his brother Alberto T. Roraback (1849-1923), a lawyer then serving as a county judge. He was admitted to the bar in 1892.[1] He became a partner in his brother's prosperous practice.\n",
        "type": []
    },
    "12": {
        "link": "/wiki/Charles_B._McVay_III",
        "title": "Charles B. McVay III",
        "date": "November 6, 1968(1968-11-06) (aged 70) Litchfield, Connecticut",
        "year": "1968",
        "location": "",
        "state": "",
        "place": "Litchfield",
        "county": "Litchfield",
        "paragraph": "Charles Butler McVay III (August 31, 1898 – November 6, 1968) was an American naval officer and the commanding officer of the cruiser USS Indianapolis which was lost in action in 1945, resulting in a significant loss of life. Of all captains in the history of the United States Navy, he is the only one to have been subjected to court-martial for losing a ship sunk by an act of war, despite the fact that he was on a top secret mission maintaining radio silence (the testimony of the Japanese commander who sank his ship also seemed to exonerate McVay).[1] After years of mental health problems, he took his own life aged 70 years. Following years of efforts by some survivors and others to clear his name, McVay was posthumously exonerated by the 106th United States Congress and President Bill Clinton on October 30, 2000.\nCharles Butler McVay III was born in Ephrata, Pennsylvania, on August 31, 1898, to a Navy family.[2] His father, Charles Butler McVay Jr. (1868–1949), commanded the tender Yankton during the cruise of the Great White Fleet (1907–1909), was an admiral in the United States Navy during World War I, and served as Commander-in-Chief of the Asiatic Fleet in the early 1930s.\nCharles III was a 1920 graduate of the United States Naval Academy at Annapolis, Maryland. Before taking command of Indianapolis in November 1944, McVay was chairman of the Joint Intelligence Committee of the Combined Chiefs of Staff in Washington, D.C., the Allies' highest intelligence unit. Earlier in World War II, he was awarded the Silver Star for displaying courage under fire.\n",
        "type": []
    },
    "13": {
        "link": "/wiki/Reactions_to_the_Sandy_Hook_Elementary_School_shooting",
        "title": "Reactions to the Sandy Hook Elementary School shooting",
        "date": "",
        "year": "new 1996",
        "location": "",
        "state": "",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\nThe December 14, 2012, Sandy Hook Elementary School shooting—in which the perpetrator shot and killed his mother at home, 20 school children, 6 teachers, and then himself—received international attention. Governments and world leaders offered their condolences, while tributes and vigils by people were made in honor of the victims. U.S. President Barack Obama gave a televised address on the day of the shootings, saying, \"We're going to have to come together and take meaningful action to prevent more tragedies like this, regardless of the politics.\"[1] Obama paused twice during the address to compose himself and wipe away tears, and expressed \"enormous sympathy for families that are affected\".[2][3][4][5] He also ordered flags to be flown at half-staff at the White House and other U.S. federal government facilities worldwide in respect for the victims.[6] Three days after the massacre, 151,000 Americans had signed up at the Obama administration's We the People petitioning website in support of a renewed national debate on gun control.[7] Obama attended and spoke at an interfaith vigil on December 16 in Newtown, Connecticut.[8]\nThere were tributes and vigils by people in Moscow, Bangalore,[43] Karachi[44] and in Monrovia, Liberia.[45] An organized candlelight vigil was held in India and a makeshift memorial set up at the U.S. embassy in Moscow.[46][47][48] Media in the United Kingdom compared the shooting to the Dunblane school massacre, another school shooting that occurred in 1996, in which 16 children and one teacher were killed before the shooter, 43-year-old Thomas Hamilton, committed suicide.[49] In the Marshall Islands students of Majuro Cooperative school dressed in the green and white colors of Sandy Hook Elementary and presented a condolence card to the American ambassador.[50]\nIn the Canadian province of Ontario, then-Premier Dalton McGuinty announced a \"locked door\" policy, as part of a Safe Welcome Program at all elementary schools as of September 2013.[51] About 2,450 elementary schools applied for and received funding from the province to install front-door buzzers and security cameras. Together with the 850 schools that installed them with provincial funding in 2005, the new equipment means about 80 per cent of Ontario's 4,000 elementary schools will have secured front doors.[52] In the Greater Toronto Area, 1,287 schools received funding through their 12 school boards such as the Toronto Catholic District School Board, Toronto District School Board, Durham Catholic District School Board, and York Region District School Board.\n",
        "type": [
            "shooting"
        ]
    },
    "14": {
        "link": "/wiki/Ken_Purdy",
        "title": "Ken Purdy",
        "date": "June 7, 1972(1972-06-07) (aged 59) Wilton, Connecticut",
        "year": "1972",
        "location": "",
        "state": "",
        "place": "Wilton",
        "county": "Western Connecticut COG",
        "paragraph": "Kenneth William Purdy (April 28, 1913 – June 7, 1972)[1] was an American automotive writer and editor.\nHe was born in Chicago, Illinois in 1913, and raised mostly in Auburn, New York, by his mother after his father, songwriter William Thomas Purdy (1882–1918) (On, Wisconsin!) died when Ken was only six. Ken graduated in 1934 from the University of Wisconsin–Madison. Soon after he got his first newspaper job with the Athol, Massachusetts Daily News. From there he went to Oshkosh, Wisconsin, to the Chicago Radio Guide, to associate editor of Look, and to the United States Office of War Information as editor of Victory during World War II. He was an editor at Parade, Car and Driver, Argosy and True magazines between the late '40s and mid '50s. He wrote articles and fiction under the pseudonym Karl Prentiss.\nPurdy's main interests were automobiles and the people who drove them. Among other works, he produced 35 short stories and scores of automotive pieces for Playboy. He won Playboy's annual writers' award three times. His Kings of the Road, published in 1952, is still a landmark.\n",
        "type": []
    },
    "15": {
        "link": "/wiki/Wendy_O._Williams",
        "title": "Wendy O. Williams",
        "date": "April 6, 1998(1998-04-06) (aged 48) Storrs, Connecticut, U.S.",
        "year": "1998",
        "location": "",
        "state": "",
        "place": "Storrs",
        "county": "Capitol Region COG",
        "paragraph": "\nWendy Orlean Williams (May 28, 1949 – April 6, 1998) was an American singer, best known as the lead singer of the punk rock band Plasmatics. She was noted for her onstage theatrics, which included partial nudity, exploding equipment, firing a shotgun, and chainsawing guitars.[1] Performing her own stunts in videos,[2] she often sported a mohawk hairstyle. In 1985, during the height of her popularity as a solo artist, she was nominated for a Grammy Award for Best Female Rock Vocal Performance.\nLeaving home at 16, Williams hitchhiked to Colorado, earning money by crocheting string bikinis. She travelled to Florida and Europe landing various jobs such as lifeguard, stripper, macrobiotic cook, and server at Dunkin' Donuts. After arriving in New York City in 1976, she began performing in live sex shows, and in 1979 appeared in the pornographic film Candy Goes to Hollywood. That year manager Rod Swenson recruited her to the Plasmatics, and the two became romantically involved. The band quickly became known on the local underground scene, performing at clubs such as CBGB.\n",
        "type": []
    },
    "16": {
        "link": "/wiki/Omar_Thornton",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "year": "2010",
        "location": "Manchester, Connecticut, USA",
        "state": "Connecticut",
        "place": "Manchester",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\nThornton, aged 34, was called into his place of employment for disciplinary purposes. Thornton had been recorded on surveillance video in the Hartford Distributors warehouse stealing beer on a previous occasion. He was also implicated in the theft of empty beer kegs.[9] Hartford Distributors is a wholesale distributor of Budweiser beer products and wine. Given the options of being fired or resigning, Thornton signed the resignation papers and was being escorted out of the building. Instead of leaving, he took a Ruger SR9 semi-automatic pistol from his lunchbox and opened fire.\n",
        "type": [
            "theft",
            "murder",
            "mass murder",
            "mass shooting",
            "shooting"
        ]
    },
    "17": {
        "link": "/wiki/Sandy_Hook_Elementary_School_shooting_conspiracy_theories",
        "title": "Sandy Hook Elementary School shooting conspiracy theories",
        "date": "",
        "year": "new 2012",
        "location": "",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\n\n\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut. The perpetrator, Adam Lanza, fatally shot his mother before murdering 20 students and six staff members at Sandy Hook Elementary School, and later committed suicide.[1] A number of fringe figures have promoted conspiracy theories that doubt or dispute what occurred at Sandy Hook. Various conspiracy theorists have claimed, for example, that the massacre was actually orchestrated by the U.S. government as part of an elaborate plot to promote stricter gun control laws.[2]\nThe more common conspiracy theory, adopted initially by James H. Fetzer, James Tracy, and others, and further popularized by Alex Jones, denied that the massacre actually occurred, asserting that it was faked. The massacre was described by Fetzer and Tracy as a classified training exercise involving members of federal and local law enforcement, the news media, and crisis actors, which they claim was modeled on Operation Closed Campus, an Iowa school-shooting drill that was canceled in 2011 amid threats and public outcry. Jones described the shooting incident as \"synthetic, completely fake with actors; in my view, manufactured [...] it just shows how bold they are that they clearly used actors.\"[3][4]\nNo evidence supports the conspiracy theories, which make a number of implausible claims.[5][6][7] Moreover, many Sandy Hook conspiracy theories contradict one another.[6] A number of sources have published articles debunking various claims put forward by conspiracy theorists.[6][8][9][10] In 2018, the parents of several children killed in the Sandy Hook shooting launched a lawsuit against Jones and other authors of conspiracy videos for defamation, accusing them of engaging in a campaign of \"false, cruel, and dangerous assertions\".[11] In 2019, Jones reversed his stance and stated that the massacre was real.[12]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "18": {
        "link": "/wiki/Cheshire_home_invasion_murders",
        "title": "Cheshire home invasion murders",
        "date": "July 23, 2007; 15 years ago (2007-07-23)",
        "year": "2007",
        "location": "Cheshire, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Cheshire",
        "county": "Naugatuck Valley COG",
        "paragraph": "\nOn July 23, 2007, Linda Hayes (born Steven Hayes) and Joshua Komisarjevsky invaded the residence of the Petit family in Cheshire, Connecticut. Though initially planning only to rob the house, she[b] and Komisarjevsky murdered Jennifer Hawke-Petit and her two daughters, 17-year-old Hayley Petit and 11-year-old Michaela Petit. Their father Dr. William Petit escaped with severe injuries.\nUpon entering the Petits' home, Komisarjevsky beat Dr. Petit with a baseball bat and the pair restrained him in the basement. Hawke-Petit and her daughters were also restrained. Hayes later kidnapped Hawke-Petit and forced her to withdraw money at a bank. After returning to the home, Hayes raped her and strangled her to death. Komisarjevsky raped 11-year-old Michaela. The invaders then decided to burn down the house to destroy evidence. With Hayley and Michaela tied to their beds, the invaders doused them and the house with gasoline and set it on fire, leaving them to die of smoke inhalation.[4]\n",
        "type": [
            "rape",
            "kidnapped",
            "murder",
            "arson"
        ]
    },
    "19": {
        "link": "/wiki/New_Haven_Black_Panther_trials",
        "title": "New Haven Black Panther trials",
        "date": "1970-71",
        "year": "1970",
        "location": "New Haven, Connecticut",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "Rulings\nIn 1969-1971 there was a series of criminal prosecutions in New Haven, Connecticut, against various members and associates of the Black Panther Party.[1]  The charges ranged from criminal conspiracy to first-degree murder.  All charges stemmed from the murder of 19-year-old Alex Rackley in the early hours of May 21, 1969.  The trials became a rallying-point for the American Left, and marked a decline in public support, even among the black community, for the Black Panther Party.\nOn May 17, 1969, members of the Black Panther Party kidnapped fellow Panther Alex Rackley, who had fallen under suspicion of informing for the FBI.  He was held captive at the New Haven Panther headquarters on Orchard Street, where he was tortured and interrogated until he confessed. His interrogation was tape recorded by the Panthers.[2]  During that time, national party chairman Bobby Seale visited New Haven and spoke on the campus of Yale University for the Yale Black Ensemble Theater Company.[3]  The prosecution alleged, but Seale denied, that after his speech, Seale briefly stopped by the headquarters where Rackley was being held captive and ordered that Rackley be executed.\nEarly in the morning of May 21, three Panthers – Warren Kimbro, Lonnie McLucas, and George Sams, one of the Panthers who had come East from California to investigate the police infiltration of the New York Panther chapter, drove Rackley to the nearby town of Middlefield, Connecticut.  Kimbro shot Rackley once in the head and McLucas shot him once in the chest.  They dumped his corpse in a swamp, where it was discovered the next day.\nNew Haven police immediately arrested eight New Haven area Black Panthers.  Sams and two other Panthers from California were captured later.\n",
        "type": [
            "kidnapped",
            "torture",
            "murder"
        ]
    },
    "20": {
        "link": "/wiki/Phillip_Musica",
        "title": "Phillip Musica",
        "date": "December 16, 1938(1938-12-16) (aged 60–61) Fairfield, Connecticut",
        "year": "1938",
        "location": "",
        "state": "",
        "place": "Fairfield",
        "county": "Greater Bridgeport COG",
        "paragraph": "Philip Mariano Fausto Musica (1877 – December 16, 1938), also known as F. Donald Coster, was an Italian swindler whose criminal career spanned parts of three decades. His various crimes included tax fraud, bank fraud, and bootlegging. However, he is best known as the mastermind of the McKesson & Robbins scandal of 1938, one of the largest financial scandals ever perpetuated by a single person.\nMusica was born in 1877 in Naples to Antonio and Maria Musica. He moved to New York City at the age of seven and grew up in Mulberry's Bend, a rough neighborhood in Little Italy. Philip would eventually have three brothers and a sister. As a boy, Musica admired Theodore Roosevelt, at the time the city's hard-charging police commissioner.\nMusica dropped out of school at the age of 14 to help out at his father's small grocery store, A. Musica and Son. Within two years, he was running the store. He soon left day-to-day operations to his younger brother Arthur while turning his own attention to building an import-export operation. By importing cheese, olive oil, and spices directly from Italy (as opposed to using a middleman), he was able to underprice his competitors. Within a few years, A. Musica and Son was one of the largest importers of Italian food in New York, grossing a half-million dollars a year. The Musicas moved to a home in Bay Ridge in Brooklyn and became leaders of the city's Italian community.\n",
        "type": []
    },
    "21": {
        "link": "/wiki/Charles_Henry_Crandall",
        "title": "Charles Henry Crandall",
        "date": "March 23, 1923(1923-03-23) (aged 64) Stamford, Connecticut",
        "year": "1923",
        "location": "",
        "state": "Connecticut",
        "place": "Stamford",
        "county": "Western Connecticut COG",
        "paragraph": "Charles Henry Crandall (June 19, 1858 – March 23, 1923) was an American author and poet. He was a noted farmer and had become active in real estate having amassed 270 acres (1.1 km2) in Stamford by 1910. Crandall was a member of the American Institute of Arts, Science and Letters, a council member of the Stamford Rural Association, and a member of the Stamford Historical Society.\nCrandall's father served in various capacities as a public official within the state of New York. These included as a member of the legislature, assistant assessor, internal revenue collector, money order clerk in the post office and a number of positions in the New York Custom House. Crandall attended Greenwich Academy, but did not matriculate from an institution of higher learning. After spending the first seventeen years of his life as a farmer, he went into the mercantile business for five years, then began a literary career.[1]\nAfter working as a reporter for the New York Tribune and the New York Globe, he moved to Connecticut in 1886 as a result of ill health.  He called his tenure with New York with the roles of reporter, correspondent and editor, his \"university years\". In 1890 he published \"Representative Sonnets by American Poets\" with an exhaustive essay on the sonnet. Thereafter, he published a number of volumes of his own works from collections previously printed in newspapers and magazines in America. These publications included The Century Magazine, Harper's, Atlantic Monthly, The Outlook (New York), Independent, Critic, Lippincott's Monthly Magazine, North American Review, and Outing, along with others.[2] His early collections often had a rural theme and his poems and prose would often involve farming life, as he became a serious farmer. A 1914 article in Guide to Nature Magazine[2] gave him the moniker \"Crandall - the Farmer-Poet\".\n",
        "type": []
    },
    "22": {
        "link": "/wiki/Edwin_Snelgrove",
        "title": "Edwin Snelgrove",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Hartford",
        "county": "Capitol Region COG",
        "paragraph": "Edwin \"Ned\" Snelgrove (born Edwin Fales Snelgrove, Jr.; August 9, 1960) is an American double-murderer who is currently serving a 60-year sentence for the murder of a Hartford, Connecticut woman, Carmen Rodriguez. He was also previously convicted of the 1983 killing of his former girlfriend Karen Osmun and the 1987 attack on Mary Ellen Renard. Snelgrove is incarcerated at the Cheshire Correctional Institution in Cheshire, Connecticut. He is scheduled for release October 14, 2063, when he will be 103 years old.[1]\nIn 1983, the 23-year-old Snelgrove had previously been dating Karen Osmun from New Brunswick, New Jersey, also 23.[2] Karen was a graduate student at Rutgers University, studying computers. On December 24, 1983, Karen was reported missing by her parents after she failed to show up at their home for dinner in Bricktown, New Jersey. The next day, her body was found in her apartment on her bedroom floor. She had been stabbed with a knife several times to death. She was also strangled.[3] Karen's ex-boyfriend, Ned Snelgrove, was the prime suspect in her murder, but was not charged until several years later, after attacking another New Jersey woman. In 1988, Snelgrove wrote \"I could not stop my hands from squeezing her throat as hard as I could\" about killing Karen Osmun.[2]\nIn August 1987, Snelgrove encountered a 44-year-old divorcee named Mary Ellen Renard at a New Jersey nightclub. Snelgrove and Mary Ellen conversed over the course of the night. Snelgrove had told Mary Ellen that he was a recent Rutgers graduate working at HP. At the end of the night, when Mary Ellen was preparing to leave, her car would not start. Snelgrove helped her get her car started, and offered to follow her home to make sure she arrived there safely. When they got back to Mary Ellen's Elmwood Park, New Jersey apartment, Snelgrove asked to use her bathroom, so she let him in. After getting into Mary Ellen's apartment, Snelgrove sexually assaulted and stabbed her several times. Mary Ellen fought back and was able to get into the apartment below her, whose owner called the police. Mary Ellen survived the attack, and was able to identify Snelgrove as her attacker. He was later apprehended and charged.[4] Snelgrove wrote the following in a 1992 letter about the assault on Mary Ellen Renard: \"I botched it up. She didn't die. If she had died, my name wouldn't have even made the suspect list\".[2]\n",
        "type": [
            "killing",
            "murder",
            "assault"
        ]
    },
    "23": {
        "link": "/wiki/Osborn_Correctional_Institution",
        "title": "Osborn Correctional Institution",
        "date": "",
        "year": "",
        "location": "335 Bilton Road, Somers, Connecticut 06071",
        "state": "Connecticut",
        "place": "Somers",
        "county": "Capitol Region COG",
        "paragraph": "Osborn Correctional Institution (OCI), formerly known as the Connecticut Correctional Institution – Somers,[1] is a medium security state prison that includes a high security mental health unit for men of the Connecticut Department of Correction located in Somers, Connecticut. It has capacity of 1900 inmates, making it amongst the largest prisons in the state and one of the oldest operational facilities in Connecticut.\nIt housed the state's execution chamber[2] until 2015, when capital punishment was declared unconstitutional.[3] It also housed the male death row inmates until 1995 when they were transferred to the nearby Northern Correctional Institution.[4]\nOCI was opened in November 1963, it served as a replacement for Old Wethersfield State Prison, it was originally the state's maximum-security prison until 1994 when it was declared into medium security prison.\n",
        "type": []
    },
    "24": {
        "link": "/wiki/Steven_Pladl_triple_murder_and_suicide",
        "title": "Steven Pladl triple murder and suicide",
        "date": "April 11 to 12, 2018",
        "year": "2018",
        "location": "Knightdale, North Carolina, U.S. (murder of Bennett)New Milford, Connecticut, U.S.(double-murder)Dover, New York, U.S. (suicide)",
        "state": "Connecticut",
        "place": "New Milford",
        "county": "Western Connecticut COG",
        "paragraph": "On April 12, 2018, Steven Walter Pladl, a 43-year old man from Knightdale, North Carolina, murdered his biological daughter, 20-year old Katie Rose Fusco Pladl, whom he had engaged in an incestuous relationship with, and her adoptive father, 56-year old Anthony Charles Fusco, in New Milford, Connecticut. He later committed suicide in Dover, New York. He had murdered his and Katie's 7-month old child, Bennett Kieron Pladl, the day prior in Knightdale.\nIn 1995, then-20-year old Steven Pladl met and groomed then-15-year old Alyssa over the internet. He traveled to San Antonio, Texas to begin a sexual relationship with her, and Alyssa ran away with Steven to live with him in New York. Alyssa became pregnant at 16 and gave birth to their first child at 17, whom they named Denise Pladl. According to Alyssa, Pladl inflicted torturous abuse upon Denise by pinching her, beating her until she was \"black and blue\", and drowning her. Alyssa decided to put Denise up for adoption, because she believed Denise would not have a chance at life while living with Steven.[1][2][3][4]\nAnthony and Kelly Fusco adopted Denise and renamed her Katie Rose Fusco. When Katie was 18 in August 2016, she reached out to her biological parents, Steven and Alyssa Pladl, on Facebook, and they met in Knightdale, North Carolina. Katie decided to move in with Steven, Alyssa, and their other two children, a decision which her adoptive parents were apprehensive about, but supported her. By the time Katie moved in, Steven and Alyssa had made the decision to separate and were sleeping in separate bedrooms. Steven and Katie became incredibly close, and when confronted by Alyssa, Steven told her it was not her business and stormed out of the house with Katie. Alyssa moved out in November 2016 and her and Steven shared custody of the other two children.[1]\n",
        "type": [
            "murder"
        ]
    },
    "25": {
        "link": "/wiki/Walt_McDougall",
        "title": "Walt McDougall",
        "date": "March 6, 1938(1938-03-06) (aged 80) Waterford, Connecticut",
        "year": "1938",
        "location": "",
        "state": "",
        "place": "Waterford",
        "county": "Southeastern Connecticut COG",
        "paragraph": "Walter Hugh McDougall (February 10, 1858 – March 6, 1938) was an American cartoonist. He produced some of the earliest full color newspaper comic strips, and was one of the first producers of regular political cartoons in American daily papers.[1][2] His satirical cartoons, published in outlets such as the New York World and The North American, were influential in the 1884 U.S. presidential election, and soon after political cartoons became a fixture in American papers. He also drew children's comic strips, including Queer Visitors from the Marvelous Land of Oz written by L. Frank Baum, and has been called the first syndicated cartoonist for his contributions to the weekly columns of humorist Bill Nye. His books include The Hidden City (1891) and The Rambillicus Book (1903).\nWalter Hugh McDougall was born in Newark, New Jersey, the son of John Alexander McDougall (1810–1894),[3] a painter and close associate of writers such as Edgar Allan Poe and Washington Irving.[4] Walt attended a military academy, and from the age of 16 was self-educated. He began his professional work in 1876 with the New York Daily Graphic, which three years earlier had become the nation's first illustrated daily newspaper. He also sold early works to Harper's Weekly and Puck.[5][6] For a time he was part owner of the Newark newspaper The Suburban.[7] He married Mary F. Burns in 1878.[6][8]\nHe began working for the New York World in 1884, and a cartoon printed on August 10 of that year became the World's first political cartoon.[9] Several of his cartoons were influential in the 1884 presidential election. One, likening nominee James G. Blaine's dinner with millionaires and plutocrats shortly before the election to Belshazzar's feast of the Bible, is credited with contributing to Blaine's narrow loss to Grover Cleveland. The cartoon, entitled \"The Royal Feast of Belshazzar Blaine and the Money Kings\" and co-drawn by Valerian Gribayedoff, was reprinted on billboards across New York and Blaine lost the state, and thus the election, by little over 1,000 votes.[10] Author Michael R. Smith writes McDougall and Gribayedoff \"may have created the most influential political cartoon in United States history.\"[11] \"Belshazzar Blaine and the Money Kings\" elevated the prominence of political cartoons, which soon after became a regular feature in daily newspapers nationwide.[12][13][14]\n",
        "type": []
    },
    "26": {
        "link": "/wiki/Alex_Rackley",
        "title": "Alex Rackley",
        "date": "May 20, 1969 (aged 19) Middlefield, Connecticut, U.S.",
        "year": "1969",
        "location": "",
        "state": "Connecticut",
        "place": "Middlefield",
        "county": "Lower Connecticut River Valley COG",
        "paragraph": "Alex Rackley (June 2, 1949 – May 20, 1969)[1] was an American activist who was a member of the New York chapter of the Black Panther Party (BPP) in the late-1960s. In May 1969, Rackley was suspected by other Panthers of being a police informant. He was brought to Panther headquarters in New Haven, Connecticut, held captive and tortured there for several days, condemned to death, taken to the wetlands of Middlefield, Connecticut, and murdered there.[2]\nHis killing was the crime at the center of the 1970 New Haven Black Panther trials.\nRackley was born and raised in Jacksonville, Florida. He was one of eight siblings and grew up in the Mixon Town neighborhood. He attended Stanton Vocational High School before dropping out.[3]\n",
        "type": [
            "torture",
            "killing",
            "murder"
        ]
    },
    "27": {
        "link": "/wiki/Murder_of_Suzanne_Jovin",
        "title": "Murder of Suzanne Jovin",
        "date": "December 4, 1998(1998-12-04) (aged 21) New Haven, Connecticut, United States",
        "year": "1998",
        "location": "",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "Suzanne Nahuela Jovin (January 26, 1977 – December 4, 1998) was a German senior at Yale University in New Haven, Connecticut, when she was brutally stabbed to death off campus. The city of New Haven and Yale University have offered a combined $150,000 for information that leads to the arrest and conviction of Jovin's killer.[1] The crime remains unsolved. At Yale, Jovin volunteered as a tutor through the Yale Tutoring in Elementary Schools program, sang in both the Freshman Chorus and the Bach Society Orchestra, co-founded the German Club, and worked for three years in the Davenport dining hall.[2]\nAfter dropping off the penultimate draft of her senior essay on the terrorist leader Osama bin Laden, at approximately 4:15 pm on Friday December 4, 1998, Suzanne Jovin began preparations for a pizza-making party she had organized at the Trinity Lutheran Church on 292 Orange Street for the local chapter of Best Buddies, an international organization that brings together students and mentally disabled adults. By 8:30 pm, after staying late to help clean up, she was driving another volunteer home in a borrowed university station wagon. Around 8:45, she returned the car to the Yale-owned lot on the corner of Edgewood Avenue and Howe Street, and proceeded to walk two blocks to her second-floor apartment at 258 Park Street, upstairs from a Yale police substation.\nSometime prior to 8:50 pm, a few friends passed by Jovin's window and asked her if she wanted to join them at the movies. Jovin declined, stating that she planned to do school work that night. At 9:02, Jovin logged onto her Yale e-mail account and told a female friend in German she was going to leave some GRE books for her in Jovin's apartment building's lobby, once she had retrieved them from an unnamed person who had borrowed them from her. She also provided the access code for her door. This unnamed person has never been identified.[3] Whether Jovin met this unnamed person that night remains unknown. At 9:10, she logged off. If she made or received any calls is unknown; calls within Yale's telephone system were not traceable. She wore the same soft, low-cut hiking boots, jeans, and maroon fleece pullover she had worn at the pizza party.[2]\n",
        "type": [
            "terrorist",
            "murder"
        ]
    },
    "28": {
        "link": "/wiki/Craig_Pepin",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "year": "2010",
        "location": "Manchester, Connecticut, USA",
        "state": "Connecticut",
        "place": "Manchester",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\nThornton, aged 34, was called into his place of employment for disciplinary purposes. Thornton had been recorded on surveillance video in the Hartford Distributors warehouse stealing beer on a previous occasion. He was also implicated in the theft of empty beer kegs.[9] Hartford Distributors is a wholesale distributor of Budweiser beer products and wine. Given the options of being fired or resigning, Thornton signed the resignation papers and was being escorted out of the building. Instead of leaving, he took a Ruger SR9 semi-automatic pistol from his lunchbox and opened fire.\n",
        "type": [
            "theft",
            "murder",
            "mass murder",
            "mass shooting",
            "shooting"
        ]
    },
    "29": {
        "link": "/wiki/Michael_Bruce_Ross",
        "title": "Michael Bruce Ross",
        "date": "May 13, 2005(2005-05-13) (aged 45) Osborn Correctional Institution, Somers, Connecticut, U.S.",
        "year": "2005",
        "location": "",
        "state": "Connecticut",
        "place": "Putnam",
        "county": "Northeastern Connecticut COG",
        "paragraph": "Michael Bruce Ross (July 26, 1961 – May 13, 2005) was an American serial killer. In 2005, he was executed by the state of Connecticut. Connecticut ended capital punishment in 2012, and the Connecticut Supreme Court ruled capital punishment unconstitutional in 2015, converting the sentences of the state's remaining death row inmates to life in prison without parole.[1]\nRoss was born in Putnam, Connecticut, on July 26, 1959, to Patricia Hilda Laine and Dan Graeme Ross. He was the oldest of four children, having two younger sisters and a younger brother. The family lived on a chicken farm in Brooklyn, Connecticut. Ross's home life was extremely dysfunctional; his mother, who abandoned the family at least once, had been institutionalized and beat all four of her children, saving the worst treatment for him. Some family and friends have suggested that he was also molested by his teenaged uncle, who committed suicide when Ross was six.[2]\nHe was a bright boy who performed well in school. He graduated from Killingly High School in Killingly, Connecticut, in 1977,[3] and graduated from Cornell University in Ithaca, New York, where he studied economics, in May 1981.[4][5] He became an insurance salesman. He exhibited antisocial behavior from a young age. Ross began stalking women in his sophomore year of college and, in his senior year, he committed his first rape followed by his first murder soon after.\n",
        "type": [
            "rape",
            "killing",
            "murder"
        ]
    },
    "30": {
        "link": "/wiki/Matthew_Steven_Johnson",
        "title": "Matthew Steven Johnson",
        "date": "",
        "year": "new 2000",
        "location": "",
        "state": "",
        "place": "Hartford",
        "county": "Capitol Region COG",
        "paragraph": "Matthew Steven Johnson (born May 24, 1963) is an American serial killer and rapist who murdered at least three female sex workers from 2000 to 2001. He is also suspected in the deaths of another two women, but hasn't been charged in their deaths. Johnson was convicted of the three murders and was sentenced to 180 years in prison.[1]\nBorn into a family that included nine other siblings, Johnson, a twin, grew up in Hartford's Blue Hills and Asylum Hill neighborhoods. At 12, he lost sight in one eye when he was shot with a pellet gun. He was described as a very sweet child, but exhibited immature behavior, such as sucking his thumb when asked to do something he did not want to do. His kindergarten teacher later stated to a psychologist that he was highly aggressive and unable to cope with denial.[2]\nBy the time he was a teenager, he had been admitted to the Connecticut Children's Medical Center and repeatedly evaluated. Although he was noted for doing well in music and physical education, Johnson had a limited academic ability due to his intellectual disability and also suffered from seizures, which had to be medicated. His recorded IQ is 69.[2]\n",
        "type": [
            "murder"
        ]
    },
    "31": {
        "link": "/wiki/Execution_of_George_Spencer",
        "title": "Execution of George Spencer",
        "date": "April 8, 1642 (aged 41-42) Connecticut, British America",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Boston",
        "county": "Western Connecticut COG",
        "paragraph": "George Spencer (c. 1600 – April 8, 1642) was the second person in history to be executed in Connecticut. He was executed by hanging for charges of sodomy after being wrongfully convicted for an alleged sexual act with an animal, in which it was erroneously claimed that Spencer had fathered a female pig's offspring. His hanging was the first wrongful execution in Connecticut's history.\nAfter a review of the case in 2015, Spencer was given a posthumous pardon by Superior Court Judge John C. Blue, concluding that Spencer's confession was coerced and thus inadmissible, while also stating that Spencer's alleged crime of fathering a piglet was \"biologically impossible\". Spencer's case was described by Blue as the \"first verifiable false confession in American history\".[1]\nGeorge Spencer is described as an ugly, balding servant with a glass eye.[2][3]  He is believed to have lived for a time in Boston and while there was found guilty of receiving stolen goods.[2]  His punishment was a flogging. He then moved to the New Haven Colony,[2] and continued to be a \"habitual troublemaker\".[3]  He was open about his lack of faith, never praying in the years of being in Connecticut and only reading the Bible when forced to by his master.[2][4]\n",
        "type": [
            "sex crime"
        ]
    },
    "32": {
        "link": "/wiki/Alse_Young",
        "title": "Alse Young",
        "date": "May 26, 1647 (aged 31–32) Meeting House Square?, Windsor, Connecticut",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Windsor",
        "county": "Capitol Region COG",
        "paragraph": "Alse Young (1615[1] – 26 May 1647) of Windsor, Connecticut — sometimes Achsah Young or Alice Young — was the first recorded instance of execution for witchcraft in the thirteen American colonies. She had one child, Alice Beamon (Young), born in 1640,[2] who was also condemned for the same crime thirty years later in the 1670s, but was not hanged.\nAlse Young was born in 1615 in New Windsor, Berkshire, England[1] and moved to Windsor, Connecticut during the 1630s.[1] She is believed to have been the wife of John Young,[3] who bought a small parcel of land in Windsor in 1641, sold it in 1649, and then disappeared from the town records.[4] The best evidence to suggest that John Young was her husband comes from a physician.[5] She had a daughter, Alice Young Beamon, who was accused of witchcraft in nearby Springfield, Massachusetts, some 30 years later.[4] Her daughter Alice Young Beamon married and had children with Simon Beamon.[5] Similarly to her mother, Alice Young Beamon was also accused of witchcraft but defended herself by claiming that she was being slandered.[5] Even though Alice Young was a woman without a son when the witchcraft accusation was lodged, her husband was still alive during her accusation. This makes it unlikely that she was accused simply for the possibility of inheriting her husband's estate in the future. Other reasons are more probable.\nThere is no record of Young's trial or the specifics of the charge. The same year that Alice was hanged the death rate had steadily increased.[5] The influenza affected everyone in that even wealthy people with more resources and access to medical care were dying at extremely high rates.[5] Many prominent members of the noble class and legislature lost their families.[5] Given such circumstances, a member of the elite class may have organized for someone to be hanged and scapegoated, leading to Alice's being chosen at random. She may have been hanged at the Meeting House Square in Hartford, Connecticut, now the site of the Old State House, since a jail was on the edge of the square. A journal of then Massachusetts Bay Colony Governor John Winthrop mentions \"One... of Windsor arraigned and executed at Hartford for a witch.\"[6] The second town clerk of Windsor, Matthew Grant, confirms her execution with the May 26, 1647, diary entry, \"Alse Young was hanged.\" She was roughly 32 years old when she was hanged.\n",
        "type": []
    },
    "33": {
        "link": "/wiki/Kay_Sage",
        "title": "Kay Sage",
        "date": "January 8, 1963(1963-01-08) (aged 64) Woodbury, Connecticut",
        "year": "1963",
        "location": "",
        "state": "",
        "place": "Woodbury",
        "county": "Naugatuck Valley COG",
        "paragraph": "\nKatherine Linn Sage (June 25, 1898 – January 8, 1963), usually known as Kay Sage, was an American Surrealist artist and poet active between 1936 and 1963. A member of the Golden Age and Post-War periods of Surrealism, she is mostly recognized for her artistic works, which typically contain themes of an architectural nature.\nSage was born in Albany, New York, into a family made wealthy from the timber industry.[1] Her father, Henry M. Sage, was a state assemblyman the year after her birth and later was a five-term state senator. Her mother was Anne Wheeler (Ward) Sage. Sage had an elder sister, Anne Erskine Sage.[2]\n",
        "type": []
    },
    "34": {
        "link": "/wiki/John_Talbott_Donoghue",
        "title": "John Talbott Donoghue",
        "date": "",
        "year": "new 1903",
        "location": "",
        "state": "",
        "place": "Chicago",
        "county": "Southeastern Connecticut COG",
        "paragraph": "John Talbott Donoghue (1853 – July 1, 1903) was an American artist who was born in Chicago.  Although he produced figural sculpture, bas reliefs and paintings, his fame rests primarily on a single bronze sculpture, \"The Young Sophocles\".  This bronze was originally cast in 1885, but later castings are known to exist.  It is a full-length nude sculpture of the Greek dramatist Sophocles playing a lyre while leading the chorus of victory after the Battle of Salamis in 480 BCE.  John Talbott Donoghue shot himself on July 1, 1903, in Lake Whitney, Connecticut.[1]\nThe Honolulu Museum of Art and the Metropolitan Museum of Art are among the public collections holding works by John Talbott Donoghue.  The latter’s The Young Sophocles Leading the Chorus of Victory after the Battle of Salamis is on long-term loan to the Federal Reserve Bank of New York.\nDuring his 1882 lecture tour of North America Oscar Wilde met Donoghue and encouraged Chicagoans to support one \"whose work is beautiful — more beautiful than the work of any sculptor I have seen yet, and of whom you should all be proud.\"[2] His work was also part of the sculpture event in the art competition at the 1928 Summer Olympics.[1]\n",
        "type": []
    },
    "35": {
        "link": "/wiki/Capital_punishment_in_Connecticut",
        "title": "Capital punishment in Connecticut",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Connecticut Colony",
        "county": "South Central COG",
        "paragraph": "\nCapital punishment in Connecticut formerly existed as an available sanction for a criminal defendant upon conviction for the commission of a capital offense. Since the 1976 United States Supreme Court decision in Gregg v. Georgia until Connecticut repealed capital punishment in 2012, Connecticut had only executed one person, Michael Bruce Ross in 2005. Initially, the 2012 law allowed executions to proceed for those still on death row and convicted under the previous law, but on August 13, 2015, the Connecticut Supreme Court ruled that applying the death penalty only for past cases was unconstitutional.[1]\nBetween 1639 and 2005, Connecticut performed 126 executions. Twenty-four executions occurred in Connecticut Colony, prior to its statehood. The remaining 102 executions occurred after Connecticut's 1788 admission to the Union as the fifth state.[2] Contrary to popular belief, Adonijah Bailey was not the oldest person ever to be executed in Connecticut, at age 79 in 1824; instead, he was tried and sentenced to death at age 80 in January 1825 for the murder of Jeremiah W. Pollock, and hanged himself on May 24, over two weeks before he was to be executed.[3][4] The oldest person ever to be executed in Connecticut is Gershon Marx, who was hanged for murder at the age of 73, on May 18, 1905.[5]\nAfter Furman v. Georgia, Connecticut reinstated the death penalty on January 10, 1973.[6] Lethal injection became the method mandated to execute condemned prisoners, replacing the electric chair, which had not been used since Taborsky's execution in 1960.[citation needed]\n",
        "type": [
            "murder"
        ]
    },
    "36": {
        "link": "/wiki/Adam_Lanza",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "year": "2012",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\nThe incident is the deadliest mass shooting at an elementary school in U.S. history, and the fourth-deadliest mass shooting overall.[a] The shooting prompted renewed debate about gun control in the United States, including proposals to make the background-check system universal, and for new federal and state gun legislation banning the sale and manufacture of certain types of semi-automatic firearms and magazines which can hold more than ten rounds of ammunition.\n",
        "type": [
            "mass murder",
            "mass shooting",
            "murder",
            "shooting"
        ]
    },
    "37": {
        "link": "/wiki/Murder_of_Annie_Le",
        "title": "Murder of Annie Le",
        "date": "September 8, 2009; 13 years ago (2009-09-08)",
        "year": "2009",
        "location": "10 Amistad StreetNew Haven, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "The murder of Annie Le occurred on September 8, 2009, while she was working in the New Haven, Connecticut campus of Yale University. Annie Marie Thu Le (July 3, 1985 – September 8, 2009) was a 24-year-old doctoral student at the Yale School of Medicine's Department of Pharmacology. She was last seen in a research building on the New Haven campus on September 8. On September 13, the day that she was to be married, she was found dead inside the building.[2]\nOn September 17, police arrested the perpetrator, Raymond J. Clark III, a Yale laboratory technician who worked in the building.[1][3] Clark pleaded guilty to the murder on March 17, 2011.[4] Clark was sentenced to 44 years imprisonment on June 3.[5] The case generated frenetic media coverage.\nOn the morning of September 8, Le left her apartment and took Yale Transit to the Sterling Hall of Medicine on the Yale campus. At about 10 a.m., she walked from Sterling Hall to another campus building at 10 Amistad Street, where her research laboratory was located. Le had left her purse, cell phone, credit cards, and cash in her office at Sterling Hall. She entered the Amistad Street building just after 10 a.m., as documented on footage from the building's security cameras. Le was never seen leaving the building. At approximately 9 p.m. on the evening of September 8, when Le had still not returned to her home, one of her five housemates called police to report her missing.\n",
        "type": [
            "murder"
        ]
    },
    "38": {
        "link": "/wiki/Gerald_Chapman",
        "title": "Gerald Chapman",
        "date": "April 6, 1926  (aged 38) Wethersfield, Connecticut",
        "year": "1926",
        "location": "",
        "state": "",
        "place": "Miami",
        "county": "Lower Connecticut River Valley COG",
        "paragraph": "Gerald Chapman (August, 1887 – April 6, 1926), known as \"The Count of Gramercy Park\", \"The Gentleman Bandit\", and \"Gentleman Gerald\", was an American criminal who helped lead an early Prohibition-era gang from 1919 until the mid-1920s. His nicknames came from his ability to pose as a member of the wealthy elite, which allowed him to fool potential victims and avoid scrutiny from investigators. Chapman was the first criminal to be dubbed \"Public Enemy Number One\" by the press.[1]\nGerald Chapman was born George Chartres in August 1887 to parents of Irish heritage.[2] Arrested for the first time in 1902 at age fourteen, Chapman was incarcerated for most of his early adult life.[3] While serving time for bank robbery, he was transferred from Sing Sing to Auburn State Prison, and became acquainted with highly educated Danish-born con man George \"Dutch\" Anderson in 1908.[4] With Anderson as his mentor, Chapman became a voracious reader and a self-styled gentleman, often affecting a British accent. Following both men's paroles in 1919, they began bootlegging operations in Toledo, Miami and New York City over the next two years.\nIn late 1921, along with former Auburn inmate Charles Loeber, Chapman and Anderson began committing armed robberies. On October 24,[5] the three men forced a U.S. Mail truck to stop at gunpoint on Leonard Street, successfully taking $2.4 million in cash, bonds and jewelry. Their identities were unknown to the police for months, and Chapman lived the life of an aristocrat, residing with his mistress in New York's fashionable Gramercy Park neighborhood. The three men were eventually arrested by United States Postal Inspectors William Doran, Jim Doyle and William Cochraine on July 3, 1922, after Chapman attempted to sell Argentine gold notes (stolen during the Leonard Street mail robbery) to an undercover postal inspector posing as a stock broker.[6] Chapman made headlines when he briefly got away from his interrogators at police headquarters, but he was caught before he could leave the building.\n",
        "type": [
            "robber",
            "robbery",
            "robberies"
        ]
    },
    "39": {
        "link": "/wiki/Murder_of_Andrew_Kissel",
        "title": "Murder of Andrew Kissel",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Greenwich",
        "county": "Western Connecticut COG",
        "paragraph": "\nAndrew Michael Kissel (August 23, 1959 – April 3, 2006) was an American real estate developer who was found murdered at his rented Greenwich, Connecticut estate. Kissel had been accused of defrauding a New York co-op board of millions of dollars.\nHis body was found by workers from a moving company. He had been stabbed to death in the basement of the home. The motive for his murder was a mystery, as there were many people who had problems with him, including those from the U.S. Justice Department, several multi-billion dollar corporations/conglomerates, and his own wife. Kissel's chauffeur and his cousin were later found guilty in association with the murder.\nKissel was a resident of Woodcliff Lake, New Jersey and later of Saddle River, New Jersey.[1]\n",
        "type": [
            "murder"
        ]
    },
    "40": {
        "link": "/wiki/George_Floyd_protests_in_Connecticut",
        "title": "George Floyd protests in Connecticut",
        "date": "May 28, 2020 – August 25, 2020",
        "year": "2020",
        "location": "Connecticut, United States",
        "state": "Connecticut",
        "place": "",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Connecticut, United States.\nA section of Route 8 was shut down by protesters on May 30.[3]\n",
        "type": [
            "riot"
        ]
    },
    "41": {
        "link": "/wiki/Warren_Kimbro",
        "title": "Warren Kimbro",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "\nWarren Aloysious Kimbro (April 29, 1934 – February 3, 2009) was a Black Panther Party member in New Haven, Connecticut who was found guilty of the May 21, 1969, murder of New York City Panther Alex Rackley, in the first of the New Haven Black Panther trials in 1970.[1]\nKimbro had been a resident of the New Haven Panther headquarters at 365 Orchard Street, where Rackley was held and tortured for two days under suspicion of being an informant for the FBI's COINTELPRO program. It was established at the trial that afterwards, Kimbro, Bridgeport, Connecticut Panther Lonnie McLucas, and national Panther field marshal George W. Sams, Jr. had driven Rackley to the marshes of Middlefield, Connecticut, where Kimbro and McLucas had each shot Rackley, on Sams' orders. Sams testified that national Panther leader Bobby Seale, who had been speaking at Yale University the day before the murder, had personally ordered the killing. Seales was at the Black Panther Headquarter the night Rackley was executed.[2]  The jury in Seale's subsequent trial was unable to reach a verdict, and the prosecution chose not to re-try the case.\n",
        "type": [
            "torture",
            "killing",
            "murder"
        ]
    },
    "42": {
        "link": "/wiki/Alexander_v._Yale",
        "title": "Alexander v. Yale",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Alexander v. Yale, 631 F.2d 178 (2d Cir. 1980),[1] was the first use of Title IX[2] of the United States Education Amendments of 1972 in charges of sexual harassment against an educational institution.[3]  It further established that sexual harassment of female students could be considered sex discrimination, and was thus illegal.\nThe plaintiffs were Ronni Alexander, Margery Reifler, Pamela Price, Lisa E. Stone and Ann Olivarius. All were Yale College students between 1973 and 1980.\nAlexander and Reifler alleged that they were sexually harassed and/or assaulted by a flute teacher (Keith Brion) and hockey coach,[4] respectively, and that Yale provided no procedure through which they could complain. Pamela Price alleged a classic case of what is now known as quid pro quo sexual harassment, when a course instructor offered to give her an ‘A’ if she complied with his sexual demands.[5] Lisa Stone alleged that English professor Michael Cooke propositioned her during his office hours while putting his hand on her knee. Ann Olivarius alleged that the absence of a procedure for complaining about sexual harassment forced her to expend her own time and money on helping fellow students who had been sexually harassed, and that in the course of providing that help she was threatened by individuals whom she was investigating, and that Yale failed to protect her from those individuals.\n",
        "type": [
            "assault"
        ]
    },
    "43": {
        "link": "/wiki/Madeleine_Hsu",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "year": "2012",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\nThe incident is the deadliest mass shooting at an elementary school in U.S. history, and the fourth-deadliest mass shooting overall.[a] The shooting prompted renewed debate about gun control in the United States, including proposals to make the background-check system universal, and for new federal and state gun legislation banning the sale and manufacture of certain types of semi-automatic firearms and magazines which can hold more than ten rounds of ammunition.\n",
        "type": [
            "mass murder",
            "mass shooting",
            "murder",
            "shooting"
        ]
    },
    "44": {
        "link": "/wiki/Leonard_Pozner",
        "title": "Leonard Pozner",
        "date": "",
        "year": "new 2012",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Leonard Pozner is the father of a Sandy Hook Elementary School shooting victim, Noah Pozner. He is the founder of the HONR Network, which supports the victims of mass casualty violence as well as the targets of online hate speech and harassment.\nOn December 14, 2012, 20 year old Adam Lanza took a Bushmaster XM-15 semi-automatic rifle into Sandy Hook Elementary school and killed 20 children and 6 teachers. One of the children killed was Pozner's six-year-old son Noah.[1] Shortly afterwards, conspiracy theorists used Facebook, YouTube, blogs and other social media platforms to claim the massacre was a hoax and a false flag operation and that the victims were actually crisis actors. Among them was radio-show host Alex Jones, who repeatedly used the conspiracy theory to tell the audience listening to his InfoWars radio program to rise up and \"find out the truth\", insisting that the shooting was staged by the federal government to destroy the Second Amendment and citizens' right to bear arms.[1]\nWhile mourning the loss of their children, Pozner and the other victims' families had to endure accusations that their children were not dead, and that the tragedy was a fraud designed to undermine Americans' gun rights.[2] They received death threats and in-person, online and phone call harassment from people who took up the call from Jones and others. In response, Pozner began reporting harassing and defaming content and claims about him and his family, as well as posts and videos using photos (often defaced) of his son.[3] \"I have to absolutely defend the memory of my son — I have no choice\" he said. \"I know how some of these theories build up. They don't fade away and the more time they spend online, the more accepted they become. The JFK conspiracy theory in the US is very accepted. Conspiracy theories erase history, they erase our memories, and how will this event (Sandy Hook) be remembered a hundred years from now? So I think it's important, the work that I'm doing now.\"[4]\n",
        "type": [
            "shooting"
        ]
    },
    "45": {
        "link": "/wiki/Donna_Lee_Bakery_murders",
        "title": "Donna Lee Bakery murders",
        "date": "October 19, 1974 (1974-10-19) (49 years ago)",
        "year": "1974",
        "location": "New Britain, Connecticut, USA",
        "state": "Connecticut",
        "place": "New Britain",
        "county": "Capitol Region COG",
        "paragraph": "The Donna Lee Bakery murders occurred on the night of Saturday, October 19, 1974, in New Britain, Connecticut. Six people were found murdered inside the bakery. At the time, it was the worst mass murder in Connecticut history.[1] Two local men were convicted of the murders: Ronald F. \"Tiny\" Piskorski, a 25‐year‐old former bar bouncer and circus‐bear wrestler, and Gary B. Schrager, a 31‐year‐old drifter.\nDuring the slayings, the bakery owner, a store clerk, three customers, and a young passer‐by who had stopped in to ask directions were shot in the back of the head after they were forced to lie face down on the floor of a back room at the Donna Lee Bakery.\nAuthorities had initially suspected robbery as the motive for the killings, and believed that both Piskorski and Schrager took part in the murders. Investigators later theorized that one of the victims had recognized Schrager during the robbery, and the perpetrators thus felt the need to eliminate all witnesses. Michael P. Kron, age 49, one of the victims, was related to Schrager as his uncle by marriage. Schrager felt that Kron had recognized him and would be able to identify him.\n",
        "type": [
            "killing",
            "robbery",
            "murder",
            "mass murder",
            "robber"
        ]
    },
    "46": {
        "link": "/wiki/James_Allen_Paul",
        "title": "James Allen Paul",
        "date": "March 3, 2000(2000-03-03) (aged 52) New Jersey State Prison, Trenton, New Jersey, U.S.",
        "year": "2000",
        "location": "",
        "state": "Connecticut",
        "place": "Norfolk",
        "county": "Northwest Hills COG",
        "paragraph": "James Allen Paul (April 19, 1947 – March 3, 2000) was an American spree killer who murdered three people during a seven-day rampage across three states during May 1984.[1]\nPaul was born on April 19, 1947, in Norfolk, Virginia.[2] Little is known about his early life, but in his adult years Paul obtained work as stable hand for farms. In 1983, Paul moved to Room 1 at the Belvedere Motel on Route 22 in Readington Township, New Jersey.[2] At the same motel lived 47-year-old Virginia Vickory.[2]\nOn May 15, 1984, Vickory was found murdered in a field in Readington Township, having been shot in the face at a close range.[1] Police quickly circled in on Paul, then 37 years old, who also went under multiple aliases including James Dalton and Steve Sanders.[2] Paul fled to Connecticut not long after and, on May 17, 18-year-old Robin White went missing. Investigators believe White may have been hitchhiking and Paul offered her a ride and later killed her.[3] White's body was found along a road in Portland, Connecticut on May 20, shot to death with the same gun used to kill Vickory. Then, on May 22, 45-year-old George Call, a nurse of 10 years at the Sullivan Home nursing home, was found shot to death at a rest area along Interstate 91 in Springfield, Vermont.[4] He had been shot in the face twice, just like Vickory, with his wallet stolen.[3]\n",
        "type": [
            "burglary",
            "murder"
        ]
    },
    "47": {
        "link": "/wiki/Nancy_Lanza",
        "title": "Sandy Hook Elementary School shooting",
        "date": "December 14, 2012; 10 years ago (2012-12-14) c. 9:35 – c. 9:40 a.m.[1][2][3] EST (UTC−05:00)",
        "year": "2012",
        "location": "Sandy Hook Elementary School, Sandy Hook, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut, United States, when 20-year-old Adam Lanza shot and killed 26 people. Twenty of the victims were children between six and seven years old, and the other six were adult staff members. Earlier that day, before driving to the school, Lanza had shot and killed his mother at their Newtown home. As first responders arrived at the school, Lanza died by suicide, shooting himself in the head.\nThe incident is the deadliest mass shooting at an elementary school in U.S. history, and the fourth-deadliest mass shooting overall.[a] The shooting prompted renewed debate about gun control in the United States, including proposals to make the background-check system universal, and for new federal and state gun legislation banning the sale and manufacture of certain types of semi-automatic firearms and magazines which can hold more than ten rounds of ammunition.\n",
        "type": [
            "mass murder",
            "mass shooting",
            "murder",
            "shooting"
        ]
    },
    "48": {
        "link": "/wiki/Disappearance_of_George_Smith",
        "title": "Disappearance of George Smith",
        "date": "",
        "year": "new 2005",
        "location": "",
        "state": "",
        "place": "Turkey",
        "county": "Western Connecticut COG",
        "paragraph": "George Allen Smith IV (born October 3, 1978) was an American man who disappeared overboard from the Royal Caribbean International cruise ship MS Brilliance of the Seas in July 2005 under suspicious circumstances. His story has been reported on by Dateline NBC and 48 Hours and was depicted in a television film called Deadly Honeymoon, which still airs on Lifetime.\nHaving married Jennifer Hagel eleven days earlier, George Smith was on his honeymoon, a two-week trip on a Mediterranean cruise stopping in Greece, Turkey, and Italy, among other locations.[1]\nSmith mysteriously disappeared in the early morning hours of July 5, 2005,[2][3] and evidence suggested that foul play might have been involved. Blood stains were found in his cabin as well as on the side of the ship, and it appeared that he might have been tossed off the ship or fallen overboard and drowned. The police suspected homicide.\n",
        "type": [
            "murder"
        ]
    },
    "49": {
        "link": "/wiki/Americans_for_Responsible_Solutions",
        "title": "Americans for Responsible Solutions",
        "date": "",
        "year": "new 2016",
        "location": "Washington, D.C.",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nAmericans for Responsible Solutions (ARS) was a United States non-profit organization and super PAC that supports gun control.[2][3] The group's stated goal was \"to encourage elected officials to stand up for solutions to prevent gun violence and protect responsible gun ownership.\"[4] It typically supported Democratic politicians in elections.[5] In 2016, the organization merged with the Law Center to Prevent Gun Violence to become Giffords.[6]\nARS was formed by Gabby Giffords, a former Democratic member of the U.S. House of Representatives, and her husband, Mark Kelly, in the weeks following the Sandy Hook Elementary School shooting of December 14, 2012. Giffords' political career ended on January 8, 2011, when she and 18 others were shot at a meeting with constituents in a suburb of Tucson, Arizona.\n",
        "type": [
            "shooting"
        ]
    },
    "50": {
        "link": "/wiki/Murder_of_Christian_Prince",
        "title": "Murder of Christian Prince",
        "date": "February 17, 1991(1991-02-17) (aged 19) New Haven, Connecticut, U.S.",
        "year": "1991",
        "location": "",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "Christian Haley Prince (July 8, 1971 – February 17, 1991) was a Yale University student whose murder in New Haven, Connecticut, highlighted racial and class tensions between town and gown.\nPrince, the son of Edward and Sally Prince of Chevy Chase, Maryland, was a fourth-generation Yale student, a member of the class of 1993 in his sophomore year, in Pierson College. The evening of February 16, 1991, after having dined at Mory's and attending a party at Sterling-Sheffield-Strathcona Hall, Prince left his friends and began walking to his off-campus apartment on Whitney Avenue to rest for lacrosse practice the next day.[1] Prince was found lying on the steps of St. Mary's Church, New Haven on Hillhouse Avenue, dead of a bullet wound to the heart, in the early morning hours of February 17.[1][2] He was the first Yale student killed on campus since the murder of Gary Stein during a robbery near Grove Street Cemetery in 1974.[1]\nHis death stunned the campus, and more than 1,000 people attended his funeral in Washington, D.C., where Prince's brother Ted, a Yale graduate, gave the eulogy.[1] There was a short term significant decline in applications to Yale which was directly attributed to the murder.[1] Yale's president, Benno Schmidt, resigned the following year after a contentious six-year term filled with myriad problems, including badly deteriorated town-gown relations highlighted by Prince's murder.[citation needed]\n",
        "type": [
            "robber",
            "robbery",
            "murder"
        ]
    },
    "51": {
        "link": "/wiki/Harold_Meade_(murderer)",
        "title": "Harold Meade (murderer)",
        "date": "August 12, 1970",
        "year": "1970",
        "location": "",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "Harold W. Meade III (1948 – December 9, 2007) was an American murderer and suspected serial killer who bludgeoned three mentally disabled individuals to death on August 12, 1970, in New Haven, Connecticut. He was later arrested in December of the same year, and pleaded guilty to the murders in 1972. In addition to the three murders he was convicted of, Meade is suspected of committing several other killings in Connecticut dating back to 1969. In 2007, Meade died from an illness in prison.[1][2]\nHarold Meade was born in 1948.[3] Meade's father owned a gas station in Bethany, Connecticut.[4]\nWhen Meade was an adult, he married his first wife, Donna Meade. They had two children together.[4] Meade worked as a truck driver, milkman, and ice cream vendor.\n",
        "type": [
            "killing",
            "murder"
        ]
    },
    "52": {
        "link": "/wiki/List_of_people_executed_in_Connecticut",
        "title": "List of people executed in Connecticut",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "",
        "county": "",
        "paragraph": "\nThis is a list of people executed in Connecticut, prior to the abolition of capital punishment in the state on April 25, 2012.[1]\nNotes:\n",
        "type": []
    },
    "53": {
        "link": "/wiki/Bra_murders",
        "title": "Bra murders",
        "date": "",
        "year": "new 1967",
        "location": "",
        "state": "Connecticut",
        "place": "Stamford",
        "county": "Western Connecticut COG",
        "paragraph": "The bra murders were a series of murders committed against five prostitutes from 1967 to 1971 in Stamford, Connecticut. Most of the victims were black prostitutes or drug addicts, each had been strangled, sometimes with their own bras, from which the murders' moniker originated.\nBenjamin Franklin Miller, a self-styled preacher from Norwalk, was charged and later acquitted by reason of insanity, spending the rest of his life in a mental institution. His guilt has been questioned and remains the subject of debate to this day.[1]\nThe murders began on or after August 4, 1967, when 29-year-old Rose Ellen Pazda (known as \"Sissi Rush\") was reported missing from Stamford.[2] Despite the authorities' efforts, they were unable to locate her until April 4, 1969, when her skeletonized remains were found. Due to the advanced state of decomposition, the coroner was unable to determine her exact date of death.\n",
        "type": [
            "murder"
        ]
    },
    "54": {
        "link": "/wiki/Alex_Kelly_(rapist)",
        "title": "Alex Kelly (rapist)",
        "date": "",
        "year": "new 1986",
        "location": "",
        "state": "",
        "place": "Darien",
        "county": "Western Connecticut COG",
        "paragraph": "Alex Kelly (born May 8, 1967) is an American convicted rapist.\nAlex Kelly is the son of Melanie Reisdorf Kelly, a travel agent, and Joe Kelly, a plumber.[1][2][3] He grew up in the Noroton Heights section of Darien, Connecticut.[1]  In 1986, he graduated from Darien High School.[4]\nHis older brother, Christopher, died of a drug overdose in 1991 while Kelly was on the run.[1][5] His younger brother, Russell, died in 2004 in a car accident in Yellowstone National Park, while Kelly was incarcerated.[6]\n",
        "type": [
            "rape"
        ]
    },
    "55": {
        "link": "/wiki/Annie_Le",
        "title": "Murder of Annie Le",
        "date": "September 8, 2009; 13 years ago (2009-09-08)",
        "year": "2009",
        "location": "10 Amistad StreetNew Haven, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "New Haven",
        "county": "South Central COG",
        "paragraph": "The murder of Annie Le occurred on September 8, 2009, while she was working in the New Haven, Connecticut campus of Yale University. Annie Marie Thu Le (July 3, 1985 – September 8, 2009) was a 24-year-old doctoral student at the Yale School of Medicine's Department of Pharmacology. She was last seen in a research building on the New Haven campus on September 8. On September 13, the day that she was to be married, she was found dead inside the building.[2]\nOn September 17, police arrested the perpetrator, Raymond J. Clark III, a Yale laboratory technician who worked in the building.[1][3] Clark pleaded guilty to the murder on March 17, 2011.[4] Clark was sentenced to 44 years imprisonment on June 3.[5] The case generated frenetic media coverage.\nOn the morning of September 8, Le left her apartment and took Yale Transit to the Sterling Hall of Medicine on the Yale campus. At about 10 a.m., she walked from Sterling Hall to another campus building at 10 Amistad Street, where her research laboratory was located. Le had left her purse, cell phone, credit cards, and cash in her office at Sterling Hall. She entered the Amistad Street building just after 10 a.m., as documented on footage from the building's security cameras. Le was never seen leaving the building. At approximately 9 p.m. on the evening of September 8, when Le had still not returned to her home, one of her five housemates called police to report her missing.\n",
        "type": [
            "murder"
        ]
    },
    "56": {
        "link": "/wiki/Louis_Felder",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "year": "2010",
        "location": "Manchester, Connecticut, USA",
        "state": "Connecticut",
        "place": "Manchester",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\nThornton, aged 34, was called into his place of employment for disciplinary purposes. Thornton had been recorded on surveillance video in the Hartford Distributors warehouse stealing beer on a previous occasion. He was also implicated in the theft of empty beer kegs.[9] Hartford Distributors is a wholesale distributor of Budweiser beer products and wine. Given the options of being fired or resigning, Thornton signed the resignation papers and was being escorted out of the building. Instead of leaving, he took a Ruger SR9 semi-automatic pistol from his lunchbox and opened fire.\n",
        "type": [
            "theft",
            "murder",
            "mass murder",
            "mass shooting",
            "shooting"
        ]
    },
    "57": {
        "link": "/wiki/Eugene_Mallove",
        "title": "Eugene Mallove",
        "date": "",
        "year": "new 2004",
        "location": "",
        "state": "",
        "place": "Ice",
        "county": "New Haven",
        "paragraph": "Eugene Franklin Mallove (June 9, 1947 – May 14, 2004) was an American scientist, science writer, editor, and publisher of Infinite Energy magazine, and founder of the nonprofit organization New Energy Foundation.  He was a proponent of cold fusion, and a supporter of its research and related exploratory alternative energy topics, several of which are sometimes characterised as \"fringe science\".\nMallove authored Fire from Ice, a book detailing the 1989 report of tabletop cold fusion from Stanley Pons and Martin Fleischmann at the University of Utah. Among other things, the book claims the team did produce \"greater-than-unity\" output energy in an experiment successfully replicated on several occasions, but that the results were suppressed through an organized campaign of ridicule from mainstream physicists, including those studying controlled thermonuclear fusion, trying to protect their research and funding.[1]\nMallove was murdered in 2004 while cleaning out his former childhood home, which had been rented out. Three people have been arrested and charged in connection with the killing; two were convicted of first-degree manslaughter[2] and murder'[3] the third pleaded guilty to obstruction of justice.[4]\n",
        "type": [
            "killing",
            "murder"
        ]
    },
    "58": {
        "link": "/wiki/Martin_Frankel",
        "title": "Martin Frankel",
        "date": "",
        "year": "new 1999",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Martin R. \"Marty\" Frankel (born 1954)[1] is an American financial criminal who conducted a series of investment frauds in the late 20th century, causing hundreds of millions of dollars in losses.  He was caught in 1999, and in 2004 was sentenced to 200 months in prison based on over $200 million in proven losses to insurance companies he bought then looted their actuarial reserves; the sentence was reaffirmed in 2006.[4]\nMarty Frankel was born to Leon and Tilly Frankel in 1954; he was Leon's fourth child and Tilly's second, and was raised as Jewish.  He attended the University of Toledo but never graduated.[1][6]\nFrankel used astrology to make financial trading decisions. In addition, he usually could not bring himself to actually make trades, causing trouble for him with the brokerage firms he worked for.  After being fired by his boss John Schulte in 1986, Schulte's wife and brokerage partner, Sonia, left the marriage to join Frankel as his business and life partner.[7] Frankel set up Winthrop Capital using the phony name of James Spencer.  He also set up The Frankel Fund with Douglas Maxwell, but remained reluctant to buy or hold his chosen investments.[1][7]\n",
        "type": []
    },
    "59": {
        "link": "/wiki/New_London_riots_of_1919",
        "title": "New London riots of 1919",
        "date": "Late May and June 1919",
        "year": "1919",
        "location": "New London, Connecticut",
        "state": "Connecticut",
        "place": "New London",
        "county": "Southeastern Connecticut COG",
        "paragraph": "The New London riots of 1919 were a series of racial riots between white and black Navy sailors and Marines stationed in New London and Groton, Connecticut.\nWhite and black sailors and marines occupied separate living quarters at the Naval submarine base in Groton, Connecticut in 1919. Racial tensions were high in the Groton and New London area from May to June, and there were several confrontations between the two groups. Black sailors reported that white sailors attacked them, and white Marines accused the black sailors of waiting for them after dark when they crossed Long Cove Bridge.[1] The police arrested two white \"Blue Jackets\", and white sailors attacked the Hotel Bristol on Bank Street where the black sailors spent most of their free time, throwing a group of blacks out of the hotel on the street and beating them. The police and fire brigades were called but could not stop the rioting. The Marine Corps were eventually called, and they regained control.[1]\nOn May 30, 1919, about 20 sailors and soldiers were arrested by police officers, marines, and firemen. The Greeneville Daily Sun reported that the trouble began when \"negro sailors\" entered the Coast Guard Academy in New London and attacked white sailors.[2] On June 29, 1919, another riot erupted which required the Marines to restore order.[3] Author Jan Voogd argues that this riot came to national attention because a fire hydrant was damaged by the marine vehicles. This caused a dispute between the submarine base and city authorities over who would pay for the damage, and so created a paper trail.[3] Voogd posits that there may have been other race riots that went \"uncounted, unobserved, and unacknowledged.\"[3]\n",
        "type": [
            "riot"
        ]
    },
    "60": {
        "link": "/wiki/Moms_Demand_Action",
        "title": "Everytown for Gun Safety",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\n\nEverytown for Gun Safety is an American nonprofit organization which advocates for gun control and against gun violence.[7] Everytown was formed in 2013 due a merger between Mayors Against Illegal Guns and Moms Demand Action for Gun Sense in America.[8]\n",
        "type": []
    },
    "61": {
        "link": "/wiki/Michael_Skakel",
        "title": "Murder of Martha Moxley",
        "date": "October 30, 1975(1975-10-30) (aged 15) Belle Haven, Greenwich, Connecticut, U.S.",
        "year": "1975",
        "location": "",
        "state": "Connecticut",
        "place": "Belle Haven",
        "county": "Western Connecticut COG",
        "paragraph": "\nMartha Elizabeth Moxley (August 16, 1960 – October 30, 1975) was a 15-year-old American high school student from Greenwich, Connecticut, who was murdered in 1975. Moxley was last seen alive spending time at the home of the Skakel family, across the street from her home in Belle Haven.[1] Michael Skakel, also aged 15 at the time, was convicted in 2002 of murdering Moxley and was sentenced to 20 years to life in prison. In 2013, Skakel was granted a new trial by a Connecticut judge who ruled that his counsel had been inadequate so he was then released on $1.2 million bail. On December 30, 2016, the Connecticut Supreme Court ruled 4–3 to reinstate Skakel's conviction. The Connecticut Supreme Court reversed itself on May 4, 2018, and ordered a new trial.[2][3] On October 30, 2020, the 45th anniversary of Moxley's murder, the state of Connecticut announced it would not retry Skakel for Moxley's murder.\nThe case attracted worldwide publicity, as Skakel is a nephew of Ethel Skakel Kennedy, the widow of U.S. Senator Robert F. Kennedy.\n",
        "type": [
            "murder"
        ]
    },
    "62": {
        "link": "/wiki/Ezra_Winter",
        "title": "Ezra Winter",
        "date": "April 6, 1949(1949-04-06) (aged 63) Falls Village, Connecticut, U.S.",
        "year": "1949",
        "location": "",
        "state": "Connecticut",
        "place": "Falls Village",
        "county": "Northwest Hills COG",
        "paragraph": "Ezra Augustus Winter (March 10, 1886 – April 6, 1949)[1] was a prominent American muralist.\nWinter was born in Traverse City, Michigan, trained at the Chicago Academy of Fine Arts in 1908, and the American Academy in Rome in 1914.  Winter became extremely successful and commanded high prices for his work.  In 1924 he taught at the Grand Central School of Art.\nWinter studied art at the Chicago Academy of Fine Arts and was a fellow in visual arts at the American Academy in Rome in 1914.  Among his best-known works are The Canterbury Tales in the Library of Congress and Fountain of Youth in the foyer of Radio City Music Hall. He also completed murals for the U.S. Supreme Court, the U.S. Chamber of Commerce, the University of Rochester and Eastman School of Music, and a six-story work for the Guardian Building in Detroit.  During World War I Winter was a camouflage designer for the U.S. Shipping Board.  He later taught at the Grand Central School of Art and kept a studio in Falls Village, Connecticut.  Winter was associated with the National Society of Mural Painters and the Architectural League of New York.  He served on the Connecticut State Commission of Sculpture and the U.S. Commission of Fine Arts, from 1928 to 1933, and was a member of the National Institute of Arts and Letters.  His papers are in the Archives of American Art at the Smithsonian Institution.[2]\n",
        "type": []
    },
    "63": {
        "link": "/wiki/Amy_Archer-Gilligan",
        "title": "Amy Archer-Gilligan",
        "date": "April 23, 1962(1962-04-23) (aged 88) Middletown, Connecticut, U.S.",
        "year": "1962",
        "location": "",
        "state": "Connecticut",
        "place": "Middletown",
        "county": "Lower Connecticut River Valley COG",
        "paragraph": "\nAmy Duggan \"Sister\" Archer-Gilligan (October 31, 1873[1] – April 23, 1962)[2] was a nursing home proprietor and serial killer from Windsor, Connecticut. She murdered at least five people by poisoning them. One of her victims was her second husband, Michael Gilligan; the others were residents of her nursing home.\nIt is possible that Archer-Gilligan was involved in more deaths. The authorities counted 48 deaths in her nursing home, the \"Archer Home for the Elderly and Infirm.\"\n",
        "type": [
            "murder"
        ]
    },
    "64": {
        "link": "/wiki/Connecticut_Lottery_shooting",
        "title": "Connecticut Lottery",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Hartford",
        "county": "Capitol Region COG",
        "paragraph": "The Connecticut Lottery Corporation, also called the CT Lottery, is the official lottery in Connecticut. It was created in 1971 by then-Gov. Thomas Meskill, who signed Public Act No. 865. The first tickets were sold on February 15, 1972.[1] The Connecticut Lottery offers several in-house drawing games; Connecticut also participates in Mega Millions and Powerball; each are played in 44 states, the District of Columbia, and the U.S. Virgin Islands.\nDrawings are broadcast on WCCT-TV(channel 20) the CW affiliate in the Hartford/New Haven television market.\nA three-digit numbers game-style game drawn twice daily, with day and night drawings. Tickets can be bought in 50-cent multiples. Bets include straight(all three digits in order), box(all three digits in any order) and pairs(any two digits).[2]\n",
        "type": []
    },
    "65": {
        "link": "/wiki/Lorne_J._Acquin",
        "title": "Lorne J. Acquin",
        "date": "July 22, 19772:30 a.m. – 3:30 a.m.",
        "year": "1977",
        "location": "",
        "state": "Connecticut",
        "place": "Prospect",
        "county": "Naugatuck Valley COG",
        "paragraph": "Lorne J. Acquin (March 21, 1950 – June 2015)[2] was an American mass murderer who killed his foster brother's wife, her seven children, and their niece in their home at Cedar Hill Drive in Prospect, Connecticut, on July 22, 1977, by beating them to death with a tire iron. He afterward set fire to the building and escaped, but was arrested the following day and sentenced to 105 years in prison two years later.[3]\nIt was the largest mass murder in Connecticut history until the Sandy Hook Elementary School shooting.[4][5]\nOn Friday, July 22, 1977, Lorne J. Acquin went to the home of his foster brother Fred Beaudoin, who was at work at the time, and killed the latter's wife Cheryl, their seven children, and a niece of theirs by bludgeoning them to death with a tire iron.  Acquin also sexually molested one of the children, 10-year-old Sharon Lee Beaudoin, before killing her.[6][7] He afterward spread gasoline around the house, set it on fire, and escaped.\n",
        "type": [
            "killing",
            "murder",
            "mass murder",
            "shooting",
            "arson"
        ]
    },
    "66": {
        "link": "/wiki/Charles_P._Graham",
        "title": "Charles P. Graham",
        "date": "November 2, 1904(1904-11-02) (aged 65) Middletown, CT",
        "year": "1904",
        "location": "",
        "state": "Connecticut",
        "place": "Middletown",
        "county": "Lower Connecticut River Valley COG",
        "paragraph": "Charles P. Graham, born in Utica, New York on June 6, 1839, was the twenty ninth Adjutant General of the State of Connecticut. Graham was one of the original dental commissioners of the state being first appointed in 1893. In 1896 he served as president of the State Dental Society. Graham was a prominent member of the Universalist Church. He practiced dentistry for 36 years.[1]\nIn December 8, 1871 Graham joined the Middletown company, H, of the Second Regiment, as a private. A month later he was first sergeant. Graham was elected first lieutenant and eight months later on April 21, 1873 became captain. On September 3, 1875 he was appointed to second regiment and then on July 5, 1878 succeeded Stephen R. Smith a colonel. On January 28, 1885 he became brigadier-general.  In 1895 Charles P. Graham became Connecticut Adjutant General until 1896 [2]\nCharles P. Graham was the son of George W. Graham. He moved the Middletown, Connecticut in 1857. Graham got married and a daughter who was killed in the Park Central disaster in Hartford. On November 2, 1904 General Charles P. Graham killed himself. He was survived by his wife; a daughter, Mrs. Eugene P. Pelton of Essex. He had a brother, George T. Graham of Hartford, and three sisters, Mrs. Edwin A. Sawyer of Hartford, Mrs. A.O. Carter of Niantic and Mrs. Charles Barlett of New Haven.[3]\n",
        "type": []
    },
    "67": {
        "link": "/wiki/Sandy_Hoax",
        "title": "Sandy Hook Elementary School shooting conspiracy theories",
        "date": "",
        "year": "new 2012",
        "location": "",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "\n\n\nThe Sandy Hook Elementary School shooting occurred on December 14, 2012, in Newtown, Connecticut. The perpetrator, Adam Lanza, fatally shot his mother before murdering 20 students and six staff members at Sandy Hook Elementary School, and later committed suicide.[1] A number of fringe figures have promoted conspiracy theories that doubt or dispute what occurred at Sandy Hook. Various conspiracy theorists have claimed, for example, that the massacre was actually orchestrated by the U.S. government as part of an elaborate plot to promote stricter gun control laws.[2]\nThe more common conspiracy theory, adopted initially by James H. Fetzer, James Tracy, and others, and further popularized by Alex Jones, denied that the massacre actually occurred, asserting that it was faked. The massacre was described by Fetzer and Tracy as a classified training exercise involving members of federal and local law enforcement, the news media, and crisis actors, which they claim was modeled on Operation Closed Campus, an Iowa school-shooting drill that was canceled in 2011 amid threats and public outcry. Jones described the shooting incident as \"synthetic, completely fake with actors; in my view, manufactured [...] it just shows how bold they are that they clearly used actors.\"[3][4]\nNo evidence supports the conspiracy theories, which make a number of implausible claims.[5][6][7] Moreover, many Sandy Hook conspiracy theories contradict one another.[6] A number of sources have published articles debunking various claims put forward by conspiracy theorists.[6][8][9][10] In 2018, the parents of several children killed in the Sandy Hook shooting launched a lawsuit against Jones and other authors of conspiracy videos for defamation, accusing them of engaging in a campaign of \"false, cruel, and dangerous assertions\".[11] In 2019, Jones reversed his stance and stated that the massacre was real.[12]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "68": {
        "link": "/wiki/Michaela_Petit",
        "title": "Cheshire home invasion murders",
        "date": "July 23, 2007; 15 years ago (2007-07-23)",
        "year": "2007",
        "location": "Cheshire, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Cheshire",
        "county": "Naugatuck Valley COG",
        "paragraph": "\nOn July 23, 2007, Linda Hayes (born Steven Hayes) and Joshua Komisarjevsky invaded the residence of the Petit family in Cheshire, Connecticut. Though initially planning only to rob the house, she[b] and Komisarjevsky murdered Jennifer Hawke-Petit and her two daughters, 17-year-old Hayley Petit and 11-year-old Michaela Petit. Their father Dr. William Petit escaped with severe injuries.\nUpon entering the Petits' home, Komisarjevsky beat Dr. Petit with a baseball bat and the pair restrained him in the basement. Hawke-Petit and her daughters were also restrained. Hayes later kidnapped Hawke-Petit and forced her to withdraw money at a bank. After returning to the home, Hayes raped her and strangled her to death. Komisarjevsky raped 11-year-old Michaela. The invaders then decided to burn down the house to destroy evidence. With Hayley and Michaela tied to their beds, the invaders doused them and the house with gasoline and set it on fire, leaving them to die of smoke inhalation.[4]\n",
        "type": [
            "rape",
            "kidnapped",
            "murder",
            "arson"
        ]
    },
    "69": {
        "link": "/wiki/Victor_James_(murder_victim)",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "year": "2010",
        "location": "Manchester, Connecticut, USA",
        "state": "Connecticut",
        "place": "Manchester",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\nThornton, aged 34, was called into his place of employment for disciplinary purposes. Thornton had been recorded on surveillance video in the Hartford Distributors warehouse stealing beer on a previous occasion. He was also implicated in the theft of empty beer kegs.[9] Hartford Distributors is a wholesale distributor of Budweiser beer products and wine. Given the options of being fired or resigning, Thornton signed the resignation papers and was being escorted out of the building. Instead of leaving, he took a Ruger SR9 semi-automatic pistol from his lunchbox and opened fire.\n",
        "type": [
            "theft",
            "murder",
            "mass murder",
            "mass shooting",
            "shooting"
        ]
    },
    "70": {
        "link": "/wiki/State_v._Yanz",
        "title": "State v. Yanz",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Conn.",
        "county": "Northwest Hills COG",
        "paragraph": "State v. Yanz, 50 A. 37 (Conn. 1901), was a case decided by the Supreme Court of Connecticut (then called the Connecticut Supreme Court of Errors) that held that a provocation defense that reduced a murder charge to one of manslaughter is still valid even in the presence of a reasonable mistake of fact.[1] Specifically, in the case where a man reasonably believed his wife was committing adultery and kills her alleged paramour, even where that belief was mistaken, the provocation would be enough to reduce the charge from murder to manslaughter.[2]\nGeorge Yanz, an employee at the Winchester Repeating Arms factory, left work early on June 20, 1900 after noticing his co-worker, machinist George H. Goering had left early. Yanz suspected that Goering was having an affair with Yanz's wife Kitty, and went to his home in the Highwood neighborhood of Hamden, Connecticut.[3][4] Yanz, discovering his wife and Goering \"in a compromising position\",[5] took his Winchester rifle and shot Goering in the head, killing him.[6] Yanz surrendered himself to police the same afternoon.[3]\nYanz was arraigned June 22, and held without bail.[7] He initially claimed that he did not realize the person he was shooting was Goering, and that he initially believed he was protecting his wife against a rapist. Public opinion at the time was that he was claiming this to defend his wife's reputation.[5] Yanz was indicted for murder by the grand jury, and his case was deferred to October.[8] The trial began the second week of October,[9] with closing arguments held the morning of October 17.[10] That afternoon, the jury found Yanz guilty of second degree murder after two hours of deliberation, and he was sentenced to life imprisonment.[11]\n",
        "type": [
            "killing",
            "murder",
            "shooting"
        ]
    },
    "71": {
        "link": "/wiki/William_Devin_Howell",
        "title": "William Devin Howell",
        "date": "",
        "year": "new 2003",
        "location": "",
        "state": "Connecticut",
        "place": "New Britain",
        "county": "Capitol Region COG",
        "paragraph": "William Devin Howell (born February 11, 1970) is an American serial killer who was convicted of murdering seven women in 2003. He is one of the most prolific serial killers in Connecticut history. In November 2017, while already serving a 15-year prison sentence for manslaughter, he was sentenced to six consecutive life sentences (a life sentence in Connecticut is 60 years in prison, meaning he was sentenced to 360 years in prison),[1][2][3] which he is currently serving at Cheshire Correctional Institution.[4]\nThe victims were identified as seven women, including one transgender woman, Janice Roberts. Their bodies were discovered in two locations, including an area behind a shopping plaza on Hartford Road in New Britain, referred to by Howell as his \"garden\". The person who discovered this principal body dump, at the start of 2005, by which time the remains were mostly skeletal, had been looking for an area to hunt in. The ground is wooded and marshy and  inaccessible by car, which delayed the investigation and recovery of the victims.[5][6]\n29-year-old Melanie Ruth Camilini, a mother of two from Seymour, went missing on January 1, 2003. She had recently been living in Waterbury and was last seen in that area with two men. Camilini was known to have a substance abuse problem and would regularly disappear for long periods of time. Her body was discovered buried behind a New Britain shopping center and was identified in 2015.[5]\n",
        "type": [
            "murder"
        ]
    },
    "72": {
        "link": "/wiki/George_Colvocoresses",
        "title": "George Colvocoresses",
        "date": "June 3, 1872(1872-06-03) (aged 55) Bridgeport, Connecticut, U.S.",
        "year": "1872",
        "location": "",
        "state": "",
        "place": "Bridgeport",
        "county": "Greater Bridgeport COG",
        "paragraph": "George Musalas \"Colvos\" Colvocoresses (October 22, 1816 – June 3, 1872) was a Greek-American Navy officer who commanded the Saratoga during the American Civil War. From 1838 up until 1842, he took part in the United States Exploring Expedition, which explored large regions of the Pacific Ocean.\nHe was born on the island of Chios in the Greek Archipelago on October 22, 1816. As a member of a prominent Greek family, he was kidnapped along with his mother and two sisters and ransomed from the Turks after the massacre of the Greek population of the island in 1822, during the Greek War of Independence. His family's fortunes were devastated by the massacre. Most close relatives, including six brothers, were killed. He was enslaved at 6 years of age, but his father managed to buy back his freedom.\nBy 1824, Colvocoresses was sent to Baltimore in the United States by his father.[1] He became the adopted son of Captain Alden Partridge, the founder of the American Literary, Scientific, and Military Academy (later Norwich University) in Norwich, Vermont. Colvocoresses entered the Navy after graduating from the Academy in 1831. Several generations of his family have also graduated from Norwich and followed military careers.\n",
        "type": [
            "kidnapped",
            "murder"
        ]
    },
    "73": {
        "link": "/wiki/Gun_control_after_the_Sandy_Hook_Elementary_School_shooting",
        "title": "Gun control after the Sandy Hook Elementary School shooting",
        "date": "",
        "year": "new 2012",
        "location": "",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "After the Sandy Hook Elementary School shooting, multiple gun laws were proposed in the United States at the federal and state levels. The shooting renewed debate about gun control. The debates focused on requiring background checks on all firearm sales (called universal background checks), and on passing new and expanded assault weapon and high-capacity magazine bans.\nOn December 14, 2012, twenty children and six adults were murdered at Sandy Hook Elementary School in Newtown, Connecticut.[1] One other adult had been murdered before the shooter went to the school. It was the deadliest primary school shooting,[2] the fourth-deadliest mass shooting by a single person,[3] and one of the deadliest mass shootings in U.S. history.[4]\nWithin hours of the shooting, a We the People user started a petition asking the White House to \"immediately address the issue of gun control through the introduction of legislation in Congress,\"[5][6] and the gun control advocacy group the Brady Campaign to Prevent Gun Violence reported that an avalanche of donations caused its website to crash.[7] That afternoon, President Barack Obama made a televised statement offering condolences on behalf of the nation to Connecticut governor, Dannel Malloy and saying, \"we're going to have to come together and take meaningful action to prevent more tragedies like this, regardless of the politics.\"[8] Speaking at a December 16 memorial service in Newtown, Obama said he would \"use whatever power this office holds\" to prevent similar tragedies.[9] By December 17, the White House petition had more than 150,000 signatures,[6] and one week after the shooting it had almost 200,000, along with those on 30 similar petitions.[10]\n",
        "type": [
            "mass shooting",
            "shooting",
            "murder",
            "assault"
        ]
    },
    "74": {
        "link": "/wiki/Murder_of_Helle_Crafts",
        "title": "Murder of Helle Crafts",
        "date": "November 19, 1986 (aged 39) Newtown, Connecticut, U.S.",
        "year": "1986",
        "location": "",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "Helle Crafts  (English: /ˈhɛlə ˈkræfts/ (listen); born Helle Lorck Nielsen; July 7, 1947 – November 19, 1986) was a Danish flight attendant who was murdered by her husband, Eastern Air Lines pilot Richard Crafts. Her death led to the state of Connecticut's first murder conviction without the victim's body.[1][2]\nHelle Nielsen married Richard Crafts in 1975 and settled with him in Newtown, Connecticut, United States. Helle continued working as a flight attendant while raising their three children. In 1986, Helle began to suspect that Richard was engaged in extramarital sexual activity, and confronted him about suspicious long-distance phone calls, which angered Richard.[3] Helle met with a divorce attorney and hired a private investigator, Keith Mayo, who snapped photos of Richard kissing another flight attendant outside her New Jersey residence.[3]\nOn November 18, 1986, friends dropped Helle off at the couple's Newtown residence after she had worked a long flight from Frankfurt, West Germany. She was never seen again. That night, a snowstorm hit the area. The next morning, Richard said he was taking Helle and their children to his sister's house in Westport. When he arrived, Helle was not with him. Over the next few weeks, Richard gave Helle's friends a variety of stories as to why they were unable to reach her: that she was visiting her mother in Denmark, that she was visiting the Canary Islands with a friend, or that he simply did not know her whereabouts.[4] Helle's friends were aware that Richard had a volatile temper and grew concerned. Helle had told some of them, \"If something happens to me, don't assume it was an accident.\"[5][6] On December 1, the private investigator Keith Mayo reported her missing to the Newtown Police.[3] Richard Crafts was known to local law enforcement for his work as a volunteer police officer in Newtown, and in 1986 Crafts was working as a part-time police officer in the nearby town of Brookfield.[7] According to Mayo, Newtown Police initially dismissed his concerns, saying that Helle would probably return.[3]\n",
        "type": [
            "murder"
        ]
    },
    "75": {
        "link": "/wiki/Sheldon_Dick",
        "title": "Sheldon Dick",
        "date": "(1950-05-12) May 12, 1950 (aged 43–44)",
        "year": "1950",
        "location": "",
        "state": "",
        "place": "Chicago",
        "county": "Southeastern Connecticut COG",
        "paragraph": "Sheldon Dick (1906–1950) was an American publisher, literary agent,  photographer, and filmmaker.  He was a member of a wealthy and well-connected industrialist family, and was able to support himself while funding a series of literary and artistic endeavors.  He published a book by poet Edgar Lee Masters, and made a documentary about mining that has been of interest to scholars.  Dick is best known for the photographs he took on behalf of the Farm Security Administration during the Great Depression, and for the violent circumstances of his death.\nSheldon Dick was the son of Albert Blake Dick, a wealthy manufacturer of mimeograph machines in Chicago, and Mary Henrietta Dick.[1] He married Dorothy Michelson, the 21-year-old daughter of scientist Albert Abraham Michelson, in 1927, shortly before Dick began studies at Corpus Christi College at Cambridge University.[2]  On returning to the United States, the couple lived in New York; their daughter, also named Dorothy, was born shortly thereafter.\nThe marriage was brief.  Mrs. Dick filed for divorce in April 1932, and stated in her suit that the couple had been separated for a year.  The divorce was concluded within a day, and she received custody of the child.[3]\n",
        "type": [
            "murder"
        ]
    },
    "76": {
        "link": "/wiki/Theodore_Salisbury_Woolsey_Jr.",
        "title": "Theodore Salisbury Woolsey Jr.",
        "date": "July 10, 1933(1933-07-10) (aged 53)",
        "year": "1933",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nTheodore Salisbury Woolsey Jr. (October 2, 1879 – July 10, 1933)[1] was a United States Forest Service employee, forestry researcher, professor at Yale University and author of books and articles related to forestry and forest regulation.\nWoolsey was the son of the legal scholar Theodore Salisbury Woolsey, and grandson of Yale University president Theodore Dwight Woolsey.\n",
        "type": []
    },
    "77": {
        "link": "/wiki/Murder_of_Martha_Moxley",
        "title": "Murder of Martha Moxley",
        "date": "October 30, 1975(1975-10-30) (aged 15) Belle Haven, Greenwich, Connecticut, U.S.",
        "year": "1975",
        "location": "",
        "state": "Connecticut",
        "place": "Belle Haven",
        "county": "Western Connecticut COG",
        "paragraph": "\nMartha Elizabeth Moxley (August 16, 1960 – October 30, 1975) was a 15-year-old American high school student from Greenwich, Connecticut, who was murdered in 1975. Moxley was last seen alive spending time at the home of the Skakel family, across the street from her home in Belle Haven.[1] Michael Skakel, also aged 15 at the time, was convicted in 2002 of murdering Moxley and was sentenced to 20 years to life in prison. In 2013, Skakel was granted a new trial by a Connecticut judge who ruled that his counsel had been inadequate so he was then released on $1.2 million bail. On December 30, 2016, the Connecticut Supreme Court ruled 4–3 to reinstate Skakel's conviction. The Connecticut Supreme Court reversed itself on May 4, 2018, and ordered a new trial.[2][3] On October 30, 2020, the 45th anniversary of Moxley's murder, the state of Connecticut announced it would not retry Skakel for Moxley's murder.\nThe case attracted worldwide publicity, as Skakel is a nephew of Ethel Skakel Kennedy, the widow of U.S. Senator Robert F. Kennedy.\n",
        "type": [
            "murder"
        ]
    },
    "78": {
        "link": "/wiki/JT_Lewis",
        "title": "JT Lewis",
        "date": "",
        "year": "new 2012",
        "location": "",
        "state": "Connecticut",
        "place": "Newtown",
        "county": "Western Connecticut COG",
        "paragraph": "Joseph Theodore Lewis[2] (born May 18, 2000) is an American school safety advocate. Lewis started Newtown Helps Rwanda,[3] a charity that raised money for survivors of the 1994 Rwandan genocide as well as former child soldiers in Uganda. He previously was a candidate in the 2020 elections for Connecticut state senator for the 28th district,[4] dropping out before the August primaries[5] to work on a national campaign. He is the older brother of first grade student Jesse Lewis,[6] a victim of the 2012 Sandy Hook Elementary School shooting in Newtown, Connecticut.[7]\nJT Lewis was born Joseph Theodore Lewis on May 18, 2000,[1] to Scarlett Lewis.[8] He is the older brother of six-year-old Jesse Lewis,[9] who was a first grade student at Sandy Hook Elementary School when he and others were killed in a shooting at the school on December 14, 2012.[10] He was a twelve-year-old seventh grade student when his brother died.[11] Lewis was raised on a farm with his younger brother and they had horses, dogs, and chickens, which their mother bought in 1998.[12] Several days after the shooting, former president Barack Obama met with Lewis, his mother, and the victims' families at Newtown High School.[13] Lewis recalled the event years later saying that \"President Obama treated me with the utmost respect and class. More importantly, [he] honored my brother’s memory.\"[14] Lewis attended Newtown High School and was on the varsity football team, graduating in 2018.[15] \nLewis currently attends University of Connecticut as a political science major.[11] He played on the UConn football team as a walk-on kicker his Freshman year.[16]\nAfter the shooting, Lewis became an advocate for trauma victims and founded the organization Newtown Helps Rwanda, which raises money for relatives of the victims of the 1994 Rwanda genocide to attend college and also participates in other causes.[11] Survivors of the genocide reached out to Lewis via Skype to talk about their traumatic experiences losing family members due to violence and offer their condolences to him.[17] As a gesture of gratitude to the survivors, Lewis founded the organization to raise money for their education.[18] After a few months of fundraising, the organization raised enough money to send several survivors to college and have raised over $35,000.[17] Lewis's organization also helped Ugandan former child soldiers build fishponds and poultry farms for self-sufficiency.[18] The organization has expanded its focus to several causes to help victims of trauma, such as victims and survivors of automobile accidents. He has also interned for the non-profit organization Jesse Lewis Choose Love Movement, which his mother founded.[18] Lewis co-won the Courage Award at the 2016 Teen Choice Awards for his advocacy work.[19] The award was presented to him by singer Ne-Yo and actress Jessica Alba. He also met with singer Justin Timberlake after the ceremony.[19]\n",
        "type": [
            "shooting"
        ]
    },
    "79": {
        "link": "/wiki/Little_Miss_1565",
        "title": "Hartford circus fire",
        "date": "July 6, 1944 (1944-07-06)",
        "year": "1944",
        "location": "Hartford, Connecticut, U.S.",
        "state": "Connecticut",
        "place": "Hartford",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford circus fire, which occurred on July 6, 1944, in Hartford, Connecticut, was one of the worst fire disasters in United States history.[3] The fire occurred during an afternoon performance of the Ringling Bros. and Barnum & Bailey Circus that was attended by 6,000 to 8,000 people. The fire killed at least 167 people,[4] and more than 700 were injured.\nIn mid-20th century America, a typical circus traveled from town to town by train, performing under a huge canvas tent commonly called a \"big top\". The Ringling Brothers and Barnum & Bailey Circus was no exception; what made it stand out was that it was the largest circus in the country.\n",
        "type": [
            "arson"
        ]
    },
    "80": {
        "link": "/wiki/Hannah_Ocuish",
        "title": "Hannah Ocuish",
        "date": "July 21, 1786; 236 years ago (1786-07-21) Around 10 AM[1]: 29 ",
        "year": "",
        "location": "Public road leading from New-London to Norwich[1]: 29–30 ",
        "state": "Connecticut",
        "place": "New-London",
        "county": "Southeastern Connecticut COG",
        "paragraph": "\nHannah Ocuish (sometimes \"Occuish\";[3] March 1774 – December 20, 1786) was a 12-year old Pequot Native American girl with an intellectual disability who was hanged on December 20, 1786, in New London, Connecticut for the murder of Eunice Bolles, the 6-year old daughter of a wealthy farmer. She is believed to be the youngest person executed in the United States.[4] In recent years, Ocuish's guilt, culpability, and the fairness of her trial have come into question.[2]\nHenry Channing, a minister, published a sermon entitled God Admonishing His People of their Duty ... a Sermon ... Occasioned by the Execution of Hannah Ocuish, a Mixed Girl, Aged 12 Years and 9 Months, for the Murder of Eunice Bolles, Aged 6 Years and 6 Months.[1] It describes the negative and racially prejudiced light in which her early life was presented to the court, referring to her Native American mother as an \"abandoned creature\", and characterizing Ocuish as a fearsome violent criminal who at the age of 6 nearly killed another victim during a robbery of a gold necklace and clothing:\n",
        "type": [
            "robber",
            "robbery",
            "murder"
        ]
    },
    "81": {
        "link": "/wiki/Bryan_Cirigliano",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "year": "2010",
        "location": "Manchester, Connecticut, USA",
        "state": "Connecticut",
        "place": "Manchester",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\nThornton, aged 34, was called into his place of employment for disciplinary purposes. Thornton had been recorded on surveillance video in the Hartford Distributors warehouse stealing beer on a previous occasion. He was also implicated in the theft of empty beer kegs.[9] Hartford Distributors is a wholesale distributor of Budweiser beer products and wine. Given the options of being fired or resigning, Thornton signed the resignation papers and was being escorted out of the building. Instead of leaving, he took a Ruger SR9 semi-automatic pistol from his lunchbox and opened fire.\n",
        "type": [
            "theft",
            "murder",
            "mass murder",
            "mass shooting",
            "shooting"
        ]
    },
    "82": {
        "link": "/wiki/Torrington_High_School_rape_cases",
        "title": "Torrington High School rape cases",
        "date": "",
        "year": "new 2013",
        "location": "",
        "state": "Connecticut",
        "place": "Torrington",
        "county": "Northwest Hills COG",
        "paragraph": "The Torrington High School rape case refers to five separate rape cases in Torrington, Connecticut, United States, involving 6 former Torrington High School football players and two other Torrington teens.[1]\nIn a 2013 case, Joan Toribio and Edgar Gonzalez, both 18-year-old former football players from Torrington High School, were convicted in the sexual assault of two 13-year-old girls in Torrington, Connecticut.[2][3][4] Joan Toribio was sentenced to 9 months in prison.[5] Edgar Gonzalez was sentenced to six years in prison.[6]\nIn a 2011 case, Kenuel Weaver-Hunt, 17, and Dylan Rodriguez, 16, pleaded guilty to charges of risk of injury to a minor with illicit sexual contact, a class \"D\" felony.[7] Both were sentenced to five years in prison, suspended after four months served.[8] Alec Berkemeier, 16, was charged with second-degree sexual assault and risk of injury to a minor with illicit sexual contact, but reached a deal with the prosecutors that included a provision to seal the records of the case.[9]\n",
        "type": [
            "rape",
            "sex crime",
            "assault"
        ]
    },
    "83": {
        "link": "/wiki/Joseph_%22Mad_Dog%22_Taborsky",
        "title": "Joseph \"Mad Dog\" Taborsky",
        "date": "May 17, 1960(1960-05-17) (aged 36) Wethersfield State Prison, Wethersfield, Connecticut, U.S.",
        "year": "1960",
        "location": "",
        "state": "Connecticut",
        "place": "Wethersfield",
        "county": "Capitol Region COG",
        "paragraph": "Joseph \"Mad Dog\" Taborsky (March 23, 1924 – May 17, 1960) was a serial killer who was sentenced to death after a string of robberies and murders in Connecticut during the 1950s. Six people were killed during these events, which became known as the \"Mad Dog Killings.\"  A number of others were shot, beaten, or pistol-whipped but survived.  Taborsky earned his nickname due to the savagery of the killings that condemned him to death. In 1957, Connecticut package store hours were modified to close from 8:00 p.m. to 11:00 p.m. due in part as a response to the crimes of Taborsky and his partner Arthur \"Meatball\" Culombe. [1]\nHe was executed by electric chair at the age of 36.  His execution in 1960 was the last in Connecticut (and in New England) until that of Michael Bruce Ross in 2005.  Taborsky donated his body to Yale School of Medicine, and his ashes were later buried in the garden of Christ Church Cathedral.\nTaborsky is an anomaly in Connecticut death penalty lore. He is the only convict sent to death row twice, for different crimes. Taborsky first came to Connecticut's death row for the 1950 murder of Louis Wolfson, a West Hartford liquor store owner during a robbery. His younger brother Albert, who was also his co-conspirator, testified against Taborsky at the trial in exchange for a life sentence.  In prison Albert exhibited signs of mental illness and was institutionalized.  \n",
        "type": [
            "killing",
            "robbery",
            "robberies",
            "murder",
            "robber"
        ]
    },
    "84": {
        "link": "/wiki/Northern_Correctional_Institution",
        "title": "Northern Correctional Institution",
        "date": "",
        "year": "",
        "location": "Somers, Connecticut",
        "state": "Connecticut",
        "place": "",
        "county": "",
        "paragraph": "1995-1995 \tDavid May\n1995-1996 \tRobert Kupec\n1996-1999 \tGiovanny Gomez\n1999-2003 \tLarry J. Myers\n2003-2006 \tWayne Choinski\n2006-2009 \tJeffrey McGill\n2009-2011 \tAngel Quiros\n2011-2014   Edward Maldonado\n2014-2016   Anne Cournoyer\n2016-2017   William Mulligan\n2017        William Faneuff\n2017-2019 \tNick Rodriquez\nNorthern Correctional Institution (NCI) was a high-security state prison in Somers,[3][4] in the northern part of the U.S. state of Connecticut.  Until its closure, the prison housed the state's male convicts serving long sentences for violent crimes; previously, it had also housed the death row for inmates before the abolition of the death penalty in Connecticut.\nIt was the designated restrictive housing facility for the Connecticut Department of Correction, managing those inmates who had demonstrated a serious inability to adjust to confinement, particularly those that posed a threat to the safety and security of the community, staff, and other inmates.\n",
        "type": []
    },
    "85": {
        "link": "/wiki/Hartford_Distributors_shooting",
        "title": "Hartford Distributors shooting",
        "date": "August 3, 2010 (2010-08-03)",
        "year": "2010",
        "location": "Manchester, Connecticut, USA",
        "state": "Connecticut",
        "place": "Manchester",
        "county": "Capitol Region COG",
        "paragraph": "\nThe Hartford Distributors shooting was a mass shooting that occurred on August 3, 2010, in Manchester, Connecticut, United States. The location of the crime was a warehouse owned by Hartford Distributors, a beer distribution company. The gunman, former employee Omar Sheriff Thornton (born April 25, 1976)[1] shot and killed eight male coworkers before turning a gun on himself.[2][3][4][5][6][7][8][excessive citations]\nThornton, aged 34, was called into his place of employment for disciplinary purposes. Thornton had been recorded on surveillance video in the Hartford Distributors warehouse stealing beer on a previous occasion. He was also implicated in the theft of empty beer kegs.[9] Hartford Distributors is a wholesale distributor of Budweiser beer products and wine. Given the options of being fired or resigning, Thornton signed the resignation papers and was being escorted out of the building. Instead of leaving, he took a Ruger SR9 semi-automatic pistol from his lunchbox and opened fire.\n",
        "type": [
            "theft",
            "murder",
            "mass murder",
            "mass shooting",
            "shooting"
        ]
    },
    "86": {
        "link": "/wiki/Sandy_Hook_Memorial",
        "title": "Sandy Hook Memorial",
        "date": "",
        "year": "new 2012",
        "location": "",
        "state": "Connecticut",
        "place": "Sandy Hook",
        "county": "Western Connecticut COG",
        "paragraph": "\nThe Sandy Hook Permanent Memorial is a memorial in Sandy Hook, Connecticut, that honors the twenty children and six educators who were victims of the Sandy Hook Elementary School shooting on the morning of December 14, 2012. The memorial is located at 28 Riverside Road in the woods adjacent to the new Sandy Hook Elementary School, built near the site of the original school that was razed.[1]\nPlanning for a memorial began in 2013 when Newtown's board of selectmen appointed the Sandy Hook Permanent Memorial Commission.[2] The five-acre site, donated by the Boys Social and Athletic Club of Sandy Hook, was chosen from among 17 potential properties after commission members heard children playing on the nearby school's playground during a site walk.[3] The winning design, created by architects Dan Affleck and Ben Waldo of SWA Group, was selected from a pool of 189 submissions.[4]\n",
        "type": [
            "shooting"
        ]
    },
    "87": {
        "link": "/wiki/Frank_Piccolo",
        "title": "Frank Piccolo",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Bridgeport",
        "county": "Greater Bridgeport COG",
        "paragraph": "Frank Louis Piccolo also known as Frank Lanza (July 2, 1921 – September 19, 1981), was a caporegime in the Gambino crime family in Bridgeport, Connecticut who became involved in a famous extortion case with singer Wayne Newton.[citation needed]\nBorn on July 2, 1921, in New York City, Piccolo was the only son of Francesco Piccolo and Fannie Lanza. Frank Piccolo stood at 6 ft (1.8 m) tall and weighed 200 pounds (91 kg) with black hair, brown eyes, and had a husky build. He was married to Virginia Paglinco and was the father of four children.[1]  Piccolo and his family lived in Bridgeport, Connecticut. He was the cousin of Guido Penosi.[2]\nIn 1980, Piccolo attempted to blackmail money from Wayne Newton. Newton was trying to disengage himself from a financial investment in a Las Vegas, Nevada tabloid newspaper, but was being threatened by his partners in the venture. When the Las Vegas Police Department was unable to stop the threats, Newton turned to his friend Guido Penosi for help. Penosi referred Newton to Piccolo, who then used his influence to stop the threats. Piccolo then performed a similar favor for Newton's business advisor.[3]\n",
        "type": [
            "murder"
        ]
    },
    "88": {
        "link": "/wiki/Jasper_Howard",
        "title": "Jasper Howard",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Miami",
        "county": "Lower Connecticut River Valley COG",
        "paragraph": "\nJasper Tyrone \"Jazz\" Howard (January 28, 1989 – October 18, 2009) was an American football cornerback for the University of Connecticut Huskies from 2007 to 2009. He was fatally stabbed on October 18, 2009, hours after UConn's win over the Louisville Cardinals.\nHoward grew up in the Little Haiti neighborhood of Miami, an area known for its poverty and violence. His mother JoAngila Howard worked numerous jobs to support Howard and his two younger sisters.[1]\nHis youngest sister had health issues after a severe case of meningitis.[2] His plan was to get a football scholarship and go to the NFL to get money and get his family out of the violent streets of Miami.  At Miami Edison High School, Howard was an All-Dade County pick as a senior, and named MVP of the annual Nike Dade-Broward All-Star Game after returning a punt 70 yards for a touchdown and making a 45-yard touchdown catch.  He was also the team captain.[3]\n",
        "type": [
            "murder"
        ]
    },
    "89": {
        "link": "/wiki/Harry_Thurston_Peck",
        "title": "Harry Thurston Peck",
        "date": "",
        "year": "",
        "location": "",
        "state": "Connecticut",
        "place": "Stamford",
        "county": "Western Connecticut COG",
        "paragraph": "Harry Thurston Peck (November 24, 1856 – March 23, 1914) was an American classical scholar, author, editor, historian and critic.\nPeck was born in Stamford, Connecticut. He was educated in private schools and at Columbia College, graduating in 1881, where his literary gifts attracted wide attention. His address at the conclusion of that year's commencement exercises was \"witty, pathetic, and full of clever allusions\" according to the New York Times. \"Bouquets fell at his feet by the score as he bowed his way off the stage.\"[1] Upon graduation, he immediately joined the faculty as a Latin tutor, becoming a professor in 1888.[2] He was among several faculty members appointed to newly created chairs when he became Anthon Professor of Latin Language and Literature at the celebration of the 150th anniversary of Columbia's founding in 1904.[3]\nPeck also wrote travel guides and produced translations and works for children under a number of pseudonyms, and he was a frequent and forceful contributor to magazines and newspapers. He was editor in chief of Harpers Dictionary of Classical Antiquities and editor of the Students' Series of Latin Classics and Columbia University Studies in Classical Philology. He served as the first editor in chief of The Bookman magazine, worked on its staff from 1895 to 1906, and created America's first best-seller list for its pages in 1895. He was also editor in chief of the International Cyclopaedia from 1890 to 1901 and co-editor of the first edition of the New International Encyclopedia (1902–1904).  In 1906 he published a nearly 800-page monument of progressive historiography, Twenty Years of the Republic 1885-1905, expansive, dense with detail and reference, penetrating, scathing in its revelations of actual social, economic and political conditions.  It was excoriated in the metropolitan press and plainly had much to do with his later difficulties.\n",
        "type": []
    },
    "90": {
        "link": "/wiki/Disappearance_of_Jennifer_Dulos",
        "title": "Disappearance of Jennifer Dulos",
        "date": "",
        "year": "new 2020",
        "location": "",
        "state": "Connecticut",
        "place": "New Canaan",
        "county": "Western Connecticut COG",
        "paragraph": "\nJennifer Dulos (née  Farber; born September 27, 1968) is an American woman who went missing on May 24, 2019. Authorities suspect that she was killed in a violent attack at her home in New Canaan, Connecticut. Her husband, Fotis Dulos, and his girlfriend, Michelle Troconis, were arrested on charges of tampering with evidence and hindering prosecution in connection with Jennifer's disappearance. Later, the two – along with Fotis' attorney Kent Mawhinney – faced additional charges related to Jennifer's murder. Fotis died by suicide in January 2020. As of June 2022[update], neither Troconis nor Mawhinney have had their day in court, so none of the accused have yet been proven guilty.[1]\nJennifer and Fotis were in the midst of both a contentious divorce and child-custody proceedings.[2] Police suspect that Fotis had been lying in wait for Jennifer and attacked her when she arrived at her home, after dropping her children off at school. Police allege that he and Troconis drove to Hartford to dispose of garbage bags containing items with Jennifer's blood on them on the night that Jennifer disappeared. Police further allege that Mawhinney conspired with Fotis and Troconis. If convicted, they will spend life behind bars.\n",
        "type": [
            "murder"
        ]
    }
}