{
    "0": {
        "link": "/wiki/Thomas_Capano",
        "title": "Thomas Capano",
        "date": "September 19, 2011(2011-09-19) (aged 61) Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "2011",
        "location": "",
        "state": "Delaware",
        "place": "Smyrna",
        "county": "Kent County",
        "paragraph": "\nThomas Joseph Capano (October 11, 1949 – September 19, 2011)[1][2] was a disbarred American lawyer and former Delaware deputy attorney general who was convicted of the 1996 murder of Anne Marie Fahey, his former lover.\nThomas Capano, a prominent Democrat, was one of four brothers. Capano belonged to a prominent family of Delaware real estate developers and building contractors. He became an affluent lawyer, state prosecutor, Wilmington city attorney, legal counsel to Governor Mike Castle, and political consultant, well known in Delaware's political circles.\n",
        "type": [
            "murder"
        ]
    },
    "1": {
        "link": "/wiki/Shalita_Middleton",
        "title": "Delaware State University shooting",
        "date": "September 21, 2007  (UTC-4)",
        "year": "2007",
        "location": "Dover, Delaware, United States",
        "state": "Delaware",
        "place": "Dover",
        "county": "Kent County",
        "paragraph": "On September 21, 2007, two 17-year-old Delaware State University freshmen were shot on campus. One died 32 days later on October 23, from critical injuries sustained in the attack. A suspected perpetrator, Loyer D. Braden, a freshman from East Orange, New Jersey, was arrested and charged with attempted murder; the charges were dismissed in May 2009.\nOn September 21, 2007, a perpetrator shot two 17-year-old Delaware State University students from the Washington, D.C. area, Shalita Middleton and Nathaniel Pugh, and shot at but did not wound a third student.[1] Middleton died on October 23 from injuries sustained in the attack, without regaining consciousness.[2][3]\nThe university responded within 20 minutes of the shooting to notify students by web announcements, physically entering dorms, and telecommunications.[4]  Text messages were not sent at the time of the incident.[5] The campus was kept on \"limited access status\" from Friday, September 21 through Sunday, September 23, with classes resuming on Monday, September 24.[6] The university increased security patrols on campus following the incident.[7]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "2": {
        "link": "/wiki/Wilmington_riot_of_1968",
        "title": "Wilmington riot of 1968",
        "date": "April 9–10, 1968",
        "year": "1968",
        "location": "Wilmington, Delaware",
        "state": "Delaware",
        "place": "Wilmington",
        "county": "New Castle County",
        "paragraph": "The Wilmington Riot of 1968 occurred in Wilmington, Delaware, in April of that year following the assassination of Martin Luther King Jr. The riot did not cause any fatalities, though there were numerous injuries, arrests, and buildings burned. Despite the quick cessation of rioting, the governor refused to recall the Delaware Army National Guard, leaving them in the city as an occupying force until the following year. \nPrior to the events of the late 1960s, tensions were already running high in Wilmington.  There had already been a race riot in 1919. The flight of white city dwellers to the suburbs, migration of southern blacks to the city, and lingering bad feelings from the construction of I-95 resulted in a divided city, and attempts by local leaders to alleviate the social issue plaguing the city were unsuccessful.[1][2] Heightened racial tensions and altercations in July 1967 were followed by two days of sporadic vandalism, looting, and firebombing. At the request of Wilmington Mayor John Babiarz, state police were summoned to increase patrols. For his part, Governor Charles L. Terry (a southern-style Democrat) publicly warned of minority violence and conspiracies and placed fifteen hundred National Guardsmen on standby alert at Wilmington's airport.  He also proposed and signed legislation granting him sole authority to impose martial law and ban the sale of alcohol and established a riot commission.  In addition to the Delaware National Guard, the Governor activated the entire Delaware State Police Department.  All days off were canceled, vacations were canceled and all troopers were to report to their assigned Troop.  The Delaware State Police who were nearest to the City of Wilmington were sent to Troop 2 located south of the city.  Only a skeleton force was left at the other Troops located in New Castle County.  The Troopers who were assigned to Kent and Sussex counties Troops were sent to Troop 2.  Once the lower county Troopers arrived at Troop 2 they were paired with those of New Castle County.  Any request for law enforcement assistance from the Wilmington Police Department was sent to Troop 2.\nIn the wake of the assassination of Martin Luther King Jr. on April 4, 1968, a large number of black youths converged on the main downtown business area of Wilmington and began looting stores April 9–10, 1968. A report of sniper fire prompted Democratic mayor Babiarz to declare a state of emergency, to impose a curfew, and to request assistance from Governor Terry. The two-day riot that occurred after the assassination was small compared with riots in other cities, but its aftermath highlighted the depth of Wilmington's racial problem.[3]\n",
        "type": [
            "riot",
            "looting"
        ]
    },
    "3": {
        "link": "/wiki/Steven_Brian_Pennell",
        "title": "Steven Brian Pennell",
        "date": "March 14, 1992 (aged 34) James T. Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "1992",
        "location": "",
        "state": "Delaware",
        "place": "Smyrna",
        "county": "Kent County",
        "paragraph": "Steven Brian Pennell (November 22, 1957 – March 14, 1992), aka The Route 40 Killer, was Delaware's only known serial killer, convicted of the murders of two New Castle County, Delaware women and suspected of killing three others. He abducted most of his victims from U.S. Route 40, near Bear.\nThe first victim was 23-year-old Shirley Anna Ellis, a nurse. On November 29, 1987, she left Wilmington Hospital around 6 PM, where she was aiding an AIDS patient, catching a lift on her way home on Route 40. Her body was later found by the roadside by two boys. She was partially nude, her legs spread out, hands and feet tied with adhesive tape. There were no signs of sexual assault, but she had been seriously abused, with her killer tying a string around her neck and hitting her head with a hammer before she died.[1]\nThe second victim was 31-year-old Catherine A. DiMauro. On June 28, 1988, about seven months after the first murder, around 11:30 PM, she was seen walking down Route 40. At 6:25 AM, construction workers found her naked body at a construction site. No signs of sexual assault were found. Like Ellis, she was killed by hammer blows and strangulation, but unlike the first murder, DiMauro's body was covered in blue fibers.\n",
        "type": [
            "murder",
            "assault",
            "killing"
        ]
    },
    "4": {
        "link": "/wiki/Killing_of_Stephen_Ballard",
        "title": "Killing of Stephen Ballard",
        "date": "April 27, 2017; 5 years ago (2017-04-27)",
        "year": "2017",
        "location": "Middletown, Delaware, U.S.",
        "state": "Delaware",
        "place": "Middletown",
        "county": "New Castle County",
        "paragraph": "Corporal Stephen J. Ballard (January 28, 1985 – April 26, 2017) was a Delaware State Police Officer. On April 26, 2017 Ballard was shot and killed after approaching a suspicious vehicle at a Wawa in Bear, Delaware.[1][2][3] A day later, the perpetrator, Burgon Sealy, Jr. was shot and killed after a standoff with police.\nBallard was shot and killed on April 26, 2017 after he approached a suspicious vehicle in the parking lot of a Wawa gas-station in Bear, Delaware.  After asking the driver and passenger in the car for identification, Ballard asked the passenger, Burgon Sealy Jr., to step out of the car.  Sealy got into a struggle with Ballard, then began shooting at him. When Ballard, who was unable to draw his weapon in time, attempted to find cover from Sealy, Sealy pursued and continued to shoot, hitting Ballard multiple times in the upper body and continuing to shoot even after the officer fell to the ground.[4]\nBallard was born in Bowie, Maryland on January 28, 1985. He graduated from Delaware State University in 2007 with a degree in Criminal Justice, after which he was recruited into the Delaware State Police academy. He graduated from the academy in 2009.[5] At the time of his death Ballard had served eight years on the Delaware State Police.\n",
        "type": [
            "killing",
            "shooting"
        ]
    },
    "5": {
        "link": "/wiki/John_P._Wheeler_III",
        "title": "John P. Wheeler III",
        "date": "c. December 30, 2010(2010-12-30) (aged 66) Delaware, U.S.",
        "year": "2010",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "John Parsons Wheeler III (December 14, 1944 – c. December 30, 2010), known as Jack Wheeler, was an American businessman and former White House aide. Wheeler was chairman of the Vietnam Veterans Memorial Fund, senior planner for Amtrak (1971–1972), official of the Securities and Exchange Commission (1978–1986), chief executive and CEO of Mothers Against Drunk Driving, consultant to the Mitre Corporation (2009–death), and a presidential aide to the Ronald Reagan, George H. W. Bush, and George W. Bush administrations. He also held numerous other positions in the United States military, government, and corporations.[2][3] He died under mysterious circumstances on December 30, 2010.\nWheeler was descended from a family of military professionals which included Joseph Wheeler, who had served as a general both in the Confederate Army, and later with the United States Army. Wheeler III was born in Laredo, Texas, where his mother, Janet Conly Wheeler, was staying with her mother while his father was in Europe. Five days after the delivery, the family received a telegram that his father was missing in action in the Battle of the Bulge. His father was later found to be alive.[4]  Wheeler had one younger brother, Robert Conly Wheeler, and one younger sister, Janet Wheeler Gilani.[5]\nWheeler was a member of the United States Military Academy class of 1966 which lost 30 of its members in the Vietnam War.[4]\n",
        "type": [
            "murder",
            "arson"
        ]
    },
    "6": {
        "link": "/wiki/James_B._Clark_Jr.",
        "title": "James B. Clark Jr.",
        "date": "April 19, 1996(1996-04-19) (aged 39) James T. Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "1996",
        "location": "",
        "state": "",
        "place": "Smyrna",
        "county": "Kent County",
        "paragraph": "James B. Clark Jr. (February 8, 1957 – April 19, 1996) was an inmate executed in the State of Delaware for the murder of his adoptive parents.[1] Clark confessed to the crime. He was motivated by a desire for the couple's life insurance. The murders took place on May 22, 1994, one month after he had been released on parole for an earlier conviction.[2] Clark had served 21 years of a 30-year sentence for his attempted slaying of a 3-year-old girl in 1973, but in spite of his failure to participate in rehabilitation and repeated discipline by prison authorities for fighting, he was released for good behavior. His case inspired public outrage and proposed legislation to curtail unwarranted early release.\nClark was born on February 8, 1957, and was a resident of the State of Delaware.[2] He was adopted by Elizabeth and James B. Clark Sr.. The identity of his birth parents is unknown.[3][4]\nWhen Clark was two years old, he developed a pattern of frequently attacking other children. He was expelled from two pre-kindergarten programs due to his behavior and began receiving psychotherapy and medication when he was 5.[3]\n",
        "type": [
            "murder"
        ]
    },
    "7": {
        "link": "/wiki/Nelson_Shelton",
        "title": "Murder of Wilson Mannon",
        "date": "March 17, 1995(1995-03-17) (aged 27) James T. Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "1995",
        "location": "",
        "state": "Delaware",
        "place": "Smyrna",
        "county": "Kent County",
        "paragraph": "Wilson Mannon Jr. (January 5, 1928 – January 16, 1992) was an American man who was robbed and murdered by three career criminals in Delaware.\nThe perpetrators were brothers Nelson Shelton (July 20, 1967 – March 17, 1995) and Steven W. Shelton (born July 11, 1965), and their cousin Jack Foster Outten Jr. (born March 23, 1966). All three men were convicted of first degree murder and sentenced to death. Nelson was executed in 1995 after waiving his appeals, while Steven and Outten eventually won appeals, and had their sentences reduced to lengthy prison terms in plea agreements years later.\nThe case drew attention after Steven donated one of his kidneys to his ailing mother, Vessa Shelton. Nelson had wanted to donate his own kidney, but his was found to be incompatible. Steven donated one in his brother's place.\n",
        "type": [
            "murder"
        ]
    },
    "8": {
        "link": "/wiki/Wilmington,_Delaware_race_riot_of_1919",
        "title": "Wilmington, Delaware race riot of 1919",
        "date": "November 13, 1919",
        "year": "1919",
        "location": "Wilmington, Delaware, United States",
        "state": "Delaware",
        "place": "Wilmington",
        "county": "New Castle County",
        "paragraph": "The Wilmington, Delaware race riot of 1919 was a violent racial riot between white and black residents of Wilmington, Delaware on November 13, 1919.\nThe Price family were  African-American suspects in the robbery of a Wilmington, Delaware gun store.[1] The guns, in turn, had been pawned throughout the city. While raiding the Price house Patrolman Thomas L. Zebley (sometimes spelled Scebley) was killed and Officer Harry F. Pierce was shot twice in the lungs.[2] When the two officers entered the house the three brothers were sleeping. When awakened by the officers the brothers took guns from under their pillows and started shooting.[3] Three brothers were arrested at the scene: Lemuel, James and John Price. Lemuel is thought to have shot Zebley through the heart.[3]\nAs news of the shooting spread an angry white mob grew and tried to lynch the three brothers. Wilmington police were able to prevent this by secreting the brothers to Philadelphia's Central police station.[4] When the mob found out the brothers were out of their reach they turned their anger on the black community. One mob of 300 whites were rampaging through the black part of town. When they encountered 4 black men, the two parties shot at each other and African-American Bannel Fields was wounded with a shot in the head.[4]\n",
        "type": [
            "robber",
            "riot",
            "shooting",
            "robbery"
        ]
    },
    "9": {
        "link": "/wiki/Lynching_of_George_White",
        "title": "Lynching of George White",
        "date": "June 22, 1903; 119 years ago (1903-06-22)",
        "year": "1903",
        "location": "Wilmington, Delaware, U.S.",
        "state": "Delaware",
        "place": "Wilmington",
        "county": "New Castle County",
        "paragraph": "The lynching of George White occurred on Monday, June 22, 1903 in Wilmington, Delaware. White was a black farmer who was accused of the rape and murder of Helen Bishop, who was arrested and brought to the workhouse. On the evening of June 22, under the impression that the local authorities were not reacting severely or soon enough, a large mob of white men marched to the workhouse, broke their way in, and forced White out of his cell. He was then brought to the site of Helen Bishop's death, bludgeoned, had parts of his body dismembered, then was tied to a stake, and burnt to death.[4] It is often referred to as the only documented lynching in Delaware, and as one of the worst crimes in Delaware history.[5]\nThe late 19th and early 20th centuries were times of high racial tension in the United States. This also coincided with a national pattern of racial violence. Between the years 1882 and 1921, the United States experienced more than 3,405 lynchings.[6] Most of these victims were black men, but women and children were also targeted. While many people did not believe in lynching, others found them not only acceptable but necessary. These events were sometimes referred to as \"unofficial executions.\"[6] In 1903 specifically, there was a wave of lynchings across the midwest, including events in Evansville, Indiana, Springfield, Ohio, Belleville, and Danville, Illinois.\nThese attitudes were especially complicated in Delaware. In his documentary \"In the Dead Fire's Ashes,\" Stephen Labovsky describes the town of Wilmington as \"North of the South but South of the North.\" This is because of its position as a border state during and after the U.S. Civil War. Scholar Michael J. Pfeifer describes this contradiction, saying \"If the area's commercial interests were more aligned with...the industrial North, the state's social politics continued to reflect a Jim Crow orientation on matters of race and rights.\"[7]\n",
        "type": [
            "murder",
            "lynching",
            "rape"
        ]
    },
    "10": {
        "link": "/wiki/Billy_Bailey",
        "title": "Billy Bailey",
        "date": "June 12, 1979",
        "year": "1979",
        "location": "",
        "state": "Delaware",
        "place": "Wilmington",
        "county": "New Castle County",
        "paragraph": "Billy Bailey (January 1947 – January 25, 1996) was a convicted murderer who was hanged in Delaware in 1996. He became the third person to be hanged in the United States since 1965 (the previous two were Charles Rodman Campbell and Westley Allan Dodd, both in Washington), and the first person hanged in Delaware in 50 years.[2][3] As of 2023, he remains the last person to be executed by hanging in the United States.[4]\nThe ninth of 23 children, Bailey lived in stark poverty and suffered chronic physical abuse, state records show. His mother died when he was less than a year old. As an adult, Bailey was known to police as a brawler and a thief.[5]\nIn 1979, after being convicted of forgery, Bailey was assigned to the Plummer House, a work release facility in Wilmington, Delaware, but soon escaped. He later appeared at the home of his foster sister, Sue Ann Coker, in Cheswold, Delaware, saying he was upset and was not going back to the Plummer House.[5]\n",
        "type": [
            "murder",
            "thief"
        ]
    },
    "11": {
        "link": "/wiki/Brian_Steckel",
        "title": "Brian Steckel",
        "date": "November 4, 2005(2005-11-04) (aged 36) James T. Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "2005",
        "location": "",
        "state": "Delaware",
        "place": "Smyrna",
        "county": "Kent County",
        "paragraph": "Brian David Steckel (December 14, 1968 – November 4, 2005) was an American convicted killer in the 1994 rape and murder of 29-year-old Sandra Lee Long near Wilmington, Delaware.\nOn September 2, 1994, Steckel knocked on Long's door and asked to use her telephone. Once inside, he disconnected the phone and demanded sex from her. When she refused, he threw her onto a couch and attempted to strangle her with some pantyhose. The pantyhose broke, so he continued his attack with a sock. After she was unconscious he sexually assaulted her. He then dragged Long to a bedroom, where he set her and the curtains on fire.  Long died of smoke inhalation and burns to 60 percent of her body.\nSteckel then went to the home of a former co-worker, where he drank several beers. After the co-worker left, Steckel asked the co-worker's wife to drive him to a liquor store. This led them past Long's apartment, now on fire. The co-worker's wife later said that Steckel became agitated and angry when she jokingly said, \"You look like you've killed someone.\"\n",
        "type": [
            "murder",
            "assault",
            "rape"
        ]
    },
    "12": {
        "link": "/wiki/Murder_of_Wilson_Mannon",
        "title": "Murder of Wilson Mannon",
        "date": "March 17, 1995(1995-03-17) (aged 27) James T. Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "1995",
        "location": "",
        "state": "Delaware",
        "place": "Smyrna",
        "county": "Kent County",
        "paragraph": "Wilson Mannon Jr. (January 5, 1928 – January 16, 1992) was an American man who was robbed and murdered by three career criminals in Delaware.\nThe perpetrators were brothers Nelson Shelton (July 20, 1967 – March 17, 1995) and Steven W. Shelton (born July 11, 1965), and their cousin Jack Foster Outten Jr. (born March 23, 1966). All three men were convicted of first degree murder and sentenced to death. Nelson was executed in 1995 after waiving his appeals, while Steven and Outten eventually won appeals, and had their sentences reduced to lengthy prison terms in plea agreements years later.\nThe case drew attention after Steven donated one of his kidneys to his ailing mother, Vessa Shelton. Nelson had wanted to donate his own kidney, but his was found to be incompatible. Steven donated one in his brother's place.\n",
        "type": [
            "murder"
        ]
    },
    "13": {
        "link": "/wiki/Killing_of_Jeremy_McDole",
        "title": "Killing of Jeremy McDole",
        "date": "September 23, 2015 (2015-09-23)",
        "year": "2015",
        "location": "Wilmington, Delaware, United States",
        "state": "Delaware",
        "place": "Wilmington",
        "county": "New Castle County",
        "paragraph": "\nJeremy \"Bam Bam\" McDole was a 28-year-old African American paraplegic who was shot and killed by police in Wilmington, Delaware on September 23, 2015, at 3:00 pm. McDole was in a wheelchair at the time of the shooting. Police responded to a call about a man with a gun. The 911 caller later recanted her statements and has, to date, faced no penalties for the false statements made, which resulted in McDoles death. Camera footage from a bystander showed officers ordering McDole to drop his weapon and raise his hands, with McDole being shot after reaching for his waist area, but with a gun never being seen and evidence photos of the reported weapon only appearing 6 years after his murder.[3][4][5] The Delaware state department cleared the officers of wrongdoing, but concluded that one of the involved officers had shown \"extraordinarily poor\" police work. A 2020 review by the Delaware Attorney General's Office came to the same conclusion. Both decided against filing any charges. The McDole family sued the city of Wilmington, and in January 2017, a settlement of $1.5 million was reached by the city.[2][3]\nOn September 23, 2015, at around 3:00 p.m., local police in Wilmington, Delaware responded to a 911 call about a man who had suffered a self-inflicted gunshot wound. The female caller told the dispatcher that a man had shot himself, still had the weapon, and had fallen onto the ground but was moving back into his wheelchair.[6]\n",
        "type": [
            "murder",
            "killing",
            "shooting"
        ]
    },
    "14": {
        "link": "/wiki/James_Allen_Red_Dog",
        "title": "James Allen Red Dog",
        "date": "March 3, 1993(1993-03-03) (aged 39) James T. Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "1993",
        "location": "",
        "state": "Delaware",
        "place": "Smyrna",
        "county": "Kent County",
        "paragraph": "James Allen Red Dog (February 1, 1954 – March 3, 1993) was a mixed Sioux and Assiniboine serial killer from Fort Peck Indian Reservation who was executed at his own request for murdering Hugh Pennington and who had previously been convicted twice of armed robbery. As a result of his crimes, Joe Biden introduced legislation that required states to be notified by federal officials when dangerous criminals were placed in their jurisdictions.[1][2]\nRed Dog's heritage was a mix of (Dakota) Sioux and Assiniboine.[3][4] He was a member of the Dakota tribe,[5] and grew up on Fort Peck Reservation in Poplar, in northeast Montana.[6][4][7] He blamed poverty on his reservation for his crimes later in life; he said that there were no jobs and he could only make a living on crime. According to a family acquaintance, who asked not to be named, at age 8 or 10 Red Dog tried to emulate the lifestyle of an older half-brother whom he admired, who as of 1993 was in a federal prison. The acquaintance also said that life had \"very little\" to offer Red Dog.[3]\nDelaware deputy attorneys Steven P. Wood and Peggy J. Hageman, who prosecuted Red Dog, tried and failed to find a motive.[8] According to Wood, attributing Red Dog's behavior to his upbringing is too easy: \"There is no denying the privation Native Americans are subjected to on reservations, but the simple fact is there are hundreds of thousands of Native Americans raised in those conditions, and precious few become multiple murders\", he said, as well as that his killings were \"essentially motiveless\".[3]\n",
        "type": [
            "murder",
            "robber",
            "killing",
            "robbery"
        ]
    },
    "15": {
        "link": "/wiki/George_Floyd_protests_in_Delaware",
        "title": "George Floyd protests in Delaware",
        "date": "May 28, 2020 – June 13, 2020",
        "year": "2020",
        "location": "Delaware, United States",
        "state": "Delaware",
        "place": "Camden",
        "county": "Kent County",
        "paragraph": "\nThis is a list of George Floyd protests in Delaware, United States.\nOn June 9, a group of protesters marched along U.S. Route 13 in Camden, blocking traffic and defying police orders. 21 protesters were detained, including Dover Post reporter Andre Lamar.[3]\n",
        "type": [
            "riot"
        ]
    },
    "16": {
        "link": "/wiki/Jeremy_McDole",
        "title": "Killing of Jeremy McDole",
        "date": "September 23, 2015 (2015-09-23)",
        "year": "2015",
        "location": "Wilmington, Delaware, United States",
        "state": "Delaware",
        "place": "Wilmington",
        "county": "New Castle County",
        "paragraph": "\nJeremy \"Bam Bam\" McDole was a 28-year-old African American paraplegic who was shot and killed by police in Wilmington, Delaware on September 23, 2015, at 3:00 pm. McDole was in a wheelchair at the time of the shooting. Police responded to a call about a man with a gun. The 911 caller later recanted her statements and has, to date, faced no penalties for the false statements made, which resulted in McDoles death. Camera footage from a bystander showed officers ordering McDole to drop his weapon and raise his hands, with McDole being shot after reaching for his waist area, but with a gun never being seen and evidence photos of the reported weapon only appearing 6 years after his murder.[3][4][5] The Delaware state department cleared the officers of wrongdoing, but concluded that one of the involved officers had shown \"extraordinarily poor\" police work. A 2020 review by the Delaware Attorney General's Office came to the same conclusion. Both decided against filing any charges. The McDole family sued the city of Wilmington, and in January 2017, a settlement of $1.5 million was reached by the city.[2][3]\nOn September 23, 2015, at around 3:00 p.m., local police in Wilmington, Delaware responded to a 911 call about a man who had suffered a self-inflicted gunshot wound. The female caller told the dispatcher that a man had shot himself, still had the weapon, and had fallen onto the ground but was moving back into his wheelchair.[6]\n",
        "type": [
            "murder",
            "killing",
            "shooting"
        ]
    },
    "17": {
        "link": "/wiki/Cheney_Clow",
        "title": "Cheney Clow",
        "date": "",
        "year": "",
        "location": "West of Kenton on Delaware Route 300, near Kenton, Delaware",
        "state": "Delaware",
        "place": "Kenton",
        "county": "Kent County",
        "paragraph": "Cheney Clow (1734–1788) was a loyalist from Delaware Colony during the American Revolution who staged a rebellion against the colonial government that was advocating separation from Great Britain.[2][3]\nCheney Clow was born in 1734 in Delaware Colony, the third of nine children of Nathaniel Clow and his wife Susannah. They lived in Queen Anne's County, Province of Maryland, owned their own farm, of unknown acres but was said to have been considerable. Land recorded in 1744, 50 acres (200,000 m2) was named \"Clow's Hope.\" In 1747 another 50 acres (200,000 m2) was recorded and it was called \"Boon's Hope\". Boon's Hope cost Nathaniel and Susannah 2,100 pounds of tobacco, which was a common practice in the early colonies, paying for items with tobacco off your own land.\nNathaniel Clow died in 1748, his estate papers and will are filed in the courthouse in Annapolis. He wanted his estate divided equally among his wife and children. The children were John (born 1732), Mary (born 1733), Cheney (born 1734), Susannah (born 1737), Rachael (born 1738), James (born 1740), Sarah (born 1742), Rebecca (born 1743) and Ann (born 1749).\n",
        "type": []
    },
    "18": {
        "link": "/wiki/Shannon_Johnson_(murderer)",
        "title": "Shannon Johnson (murderer)",
        "date": "September 24, 2006",
        "year": "2006",
        "location": "",
        "state": "Delaware",
        "place": "Wilmington",
        "county": "New Castle County",
        "paragraph": "Shannon M. Johnson (November 18, 1983 – April 20, 2012)[1] was an American convicted murderer and rapist who was executed for the 2006 murder of 25-year-old Cameron Hamlin in Wilmington, Delaware. Johnson was executed by lethal injection at the James T. Vaughn Correctional Center on April 20, 2012.[2] Capital punishment was declared unconstitutional in Delaware on August 2, 2016, officially making Johnson the last person to be executed by the state of Delaware.[3]\nJohnson's criminal record consisted of 57 arrests on 145 misdemeanor charges and 33 felony offenses since 2001. On December 19, 2002, Johnson raped a pregnant woman. He pleaded guilty to fourth degree rape for that crime. This prior violent felony conviction would make Hamlin's murder a capital offense.[4] Johnson was also suspected in the shooting of his stepfather.[4]\nOn September 24, 2006, Johnson went to the home of his ex-girlfriend, Lakeisha Truitt, in Wilmington, Delaware. The relationship between the two had ended due to Johnson abusing Truitt, but the pair had a son together.[4] Johnson had hoped to reconcile with Truitt and had gone round to see her, but instead he came across Truitt and 25-year-old Cameron Hamlin, who was Truitt's new boyfriend and had been staying at Truitt's home. He spotted Hamlin and Truitt sitting in front of her home in a car. Johnson pulled out a gun and began firing into the car, fatally wounding Hamlin. He then fled the scene. Truitt was not injured in the shooting and ran to her grandmother's house where she called the police. Due to concern for her safety, she was advised not to return home until Johnson was caught.[5]\n",
        "type": [
            "murder",
            "rape",
            "shooting"
        ]
    },
    "19": {
        "link": "/wiki/Delaware_State_University_shooting",
        "title": "Delaware State University shooting",
        "date": "September 21, 2007  (UTC-4)",
        "year": "2007",
        "location": "Dover, Delaware, United States",
        "state": "Delaware",
        "place": "Dover",
        "county": "Kent County",
        "paragraph": "On September 21, 2007, two 17-year-old Delaware State University freshmen were shot on campus. One died 32 days later on October 23, from critical injuries sustained in the attack. A suspected perpetrator, Loyer D. Braden, a freshman from East Orange, New Jersey, was arrested and charged with attempted murder; the charges were dismissed in May 2009.\nOn September 21, 2007, a perpetrator shot two 17-year-old Delaware State University students from the Washington, D.C. area, Shalita Middleton and Nathaniel Pugh, and shot at but did not wound a third student.[1] Middleton died on October 23 from injuries sustained in the attack, without regaining consciousness.[2][3]\nThe university responded within 20 minutes of the shooting to notify students by web announcements, physically entering dorms, and telecommunications.[4]  Text messages were not sent at the time of the incident.[5] The campus was kept on \"limited access status\" from Friday, September 21 through Sunday, September 23, with classes resuming on Monday, September 24.[6] The university increased security patrols on campus following the incident.[7]\n",
        "type": [
            "murder",
            "shooting"
        ]
    }
}