[
    {
        "link": "/wiki/Delaware_State_University_shooting",
        "title": "Delaware State University shooting",
        "date": "September 21, 2007  (UTC-4)",
        "year": "2007",
        "location": "Dover, Delaware, United States",
        "state": "Delaware",
        "county": "Dover",
        "paragraph": "On September 21, 2007, two 17-year-old Delaware State University freshmen were shot on campus. One died 32 days later on October 23, from critical injuries sustained in the attack. A suspected perpetrator, Loyer D. Braden, a freshman from East Orange, New Jersey, was arrested and charged with attempted murder; the charges were dismissed in May 2009.\nOn September 21, 2007, a perpetrator shot two 17-year-old Delaware State University students from the Washington, D.C. area, Shalita Middleton and Nathaniel Pugh, and shot at but did not wound a third student.[1] Middleton died on October 23 from injuries sustained in the attack, without regaining consciousness.[2][3]\nThe university responded within 20 minutes of the shooting to notify students by web announcements, physically entering dorms, and telecommunications.[4]  Text messages were not sent at the time of the incident.[5] The campus was kept on \"limited access status\" from Friday, September 21 through Sunday, September 23, with classes resuming on Monday, September 24.[6] The university increased security patrols on campus following the incident.[7]\n"
    },
    {
        "link": "/wiki/Murder_of_Wilson_Mannon",
        "title": "Murder of Wilson Mannon",
        "date": "March 17, 1995(1995-03-17) (aged 27)James T. Vaughn Correctional Center, Smyrna, Delaware, U.S.",
        "year": "1995",
        "location": "",
        "state": "Delaware",
        "county": "",
        "paragraph": "Wilson Mannon Jr. (January 5, 1928 – January 16, 1992) was an American man who was robbed and murdered by three career criminals in Delaware.\nThe perpetrators were brothers Nelson Shelton (July 20, 1967 – March 17, 1995) and Steven W. Shelton (born July 11, 1965), and their cousin Jack Foster Outten Jr. (born March 23, 1966). All three men were convicted of first degree murder and sentenced to death. Nelson was executed in 1995 after waiving his appeals, while Steven and Outten eventually won appeals, and had their sentences reduced to lengthy prison terms in plea agreements years later.\nThe case drew attention after Steven donated one of his kidneys to his ailing mother, Vessa Shelton. Nelson had wanted to donate his own kidney, but his was found to be incompatible. Steven donated one in his brother's place.\n"
    },
    {
        "link": "/wiki/Shalita_Middleton",
        "title": "Delaware State University shooting",
        "date": "September 21, 2007  (UTC-4)",
        "year": "2007",
        "location": "Dover, Delaware, United States",
        "state": "Delaware",
        "county": "Dover",
        "paragraph": "On September 21, 2007, two 17-year-old Delaware State University freshmen were shot on campus. One died 32 days later on October 23, from critical injuries sustained in the attack. A suspected perpetrator, Loyer D. Braden, a freshman from East Orange, New Jersey, was arrested and charged with attempted murder; the charges were dismissed in May 2009.\nOn September 21, 2007, a perpetrator shot two 17-year-old Delaware State University students from the Washington, D.C. area, Shalita Middleton and Nathaniel Pugh, and shot at but did not wound a third student.[1] Middleton died on October 23 from injuries sustained in the attack, without regaining consciousness.[2][3]\nThe university responded within 20 minutes of the shooting to notify students by web announcements, physically entering dorms, and telecommunications.[4]  Text messages were not sent at the time of the incident.[5] The campus was kept on \"limited access status\" from Friday, September 21 through Sunday, September 23, with classes resuming on Monday, September 24.[6] The university increased security patrols on campus following the incident.[7]\n"
    },
    {
        "link": "/wiki/John_P._Wheeler_III",
        "title": "John P. Wheeler III",
        "date": "c. December 30, 2010(2010-12-30) (aged 66)Delaware, U.S.",
        "year": "2010",
        "location": "",
        "state": "Texas",
        "county": "Laredo",
        "paragraph": "John Parsons Wheeler III (December 14, 1944 – c. December 30, 2010), known as Jack Wheeler, was an American businessman and former White House aide. Wheeler was chairman of the Vietnam Veterans Memorial Fund, senior planner for Amtrak (1971–1972), official of the Securities and Exchange Commission (1978–1986), chief executive and CEO of Mothers Against Drunk Driving, consultant to the Mitre Corporation (2009–death), and a presidential aide to the Ronald Reagan, George H. W. Bush, and George W. Bush administrations. He also held numerous other positions in the United States military, government, and corporations.[2][3] He died under mysterious circumstances on December 30, 2010.\nWheeler was descended from a family of military professionals which included Joseph Wheeler, who had served as a general both in the Confederate Army, and later with the United States Army. Wheeler III was born in Laredo, Texas, where his mother, Janet Conly Wheeler, was staying with her mother while his father was in Europe. Five days after the delivery, the family received a telegram that his father was missing in action in the Battle of the Bulge. His father was later found to be alive.[4]  Wheeler had one younger brother, Robert Conly Wheeler, and one younger sister, Janet Wheeler Gilani.[5]\nWheeler was a member of the United States Military Academy class of 1966 which lost 30 of its members in the Vietnam War.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_White",
        "title": "Lynching of George White",
        "date": "June 22, 1903; 119 years ago (1903-06-22)",
        "year": "1903",
        "location": "Wilmington, Delaware, U.S.",
        "state": "Delaware",
        "county": "Wilmington",
        "paragraph": "The lynching of George White occurred on Monday, June 22, 1903 in Wilmington, Delaware. White was a black farmer who was accused of the rape and murder of Helen Bishop, who was arrested and brought to the workhouse. On the evening of June 22, under the impression that the local authorities were not reacting severely or soon enough, a large mob of white men marched to the workhouse, broke their way in, and forced White out of his cell. He was then brought to the site of Helen Bishop's death, bludgeoned, had parts of his body dismembered, then was tied to a stake, and burnt to death.[4] It is often referred to as the only documented lynching in Delaware, and as one of the worst crimes in Delaware history.[5]\nThe late 19th and early 20th centuries were times of high racial tension in the United States. This also coincided with a national pattern of racial violence. Between the years 1882 and 1921, the United States experienced more than 3,405 lynchings.[6] Most of these victims were black men, but women and children were also targeted. While many people did not believe in lynching, others found them not only acceptable but necessary. These events were sometimes referred to as \"unofficial executions.\"[6] In 1903 specifically, there was a wave of lynchings across the midwest, including events in Evansville, Indiana, Springfield, Ohio, Belleville, and Danville, Illinois.\nThese attitudes were especially complicated in Delaware. In his documentary \"In the Dead Fire's Ashes,\" Stephen Labovsky describes the town of Wilmington as \"North of the South but South of the North.\" This is because of its position as a border state during and after the U.S. Civil War. Scholar Michael J. Pfeifer describes this contradiction, saying \"If the area's commercial interests were more aligned with...the industrial North, the state's social politics continued to reflect a Jim Crow orientation on matters of race and rights.\"[7]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Delaware",
        "title": "George Floyd protests in Delaware",
        "date": "May 28, 2020 – June 13, 2020",
        "year": "2020",
        "location": "Delaware, United States",
        "state": "Delaware",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Delaware, United States.\nOn June 9, a group of protesters marched along U.S. Route 13 in Camden, blocking traffic and defying police orders. 21 protesters were detained, including Dover Post reporter Andre Lamar.[3]\n"
    },
    {
        "link": "/wiki/Wilmington_riot_of_1968",
        "title": "Wilmington riot of 1968",
        "date": "April 9–10, 1968",
        "year": "1968",
        "location": "Wilmington, Delaware",
        "state": "Delaware",
        "county": "Wilmington",
        "paragraph": "The Wilmington Riot of 1968 occurred in Wilmington, Delaware, in April of that year following the assassination of Martin Luther King Jr. The riot did not cause any fatalities, though there were numerous injuries, arrests, and buildings burned. Despite the quick cessation of rioting, the governor refused to recall the Delaware Army National Guard, leaving them in the city as an occupying force until the following year. \nPrior to the events of the late 1960s, tensions were already running high in Wilmington.  There had already been a race riot in 1919. The flight of white city dwellers to the suburbs, migration of southern blacks to the city, and lingering bad feelings from the construction of I-95 resulted in a divided city, and attempts by local leaders to alleviate the social issue plaguing the city were unsuccessful.[1][2] Heightened racial tensions and altercations in July 1967 were followed by two days of sporadic vandalism, looting, and firebombing. At the request of Wilmington Mayor John Babiarz, state police were summoned to increase patrols. For his part, Governor Charles L. Terry (a southern-style Democrat) publicly warned of minority violence and conspiracies and placed fifteen hundred National Guardsmen on standby alert at Wilmington's airport.  He also proposed and signed legislation granting him sole authority to impose martial law and ban the sale of alcohol and established a riot commission.  In addition to the Delaware National Guard, the Governor activated the entire Delaware State Police Department.  All days off were canceled, vacations were canceled and all troopers were to report to their assigned Troop.  The Delaware State Police who were nearest to the City of Wilmington were sent to Troop 2 located south of the city.  Only a skeleton force was left at the other Troops located in New Castle County.  The Troopers who were assigned to Kent and Sussex counties Troops were sent to Troop 2.  Once the lower county Troopers arrived at Troop 2 they were paired with those of New Castle County.  Any request for law enforcement assistance from the Wilmington Police Department was sent to Troop 2.\nIn the wake of the assassination of Martin Luther King Jr. on April 4, 1968, a large number of black youths converged on the main downtown business area of Wilmington and began looting stores April 9–10, 1968. A report of sniper fire prompted Democratic mayor Babiarz to declare a state of emergency, to impose a curfew, and to request assistance from Governor Terry. The two-day riot that occurred after the assassination was small compared with riots in other cities, but its aftermath highlighted the depth of Wilmington's racial problem.[3]\n"
    },
    {
        "link": "/wiki/Wilmington,_Delaware_race_riot_of_1919",
        "title": "Wilmington, Delaware race riot of 1919",
        "date": "November 13, 1919",
        "year": "1919",
        "location": "Wilmington, Delaware, United States",
        "state": "Delaware",
        "county": "Wilmington",
        "paragraph": "The Wilmington, Delaware race riot of 1919 was a violent racial riot between white and black residents of Wilmington, Delaware on November 13, 1919.\nThe Price family were  African-American suspects in the robbery of a Wilmington, Delaware gun store.[1] The guns, in turn, had been pawned throughout the city. While raiding the Price house Patrolman Thomas L. Zebley (sometimes spelled Scebley) was killed and Officer Harry F. Pierce was shot twice in the lungs.[2] When the two officers entered the house the three brothers were sleeping. When awakened by the officers the brothers took guns from under their pillows and started shooting.[3] Three brothers were arrested at the scene: Lemuel, James and John Price. Lemuel is thought to have shot Zebley through the heart.[3]\nAs news of the shooting spread an angry white mob grew and tried to lynch the three brothers. Wilmington police were able to prevent this by secreting the brothers to Philadelphia's Central police station.[4] When the mob found out the brothers were out of their reach they turned their anger on the black community. One mob of 300 whites were rampaging through the black part of town. When they encountered 4 black men, the two parties shot at each other and African-American Bannel Fields was wounded with a shot in the head.[4]\n"
    }
]