[
    {
        "link": "/wiki/1968_Miami_riot",
        "title": "1968 Miami riot",
        "date": "August 7 – 8, 1968",
        "location": "Liberty City (Miami)",
        "paragraph": "SCLC member\nGovernor of Florida\n"
    },
    {
        "link": "/wiki/1973_Miami_Beach_firebombing",
        "title": "1973 Miami Beach firebombing",
        "date": "",
        "location": "",
        "paragraph": "The 1973 Miami Beach firebombing occurred on February 2, 1973, when a man walked into the crowded Concord Cafeteria in Miami Beach, Florida. He poured gasoline out of a large jar, lit a match, ignited the gasoline, and ran out of the cafeteria. Three people were killed and 139 were injured, including many people who were severely burned. \nThe Concord Cafeteria was located at 1921 Collins Avenue in Miami Beach. It was founded in 1947 by Morris Himelstein, who also owned and operated six Concord Cafeterias in New York City. It had 250 seats and served inexpensive, home style food to about 3000 diners a day, many of them retirees. It functioned as an informal social center as well as a restaurant.[1]\n"
    },
    {
        "link": "/wiki/The_Great_Fire_of_Key_West",
        "title": "The Great Fire of Key West",
        "date": "",
        "location": "",
        "paragraph": "The Great Fire of Key West was a major fire that destroyed a significant portion of the city of Key West in 1886. It was the largest and most devastating fire in Key West history.[1]\nThe fire began in a coffee shop next to the San Carlos Institute. It burned for 12 hours over 50 acres, destroyed most of the commercial area of the city, killed seven people, injured 15 more, and cost one and a half million dollars in property damage.[1][2]\n"
    },
    {
        "link": "/wiki/2013_Hialeah_shooting",
        "title": "2013 Hialeah shooting",
        "date": "July 26–27, 2013 c. 6:30 p.m. – c. 2:30 a.m.",
        "location": "1485 West 46th Street, Hialeah, Florida, U.S.",
        "paragraph": "\nOn July 26, 2013, a mass shooting occurred at the Todel Apartments, an American apartment complex in Hialeah, a city in Miami-Dade County, Florida. Seven people, including the shooter, were killed in the incident. The shooter was identified by police as 42-year-old Pedro Alberto Vargas, a resident of Hialeah, who, after setting his apartment ablaze, opened fire from his balcony and inside the apartment, then held two people hostage before being fatally shot by a SWAT team in the early hours of July 27.\n"
    },
    {
        "link": "/wiki/1980_Miami_riots",
        "title": "1980 Miami riots",
        "date": "May 17, 1980 (1980-05-17) – May 20, 1980 (1980-05-20)",
        "location": "Dade County, Florida\nMiami\nWest Coconut Grove\nBrownsville\nLiberty City\nOvertown\n",
        "paragraph": "Florida Army National Guard\nGovernor Bob Graham\nMayor Maurice Ferré\n"
    },
    {
        "link": "/wiki/Lynching_of_Claude_Neal",
        "title": "Lynching of Claude Neal",
        "date": "",
        "location": "",
        "paragraph": "\nClaude Neal (b. 1911[1] – d. October 26, 1934) was a 23-year-old African-American farmhand who was arrested in Jackson County, Florida, on October 19, 1934, for allegedly raping and killing Lola Cannady, a 19-year-old white woman missing since the preceding night. Circumstantial evidence was collected against him, but nothing directly linked him to the crime. When the news got out about his arrest, white lynch mobs began to form.[2] In order to keep Neal safe, County Sheriff Flake Chambliss moved him between multiple jails, including the county jail at Brewton, Alabama, 100 miles (160 km) away. But a lynch mob of about 100 white men from Jackson County heard where he was, and brought him back to Jackson County.[3]\nThe time and place of the lynching were provided to the news media in advance and reported on nationwide, attracting a huge crowd.[4]: 126  The spectacle lynching had been announced to take place at the Cannady farm, but the crowd had grown unruly, and a smaller group murdered Neal in secret. He was tortured and mutilated before being hanged by the instigators at a site along the Chattahoochee River, near Greenwood, Florida. They tied his body to the back of their truck and dragged his corpse to the Cannady farm, where a white crowd estimated at 2,000 attacked the corpse by stabbing it with sticks and knives.[2] Later that night Neal's body was hanged from a tree in the courthouse square. When the sheriff discovered it in the morning, he cut it down.[3][5]\n"
    },
    {
        "link": "/wiki/Ocoee_massacre",
        "title": "Ocoee massacre",
        "date": "November 2–3, 1920",
        "location": "Ocoee, Florida",
        "paragraph": "The Ocoee massacre was a mass racial violence event that saw a white mob attack numerous African-American residents in the northern parts of Ocoee, Florida, a town located in Orange County near Orlando. The massacre took place on November 2, 1920, the day of the U.S. presidential election.[4]\nBy most estimates, a total of 30–35 black people were killed in the violence.[1][2][3] Most African American-owned buildings and residences in northern Ocoee were burned to the ground. Other African Americans living in southern Ocoee were later killed or driven out of town by the threat of further violence being used against them. Thus, Ocoee essentially became an all-white or \"sundown\" town. The massacre has been described as the \"single bloodiest day in modern American political history\".[2]\n"
    },
    {
        "link": "/wiki/Perry_massacre",
        "title": "Perry massacre",
        "date": "\nDecember 6, 1922 - Cubrit Dixon\nDecember 8, 1922 - Charles Wright\nDecember 12, 1922 - Albert Young\nDecember 15, 1922 - Unidentified Black man\n",
        "location": "Perry, Florida",
        "paragraph": "The Perry massacre was a racially motivated conflict in Perry, Florida, in December 1922. Whites killed four black men, including Charles Wright, who was lynched by being burned at the stake, and they also destroyed several buildings in the black community of Perry after the murder of Ruby Hendry, a white female schoolteacher.[1] [2]\nThe body of a young white woman, Annie \"Ruby\" Hendry, was found with her throat slashed, lying in a pool of blood, at 4:40 p.m. on December 2, 1922, in Perry in Taylor County, Florida. Her face was badly disfigured from having been beaten with a blunt instrument, so it took half an hour to determine her identity. On December 5, the police had linked the murder weapons found at the scene, a double-barrelled shotgun and a bloody razor, to a black man who had been residing in the area and using the name \"Charley Wright\". He was determined to be an escaped convict from adjacent Dixie County. [3] Search parties with guns and bloodhounds were everywhere.[4] Each night after the body was found, buildings serving the black community in Perry were burnt down: schoolhouse, lodge, amusement hall, and then the church.\n"
    },
    {
        "link": "/wiki/Rosewood_massacre",
        "title": "Rosewood massacre",
        "date": "January 1–7, 1923",
        "location": "",
        "paragraph": "The Rosewood massacre was a racially motivated massacre of black people and the destruction of a black town that took place during the first week of January 1923 in rural Levy County, Florida, United States. At least six black people and two white people were killed, but eyewitness accounts suggested a higher death toll of 27 to 150. The town of Rosewood was destroyed in what contemporary news reports characterized as a race riot. Florida had an especially high number of lynchings of black men in the years before the massacre,[2] including a well-publicized incident in December 1922.[citation needed]\nBefore the massacre, the town of Rosewood had been a quiet, primarily black, self-sufficient whistle stop on the Seaboard Air Line Railway. Trouble began when white men from several nearby towns lynched a black Rosewood resident because of accusations that a white woman in nearby Sumner had been assaulted by a black drifter. A mob of several hundred whites combed the countryside hunting for black people and burned almost every structure in Rosewood. For several days, survivors from the town hid in nearby swamps until they were evacuated to larger towns by train and car. No arrests were made for what happened in Rosewood. The town was abandoned by its former black and white residents; none of them ever moved back, none of them were ever compensated for the loss of their land, and the town ceased to exist.\n"
    },
    {
        "link": "/wiki/Rosewood_massacre",
        "title": "Rosewood massacre",
        "date": "January 1–7, 1923",
        "location": "",
        "paragraph": "The Rosewood massacre was a racially motivated massacre of black people and the destruction of a black town that took place during the first week of January 1923 in rural Levy County, Florida, United States. At least six black people and two white people were killed, but eyewitness accounts suggested a higher death toll of 27 to 150. The town of Rosewood was destroyed in what contemporary news reports characterized as a race riot. Florida had an especially high number of lynchings of black men in the years before the massacre,[2] including a well-publicized incident in December 1922.[citation needed]\nBefore the massacre, the town of Rosewood had been a quiet, primarily black, self-sufficient whistle stop on the Seaboard Air Line Railway. Trouble began when white men from several nearby towns lynched a black Rosewood resident because of accusations that a white woman in nearby Sumner had been assaulted by a black drifter. A mob of several hundred whites combed the countryside hunting for black people and burned almost every structure in Rosewood. For several days, survivors from the town hid in nearby swamps until they were evacuated to larger towns by train and car. No arrests were made for what happened in Rosewood. The town was abandoned by its former black and white residents; none of them ever moved back, none of them were ever compensated for the loss of their land, and the town ceased to exist.\n"
    },
    {
        "link": "/wiki/Lynching_of_Manuel_Cabeza",
        "title": "Lynching of Manuel Cabeza",
        "date": "December 25, 1921",
        "location": "East Martello Tower, Key West, Monroe County, Florida",
        "paragraph": "The lynching of Manuel Cabeza (who is also referred to by his alias which is Manuel Head[1] [2]) occurred on December 25, 1921, when members of the Ku Klux Klan killed him. Two days earlier, they Tarred and feathered him because he was living with a Black woman.\nManuel Cabeza's parents were born on the Spanish Canary Islands before they immigrated to Florida. In Key West, he was known as \"Isleno,\" the Islander, and during World War I, he served as a private in Company B of the 105th Engineers.[1] After he was ordered to report for military service during WWI, Cabeza trained at Camp Jackson, he was assigned the service number 1873913 and on the ship Talthybius, he departed for France as a Private in Company B, 105th Engineers. His unit often came under fire while it was building railways and bridges. During fierce fighting, his unit was pushed back against a river, he was part of a group of volunteers that swam across the river with a rope so the other members of his unit could cross it. He left Europe on April 1, 1919, on the USS Martha Washington and he was honorably discharged later that same year.[1]\n"
    },
    {
        "link": "/wiki/Sam_Carter_(lynching_victim)",
        "title": "Rosewood massacre",
        "date": "January 1–7, 1923",
        "location": "",
        "paragraph": "The Rosewood massacre was a racially motivated massacre of black people and the destruction of a black town that took place during the first week of January 1923 in rural Levy County, Florida, United States. At least six black people and two white people were killed, but eyewitness accounts suggested a higher death toll of 27 to 150. The town of Rosewood was destroyed in what contemporary news reports characterized as a race riot. Florida had an especially high number of lynchings of black men in the years before the massacre,[2] including a well-publicized incident in December 1922.[citation needed]\nBefore the massacre, the town of Rosewood had been a quiet, primarily black, self-sufficient whistle stop on the Seaboard Air Line Railway. Trouble began when white men from several nearby towns lynched a black Rosewood resident because of accusations that a white woman in nearby Sumner had been assaulted by a black drifter. A mob of several hundred whites combed the countryside hunting for black people and burned almost every structure in Rosewood. For several days, survivors from the town hid in nearby swamps until they were evacuated to larger towns by train and car. No arrests were made for what happened in Rosewood. The town was abandoned by its former black and white residents; none of them ever moved back, none of them were ever compensated for the loss of their land, and the town ceased to exist.\n"
    },
    {
        "link": "/wiki/Arthur_St._Clair_(minister)",
        "title": "Arthur St. Clair (minister)",
        "date": "",
        "location": "",
        "paragraph": "Arthur W. St. Clair (died 1877) was an African-American community leader in Brooksville, Florida, who was murdered in 1877 by a mob days after he presided over the marriage of a black man and a white woman in the area that is now Dade City, Florida.[1][2] Controversy followed as efforts to investigate the white men accused of killing him were stymied. The courthouse was destroyed in a fire.[3]\nSt. Clair was a slave on the plantation owned by John and Marina Sanderson May (who owned much of the land around what later became the town).\n"
    },
    {
        "link": "/wiki/James_Clark_(lynching_victim)",
        "title": "James Clark (lynching victim)",
        "date": "",
        "location": "",
        "paragraph": "James Clark was an African-American man who was lynched in Eau Gallie, Florida by ten white men in 1926.\nOn July 11, 1926, James Clark, a chauffeur for a traveling salesman, was accused of rape by a white girl. He was arrested, but the chief of police turned him over to a mob. A noose was placed around his neck, he was dragged over a tree limb, and shot with a shotgun. The street near the site of the lynching, around Parkway Drive and U.S. 1 in what is now Melbourne, Florida was named Lynching Tree Drive until 1980, when the black community petitioned the Melbourne City Council to change the name, which was then changed to Legendary Lane.[2]\n"
    },
    {
        "link": "/wiki/Democracy_Abroad,_Lynching_At_Home",
        "title": "Democracy Abroad, Lynching At Home",
        "date": "",
        "location": "",
        "paragraph": "Democracy Abroad, Lynching At Home: Racial Violence In Florida is a 2015 history book  by Tameka Bradley Hobbs that discusses how lynchings have changed in the United States, with a focus on the mid 20th century Florida lynchings of Arthur C. Williams, Cellos Harrison, Willie James Howard, and Jesse James Payne. The book won a 2015 Bronze Florida Book Award and the 2016 Harry T. and Harriette V. Moore Award from the Florida Historical Society.\nHobbs reviews how lynchings have been conducted in United States with a focus on four African American men and boys lynched in Florida between 1941 and 1945: Arthur C. Williams, Cellos Harrison, Willie James Howard, and Jesse James Payne.[1] Hobbs argues World War II shifted public opinion and behavior in the United States, leading to private mob violence against African Americans instead of public lynchings, and to what Hobbs describes as \"legal lynchings.\"[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Evans",
        "title": "Lynching of John Evans",
        "date": "",
        "location": "",
        "paragraph": "\nOn Tuesday, November 12, 1914, John Evans, a black man, was lynched in St. Petersburg, Florida, United States, by a mob of 1,500 white men, women and children.[1] Evans was accused of the murder of Edward Sherman, a white real estate developer, and the attack of Sherman's wife, Mary. After word of the attack spread, and Mary Sherman claimed her attackers were \"two negroes,\" a citywide search ensued.[1] Suspicions immediately led to John Evans. Two days after the murder, a posse consisting of some of the city's most prominent and well-respected members stormed the St. Petersburg jail, threw a noose around Evans' neck and marched him to his death.[1] He was never given a fair trial.[2] Evans was hanged from a light post on the corner of Ninth Street South and Second Avenue. At first, he kept himself alive by wrapping his legs around the light pole. An unidentified white woman in a nearby automobile ended his struggle with a single bullet. Though the shot was fatal, the rest of the crowd began shooting at Evans' dangling body until their ammunition was depleted.[1][3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Cellos_Harrison",
        "title": "Lynching of Cellos Harrison",
        "date": "",
        "location": "",
        "paragraph": "Cellos Harrison was an African American man in Marianna, Florida who was lynched on June 16, 1943 after being rearrested when his murder conviction was overturned by the Supreme Court of Florida because his confession was obtained under duress.[1] He was twice convicted by an all-white jury of murdering a white man who was working as a gas station attendant and store clerk. State and federal investigations were launched into the lynching but no one was ever indicted or convicted.[2] A decade earlier Claude Neal was lynched in Marianna.[3] The area was also wrought by a wave of violence against African Americans and Republicans during the Reconstruction Era after the American Civil War in what is known as the Jackson County War.\nHarrison, a farm worker, was convicted of killing gas station attendant Johnnie Mayo in 1940.[4] His conviction was overturned when his confession was thrown out on appeal. Cellos was reindicted and then taken from the Jackson County, Florida jail by four masked men and killed by a blow or blows to the head. His body was found 5 miles outside Marianna.[5]\n"
    },
    {
        "link": "/wiki/Lynching_of_Willie_James_Howard",
        "title": "Lynching of Willie James Howard",
        "date": "",
        "location": "",
        "paragraph": "Willie James Howard (July 13, 1928 – January 2, 1944) was a 15-year-old African-American living in Live Oak, Suwannee County, Florida. He was lynched for having given Christmas cards to all his co-workers at the Van Priest Dime Store, including Cynthia Goff, a white girl, followed by a letter to her on New Year's Day.\nThe New Year's Day letter read:\n"
    },
    {
        "link": "/wiki/Willie_James_Howard",
        "title": "Lynching of Willie James Howard",
        "date": "",
        "location": "",
        "paragraph": "Willie James Howard (July 13, 1928 – January 2, 1944) was a 15-year-old African-American living in Live Oak, Suwannee County, Florida. He was lynched for having given Christmas cards to all his co-workers at the Van Priest Dime Store, including Cynthia Goff, a white girl, followed by a letter to her on New Year's Day.\nThe New Year's Day letter read:\n"
    },
    {
        "link": "/wiki/Oscar_Mack",
        "title": "Oscar Mack",
        "date": "July 18, 1922",
        "location": "\nShootout took place in Kissimmee, Osceola County, Florida\nReportedly lynched in Lake Jennie Jewell, in Orange County, Florida.\n",
        "paragraph": "Oscar Mack (September 20, 1892 – January 2, 1960) was an African-American World War I vet. An attempt was made to lynch Oscar Mack (Newspapers of the time also use the name John Mack) in Kissimmee, Osceola County, Florida. According to the United States Senate Committee on the Judiciary it was the 39th of 61 lynchings during 1922 in the United States.[1] The New Britain Herald reported that he was lynched in Lake Jennie Jewell, in Orange County.[2]\nMack survived the lynching attempt and fled Florida. He married Dorothy Sanders in 1938 and had two daughters. He died in 1960.\n"
    },
    {
        "link": "/wiki/Harmon_Murray",
        "title": "Harmon Murray",
        "date": "",
        "location": "",
        "paragraph": "Harmon Murray (1868 or 1869 – 1891) was an African-American who briefly achieved notoriety in 1890 and 1891 as the reputed leader of a feared criminal gang in northern Florida, and for killing a number of men, including a sheriff and a deputy sheriff, before being killed himself by an acquaintance.\nHarmon Murray was born in Long Pond, a community in northern Marion County, Florida, in 1868[1] or 1869.[2] His parents, Gilbert Murray and Emily James, had been brought to Alachua County from South Carolina in the 1850s as slaves. They were married in 1860. Harmon was their fifth child. He was named after Henry S. Harmon, an African American lawyer and politician in Gainesville.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Claude_Neal",
        "title": "Lynching of Claude Neal",
        "date": "",
        "location": "",
        "paragraph": "\nClaude Neal (b. 1911[1] – d. October 26, 1934) was a 23-year-old African-American farmhand who was arrested in Jackson County, Florida, on October 19, 1934, for allegedly raping and killing Lola Cannady, a 19-year-old white woman missing since the preceding night. Circumstantial evidence was collected against him, but nothing directly linked him to the crime. When the news got out about his arrest, white lynch mobs began to form.[2] In order to keep Neal safe, County Sheriff Flake Chambliss moved him between multiple jails, including the county jail at Brewton, Alabama, 100 miles (160 km) away. But a lynch mob of about 100 white men from Jackson County heard where he was, and brought him back to Jackson County.[3]\nThe time and place of the lynching were provided to the news media in advance and reported on nationwide, attracting a huge crowd.[4]: 126  The spectacle lynching had been announced to take place at the Cannady farm, but the crowd had grown unruly, and a smaller group murdered Neal in secret. He was tortured and mutilated before being hanged by the instigators at a site along the Chattahoochee River, near Greenwood, Florida. They tied his body to the back of their truck and dragged his corpse to the Cannady farm, where a white crowd estimated at 2,000 attacked the corpse by stabbing it with sticks and knives.[2] Later that night Neal's body was hanged from a tree in the courthouse square. When the sheriff discovered it in the morning, he cut it down.[3][5]\n"
    },
    {
        "link": "/wiki/Newberry_Six_lynchings",
        "title": "Newberry Six lynchings",
        "date": "",
        "location": "",
        "paragraph": "\nThe Newberry Six lynchings took place in Newberry, Alachua County, Florida, on August 18, 1916.\n"
    },
    {
        "link": "/wiki/Ocoee_massacre",
        "title": "Ocoee massacre",
        "date": "November 2–3, 1920",
        "location": "Ocoee, Florida",
        "paragraph": "The Ocoee massacre was a mass racial violence event that saw a white mob attack numerous African-American residents in the northern parts of Ocoee, Florida, a town located in Orange County near Orlando. The massacre took place on November 2, 1920, the day of the U.S. presidential election.[4]\nBy most estimates, a total of 30–35 black people were killed in the violence.[1][2][3] Most African American-owned buildings and residences in northern Ocoee were burned to the ground. Other African Americans living in southern Ocoee were later killed or driven out of town by the threat of further violence being used against them. Thus, Ocoee essentially became an all-white or \"sundown\" town. The massacre has been described as the \"single bloodiest day in modern American political history\".[2]\n"
    },
    {
        "link": "/wiki/Perry_massacre",
        "title": "Perry massacre",
        "date": "\nDecember 6, 1922 - Cubrit Dixon\nDecember 8, 1922 - Charles Wright\nDecember 12, 1922 - Albert Young\nDecember 15, 1922 - Unidentified Black man\n",
        "location": "Perry, Florida",
        "paragraph": "The Perry massacre was a racially motivated conflict in Perry, Florida, in December 1922. Whites killed four black men, including Charles Wright, who was lynched by being burned at the stake, and they also destroyed several buildings in the black community of Perry after the murder of Ruby Hendry, a white female schoolteacher.[1] [2]\nThe body of a young white woman, Annie \"Ruby\" Hendry, was found with her throat slashed, lying in a pool of blood, at 4:40 p.m. on December 2, 1922, in Perry in Taylor County, Florida. Her face was badly disfigured from having been beaten with a blunt instrument, so it took half an hour to determine her identity. On December 5, the police had linked the murder weapons found at the scene, a double-barrelled shotgun and a bloody razor, to a black man who had been residing in the area and using the name \"Charley Wright\". He was determined to be an escaped convict from adjacent Dixie County. [3] Search parties with guns and bloodhounds were everywhere.[4] Each night after the body was found, buildings serving the black community in Perry were burnt down: schoolhouse, lodge, amusement hall, and then the church.\n"
    },
    {
        "link": "/wiki/Fred_Rochelle",
        "title": "Fred Rochelle",
        "date": "",
        "location": "",
        "paragraph": "Fred Rochelle (c. 1885 – May 29, 1901) was an African-American teenager from Bartow, Florida, who was lynched and burned to death on May 29, 1901, following the alleged rape and murder of a white woman, Rena Smith Taggart, the previous day.[1][2] He was said to have been seen near where Taggart's body was found. Newspapers misreported the 16-year-old boy as \"35 years of age\". A mob of over 100 men as well as bloodhounds from Mulberry and Pebble was assembled to search for him but a local paper mentioned a possible lynching before any evidence was recovered or he was charged.\nRochelle was captured two days later by two black men, who evaded the mob and turned Rochelle over to the Sheriff of Polk County in Lakeland, Florida. Ten minutes later, Rochelle was turned over to a mob.[3] The mob took Rochelle back to Bartow. A special train was arranged from Lakeland so that a large crowd of spectators could attend a \"barbecue\" in Bartow where Rochelle was to be the \"chief actor.\"[4] He was taken to the site of the Taggart murder, where he was chained to a barrel and doused with quantities of kerosene. At 6:00 p.m. the match was struck. He was burned alive for 15 minutes, and the crowd dispersed by 8:30 that evening.[3][5]\n"
    },
    {
        "link": "/wiki/Lynching_of_Leander_Shaw",
        "title": "Lynching of Leander Shaw",
        "date": "July 29, 1908; 114 years ago (1908-07-29)",
        "location": "Pensacola, Florida",
        "paragraph": "The lynching of Leander Shaw occurred near midnight on July 29, 1908, in Pensacola, Florida. Shaw was accused of the attempted murder and rape of 21-year-old Lillie Davis. Shaw, being positively identified by Davis, was arrested and taken to jail. On the night of July 29, an angry mob shot the Escambia County Sheriff and hung Leander Shaw in Plaza Ferdinand VII.[1][2]\nEarlier on July 29, 1908, 21-year-old Lillie Davis was beaten and found, a victim of assault in her Gull Point home. Davis' husband absent at the time, the assailant raped her, slit her throat, beat her in the head with a Colt revolver he’d stolen from the home, and then fled. Davis' daughter had also been struck. Davis was taken to a nearby hospital.[3][4][5]\n"
    },
    {
        "link": "/wiki/Lynching_of_Charles_Strong",
        "title": "Lynching of Charles Strong",
        "date": "January 17, 1922",
        "location": "Mayo, Lafayette County, Florida",
        "paragraph": "Charles Strong was lynched by in Mayo, Florida. According to the United States Senate Committee on the Judiciary it was the 5th of 61 lynchings during 1922 in the United States. [1]\nMailman W.R. Taylor was the son of a well-known naval stores operator in Mayo, Florida.[2] On Saturday, January 14, 1922, he entered the home of Charles Strong to investigate a dispute. In this home, around midnight, he was shot and killed by a shotgun.[3] Charles Strong, accused of firing the gun, claimed that another man held the shotgun but he fled anyway and was on the run for three days before he was arrested by police.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Albert_Williams",
        "title": "Lynching of Albert Williams",
        "date": "",
        "location": "",
        "paragraph": "Albert Williams was an African-American man who was lynched by a mob in Chiefland, Florida, on July 21, 1927.[1]\nJohn R. Steelman, who wrote his PhD dissertation on \"mob action in the South\", listed Albert Williams, and cited a local newspaper: \"Albert Williams, charged with assault on a turpentine operator, was shot to death by a mob. The trouble is said to have arisen over a debt which Williams owed the white man.\"[2]\n"
    },
    {
        "link": "/wiki/Charles_Wright_(lynching_victim)",
        "title": "Perry massacre",
        "date": "\nDecember 6, 1922 - Cubrit Dixon\nDecember 8, 1922 - Charles Wright\nDecember 12, 1922 - Albert Young\nDecember 15, 1922 - Unidentified Black man\n",
        "location": "Perry, Florida",
        "paragraph": "The Perry massacre was a racially motivated conflict in Perry, Florida, in December 1922. Whites killed four black men, including Charles Wright, who was lynched by being burned at the stake, and they also destroyed several buildings in the black community of Perry after the murder of Ruby Hendry, a white female schoolteacher.[1] [2]\nThe body of a young white woman, Annie \"Ruby\" Hendry, was found with her throat slashed, lying in a pool of blood, at 4:40 p.m. on December 2, 1922, in Perry in Taylor County, Florida. Her face was badly disfigured from having been beaten with a blunt instrument, so it took half an hour to determine her identity. On December 5, the police had linked the murder weapons found at the scene, a double-barrelled shotgun and a bloody razor, to a black man who had been residing in the area and using the name \"Charley Wright\". He was determined to be an escaped convict from adjacent Dixie County. [3] Search parties with guns and bloodhounds were everywhere.[4] Each night after the body was found, buildings serving the black community in Perry were burnt down: schoolhouse, lodge, amusement hall, and then the church.\n"
    },
    {
        "link": "/wiki/1986_FBI_Miami_shootout",
        "title": "1986 FBI Miami shootout",
        "date": "April 11, 1986 (36 years ago) 9:30 a.m. (UTC-5)",
        "location": "Pinecrest, Florida, U.S.",
        "paragraph": "The 1986 FBI Miami shootout occurred on April 11, 1986, in Miami-Dade County, Florida, U.S. (the specific area was incorporated as Pinecrest in 1996), when a small group of field agents for the FBI attempted to apprehend William Russell Matix and Michael Lee Platt, who were suspected of committing a series of violent crimes in and around the Miami metropolitan area.\nAlthough they had partially surrounded the suspects after maneuvering them off a local road, the agents involved quickly found their firepower was outmatched by the weapons which Matix and Platt had in their vehicle. During the gun battle which ensued, Platt in particular was able to repeatedly return fire despite sustaining multiple hits. Two Special Agents died from their wounds, while five other agents were injured by gunfire. The shootout ended when both Matix and Platt were killed.\n"
    },
    {
        "link": "/wiki/Palm_Bay_shooting",
        "title": "Palm Bay, Florida",
        "date": "",
        "location": "",
        "paragraph": "Palm Bay is a city in Brevard County, Florida, United States. The city's population was 119,760 at the 2020 United States Census,[5] making it the most populous city in the county and the largest by land mass. The historic section of the city lies on the mouth of the Turkey Creek and the Palm Bay. Palm Bay has historically expanded south and to the west. The newer section is mostly situated west of Interstate 95 and south of the Tillman Canal.[6]\nPalm Bay is a principal city[7] of the Palm Bay−Melbourne−Titusville Metropolitan Statistical Area, which had a population of 606,612 at the 2020 census.[5]\n"
    },
    {
        "link": "/wiki/Murder_of_Adam_Walsh",
        "title": "Murder of Adam Walsh",
        "date": "c. July 27, 1981; 41 years ago (1981-07-27)",
        "location": "Rural Indian River County, Florida, U.S.",
        "paragraph": "\nAdam John Walsh (November 14, 1974 – July 27, 1981) was an American child who was abducted from a Sears department store at the Hollywood Mall in Hollywood, Florida, on July 27, 1981. His severed head was found two weeks later in a drainage canal alongside Highway 60 / Yeehaw Junction in rural Indian River County, Florida. His death garnered national interest and was made into the 1983 television film Adam, seen by 38 million people in its original airing.[3]\n"
    },
    {
        "link": "/wiki/GMAC_massacre",
        "title": "James Edward Pough",
        "date": "June 17–18, 1990",
        "location": "",
        "paragraph": "\nJames Edward \"Pop\" Pough (February 16, 1948 – June 18, 1990) was an American spree killer who killed thirteen people in two separate attacks in Jacksonville, Florida on 17 and 18 June 1990. Pough shot and killed two people at random on Jacksonville’s Northside, wounded two teenagers, and robbed a convenience store. Pough shot and killed nine people and wounded four others at a General Motors Acceptance Corporation (now Ally Financial) car loan office the next day before committing suicide.\n"
    },
    {
        "link": "/wiki/Murder_of_Bobby_Kent",
        "title": "Murder of Bobby Kent",
        "date": "",
        "location": "",
        "paragraph": "Bobby Kent (né Khayam; May 12, 1973 – July 14, 1993) was an Iranian-American man who was murdered by seven people, including his best friend,  Martin Joseph \"Marty\" Puccio, Jr (born March 21, 1973) in Weston, Florida. [1] The murder would be adapted into the 2001 film Bully.\nBobby Kent, the son of Iranian immigrants Fred and Farah Kent (originally surnamed Khayam),[2] attended South Broward High School in the South Florida suburb of Hollywood, Florida.[3] According to Tim Donnelly, who prosecuted all the conspirators for this murder, one attorney described Kent as \"like Eddie Haskell. All the parents loved him in the neighborhood, but the kids looked at him a different way.\"[4]\n"
    },
    {
        "link": "/wiki/Deltona_massacre",
        "title": "Deltona massacre",
        "date": "Friday, August 6, 2004[1]",
        "location": "3106 Telford LaneDeltona, Florida, U.S.",
        "paragraph": "The Deltona massacre (commonly referred to as the \"Xbox Murders\") was a residential murder which occurred on August 6, 2004, in a home on Telford Lane in Deltona, Florida, United States. Four men broke into the home and bludgeoned six victims to death. The four attackers,[2] apparently inspired by the film Wonderland,[3] tortured and killed four men, two women, and a dog inside the home, making it the bloodiest mass murder in Volusia County history.[4] Their primary motive for the murders was revenge on Erin Belanger, who had evicted a squatter, Troy Victorino, from her grandmother's then-vacant house, with the secondary motive of recovering an Xbox game console and some clothing that Victorino had left behind. Victorino was able to further motivate his accomplices by pointing out that the attack would likely allow them to kill another person they were mad at, but that person happened not to be at the house that night.[5]\nA jury found Troy Victorino, Robert Cannon, Jerone Hunter, and Michael Salas guilty of the massacre in August 2006. Seventh Circuit Judge William A. Parsons upheld the jury's death penalty recommendation and called the killings \"conscienceless\" and \"unnecessarily torturous.\"[6] He told each of the men during back-to-back sentencing hearings, \"You have not only forfeited your right to live among us, you have forfeited your right to live at all.\" Salas and Cannon were both sentenced to life in prison, while Hunter and Victorino received the death sentence. The death sentences of Victorino and Hunter were overturned on June 14, 2017.[7] Prosecutors intend to seek death sentences for the two men again and both Victorino and Hunter are awaiting resentencing.[8][9][10]\n"
    },
    {
        "link": "/wiki/Murder_of_Jessica_Lunsford",
        "title": "Murder of Jessica Lunsford",
        "date": "",
        "location": "",
        "paragraph": "\nJessica Marie Lunsford (October 6, 1995 – February 24, 2005) was an American nine-year-old girl from Homosassa, Florida, who was murdered in February 2005. Lunsford was abducted from her home in the early morning of February 24, 2005, by John Couey, a 46-year-old convicted sex offender who lived nearby. Couey held her captive over the weekend, during which she was raped and later murdered by being buried alive. The media extensively covered the investigation and trial of Couey.\n"
    },
    {
        "link": "/wiki/2021_Hialeah_shooting",
        "title": "2021 Hialeah shooting",
        "date": "May 30, 2021",
        "location": "Miami-Dade County, Florida,United States",
        "paragraph": "\nOn May 30, 2021, twenty-three people were shot, of whom three were killed,[1][2] in a mass shooting outside a banquet hall in Miami-Dade County, Florida, United States.[3][4][5] Some of the suspects in the shooting are still at large.[6]\n"
    },
    {
        "link": "/wiki/Killing_of_Gabby_Petito",
        "title": "Killing of Gabby Petito",
        "date": "Killing of Petito:Uncertain day in late August 2021(3–4 weeks prior to discovery of remains on September 19)Laundrie's suicide:c. September 21, 2021",
        "location": "Bridger–Teton National Forest, Wyoming, U.S.",
        "paragraph": "\nIn August 2021, American woman Gabrielle Venora Petito was killed by her fiancé Brian Laundrie at the age of 22 while they were traveling together on a van life journey across the United States. The trip was planned to last for four months and began on July 2, 2021, but Petito disappeared in late August.\n"
    },
    {
        "link": "/wiki/2021_Sunrise,_Florida_shootout",
        "title": "2021 Sunrise, Florida shootout",
        "date": "February 2, 2021 6:04 a.m.",
        "location": "Sunrise, Florida, United States",
        "paragraph": "\nOn February 2, 2021, a shootout occurred between a gunman and several agents with the Federal Bureau of Investigation (FBI) at an apartment complex in Sunrise, Florida, United States. At the time, the agents were serving a warrant related to a child pornography case. Two FBI agents were fatally shot and three others were injured. The gunman, who was the subject of the warrant, was later found dead after barricading himself inside the apartment. The incident was one of the deadliest in the FBI's history.\n"
    },
    {
        "link": "/wiki/Julie_Doe",
        "title": "Julie Doe",
        "date": "",
        "location": "",
        "paragraph": "\"Julie Doe\" is the nickname given to a transgender woman believed to have been murdered in Clermont, Florida, in 1988. Neither the victim's identity, nor the identity of those involved in her death, have been established. The victim was believed to be a cisgender woman until DNA testing in 2015.[3]\nThe mummified remains of the victim, aged between 22 and 35, were located at a roadside in the \"Green Swamp\" area of Clermont, Lake County, Florida on September 25, 1988. A man looking for lumber made the initial discovery. The body was dragged to a concealed area, off the roadway of County Road 474, not far from the border between Lake and Polk Counties.[4]\n"
    },
    {
        "link": "/wiki/Little_Miss_Lake_Panasoffkee",
        "title": "Little Miss Lake Panasoffkee",
        "date": "",
        "location": "",
        "paragraph": "Little Miss Lake Panasoffkee, or Little Miss Panasoffkee, is the name given to an unidentified young woman found murdered on February 19, 1971, in Lake Panasoffkee, Florida, United States.[4] She has remained unidentified for 51 years.\nThe murder remains unsolved despite the forensic reconstruction of the victim's face in 1971 and 2012.[4][5] The case was featured on the television show Unsolved Mysteries in an episode that premiered on October 14, 1992.[1][2][6][7][8][9]\n"
    },
    {
        "link": "/wiki/Orlando_nightclub_shooting",
        "title": "Orlando nightclub shooting",
        "date": "June 12, 2016; 6 years ago (2016-06-12) 2:02 a.m. – 5:14 a.m. EDT (UTC−04:00)",
        "location": "Pulse Nightclub1912 S. Orange AvenueOrlando, Florida, U.S.",
        "paragraph": "\nOn June 12, 2016, Omar Mateen, a 29-year-old man, killed 49 people and wounded 53 more in a mass shooting at Pulse, a gay nightclub in Orlando, Florida, United States. Orlando Police officers shot and killed him after a three-hour standoff.\n"
    },
    {
        "link": "/wiki/Broadway_for_Orlando",
        "title": "Broadway for Orlando",
        "date": "",
        "location": "",
        "paragraph": "Broadway for Orlando is a charitable initiative to provide support to the victims of the Orlando nightclub shooting.\nFounded in June 2016 by Broadway Records, it sponsored a re-recording of Hal David's and Burt Bacharach's 1965 song, What the World Needs Now, sung by an all-star cast of Broadway artists. The organization is committing to donate 100% of the proceeds from the sale of this recording to the GLBT Community Center of Central Florida.[1]\n"
    },
    {
        "link": "/wiki/Change_(Christina_Aguilera_song)",
        "title": "Change (Christina Aguilera song)",
        "date": "",
        "location": "",
        "paragraph": "\"Change\" is a song recorded by American singer Christina Aguilera. It was written by Aguilera, Fancy Hagood and Flo Reutter, while its production was done by Flo Reutter and Martin Terefe. RCA Records premiered the song on June 16, 2016, on On Air with Ryan Seacrest. The song was dedicated to the victims of the Orlando nightclub shooting. The proceedings are donated to the National Compassion Fund to benefit the victims' families.[1]\nLyrically, the song talks about self-identity and acceptance.[2] Characterized as a slow ballad, received mostly positive reviews from music critics, who praised Aguilera's vocals and the song's empowering lyrics.\n"
    },
    {
        "link": "/wiki/Chris_Murphy_gun_control_filibuster",
        "title": "Chris Murphy gun control filibuster",
        "date": "",
        "location": "",
        "paragraph": "\nOn June 15, 2016, in the wake of a mass shooting in Orlando, Florida, Senator Chris Murphy, Democrat of Connecticut, launched a filibuster in the United States Senate, promising to hold the floor \"for as long as I can\" or until Congress acts on gun control legislation.[1]\n"
    },
    {
        "link": "/wiki/God_Control",
        "title": "God Control",
        "date": "",
        "location": "",
        "paragraph": "\n\"God Control\" is a song by American singer-songwriter Madonna from her fourteenth studio album, Madame X (2019). It was written by Madonna, longtime collaborator Mirwais, and American musician Casey Spooner. Madonna and Mirwais produced the song along with Mike Dean. Lyrically the song talks about gun control and also touches on the political climate of the United States at the time. It is an experimental pop, disco, hi-NRG and electropop song and features the Tiffin Children's Chorus repeating \"We lost god control\" all throughout. In the music video, we can see Madonna typing \"we lost gun control\" and not \"god control\" as the song title suggests.\n"
    },
    {
        "link": "/wiki/The_Greatest_(Sia_song)",
        "title": "The Greatest (Sia song)",
        "date": "",
        "location": "",
        "paragraph": "\n\"The Greatest\" is a song recorded by Australian singer and songwriter Sia for the deluxe edition of her seventh studio album, This Is Acting (2016). Being made available for digital consumption as the record's third single on 6 September 2016 through Monkey Puzzle and RCA Records, \"The Greatest\" features a new part with the American rapper Kendrick Lamar. The electropop song was written by Sia, Greg Kurstin, and Lamar while production was only handled by Kurstin. The solo version was written only by the former two. The song was originally intended to be in a new album called We Are Your Children.[1]\n"
    },
    {
        "link": "/wiki/Hands_(2016_song)",
        "title": "Hands (2016 song)",
        "date": "",
        "location": "",
        "paragraph": "\"Hands\" is a charity single recorded by various artists as tribute to victims of the Orlando nightclub shooting. It was written by Justin Tranter, Julia Michaels, and BloodPop, and produced by the latter and Mark Ronson. All of the song's proceeds benefited the families affected during the shooting, and helped cover medical costs and counseling efforts. The song was written a day after the mass shooting occurred.\nApproximately 27 artists assisted in the making of \"Hands\", which was released for download on July 6, 2016. Interscope Records handled the release, allowing artists to use the studios most convenient to them. In addition to Tranter and Interscope, GLAAD also helped with the single. Proceeds from the song were donated to the Equality Florida Pulse Victims Fund, the GLBT Community Center of Central Florida and GLAAD.\n"
    },
    {
        "link": "/wiki/Love_Is_Love_(comics)",
        "title": "Love Is Love (comics)",
        "date": "December 2016",
        "location": "",
        "paragraph": "\nLove Is Love is a 144-page graphic novel released in December 2016 by IDW Publishing in collaboration with DC Entertainment with many characters appearing from other publishers and franchises with explicit permission in tribute to the victims of the Orlando nightclub shooting. The comic became a New York Times bestseller and over US$165,000 was raised by the sales, which was donated to the victims.[1][2] The comic was produced with volunteer work by dozens of artists and featured the first official comic based on the Harry Potter media franchise.[3][4][5]\n"
    },
    {
        "link": "/wiki/Love_Make_the_World_Go_Round",
        "title": "Love Make the World Go Round",
        "date": "",
        "location": "",
        "paragraph": "\"Love Make the World Go Round\" is a charity single recorded by American entertainer Jennifer Lopez and American composer Lin-Manuel Miranda. It was written by Lopez, Miranda, Mike Molina, Melody Noel Hernandez, John Mitchell, Nelson Kyle, Marcus Lomax, Jordan Johnson and Stefan Johnson, and produced by The Agency and The Monsters & Strangerz. The song was released exclusively on the iTunes Store in the United States on July 8, 2016, by Epic Records. All proceeds from \"Love Make the World Go Round\" were donated to the Hispanic Federation's Somos Orlando fund, which provided care and resources to the victims of the Orlando nightclub shooting.[1]\nProceeds of the song will go toward the Hispanic Federation's Proyecto Somos Orlando initiative, which \"will address the long-term needs for mental health services that are culturally competent and bilingual. Proyecto will enable care to be delivered to those affected directly in the communities in which they live. Beyond emergency assistance, they will be provided with case management, crisis intervention and mental health services, among other needs.\"[2]\n"
    },
    {
        "link": "/wiki/Omar_Mateen",
        "title": "Omar Mateen",
        "date": "June 12, 2016; 6 years ago (2016-06-12)c.  2:00 – c.  5:00 a.m.",
        "location": "",
        "paragraph": "\nOmar Mir Seddique Mateen[1] born Omar Mir Seddique; (November 16, 1986 – June 12, 2016) was an American mass murderer and domestic terrorist who murdered 49 people and wounded 53 others in a mass shooting at the Pulse nightclub in Orlando, Florida, on June 12, 2016, before he was killed in a shootout with the local police. It was the deadliest shooting by a single shooter in United States history until the Las Vegas Strip shooting on October 1, 2017.\n"
    },
    {
        "link": "/wiki/Our_Happy_Hours",
        "title": "Our Happy Hours",
        "date": "",
        "location": "",
        "paragraph": "Our Happy Hours: LGBT Voices from the Gay Bars is a 2017 anthology that came about as a result of the massacre at the Pulse nightclub in Orlando, Florida. The anthology is curated by writers Renee Bess and Lee Lynch and contains contributions from LGBT writers from all walks of life. The anthology was created to give LGBTQ writers a chance to reflect upon the role of the gay bar in their lives and to express its importance to non-LGBTQ people.[1]\nThe massacre at the Pulse nightclub in Orlando, Florida brought LGBT club life into the public view. However, it became apparent that many people outside of the LGBTQ community did not truly understand the role that bars and clubs play in the community and how their importance evolved over the years.[2]\n"
    },
    {
        "link": "/wiki/Pulse_(nightclub)",
        "title": "Pulse (nightclub)",
        "date": "",
        "location": "Orlando, Florida, U.S.",
        "paragraph": "\nPulse was a gay bar, dance club, and nightclub in Orlando, Florida, founded in 2004 by Barbara Poma and Ron Legler. On June 12, 2016, the club was the scene of the second worst mass shooting by a single gunman in U.S. history, and the second deadliest terrorist attack on U.S. soil since the events of September 11, 2001. Forty-nine people were killed and 53 other people were injured.\n"
    },
    {
        "link": "/wiki/Pulse_Memorial_and_Museum",
        "title": "Pulse Memorial and Museum",
        "date": "",
        "location": "Orlando, Florida",
        "paragraph": "\nThe National Pulse Memorial and Museum is a planned memorial and museum commemorating victims of the Orlando nightclub shooting at Pulse in 2016, originally planned to open in 2022.[1]\n"
    },
    {
        "link": "/wiki/Swerlk",
        "title": "Swerlk",
        "date": "",
        "location": "",
        "paragraph": "\n\"Swerlk\" is a song by American electronic singer MNDR and American pop band Scissor Sisters. It was released as a single on June 9, 2017, by WonderSound Records. MNDR and Scissor Sisters conceived the song in honor of the one-year remembrance of the 2016 Orlando nightclub shooting. \"Swerlk\" was released in conjunction with GLAAD and proceeds from the sales benefited the Contigo Fund, a non-profit organization for LGBTQ individuals. The website swerlk.com was developed to funnel donations directly to Contigo.\n"
    },
    {
        "link": "/wiki/2016_United_States_House_of_Representatives_sit-in",
        "title": "2016 United States House of Representatives sit-in",
        "date": "June 22, 2016",
        "location": "United States Capitol",
        "paragraph": "\nThe 2016 United States House of Representatives sit-in began on June 22, 2016, when members of the House Democratic Caucus, led by Georgia Representative John Lewis, Massachusetts Representative Katherine Clark, and Illinois Representative Robin Kelly, declared their intention to remain on the floor of the United States House of Representatives until its Republican Speaker, Paul Ryan, allowed votes on gun control legislation in the aftermath of the June 12, 2016 Orlando nightclub shooting. The sit-in was staged by about 60 legislators.[a] Barack Obama, Bill Clinton, and Hillary Clinton showed their support via Twitter.[4][5][6]\n"
    },
    {
        "link": "/wiki/Orlando_nightclub_shooting",
        "title": "Orlando nightclub shooting",
        "date": "June 12, 2016; 6 years ago (2016-06-12) 2:02 a.m. – 5:14 a.m. EDT (UTC−04:00)",
        "location": "Pulse Nightclub1912 S. Orange AvenueOrlando, Florida, U.S.",
        "paragraph": "\nOn June 12, 2016, Omar Mateen, a 29-year-old man, killed 49 people and wounded 53 more in a mass shooting at Pulse, a gay nightclub in Orlando, Florida, United States. Orlando Police officers shot and killed him after a three-hour standoff.\n"
    },
    {
        "link": "/wiki/Broadway_for_Orlando",
        "title": "Broadway for Orlando",
        "date": "",
        "location": "",
        "paragraph": "Broadway for Orlando is a charitable initiative to provide support to the victims of the Orlando nightclub shooting.\nFounded in June 2016 by Broadway Records, it sponsored a re-recording of Hal David's and Burt Bacharach's 1965 song, What the World Needs Now, sung by an all-star cast of Broadway artists. The organization is committing to donate 100% of the proceeds from the sale of this recording to the GLBT Community Center of Central Florida.[1]\n"
    },
    {
        "link": "/wiki/Change_(Christina_Aguilera_song)",
        "title": "Change (Christina Aguilera song)",
        "date": "",
        "location": "",
        "paragraph": "\"Change\" is a song recorded by American singer Christina Aguilera. It was written by Aguilera, Fancy Hagood and Flo Reutter, while its production was done by Flo Reutter and Martin Terefe. RCA Records premiered the song on June 16, 2016, on On Air with Ryan Seacrest. The song was dedicated to the victims of the Orlando nightclub shooting. The proceedings are donated to the National Compassion Fund to benefit the victims' families.[1]\nLyrically, the song talks about self-identity and acceptance.[2] Characterized as a slow ballad, received mostly positive reviews from music critics, who praised Aguilera's vocals and the song's empowering lyrics.\n"
    },
    {
        "link": "/wiki/Chris_Murphy_gun_control_filibuster",
        "title": "Chris Murphy gun control filibuster",
        "date": "",
        "location": "",
        "paragraph": "\nOn June 15, 2016, in the wake of a mass shooting in Orlando, Florida, Senator Chris Murphy, Democrat of Connecticut, launched a filibuster in the United States Senate, promising to hold the floor \"for as long as I can\" or until Congress acts on gun control legislation.[1]\n"
    },
    {
        "link": "/wiki/God_Control",
        "title": "God Control",
        "date": "",
        "location": "",
        "paragraph": "\n\"God Control\" is a song by American singer-songwriter Madonna from her fourteenth studio album, Madame X (2019). It was written by Madonna, longtime collaborator Mirwais, and American musician Casey Spooner. Madonna and Mirwais produced the song along with Mike Dean. Lyrically the song talks about gun control and also touches on the political climate of the United States at the time. It is an experimental pop, disco, hi-NRG and electropop song and features the Tiffin Children's Chorus repeating \"We lost god control\" all throughout. In the music video, we can see Madonna typing \"we lost gun control\" and not \"god control\" as the song title suggests.\n"
    },
    {
        "link": "/wiki/The_Greatest_(Sia_song)",
        "title": "The Greatest (Sia song)",
        "date": "",
        "location": "",
        "paragraph": "\n\"The Greatest\" is a song recorded by Australian singer and songwriter Sia for the deluxe edition of her seventh studio album, This Is Acting (2016). Being made available for digital consumption as the record's third single on 6 September 2016 through Monkey Puzzle and RCA Records, \"The Greatest\" features a new part with the American rapper Kendrick Lamar. The electropop song was written by Sia, Greg Kurstin, and Lamar while production was only handled by Kurstin. The solo version was written only by the former two. The song was originally intended to be in a new album called We Are Your Children.[1]\n"
    },
    {
        "link": "/wiki/Hands_(2016_song)",
        "title": "Hands (2016 song)",
        "date": "",
        "location": "",
        "paragraph": "\"Hands\" is a charity single recorded by various artists as tribute to victims of the Orlando nightclub shooting. It was written by Justin Tranter, Julia Michaels, and BloodPop, and produced by the latter and Mark Ronson. All of the song's proceeds benefited the families affected during the shooting, and helped cover medical costs and counseling efforts. The song was written a day after the mass shooting occurred.\nApproximately 27 artists assisted in the making of \"Hands\", which was released for download on July 6, 2016. Interscope Records handled the release, allowing artists to use the studios most convenient to them. In addition to Tranter and Interscope, GLAAD also helped with the single. Proceeds from the song were donated to the Equality Florida Pulse Victims Fund, the GLBT Community Center of Central Florida and GLAAD.\n"
    },
    {
        "link": "/wiki/Love_Is_Love_(comics)",
        "title": "Love Is Love (comics)",
        "date": "December 2016",
        "location": "",
        "paragraph": "\nLove Is Love is a 144-page graphic novel released in December 2016 by IDW Publishing in collaboration with DC Entertainment with many characters appearing from other publishers and franchises with explicit permission in tribute to the victims of the Orlando nightclub shooting. The comic became a New York Times bestseller and over US$165,000 was raised by the sales, which was donated to the victims.[1][2] The comic was produced with volunteer work by dozens of artists and featured the first official comic based on the Harry Potter media franchise.[3][4][5]\n"
    },
    {
        "link": "/wiki/Love_Make_the_World_Go_Round",
        "title": "Love Make the World Go Round",
        "date": "",
        "location": "",
        "paragraph": "\"Love Make the World Go Round\" is a charity single recorded by American entertainer Jennifer Lopez and American composer Lin-Manuel Miranda. It was written by Lopez, Miranda, Mike Molina, Melody Noel Hernandez, John Mitchell, Nelson Kyle, Marcus Lomax, Jordan Johnson and Stefan Johnson, and produced by The Agency and The Monsters & Strangerz. The song was released exclusively on the iTunes Store in the United States on July 8, 2016, by Epic Records. All proceeds from \"Love Make the World Go Round\" were donated to the Hispanic Federation's Somos Orlando fund, which provided care and resources to the victims of the Orlando nightclub shooting.[1]\nProceeds of the song will go toward the Hispanic Federation's Proyecto Somos Orlando initiative, which \"will address the long-term needs for mental health services that are culturally competent and bilingual. Proyecto will enable care to be delivered to those affected directly in the communities in which they live. Beyond emergency assistance, they will be provided with case management, crisis intervention and mental health services, among other needs.\"[2]\n"
    },
    {
        "link": "/wiki/Omar_Mateen",
        "title": "Omar Mateen",
        "date": "June 12, 2016; 6 years ago (2016-06-12)c.  2:00 – c.  5:00 a.m.",
        "location": "",
        "paragraph": "\nOmar Mir Seddique Mateen[1] born Omar Mir Seddique; (November 16, 1986 – June 12, 2016) was an American mass murderer and domestic terrorist who murdered 49 people and wounded 53 others in a mass shooting at the Pulse nightclub in Orlando, Florida, on June 12, 2016, before he was killed in a shootout with the local police. It was the deadliest shooting by a single shooter in United States history until the Las Vegas Strip shooting on October 1, 2017.\n"
    },
    {
        "link": "/wiki/Our_Happy_Hours",
        "title": "Our Happy Hours",
        "date": "",
        "location": "",
        "paragraph": "Our Happy Hours: LGBT Voices from the Gay Bars is a 2017 anthology that came about as a result of the massacre at the Pulse nightclub in Orlando, Florida. The anthology is curated by writers Renee Bess and Lee Lynch and contains contributions from LGBT writers from all walks of life. The anthology was created to give LGBTQ writers a chance to reflect upon the role of the gay bar in their lives and to express its importance to non-LGBTQ people.[1]\nThe massacre at the Pulse nightclub in Orlando, Florida brought LGBT club life into the public view. However, it became apparent that many people outside of the LGBTQ community did not truly understand the role that bars and clubs play in the community and how their importance evolved over the years.[2]\n"
    },
    {
        "link": "/wiki/Pulse_(nightclub)",
        "title": "Pulse (nightclub)",
        "date": "",
        "location": "Orlando, Florida, U.S.",
        "paragraph": "\nPulse was a gay bar, dance club, and nightclub in Orlando, Florida, founded in 2004 by Barbara Poma and Ron Legler. On June 12, 2016, the club was the scene of the second worst mass shooting by a single gunman in U.S. history, and the second deadliest terrorist attack on U.S. soil since the events of September 11, 2001. Forty-nine people were killed and 53 other people were injured.\n"
    },
    {
        "link": "/wiki/Pulse_Memorial_and_Museum",
        "title": "Pulse Memorial and Museum",
        "date": "",
        "location": "Orlando, Florida",
        "paragraph": "\nThe National Pulse Memorial and Museum is a planned memorial and museum commemorating victims of the Orlando nightclub shooting at Pulse in 2016, originally planned to open in 2022.[1]\n"
    },
    {
        "link": "/wiki/Swerlk",
        "title": "Swerlk",
        "date": "",
        "location": "",
        "paragraph": "\n\"Swerlk\" is a song by American electronic singer MNDR and American pop band Scissor Sisters. It was released as a single on June 9, 2017, by WonderSound Records. MNDR and Scissor Sisters conceived the song in honor of the one-year remembrance of the 2016 Orlando nightclub shooting. \"Swerlk\" was released in conjunction with GLAAD and proceeds from the sales benefited the Contigo Fund, a non-profit organization for LGBTQ individuals. The website swerlk.com was developed to funnel donations directly to Contigo.\n"
    },
    {
        "link": "/wiki/2016_United_States_House_of_Representatives_sit-in",
        "title": "2016 United States House of Representatives sit-in",
        "date": "June 22, 2016",
        "location": "United States Capitol",
        "paragraph": "\nThe 2016 United States House of Representatives sit-in began on June 22, 2016, when members of the House Democratic Caucus, led by Georgia Representative John Lewis, Massachusetts Representative Katherine Clark, and Illinois Representative Robin Kelly, declared their intention to remain on the floor of the United States House of Representatives until its Republican Speaker, Paul Ryan, allowed votes on gun control legislation in the aftermath of the June 12, 2016 Orlando nightclub shooting. The sit-in was staged by about 60 legislators.[a] Barack Obama, Bill Clinton, and Hillary Clinton showed their support via Twitter.[4][5][6]\n"
    },
    {
        "link": "/wiki/Orlando_nightclub_shooting",
        "title": "Orlando nightclub shooting",
        "date": "June 12, 2016; 6 years ago (2016-06-12) 2:02 a.m. – 5:14 a.m. EDT (UTC−04:00)",
        "location": "Pulse Nightclub1912 S. Orange AvenueOrlando, Florida, U.S.",
        "paragraph": "\nOn June 12, 2016, Omar Mateen, a 29-year-old man, killed 49 people and wounded 53 more in a mass shooting at Pulse, a gay nightclub in Orlando, Florida, United States. Orlando Police officers shot and killed him after a three-hour standoff.\n"
    },
    {
        "link": "/wiki/Broadway_for_Orlando",
        "title": "Broadway for Orlando",
        "date": "",
        "location": "",
        "paragraph": "Broadway for Orlando is a charitable initiative to provide support to the victims of the Orlando nightclub shooting.\nFounded in June 2016 by Broadway Records, it sponsored a re-recording of Hal David's and Burt Bacharach's 1965 song, What the World Needs Now, sung by an all-star cast of Broadway artists. The organization is committing to donate 100% of the proceeds from the sale of this recording to the GLBT Community Center of Central Florida.[1]\n"
    },
    {
        "link": "/wiki/Change_(Christina_Aguilera_song)",
        "title": "Change (Christina Aguilera song)",
        "date": "",
        "location": "",
        "paragraph": "\"Change\" is a song recorded by American singer Christina Aguilera. It was written by Aguilera, Fancy Hagood and Flo Reutter, while its production was done by Flo Reutter and Martin Terefe. RCA Records premiered the song on June 16, 2016, on On Air with Ryan Seacrest. The song was dedicated to the victims of the Orlando nightclub shooting. The proceedings are donated to the National Compassion Fund to benefit the victims' families.[1]\nLyrically, the song talks about self-identity and acceptance.[2] Characterized as a slow ballad, received mostly positive reviews from music critics, who praised Aguilera's vocals and the song's empowering lyrics.\n"
    },
    {
        "link": "/wiki/Chris_Murphy_gun_control_filibuster",
        "title": "Chris Murphy gun control filibuster",
        "date": "",
        "location": "",
        "paragraph": "\nOn June 15, 2016, in the wake of a mass shooting in Orlando, Florida, Senator Chris Murphy, Democrat of Connecticut, launched a filibuster in the United States Senate, promising to hold the floor \"for as long as I can\" or until Congress acts on gun control legislation.[1]\n"
    },
    {
        "link": "/wiki/God_Control",
        "title": "God Control",
        "date": "",
        "location": "",
        "paragraph": "\n\"God Control\" is a song by American singer-songwriter Madonna from her fourteenth studio album, Madame X (2019). It was written by Madonna, longtime collaborator Mirwais, and American musician Casey Spooner. Madonna and Mirwais produced the song along with Mike Dean. Lyrically the song talks about gun control and also touches on the political climate of the United States at the time. It is an experimental pop, disco, hi-NRG and electropop song and features the Tiffin Children's Chorus repeating \"We lost god control\" all throughout. In the music video, we can see Madonna typing \"we lost gun control\" and not \"god control\" as the song title suggests.\n"
    },
    {
        "link": "/wiki/The_Greatest_(Sia_song)",
        "title": "The Greatest (Sia song)",
        "date": "",
        "location": "",
        "paragraph": "\n\"The Greatest\" is a song recorded by Australian singer and songwriter Sia for the deluxe edition of her seventh studio album, This Is Acting (2016). Being made available for digital consumption as the record's third single on 6 September 2016 through Monkey Puzzle and RCA Records, \"The Greatest\" features a new part with the American rapper Kendrick Lamar. The electropop song was written by Sia, Greg Kurstin, and Lamar while production was only handled by Kurstin. The solo version was written only by the former two. The song was originally intended to be in a new album called We Are Your Children.[1]\n"
    },
    {
        "link": "/wiki/Hands_(2016_song)",
        "title": "Hands (2016 song)",
        "date": "",
        "location": "",
        "paragraph": "\"Hands\" is a charity single recorded by various artists as tribute to victims of the Orlando nightclub shooting. It was written by Justin Tranter, Julia Michaels, and BloodPop, and produced by the latter and Mark Ronson. All of the song's proceeds benefited the families affected during the shooting, and helped cover medical costs and counseling efforts. The song was written a day after the mass shooting occurred.\nApproximately 27 artists assisted in the making of \"Hands\", which was released for download on July 6, 2016. Interscope Records handled the release, allowing artists to use the studios most convenient to them. In addition to Tranter and Interscope, GLAAD also helped with the single. Proceeds from the song were donated to the Equality Florida Pulse Victims Fund, the GLBT Community Center of Central Florida and GLAAD.\n"
    },
    {
        "link": "/wiki/Love_Is_Love_(comics)",
        "title": "Love Is Love (comics)",
        "date": "December 2016",
        "location": "",
        "paragraph": "\nLove Is Love is a 144-page graphic novel released in December 2016 by IDW Publishing in collaboration with DC Entertainment with many characters appearing from other publishers and franchises with explicit permission in tribute to the victims of the Orlando nightclub shooting. The comic became a New York Times bestseller and over US$165,000 was raised by the sales, which was donated to the victims.[1][2] The comic was produced with volunteer work by dozens of artists and featured the first official comic based on the Harry Potter media franchise.[3][4][5]\n"
    },
    {
        "link": "/wiki/Love_Make_the_World_Go_Round",
        "title": "Love Make the World Go Round",
        "date": "",
        "location": "",
        "paragraph": "\"Love Make the World Go Round\" is a charity single recorded by American entertainer Jennifer Lopez and American composer Lin-Manuel Miranda. It was written by Lopez, Miranda, Mike Molina, Melody Noel Hernandez, John Mitchell, Nelson Kyle, Marcus Lomax, Jordan Johnson and Stefan Johnson, and produced by The Agency and The Monsters & Strangerz. The song was released exclusively on the iTunes Store in the United States on July 8, 2016, by Epic Records. All proceeds from \"Love Make the World Go Round\" were donated to the Hispanic Federation's Somos Orlando fund, which provided care and resources to the victims of the Orlando nightclub shooting.[1]\nProceeds of the song will go toward the Hispanic Federation's Proyecto Somos Orlando initiative, which \"will address the long-term needs for mental health services that are culturally competent and bilingual. Proyecto will enable care to be delivered to those affected directly in the communities in which they live. Beyond emergency assistance, they will be provided with case management, crisis intervention and mental health services, among other needs.\"[2]\n"
    },
    {
        "link": "/wiki/Omar_Mateen",
        "title": "Omar Mateen",
        "date": "June 12, 2016; 6 years ago (2016-06-12)c.  2:00 – c.  5:00 a.m.",
        "location": "",
        "paragraph": "\nOmar Mir Seddique Mateen[1] born Omar Mir Seddique; (November 16, 1986 – June 12, 2016) was an American mass murderer and domestic terrorist who murdered 49 people and wounded 53 others in a mass shooting at the Pulse nightclub in Orlando, Florida, on June 12, 2016, before he was killed in a shootout with the local police. It was the deadliest shooting by a single shooter in United States history until the Las Vegas Strip shooting on October 1, 2017.\n"
    },
    {
        "link": "/wiki/Our_Happy_Hours",
        "title": "Our Happy Hours",
        "date": "",
        "location": "",
        "paragraph": "Our Happy Hours: LGBT Voices from the Gay Bars is a 2017 anthology that came about as a result of the massacre at the Pulse nightclub in Orlando, Florida. The anthology is curated by writers Renee Bess and Lee Lynch and contains contributions from LGBT writers from all walks of life. The anthology was created to give LGBTQ writers a chance to reflect upon the role of the gay bar in their lives and to express its importance to non-LGBTQ people.[1]\nThe massacre at the Pulse nightclub in Orlando, Florida brought LGBT club life into the public view. However, it became apparent that many people outside of the LGBTQ community did not truly understand the role that bars and clubs play in the community and how their importance evolved over the years.[2]\n"
    },
    {
        "link": "/wiki/Pulse_(nightclub)",
        "title": "Pulse (nightclub)",
        "date": "",
        "location": "Orlando, Florida, U.S.",
        "paragraph": "\nPulse was a gay bar, dance club, and nightclub in Orlando, Florida, founded in 2004 by Barbara Poma and Ron Legler. On June 12, 2016, the club was the scene of the second worst mass shooting by a single gunman in U.S. history, and the second deadliest terrorist attack on U.S. soil since the events of September 11, 2001. Forty-nine people were killed and 53 other people were injured.\n"
    },
    {
        "link": "/wiki/Pulse_Memorial_and_Museum",
        "title": "Pulse Memorial and Museum",
        "date": "",
        "location": "Orlando, Florida",
        "paragraph": "\nThe National Pulse Memorial and Museum is a planned memorial and museum commemorating victims of the Orlando nightclub shooting at Pulse in 2016, originally planned to open in 2022.[1]\n"
    },
    {
        "link": "/wiki/Swerlk",
        "title": "Swerlk",
        "date": "",
        "location": "",
        "paragraph": "\n\"Swerlk\" is a song by American electronic singer MNDR and American pop band Scissor Sisters. It was released as a single on June 9, 2017, by WonderSound Records. MNDR and Scissor Sisters conceived the song in honor of the one-year remembrance of the 2016 Orlando nightclub shooting. \"Swerlk\" was released in conjunction with GLAAD and proceeds from the sales benefited the Contigo Fund, a non-profit organization for LGBTQ individuals. The website swerlk.com was developed to funnel donations directly to Contigo.\n"
    },
    {
        "link": "/wiki/2016_United_States_House_of_Representatives_sit-in",
        "title": "2016 United States House of Representatives sit-in",
        "date": "June 22, 2016",
        "location": "United States Capitol",
        "paragraph": "\nThe 2016 United States House of Representatives sit-in began on June 22, 2016, when members of the House Democratic Caucus, led by Georgia Representative John Lewis, Massachusetts Representative Katherine Clark, and Illinois Representative Robin Kelly, declared their intention to remain on the floor of the United States House of Representatives until its Republican Speaker, Paul Ryan, allowed votes on gun control legislation in the aftermath of the June 12, 2016 Orlando nightclub shooting. The sit-in was staged by about 60 legislators.[a] Barack Obama, Bill Clinton, and Hillary Clinton showed their support via Twitter.[4][5][6]\n"
    },
    {
        "link": "/wiki/Orlando_nightclub_shooting",
        "title": "Orlando nightclub shooting",
        "date": "June 12, 2016; 6 years ago (2016-06-12) 2:02 a.m. – 5:14 a.m. EDT (UTC−04:00)",
        "location": "Pulse Nightclub1912 S. Orange AvenueOrlando, Florida, U.S.",
        "paragraph": "\nOn June 12, 2016, Omar Mateen, a 29-year-old man, killed 49 people and wounded 53 more in a mass shooting at Pulse, a gay nightclub in Orlando, Florida, United States. Orlando Police officers shot and killed him after a three-hour standoff.\n"
    },
    {
        "link": "/wiki/Broadway_for_Orlando",
        "title": "Broadway for Orlando",
        "date": "",
        "location": "",
        "paragraph": "Broadway for Orlando is a charitable initiative to provide support to the victims of the Orlando nightclub shooting.\nFounded in June 2016 by Broadway Records, it sponsored a re-recording of Hal David's and Burt Bacharach's 1965 song, What the World Needs Now, sung by an all-star cast of Broadway artists. The organization is committing to donate 100% of the proceeds from the sale of this recording to the GLBT Community Center of Central Florida.[1]\n"
    },
    {
        "link": "/wiki/Change_(Christina_Aguilera_song)",
        "title": "Change (Christina Aguilera song)",
        "date": "",
        "location": "",
        "paragraph": "\"Change\" is a song recorded by American singer Christina Aguilera. It was written by Aguilera, Fancy Hagood and Flo Reutter, while its production was done by Flo Reutter and Martin Terefe. RCA Records premiered the song on June 16, 2016, on On Air with Ryan Seacrest. The song was dedicated to the victims of the Orlando nightclub shooting. The proceedings are donated to the National Compassion Fund to benefit the victims' families.[1]\nLyrically, the song talks about self-identity and acceptance.[2] Characterized as a slow ballad, received mostly positive reviews from music critics, who praised Aguilera's vocals and the song's empowering lyrics.\n"
    },
    {
        "link": "/wiki/Chris_Murphy_gun_control_filibuster",
        "title": "Chris Murphy gun control filibuster",
        "date": "",
        "location": "",
        "paragraph": "\nOn June 15, 2016, in the wake of a mass shooting in Orlando, Florida, Senator Chris Murphy, Democrat of Connecticut, launched a filibuster in the United States Senate, promising to hold the floor \"for as long as I can\" or until Congress acts on gun control legislation.[1]\n"
    },
    {
        "link": "/wiki/God_Control",
        "title": "God Control",
        "date": "",
        "location": "",
        "paragraph": "\n\"God Control\" is a song by American singer-songwriter Madonna from her fourteenth studio album, Madame X (2019). It was written by Madonna, longtime collaborator Mirwais, and American musician Casey Spooner. Madonna and Mirwais produced the song along with Mike Dean. Lyrically the song talks about gun control and also touches on the political climate of the United States at the time. It is an experimental pop, disco, hi-NRG and electropop song and features the Tiffin Children's Chorus repeating \"We lost god control\" all throughout. In the music video, we can see Madonna typing \"we lost gun control\" and not \"god control\" as the song title suggests.\n"
    },
    {
        "link": "/wiki/The_Greatest_(Sia_song)",
        "title": "The Greatest (Sia song)",
        "date": "",
        "location": "",
        "paragraph": "\n\"The Greatest\" is a song recorded by Australian singer and songwriter Sia for the deluxe edition of her seventh studio album, This Is Acting (2016). Being made available for digital consumption as the record's third single on 6 September 2016 through Monkey Puzzle and RCA Records, \"The Greatest\" features a new part with the American rapper Kendrick Lamar. The electropop song was written by Sia, Greg Kurstin, and Lamar while production was only handled by Kurstin. The solo version was written only by the former two. The song was originally intended to be in a new album called We Are Your Children.[1]\n"
    },
    {
        "link": "/wiki/Hands_(2016_song)",
        "title": "Hands (2016 song)",
        "date": "",
        "location": "",
        "paragraph": "\"Hands\" is a charity single recorded by various artists as tribute to victims of the Orlando nightclub shooting. It was written by Justin Tranter, Julia Michaels, and BloodPop, and produced by the latter and Mark Ronson. All of the song's proceeds benefited the families affected during the shooting, and helped cover medical costs and counseling efforts. The song was written a day after the mass shooting occurred.\nApproximately 27 artists assisted in the making of \"Hands\", which was released for download on July 6, 2016. Interscope Records handled the release, allowing artists to use the studios most convenient to them. In addition to Tranter and Interscope, GLAAD also helped with the single. Proceeds from the song were donated to the Equality Florida Pulse Victims Fund, the GLBT Community Center of Central Florida and GLAAD.\n"
    },
    {
        "link": "/wiki/Love_Is_Love_(comics)",
        "title": "Love Is Love (comics)",
        "date": "December 2016",
        "location": "",
        "paragraph": "\nLove Is Love is a 144-page graphic novel released in December 2016 by IDW Publishing in collaboration with DC Entertainment with many characters appearing from other publishers and franchises with explicit permission in tribute to the victims of the Orlando nightclub shooting. The comic became a New York Times bestseller and over US$165,000 was raised by the sales, which was donated to the victims.[1][2] The comic was produced with volunteer work by dozens of artists and featured the first official comic based on the Harry Potter media franchise.[3][4][5]\n"
    },
    {
        "link": "/wiki/Love_Make_the_World_Go_Round",
        "title": "Love Make the World Go Round",
        "date": "",
        "location": "",
        "paragraph": "\"Love Make the World Go Round\" is a charity single recorded by American entertainer Jennifer Lopez and American composer Lin-Manuel Miranda. It was written by Lopez, Miranda, Mike Molina, Melody Noel Hernandez, John Mitchell, Nelson Kyle, Marcus Lomax, Jordan Johnson and Stefan Johnson, and produced by The Agency and The Monsters & Strangerz. The song was released exclusively on the iTunes Store in the United States on July 8, 2016, by Epic Records. All proceeds from \"Love Make the World Go Round\" were donated to the Hispanic Federation's Somos Orlando fund, which provided care and resources to the victims of the Orlando nightclub shooting.[1]\nProceeds of the song will go toward the Hispanic Federation's Proyecto Somos Orlando initiative, which \"will address the long-term needs for mental health services that are culturally competent and bilingual. Proyecto will enable care to be delivered to those affected directly in the communities in which they live. Beyond emergency assistance, they will be provided with case management, crisis intervention and mental health services, among other needs.\"[2]\n"
    },
    {
        "link": "/wiki/Omar_Mateen",
        "title": "Omar Mateen",
        "date": "June 12, 2016; 6 years ago (2016-06-12)c.  2:00 – c.  5:00 a.m.",
        "location": "",
        "paragraph": "\nOmar Mir Seddique Mateen[1] born Omar Mir Seddique; (November 16, 1986 – June 12, 2016) was an American mass murderer and domestic terrorist who murdered 49 people and wounded 53 others in a mass shooting at the Pulse nightclub in Orlando, Florida, on June 12, 2016, before he was killed in a shootout with the local police. It was the deadliest shooting by a single shooter in United States history until the Las Vegas Strip shooting on October 1, 2017.\n"
    },
    {
        "link": "/wiki/Our_Happy_Hours",
        "title": "Our Happy Hours",
        "date": "",
        "location": "",
        "paragraph": "Our Happy Hours: LGBT Voices from the Gay Bars is a 2017 anthology that came about as a result of the massacre at the Pulse nightclub in Orlando, Florida. The anthology is curated by writers Renee Bess and Lee Lynch and contains contributions from LGBT writers from all walks of life. The anthology was created to give LGBTQ writers a chance to reflect upon the role of the gay bar in their lives and to express its importance to non-LGBTQ people.[1]\nThe massacre at the Pulse nightclub in Orlando, Florida brought LGBT club life into the public view. However, it became apparent that many people outside of the LGBTQ community did not truly understand the role that bars and clubs play in the community and how their importance evolved over the years.[2]\n"
    },
    {
        "link": "/wiki/Pulse_(nightclub)",
        "title": "Pulse (nightclub)",
        "date": "",
        "location": "Orlando, Florida, U.S.",
        "paragraph": "\nPulse was a gay bar, dance club, and nightclub in Orlando, Florida, founded in 2004 by Barbara Poma and Ron Legler. On June 12, 2016, the club was the scene of the second worst mass shooting by a single gunman in U.S. history, and the second deadliest terrorist attack on U.S. soil since the events of September 11, 2001. Forty-nine people were killed and 53 other people were injured.\n"
    },
    {
        "link": "/wiki/Pulse_Memorial_and_Museum",
        "title": "Pulse Memorial and Museum",
        "date": "",
        "location": "Orlando, Florida",
        "paragraph": "\nThe National Pulse Memorial and Museum is a planned memorial and museum commemorating victims of the Orlando nightclub shooting at Pulse in 2016, originally planned to open in 2022.[1]\n"
    },
    {
        "link": "/wiki/Swerlk",
        "title": "Swerlk",
        "date": "",
        "location": "",
        "paragraph": "\n\"Swerlk\" is a song by American electronic singer MNDR and American pop band Scissor Sisters. It was released as a single on June 9, 2017, by WonderSound Records. MNDR and Scissor Sisters conceived the song in honor of the one-year remembrance of the 2016 Orlando nightclub shooting. \"Swerlk\" was released in conjunction with GLAAD and proceeds from the sales benefited the Contigo Fund, a non-profit organization for LGBTQ individuals. The website swerlk.com was developed to funnel donations directly to Contigo.\n"
    },
    {
        "link": "/wiki/2016_United_States_House_of_Representatives_sit-in",
        "title": "2016 United States House of Representatives sit-in",
        "date": "June 22, 2016",
        "location": "United States Capitol",
        "paragraph": "\nThe 2016 United States House of Representatives sit-in began on June 22, 2016, when members of the House Democratic Caucus, led by Georgia Representative John Lewis, Massachusetts Representative Katherine Clark, and Illinois Representative Robin Kelly, declared their intention to remain on the floor of the United States House of Representatives until its Republican Speaker, Paul Ryan, allowed votes on gun control legislation in the aftermath of the June 12, 2016 Orlando nightclub shooting. The sit-in was staged by about 60 legislators.[a] Barack Obama, Bill Clinton, and Hillary Clinton showed their support via Twitter.[4][5][6]\n"
    },
    {
        "link": "/wiki/1968_Miami_riot",
        "title": "1968 Miami riot",
        "date": "August 7 – 8, 1968",
        "location": "Liberty City (Miami)",
        "paragraph": "SCLC member\nGovernor of Florida\n"
    },
    {
        "link": "/wiki/1982_Overtown_riot",
        "title": "1982 Overtown riot",
        "date": "December 28–30, 1982",
        "location": "Overtown, Miami, Florida, United States",
        "paragraph": "\nThe 1982 Overtown riot was a period of civil unrest in Miami, Florida, United States, from December 28 to 30, 1982. The riot was caused by the shooting death of an African American man in the city's Overtown neighborhood by a Latino police officer on December 28, leading to three days of disorder that resulted in one additional death, numerous injuries and arrests, and widespread property damage.\n"
    },
    {
        "link": "/wiki/1989_Miami_riot",
        "title": "1989 Miami riot",
        "date": "January 16–19, 1989",
        "location": "Overtown and Liberty City neighborhoods, Miami, Florida",
        "paragraph": "William Lozano\nClement Lloyd, Allan Blanchard\n"
    },
    {
        "link": "/wiki/Brooks_Brothers_riot",
        "title": "Brooks Brothers riot",
        "date": "",
        "location": "Miami-Dade County, Florida",
        "paragraph": "\nThe Brooks Brothers riot was a demonstration led by Republican staffers at a meeting of election canvassers in Miami-Dade County, Florida, on November 22, 2000, during a recount of votes made during the 2000 United States presidential election, with the goal of shutting down the recount. After demonstrations and acts of violence, local officials shut down the recount early. This had the effect of ensuring that the December 12 \"safe harbor\" deadline set by Title 3 of the United States Code could not be met, guaranteeing that George W. Bush would win the 2000 election.\n"
    },
    {
        "link": "/wiki/Ku_Klux_Klan_raid_of_La_Paloma_nightclub",
        "title": "Ku Klux Klan raid of La Paloma nightclub",
        "date": "November 15, 1937",
        "location": "Miami Dade County",
        "paragraph": "On November 15, 1937 the Ku Klux Klan raid of La Paloma nightclub occurred in an unincorporated area of Miami-Dade County. An estimated 200 Ku Klux Klan members stormed the popular LGBT-serving nightclub, patrons were ordered to leave and the nightclub was shut down for the evening.[1]\nMiami had recently begun to shift to cater to tourists. Local businesses intended to draw tourist money by offering Miami as a more modern alternative to Havana. To cater to tourists, many local businesses expected a relaxed approach from the vice police to gambling, and more acceptance of foreigners. Some grew frustrated with Miami's new tourism-based economy and began an anti-vice crusade. These included  construction workers affected by business failings in the area. This crusade began during Prohibition and led to the revitalization of the Ku Klux Klan in the Miami area.[2]\n"
    },
    {
        "link": "/wiki/1980_Miami_riots",
        "title": "1980 Miami riots",
        "date": "May 17, 1980 (1980-05-17) – May 20, 1980 (1980-05-20)",
        "location": "Dade County, Florida\nMiami\nWest Coconut Grove\nBrownsville\nLiberty City\nOvertown\n",
        "paragraph": "Florida Army National Guard\nGovernor Bob Graham\nMayor Maurice Ferré\n"
    },
    {
        "link": "/wiki/Race_riots_in_Miami",
        "title": "Race riots in Miami",
        "date": "1980s",
        "location": "Miami, Florida",
        "paragraph": "Race riots in Miami include a series of violent events that occurred in Miami mainly through the 1980s. After desegregation, much of the racial violence in Miami had calmed only to be reignited by the 1980s.[1] The decade of riots were the result of policing controversies and ethnic tensions fueled by the perceived threat of recent immigrants to African Americans on the Miami job market.[2]\nIn the United States through the 1960s, desegregation was empowering once disadvantaged African American communities to reach new political and economic gains. In Miami the Cuban exile seemed to undercut new African American gains as Cubans began to compete for jobs, residence, and political power. The later perceived successes of many Cubans gave a feeling of powerlessness to local African Americans. Many Cuban refugees lacked English language skills and ended up living in lower income neighborhoods and taking up blue collar jobs that many African Americans also held. In 1963, Ebony magazine characterized the Cuban exile as an \"invasion\" bringing in \"grave social and economic problems.\"[3]\n"
    },
    {
        "link": "/wiki/Sydney_Aiello",
        "title": "Stoneman Douglas High School shooting",
        "date": "February 14 2018; 4 years ago (February 14 2018) 2:21 – 2:27 p.m. (EST)",
        "location": "Parkland, Florida, U.S.",
        "paragraph": "\nOn February 14, 2018, 19-year-old Nikolas Cruz opened fire on students and staff at Marjory Stoneman Douglas High School in the Miami suburban town of Parkland, Florida, murdering 17 people[note 2] and injuring 17 others.[2][3][4] Cruz, a former student at the school, fled the scene on foot by blending in with other students, and was arrested without incident approximately one hour later in nearby Coral Springs.[5] Police and prosecutors investigated \"a pattern of disciplinary issues and unnerving behavior\".[6]\n"
    },
    {
        "link": "/wiki/Lori_Alhadeff",
        "title": "Lori Alhadeff",
        "date": "",
        "location": "",
        "paragraph": "Lori Alhadeff (née Robinovitz; born February 11, 1975) is an American activist, member of the Broward County School Board, and founder of school-safety organization Make Our Schools Safe. Her 14-year-old daughter, Alyssa Alhadeff, was murdered in the Stoneman Douglas High School shooting on February 14, 2018.[1] Alhadeff gained national attention after making an appearance the day after the shooting on CNN, pleading President Trump to increase school security and calls for gun control.\nLori Robinovitz grew up in Hillsborough Township, New Jersey,[2] where she attended Hillsborough High School and played on the school's soccer team.[3] She earned a Bachelor of Science in health and physical education from The College of New Jersey. She completed a Master of Arts in education at Gratz College. She is certified in the states of New Jersey and New York in health and physical education.[4]\n"
    },
    {
        "link": "/wiki/Alfonso_Calderon_(activist)",
        "title": "Alfonso Calderon (activist)",
        "date": "",
        "location": "",
        "paragraph": "Alfonso Calderón Atienzar[a] (born October 10, 2001)[2][3] is a Spanish-American student activist against gun violence.[6][7] He is a survivor of the Stoneman Douglas High School shooting and a founding member of the Never Again MSD movement.[6][8][7]\nCalderon was born in a Spanish town outside Madrid called Alcobendas, and he has been living in the United States since 2008.[9][4]\n"
    },
    {
        "link": "/wiki/Sarah_Chadwick_(activist)",
        "title": "Sarah Chadwick (activist)",
        "date": "",
        "location": "",
        "paragraph": "\nSarah Chadwick (born August 1, 2001) is an American activist against gun violence and one of the leaders of the Never Again MSD activist movement.[3]\n"
    },
    {
        "link": "/wiki/Jaclyn_Corin",
        "title": "Jaclyn Corin",
        "date": "",
        "location": "",
        "paragraph": "Jaclyn Corin (born October 27, 2000)[1] is an American activist against gun violence. \nShe survived the Stoneman Douglas High School shooting in 2018.[3][4][5] She is one of the co-founders of March for Our Lives and the organizer of a student protest to Tallahassee, Florida.[3][4] She has also been a vocal critic of politicians funded by the National Rifle Association.[3][4]\nCorin was included in Time magazine's 100 Most Influential People of 2018.[6]\n"
    },
    {
        "link": "/wiki/Matt_Deitsch",
        "title": "Matt Deitsch",
        "date": "",
        "location": "",
        "paragraph": "Matthew Bryan Deitsch (born October 4, 1997) is an American writer, gun violence prevention advocate and political advisor. Before entering politics, he worked in broadcast media and was a freelance photographer, film director and music producer. After the 2018 Stoneman Douglas High School shooting in which his siblings witnessed, Deitsch became chief strategist for the March For Our Lives protests and began advocating for gun violence prevention. He is the older brother of activist Ryan Deitsch.\nMatthew Bryan Deitsch[1] was born on October 4, 1997,[2][3] and grew up in Parkland, Florida. He is the older brother of activists Sam and Ryan Deitsch[4] and is a practicing Jew.[5] He attended Marjory Stoneman Douglas High School from 2012 until he graduated in 2016.[6] During his high school career, Deitsch was into television production and filmmaking.[7] After graduating from high school, he moved to the Los Angeles metropolitan area and attended Santa Monica College,[8][9] graduating with honors in 2017 with an associate of arts degree.[1] During his career at Santa Monica College, Deitsch entered his early political career and organized for environmental causes, including beach cleanup, with his biology class.[7] In a podcast interview hosted by CommonAlly, Deitsch credited taking a black feminism class with helping him become more educated about current affairs and politics in turn helping him participate in community organizing.[7] After attending community college, he transferred to California State University, Northridge.[10] Deitsch dropped out of Cal State Northridge after the Stoneman Douglas High School shooting.[11] He graduated from The New School in 2020 with a bachelor's degree.[12]\n"
    },
    {
        "link": "/wiki/Ryan_Deitsch",
        "title": "Ryan Deitsch",
        "date": "",
        "location": "",
        "paragraph": "\nRyan Deitsch (born November 30, 1999) is an American student activist against gun violence, and a survivor of the Parkland massacre. He is a founding member of the Never Again MSD movement.\n"
    },
    {
        "link": "/wiki/Sam_Deitsch",
        "title": "Sam Deitsch",
        "date": "",
        "location": "",
        "paragraph": "Samantha Deitsch (born February 14, 2003) is an American author and gun control activist who survived the Stoneman Douglas High School shooting in 2018.\nSamantha Deitsch was born on February 14, 2003.[1][2] She started attending Marjory Stoneman Douglas High School in 2017. Deitsch was a freshman at Marjorie Stoneman Douglas High School when the mass shooting occurred in 2018.[3] She was friends with one of the victims, Jaime Guttenberg.[4] She is the younger sister of film director Matt Deitsch and activist Ryan Deitsch.[5]\n"
    },
    {
        "link": "/wiki/Aalayah_Eastmond",
        "title": "Aalayah Eastmond",
        "date": "",
        "location": "",
        "paragraph": "\nAalayah Eastmond (born March 22, 2001) is an American activist and advocate for gun violence prevention, social justice, and racial equality. After surviving the Stoneman Douglas High School shooting, Eastmond began her activism during the 2018 United States gun violence protests. She has testified multiple times to the U.S. Congress. Eastmond is an executive council member of Team Enough, a youth-led gun violence prevention organization which is part of the Brady Campaign. Eastmond co-founded Concerned Citizens of DC in the wake of the murder of George Floyd to organize protests supporting social justice issues in Washington, D.C. She supports Black Lives Matter and protests against police brutality.\n"
    },
    {
        "link": "/wiki/X_Gonz%C3%A1lez",
        "title": "X González",
        "date": "",
        "location": "",
        "paragraph": "\nX González (born Emma González; November 11, 1999) is an American activist and advocate for gun control.[3][4][5] In 2018, they survived the Stoneman Douglas High School shooting,[6] the deadliest high school shooting in U.S. history, and in response co-founded the gun-control advocacy group Never Again MSD.[7]\n"
    },
    {
        "link": "/wiki/Fred_Guttenberg",
        "title": "Fred Guttenberg",
        "date": "",
        "location": "",
        "paragraph": "\nFred Guttenberg (born December 24, 1965) is an American activist against gun violence. His 14-year-old daughter Jaime Guttenberg[1] was murdered in the Stoneman Douglas High School shooting on February 14, 2018. His son, Jesse, also a student at the school, ran from the shooting to meet him at a nearby store.[2] He learned about his daughter's death from a friend who is a Coral Springs SWAT officer.[3] Jessica McBride, for the website Heavy, described him as \"one of the strongest voices for changes to gun laws in the wake of the mass shooting\".[4]\n"
    },
    {
        "link": "/wiki/David_Hogg",
        "title": "David Hogg",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Lauren_Hogg",
        "title": "Lauren Hogg",
        "date": "",
        "location": "",
        "paragraph": "Lauren Hogg (born June 10, 2003) is an American author and activist against gun violence. She survived the Stoneman Douglas High School shooting in 2018 and after became a co-founder of March for Our Lives and advocates against gun violence. She is the younger sister of former Marjory Stoneman Douglas student David Hogg.\nHogg was born on June 10, 2003,[1] and is the daughter of Kevin Hogg, a former agent of the Federal Bureau of Investigation,[2] and Rebecca Boldrick, born in San Diego County, California[3] and a teacher for Broward County Public Schools in Broward County, Florida.[4] She is also the younger sister of David Hogg, both graduating from Marjory Stoneman Douglas High School in 2018 and 2021, respectively.[5] Hogg and her family moved to Washington, D.C. after her graduation in 2021.[6]\n"
    },
    {
        "link": "/wiki/Kyle_Kashuv",
        "title": "Kyle Kashuv",
        "date": "",
        "location": "",
        "paragraph": "\nKyle Kashuv (born May 20, 2001) is an American conservative activist.[3] He survived the 2018 Stoneman Douglas High School shooting and subsequently advocated for gun rights, notably in opposition to his fellow survivors' March for Our Lives movement.[4][5]\n"
    },
    {
        "link": "/wiki/Cameron_Kasky",
        "title": "Cameron Kasky",
        "date": "",
        "location": "",
        "paragraph": "\nCameron Marley Kasky[1] (born November 11, 2000) is an American activist and advocate against gun violence who co-founded the student-led gun violence prevention advocacy group Never Again MSD. He is notable for helping to organize the March for Our Lives nationwide student protest in March 2018. Kasky is a survivor of the February 2018 mass shooting at Marjory Stoneman Douglas High School.[4] Kasky was included in Time magazine's \"100 Most Influential People of 2018\".[5]\n"
    },
    {
        "link": "/wiki/Ryan_Petty",
        "title": "Ryan Petty",
        "date": "",
        "location": "",
        "paragraph": "Ryan Blaine Petty (born January 15, 1970) is an American school safety activist. His 14-year-old daughter Alaina Petty was murdered in the Stoneman Douglas High School shooting on February 14, 2018.[1] Petty is credited with helping to pass the \"Marjory Stoneman Douglas High School Public Safety Act\" Florida Senate Bill 7026 just three weeks after his daughter Alaina was murdered.[2][3] At the federal level, Petty worked with Senators Orrin Hatch, Marco Rubio and Bill Nelson to pass the STOP School Violence Act and the Fix NICS Act of 2017.[4] He has met frequently with Florida governor Rick Scott, and many federal lawmakers.\nRyan Petty ran for Broward County School Board in 2018, narrowly losing in the primary to incumbent Donna Korn. In an unusual turn of events, Petty was endorsed by two sitting U.S. Senators Orrin Hatch and Marco Rubio, unusual for a local school board race.[5]  Senator Rubio credited Petty for his work to improve school safety and his help in passing the STOP School Violence Act.[6]\n"
    },
    {
        "link": "/wiki/Andrew_Pollack",
        "title": "Andrew Pollack",
        "date": "",
        "location": "",
        "paragraph": "Andrew Scott Pollack (born February 18, 1966) is an American author, school safety activist, and entrepreneur whose daughter Meadow was one of the 17 deceased victims in the Stoneman Douglas High School shooting in 2018.[1]\nPollack is among the Stoneman Douglas High School parents who lobbied for passage of the \"Marjory Stoneman Douglas High School Public Safety Act\" (Florida Senate Bill: 7026).[2][dubious  – discuss] Unlike many other Stoneman Douglas survivors and victims' parents,[3] Pollack has endorsed politicians who oppose gun-control measures, and he advocates programs that would arm teachers.[4] He argues that bulletproof glass, metal detectors, enhanced door lock systems, ID checkpoints, and \"school marshals\" can help prevent school shootings.[5]\n"
    },
    {
        "link": "/wiki/Hunter_Pollack",
        "title": "Hunter Pollack",
        "date": "",
        "location": "",
        "paragraph": "\nHunter Pollack (born August 6, 1997) is an American school safety activist and political advisor whose younger sister, Meadow, was murdered in the Stoneman Douglas High School shooting in 2018.[1] He is the son of Shara Kaplan and Andrew Pollack, and is a part of the nonprofit organization Americans for Children's Lives and School Safety.[2] Hunter is Jewish.[3]\n"
    },
    {
        "link": "/wiki/Alex_Wind",
        "title": "Alex Wind",
        "date": "",
        "location": "",
        "paragraph": "Alexander Blake Wind (born January 30, 2001)[2][3] is an American student activist against gun violence. A survivor of the Stoneman Douglas High School shooting and a founding member of the Never Again MSD movement,[4] he is a critic of politicians who are supported by the National Rifle Association.[5] Wind was one of five Stoneman Douglas students featured on the cover of Time magazine in 2018.[6]\nWind was included in Time magazine's 100 Most Influential People of 2018. [7]\n"
    },
    {
        "link": "/wiki/2018_United_States_gun_violence_protests",
        "title": "2018 United States gun violence protests",
        "date": "March 14, 2018 (2018-03-14)",
        "location": "United States",
        "paragraph": "\nIn 2018, protests against gun violence in the United States increased after a series of mass shootings, most notably at the Marjory Stoneman Douglas High School on February 14 that year. An organized protest in the form of a national school walkout occurred on March 14. March for Our Lives was held on March 24. Another major demonstration occurred April 20, 2018.\n"
    },
    {
        "link": "/wiki/Boycott_of_The_Ingraham_Angle",
        "title": "Boycott of The Ingraham Angle",
        "date": "",
        "location": "",
        "paragraph": "The boycott of The Ingraham Angle was a boycott of companies that advertise their products during the controversial Fox News television show The Ingraham Angle. Marjory Stoneman Douglas High School student David Hogg initiated this boycott after the show's host, Laura Ingraham, ridiculed him amidst conspiracy theories related to the shooting at his school in 2018, in which seventeen students died and where Hogg was a witness and survivor.[1] Ingraham's particular criticism of Hogg was that some universities declined to offer him admission after his college application.[1]\nHogg accused Ingraham of cyberbullying and he suggested that his followers tell her show's sponsors to cancel their advertising purchases.[1] In response, several advertisers left the show after which Ingraham apologized.[1][2] Hogg dismissed the apology as insincere, and he and his supporters continued the pressure campaign on her show's advertisers.[3]\n"
    },
    {
        "link": "/wiki/List_of_March_for_Our_Lives_locations",
        "title": "List of March for Our Lives locations",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/March_for_Our_Lives",
        "title": "March for Our Lives",
        "date": "March 24, 2018 (2018-03-24)",
        "location": "Washington, D.C.[1]",
        "paragraph": "\nMarch for Our Lives (MFOL) was a student-led demonstration in support of gun control legislation.[5] It took place in Washington, D.C., on March 24, 2018, with over 880 sibling events throughout the United States and around the world,[6][7][8][9][10] and was planned by Never Again MSD in collaboration with the nonprofit organization Everytown for Gun Safety.[11] The event followed the Marjory Stoneman Douglas High School shooting a month earlier, which was described by several media outlets as a possible tipping point for gun control legislation.[12][13][14]\n"
    },
    {
        "link": "/wiki/March_for_Our_Lives_Portland",
        "title": "March for Our Lives Portland",
        "date": "March 24, 2018 (2018-03-24)",
        "location": "Portland, Oregon, U.S.",
        "paragraph": "\nMarch for Our Lives Portland (officially March for Our Lives Portland, OR)[1] was a protest held in Portland, Oregon, as part of March for Our Lives, a series of rallies and marches in Washington, D.C., and more than 800 cities across the world on March 24, 2018. Students organized the event, which included a march from the North Park Blocks to Pioneer Courthouse Square where a rally featured speakers, a performance by rock band Portugal. The Man, and a surprise appearance by rapper Black Thought of hip-hop band The Roots. The protest was the city's largest since the January 2017 Women's March on Portland; the Portland Police Bureau estimated a crowd size of 12,000.\n"
    },
    {
        "link": "/wiki/2018_NRA_boycott",
        "title": "2018 NRA boycott",
        "date": "",
        "location": "",
        "paragraph": "\nIn February 2018, a boycott emerged against the U.S. gun rights advocacy group National Rifle Association (NRA) and its business affiliates. The boycott and social media activism campaign arose in the aftermath of the Stoneman Douglas High School shooting in Parkland, Florida. The NRA was criticized for its response, including its recommendation for schools to arm teachers and opposition to bans on certain weapons. Calls for companies to sever their ties to the NRA resulted in several companies discontinuing their business relationships with the NRA and cancelling discount programs offered to NRA members. The boycott extended to Canada where Mountain Equipment Co-op and the Running Room cut supplier relationships with Vista Outdoor.[1][2] Public pressure also caused a number of gun retailers to increase the age required to buy firearms and place other restrictions on gun sales.\nAfter the Parkland shooting, there was an unprecedented upsurge of public support for gun control advocacy groups[3] and significant backlash against the NRA for its response to the shooting, having argued that schools required more armed security to protect against the possibility of future attacks, and its continued calls to preserving the right to own semi-automatic firearms, such as those used in the shooting.[4][5]\n"
    },
    {
        "link": "/wiki/Publix_boycott",
        "title": "Publix",
        "date": "",
        "location": "",
        "paragraph": "\nPublix Super Markets, Inc., commonly known as Publix, is an employee-owned American supermarket chain headquartered in Lakeland, Florida.[1] Founded in 1930 by George W. Jenkins, Publix is a private corporation that is wholly owned by present and past employees and members of the Jenkins family.[5] Publix operates throughout the Southeastern United States, with locations in Florida (836), Georgia (197), Alabama (83), South Carolina (66), Tennessee (53), North Carolina (51), and Virginia (19).[1]\n"
    },
    {
        "link": "/wiki/Rally_to_Support_Firearm_Safety_Legislation",
        "title": "2018 United States gun violence protests",
        "date": "March 14, 2018 (2018-03-14)",
        "location": "United States",
        "paragraph": "\nIn 2018, protests against gun violence in the United States increased after a series of mass shootings, most notably at the Marjory Stoneman Douglas High School on February 14 that year. An organized protest in the form of a national school walkout occurred on March 14. March for Our Lives was held on March 24. Another major demonstration occurred April 20, 2018.\n"
    },
    {
        "link": "/wiki/The_National_School_Walkout",
        "title": "The National School Walkout",
        "date": "",
        "location": "",
        "paragraph": "The National School Walkout was a national student-led protest on April 20, 2018, the 19th anniversary of the Columbine High School massacre.[1] The walkout was one of many protests against gun violence in the United States that erupted in response to the Marjory Stoneman Douglas mass shooting on February 14, 2018.\nAfter the shooting in Parkland, Ridgefield High School student Lane Murdock uploaded a petition to change.org, asking people to protest the lack of responses that follow school shootings in America by participating in a walkout. The petition accumulated over 270,000 signatures.[2][3][4] Murdock and fellow Ridgefield students Paul Kim, Max Cumming, and Grant Yaun partnered with Indivisible to successfully rollout the effort.[5][1]\n"
    },
    {
        "link": "/wiki/Sydney_Aiello",
        "title": "Stoneman Douglas High School shooting",
        "date": "February 14 2018; 4 years ago (February 14 2018) 2:21 – 2:27 p.m. (EST)",
        "location": "Parkland, Florida, U.S.",
        "paragraph": "\nOn February 14, 2018, 19-year-old Nikolas Cruz opened fire on students and staff at Marjory Stoneman Douglas High School in the Miami suburban town of Parkland, Florida, murdering 17 people[note 2] and injuring 17 others.[2][3][4] Cruz, a former student at the school, fled the scene on foot by blending in with other students, and was arrested without incident approximately one hour later in nearby Coral Springs.[5] Police and prosecutors investigated \"a pattern of disciplinary issues and unnerving behavior\".[6]\n"
    },
    {
        "link": "/wiki/Lori_Alhadeff",
        "title": "Lori Alhadeff",
        "date": "",
        "location": "",
        "paragraph": "Lori Alhadeff (née Robinovitz; born February 11, 1975) is an American activist, member of the Broward County School Board, and founder of school-safety organization Make Our Schools Safe. Her 14-year-old daughter, Alyssa Alhadeff, was murdered in the Stoneman Douglas High School shooting on February 14, 2018.[1] Alhadeff gained national attention after making an appearance the day after the shooting on CNN, pleading President Trump to increase school security and calls for gun control.\nLori Robinovitz grew up in Hillsborough Township, New Jersey,[2] where she attended Hillsborough High School and played on the school's soccer team.[3] She earned a Bachelor of Science in health and physical education from The College of New Jersey. She completed a Master of Arts in education at Gratz College. She is certified in the states of New Jersey and New York in health and physical education.[4]\n"
    },
    {
        "link": "/wiki/Alfonso_Calderon_(activist)",
        "title": "Alfonso Calderon (activist)",
        "date": "",
        "location": "",
        "paragraph": "Alfonso Calderón Atienzar[a] (born October 10, 2001)[2][3] is a Spanish-American student activist against gun violence.[6][7] He is a survivor of the Stoneman Douglas High School shooting and a founding member of the Never Again MSD movement.[6][8][7]\nCalderon was born in a Spanish town outside Madrid called Alcobendas, and he has been living in the United States since 2008.[9][4]\n"
    },
    {
        "link": "/wiki/Sarah_Chadwick_(activist)",
        "title": "Sarah Chadwick (activist)",
        "date": "",
        "location": "",
        "paragraph": "\nSarah Chadwick (born August 1, 2001) is an American activist against gun violence and one of the leaders of the Never Again MSD activist movement.[3]\n"
    },
    {
        "link": "/wiki/Jaclyn_Corin",
        "title": "Jaclyn Corin",
        "date": "",
        "location": "",
        "paragraph": "Jaclyn Corin (born October 27, 2000)[1] is an American activist against gun violence. \nShe survived the Stoneman Douglas High School shooting in 2018.[3][4][5] She is one of the co-founders of March for Our Lives and the organizer of a student protest to Tallahassee, Florida.[3][4] She has also been a vocal critic of politicians funded by the National Rifle Association.[3][4]\nCorin was included in Time magazine's 100 Most Influential People of 2018.[6]\n"
    },
    {
        "link": "/wiki/Matt_Deitsch",
        "title": "Matt Deitsch",
        "date": "",
        "location": "",
        "paragraph": "Matthew Bryan Deitsch (born October 4, 1997) is an American writer, gun violence prevention advocate and political advisor. Before entering politics, he worked in broadcast media and was a freelance photographer, film director and music producer. After the 2018 Stoneman Douglas High School shooting in which his siblings witnessed, Deitsch became chief strategist for the March For Our Lives protests and began advocating for gun violence prevention. He is the older brother of activist Ryan Deitsch.\nMatthew Bryan Deitsch[1] was born on October 4, 1997,[2][3] and grew up in Parkland, Florida. He is the older brother of activists Sam and Ryan Deitsch[4] and is a practicing Jew.[5] He attended Marjory Stoneman Douglas High School from 2012 until he graduated in 2016.[6] During his high school career, Deitsch was into television production and filmmaking.[7] After graduating from high school, he moved to the Los Angeles metropolitan area and attended Santa Monica College,[8][9] graduating with honors in 2017 with an associate of arts degree.[1] During his career at Santa Monica College, Deitsch entered his early political career and organized for environmental causes, including beach cleanup, with his biology class.[7] In a podcast interview hosted by CommonAlly, Deitsch credited taking a black feminism class with helping him become more educated about current affairs and politics in turn helping him participate in community organizing.[7] After attending community college, he transferred to California State University, Northridge.[10] Deitsch dropped out of Cal State Northridge after the Stoneman Douglas High School shooting.[11] He graduated from The New School in 2020 with a bachelor's degree.[12]\n"
    },
    {
        "link": "/wiki/Ryan_Deitsch",
        "title": "Ryan Deitsch",
        "date": "",
        "location": "",
        "paragraph": "\nRyan Deitsch (born November 30, 1999) is an American student activist against gun violence, and a survivor of the Parkland massacre. He is a founding member of the Never Again MSD movement.\n"
    },
    {
        "link": "/wiki/Sam_Deitsch",
        "title": "Sam Deitsch",
        "date": "",
        "location": "",
        "paragraph": "Samantha Deitsch (born February 14, 2003) is an American author and gun control activist who survived the Stoneman Douglas High School shooting in 2018.\nSamantha Deitsch was born on February 14, 2003.[1][2] She started attending Marjory Stoneman Douglas High School in 2017. Deitsch was a freshman at Marjorie Stoneman Douglas High School when the mass shooting occurred in 2018.[3] She was friends with one of the victims, Jaime Guttenberg.[4] She is the younger sister of film director Matt Deitsch and activist Ryan Deitsch.[5]\n"
    },
    {
        "link": "/wiki/Aalayah_Eastmond",
        "title": "Aalayah Eastmond",
        "date": "",
        "location": "",
        "paragraph": "\nAalayah Eastmond (born March 22, 2001) is an American activist and advocate for gun violence prevention, social justice, and racial equality. After surviving the Stoneman Douglas High School shooting, Eastmond began her activism during the 2018 United States gun violence protests. She has testified multiple times to the U.S. Congress. Eastmond is an executive council member of Team Enough, a youth-led gun violence prevention organization which is part of the Brady Campaign. Eastmond co-founded Concerned Citizens of DC in the wake of the murder of George Floyd to organize protests supporting social justice issues in Washington, D.C. She supports Black Lives Matter and protests against police brutality.\n"
    },
    {
        "link": "/wiki/X_Gonz%C3%A1lez",
        "title": "X González",
        "date": "",
        "location": "",
        "paragraph": "\nX González (born Emma González; November 11, 1999) is an American activist and advocate for gun control.[3][4][5] In 2018, they survived the Stoneman Douglas High School shooting,[6] the deadliest high school shooting in U.S. history, and in response co-founded the gun-control advocacy group Never Again MSD.[7]\n"
    },
    {
        "link": "/wiki/Fred_Guttenberg",
        "title": "Fred Guttenberg",
        "date": "",
        "location": "",
        "paragraph": "\nFred Guttenberg (born December 24, 1965) is an American activist against gun violence. His 14-year-old daughter Jaime Guttenberg[1] was murdered in the Stoneman Douglas High School shooting on February 14, 2018. His son, Jesse, also a student at the school, ran from the shooting to meet him at a nearby store.[2] He learned about his daughter's death from a friend who is a Coral Springs SWAT officer.[3] Jessica McBride, for the website Heavy, described him as \"one of the strongest voices for changes to gun laws in the wake of the mass shooting\".[4]\n"
    },
    {
        "link": "/wiki/David_Hogg",
        "title": "David Hogg",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Lauren_Hogg",
        "title": "Lauren Hogg",
        "date": "",
        "location": "",
        "paragraph": "Lauren Hogg (born June 10, 2003) is an American author and activist against gun violence. She survived the Stoneman Douglas High School shooting in 2018 and after became a co-founder of March for Our Lives and advocates against gun violence. She is the younger sister of former Marjory Stoneman Douglas student David Hogg.\nHogg was born on June 10, 2003,[1] and is the daughter of Kevin Hogg, a former agent of the Federal Bureau of Investigation,[2] and Rebecca Boldrick, born in San Diego County, California[3] and a teacher for Broward County Public Schools in Broward County, Florida.[4] She is also the younger sister of David Hogg, both graduating from Marjory Stoneman Douglas High School in 2018 and 2021, respectively.[5] Hogg and her family moved to Washington, D.C. after her graduation in 2021.[6]\n"
    },
    {
        "link": "/wiki/Kyle_Kashuv",
        "title": "Kyle Kashuv",
        "date": "",
        "location": "",
        "paragraph": "\nKyle Kashuv (born May 20, 2001) is an American conservative activist.[3] He survived the 2018 Stoneman Douglas High School shooting and subsequently advocated for gun rights, notably in opposition to his fellow survivors' March for Our Lives movement.[4][5]\n"
    },
    {
        "link": "/wiki/Cameron_Kasky",
        "title": "Cameron Kasky",
        "date": "",
        "location": "",
        "paragraph": "\nCameron Marley Kasky[1] (born November 11, 2000) is an American activist and advocate against gun violence who co-founded the student-led gun violence prevention advocacy group Never Again MSD. He is notable for helping to organize the March for Our Lives nationwide student protest in March 2018. Kasky is a survivor of the February 2018 mass shooting at Marjory Stoneman Douglas High School.[4] Kasky was included in Time magazine's \"100 Most Influential People of 2018\".[5]\n"
    },
    {
        "link": "/wiki/Ryan_Petty",
        "title": "Ryan Petty",
        "date": "",
        "location": "",
        "paragraph": "Ryan Blaine Petty (born January 15, 1970) is an American school safety activist. His 14-year-old daughter Alaina Petty was murdered in the Stoneman Douglas High School shooting on February 14, 2018.[1] Petty is credited with helping to pass the \"Marjory Stoneman Douglas High School Public Safety Act\" Florida Senate Bill 7026 just three weeks after his daughter Alaina was murdered.[2][3] At the federal level, Petty worked with Senators Orrin Hatch, Marco Rubio and Bill Nelson to pass the STOP School Violence Act and the Fix NICS Act of 2017.[4] He has met frequently with Florida governor Rick Scott, and many federal lawmakers.\nRyan Petty ran for Broward County School Board in 2018, narrowly losing in the primary to incumbent Donna Korn. In an unusual turn of events, Petty was endorsed by two sitting U.S. Senators Orrin Hatch and Marco Rubio, unusual for a local school board race.[5]  Senator Rubio credited Petty for his work to improve school safety and his help in passing the STOP School Violence Act.[6]\n"
    },
    {
        "link": "/wiki/Andrew_Pollack",
        "title": "Andrew Pollack",
        "date": "",
        "location": "",
        "paragraph": "Andrew Scott Pollack (born February 18, 1966) is an American author, school safety activist, and entrepreneur whose daughter Meadow was one of the 17 deceased victims in the Stoneman Douglas High School shooting in 2018.[1]\nPollack is among the Stoneman Douglas High School parents who lobbied for passage of the \"Marjory Stoneman Douglas High School Public Safety Act\" (Florida Senate Bill: 7026).[2][dubious  – discuss] Unlike many other Stoneman Douglas survivors and victims' parents,[3] Pollack has endorsed politicians who oppose gun-control measures, and he advocates programs that would arm teachers.[4] He argues that bulletproof glass, metal detectors, enhanced door lock systems, ID checkpoints, and \"school marshals\" can help prevent school shootings.[5]\n"
    },
    {
        "link": "/wiki/Hunter_Pollack",
        "title": "Hunter Pollack",
        "date": "",
        "location": "",
        "paragraph": "\nHunter Pollack (born August 6, 1997) is an American school safety activist and political advisor whose younger sister, Meadow, was murdered in the Stoneman Douglas High School shooting in 2018.[1] He is the son of Shara Kaplan and Andrew Pollack, and is a part of the nonprofit organization Americans for Children's Lives and School Safety.[2] Hunter is Jewish.[3]\n"
    },
    {
        "link": "/wiki/Alex_Wind",
        "title": "Alex Wind",
        "date": "",
        "location": "",
        "paragraph": "Alexander Blake Wind (born January 30, 2001)[2][3] is an American student activist against gun violence. A survivor of the Stoneman Douglas High School shooting and a founding member of the Never Again MSD movement,[4] he is a critic of politicians who are supported by the National Rifle Association.[5] Wind was one of five Stoneman Douglas students featured on the cover of Time magazine in 2018.[6]\nWind was included in Time magazine's 100 Most Influential People of 2018. [7]\n"
    },
    {
        "link": "/wiki/2018_United_States_gun_violence_protests",
        "title": "2018 United States gun violence protests",
        "date": "March 14, 2018 (2018-03-14)",
        "location": "United States",
        "paragraph": "\nIn 2018, protests against gun violence in the United States increased after a series of mass shootings, most notably at the Marjory Stoneman Douglas High School on February 14 that year. An organized protest in the form of a national school walkout occurred on March 14. March for Our Lives was held on March 24. Another major demonstration occurred April 20, 2018.\n"
    },
    {
        "link": "/wiki/Boycott_of_The_Ingraham_Angle",
        "title": "Boycott of The Ingraham Angle",
        "date": "",
        "location": "",
        "paragraph": "The boycott of The Ingraham Angle was a boycott of companies that advertise their products during the controversial Fox News television show The Ingraham Angle. Marjory Stoneman Douglas High School student David Hogg initiated this boycott after the show's host, Laura Ingraham, ridiculed him amidst conspiracy theories related to the shooting at his school in 2018, in which seventeen students died and where Hogg was a witness and survivor.[1] Ingraham's particular criticism of Hogg was that some universities declined to offer him admission after his college application.[1]\nHogg accused Ingraham of cyberbullying and he suggested that his followers tell her show's sponsors to cancel their advertising purchases.[1] In response, several advertisers left the show after which Ingraham apologized.[1][2] Hogg dismissed the apology as insincere, and he and his supporters continued the pressure campaign on her show's advertisers.[3]\n"
    },
    {
        "link": "/wiki/List_of_March_for_Our_Lives_locations",
        "title": "List of March for Our Lives locations",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/March_for_Our_Lives",
        "title": "March for Our Lives",
        "date": "March 24, 2018 (2018-03-24)",
        "location": "Washington, D.C.[1]",
        "paragraph": "\nMarch for Our Lives (MFOL) was a student-led demonstration in support of gun control legislation.[5] It took place in Washington, D.C., on March 24, 2018, with over 880 sibling events throughout the United States and around the world,[6][7][8][9][10] and was planned by Never Again MSD in collaboration with the nonprofit organization Everytown for Gun Safety.[11] The event followed the Marjory Stoneman Douglas High School shooting a month earlier, which was described by several media outlets as a possible tipping point for gun control legislation.[12][13][14]\n"
    },
    {
        "link": "/wiki/March_for_Our_Lives_Portland",
        "title": "March for Our Lives Portland",
        "date": "March 24, 2018 (2018-03-24)",
        "location": "Portland, Oregon, U.S.",
        "paragraph": "\nMarch for Our Lives Portland (officially March for Our Lives Portland, OR)[1] was a protest held in Portland, Oregon, as part of March for Our Lives, a series of rallies and marches in Washington, D.C., and more than 800 cities across the world on March 24, 2018. Students organized the event, which included a march from the North Park Blocks to Pioneer Courthouse Square where a rally featured speakers, a performance by rock band Portugal. The Man, and a surprise appearance by rapper Black Thought of hip-hop band The Roots. The protest was the city's largest since the January 2017 Women's March on Portland; the Portland Police Bureau estimated a crowd size of 12,000.\n"
    },
    {
        "link": "/wiki/2018_NRA_boycott",
        "title": "2018 NRA boycott",
        "date": "",
        "location": "",
        "paragraph": "\nIn February 2018, a boycott emerged against the U.S. gun rights advocacy group National Rifle Association (NRA) and its business affiliates. The boycott and social media activism campaign arose in the aftermath of the Stoneman Douglas High School shooting in Parkland, Florida. The NRA was criticized for its response, including its recommendation for schools to arm teachers and opposition to bans on certain weapons. Calls for companies to sever their ties to the NRA resulted in several companies discontinuing their business relationships with the NRA and cancelling discount programs offered to NRA members. The boycott extended to Canada where Mountain Equipment Co-op and the Running Room cut supplier relationships with Vista Outdoor.[1][2] Public pressure also caused a number of gun retailers to increase the age required to buy firearms and place other restrictions on gun sales.\nAfter the Parkland shooting, there was an unprecedented upsurge of public support for gun control advocacy groups[3] and significant backlash against the NRA for its response to the shooting, having argued that schools required more armed security to protect against the possibility of future attacks, and its continued calls to preserving the right to own semi-automatic firearms, such as those used in the shooting.[4][5]\n"
    },
    {
        "link": "/wiki/Publix_boycott",
        "title": "Publix",
        "date": "",
        "location": "",
        "paragraph": "\nPublix Super Markets, Inc., commonly known as Publix, is an employee-owned American supermarket chain headquartered in Lakeland, Florida.[1] Founded in 1930 by George W. Jenkins, Publix is a private corporation that is wholly owned by present and past employees and members of the Jenkins family.[5] Publix operates throughout the Southeastern United States, with locations in Florida (836), Georgia (197), Alabama (83), South Carolina (66), Tennessee (53), North Carolina (51), and Virginia (19).[1]\n"
    },
    {
        "link": "/wiki/Rally_to_Support_Firearm_Safety_Legislation",
        "title": "2018 United States gun violence protests",
        "date": "March 14, 2018 (2018-03-14)",
        "location": "United States",
        "paragraph": "\nIn 2018, protests against gun violence in the United States increased after a series of mass shootings, most notably at the Marjory Stoneman Douglas High School on February 14 that year. An organized protest in the form of a national school walkout occurred on March 14. March for Our Lives was held on March 24. Another major demonstration occurred April 20, 2018.\n"
    },
    {
        "link": "/wiki/The_National_School_Walkout",
        "title": "The National School Walkout",
        "date": "",
        "location": "",
        "paragraph": "The National School Walkout was a national student-led protest on April 20, 2018, the 19th anniversary of the Columbine High School massacre.[1] The walkout was one of many protests against gun violence in the United States that erupted in response to the Marjory Stoneman Douglas mass shooting on February 14, 2018.\nAfter the shooting in Parkland, Ridgefield High School student Lane Murdock uploaded a petition to change.org, asking people to protest the lack of responses that follow school shootings in America by participating in a walkout. The petition accumulated over 270,000 signatures.[2][3][4] Murdock and fellow Ridgefield students Paul Kim, Max Cumming, and Grant Yaun partnered with Indivisible to successfully rollout the effort.[5][1]\n"
    }
]