[
    {
        "link": "/wiki/Atlanta_prison_riots",
        "title": "Atlanta prison riots",
        "date": "November 13–23, 1987",
        "location": "United States Penitentiary, Atlanta, Georgia",
        "paragraph": "\nThe Atlanta prison riots were a series of prison riots that occurred at the U.S. Penitentiary in Atlanta, Georgia, United States in November 1987.  The riot coincided with a similar riot at the Federal Detention Center in Oakdale, Louisiana. \n"
    },
    {
        "link": "/wiki/Carswell_Grove_Baptist_Church_and_Cemetery",
        "title": "Carswell Grove Baptist Church and Cemetery",
        "date": "",
        "location": "Big Buckhead Rd. off US 25/GA 21, near Perkins, Georgia",
        "paragraph": "Carswell Grove Baptist Church and Cemetery, 1842–1846 Big Buckhead Church Road, near the hamlet of Perkins, Millen, Georgia (Jenkins County, Georgia) is a historic Black church and cemetery which are listed on the National Register of Historic Places in 1996. The church, a replacement for an earlier church burned in 1919, was destroyed by arson in 2014.[2]\nA different historic church, the Big Buckhead Baptist Church, is located a few hundred yards southwest. Prior to the Civil War blacks had worshipped there in segregated pews; after the war whites kicked out the blacks. White judge Porter W. Carswell gave blacks 2 acres (0.81 ha) nearby to build their own church; they named it in his honor.[3]: 4 \n"
    },
    {
        "link": "/wiki/Interstate_85_bridge_collapse",
        "title": "Interstate 85 bridge collapse",
        "date": "March 30, 2017 (2017-03-30)",
        "location": " I-85 in Atlanta, Georgia, United States",
        "paragraph": "\nA massive fire collapsed an Interstate 85 (I-85) bridge in Atlanta, Georgia, United States, on the evening of Thursday, March 30, 2017. After the 92-foot-long (28 m) section collapsed, I-85 was closed to traffic for 43 days between its split with I-75 and the interchange with State Route 400 (SR 400)---approximately two miles (3 km). Three sections of northbound I-85 and three sections of southbound I-85 were replaced at a cost of $15 million; re-opening of the interstate was on May 12.[1]\n"
    },
    {
        "link": "/wiki/Jenkins_County,_Georgia,_riot_of_1919",
        "title": "Jenkins County, Georgia, riot of 1919",
        "date": "April 13, 1919",
        "location": "Carswell Grove Baptist Church and Cemetery, Jenkins County, Georgia",
        "paragraph": "The Jenkins County riot of 1919 took place on Sunday, April 13, 1919, when a series of misunderstandings and out-of-control events spiralled into two white police officers being killed. In retaliation the local white community formed mobs and ravaged the black community, burning black community buildings and killing at least four people.\nThe event began at Carswell Grove Baptist Church, a black church, which was celebrating its anniversary. Preachers from several counties were coming, the Knights of Pythias were present in uniform,[2] the choir was giving a special performance, and a cookout would follow.[3]: 1  More than 3,000 were expected; it was one of the largest gatherings in east Georgia.[3]: 1–2 \n"
    },
    {
        "link": "/wiki/Lynching_of_Paul_Jones",
        "title": "Lynching of Paul Jones",
        "date": "November 2, 1919",
        "location": "Macon, Georgia",
        "paragraph": "Paul Jones[a] was lynched on November 2, 1919, after being accused of attacking a fifty-year-old white woman in Macon, Georgia.\nOn Sunday, November 2, 1919, Paul Jones allegedly attacked a white woman about 2 miles (3.2 km) outside of Macon.[2] Paul Jones was chased through town until he was cornered in a rail boxcar, there the woman positively identified him.[3] A white mob of 400 people quickly assembled and over the protests of Sheriff James R. Hicks they seized Jones. His body was riddled with bullets after being lynched,[4] \"saturated with coal oil\" and lit on fire.[5] He was still alive as the flames consumed his body and the mob watched as he writhed in pain.[1]  There were no arrests.\n"
    },
    {
        "link": "/wiki/Berry_Washington",
        "title": "Berry Washington",
        "date": "",
        "location": "",
        "paragraph": "Berry Washington (c. 1847-May 26, 1919) was a 72 year old black man who was lynched in Milan, Georgia, in 1919. He was in jail after killing a white man who was attacking two young girls. He was taken from jail and lynched by a mob.\nAt 1:00 AM on the morning of May 24, 1919, two white men, John Dandy and Levi Evans, went into the black section of Milan. They first tried to get into the home of Emma McCollers who had two young daughters.[1] When the family refused to open the door Dandy fired his gun. This caused the girls to flee to another house, the home of widow Emma Tisber. The two men followed and invaded the Tisber home and attempted to assault two young black girls.[1] When the two girls attempted to hide under the porch, Dandy and Evans began ripping up the floor to get to them.[2] Washington, a black man, attempted to defend the girls and get the men to leave. Dandy fired at Washington and after a struggle, Washington, who was 72 years old, shot and killed Dandy, \"He fell with his\npistol in his right hand and a cigarette in the other, and a flask of liquor fell out of his pocket.\"[1]\n"
    },
    {
        "link": "/wiki/1912_racial_conflict_in_Forsyth_County,_Georgia",
        "title": "1912 racial conflict in Forsyth County, Georgia",
        "date": "",
        "location": "",
        "paragraph": "\nIn Forsyth County, Georgia, in September 1912 two separate alleged attacks on white women resulted in black men being accused as suspects. One white woman accused two black men of breaking into her home in Big Creek Community and one of raping her. Another teenage  woman was fatally beaten and raped in the Oscarville Community. Earnest Knox was linked to the Oscarville murder along with his half brother by a hair comb sold to him at the Oscarville store. When confronted, he confessed to the Sheriff and implicated his half brother and mother’s live-in boyfriend. His mother testified against the sons during the jury trial which sentenced both to hanging. 21 days later the sentence was carried out. \nIn the Big Creek assault, a black preacher and his congregation drove to Cumming to demand the release of the men being held for the rape of a young girl from the Big Creek Community. This resulted in a white counter mob showing up in confrontation. Tempers flared and the preacher was harshly beaten for having been heard to suggest that the first woman may have had a consensual relationship with a black man. The Forsyth County Sheriff locked the preacher inside the court house over night to protect him from the mob waiting outside. \n"
    },
    {
        "link": "/wiki/Murder_of_Ahmaud_Arbery",
        "title": "Murder of Ahmaud Arbery",
        "date": "February 23, 2020 (2020-02-23) c. 1:15 p.m.",
        "location": "Satilla Shoresunincorporated Glynn County, Georgia, U.S.",
        "paragraph": "\nOn February 23, 2020, Ahmaud Arbery, a 25-year-old black man, was murdered during a racially motivated hate crime[b] while jogging in Satilla Shores, a neighborhood near Brunswick in Glynn County, Georgia.[1][2][3][4][5][9] Erroneously assuming he was a burglar,[10][2][1][11] three white men pursued Arbery in their trucks for several minutes, using the vehicles to block his path as he tried to run away.[12] Two of the men, Travis McMichael and his father, Gregory McMichael, were armed in one vehicle. Their neighbor, William \"Roddie\" Bryan, was in another vehicle. After overtaking Arbery, Travis McMichael exited his truck and assaulted Arbery with a shotgun.[11] As Arbery attempted to defend himself, Travis McMichael fatally shot him.[3][4] Bryan recorded this confrontation and Arbery's murder on his cell phone.\n"
    },
    {
        "link": "/wiki/Lynching_of_Charles_Atkins",
        "title": "Lynching of Charles Atkins",
        "date": "May 18, 1922",
        "location": "Davisboro, Washington County, Georgia",
        "paragraph": "Charles Atkins was a 15-year-old African-American boy who was lynched in Davisboro, Washington County, Georgia by a mob on May 18, 1922. According to the United States Senate Committee on the Judiciary it was the 25th of 61 lynchings during 1922 in the United States. [1]\nMrs. Elizabeth \"Billy\" Kitchens, 20, served as a rural mail carrier.[2] While driving her car, 4 miles (6.4 km) from Davisboro, someone pushed their way into her vehicle, placed a shotgun against her head and fired, killing her instantly. [3] Her body was then dragged 50 yards (46 m) away.[4] A local farmer, Sid Lewis, found the body 30 minutes after the shooting and informed Sheriff English at Sandersville, Georgia.\n"
    },
    {
        "link": "/wiki/Hanging_of_Charles_Blackman",
        "title": "Hanging of Charles Blackman",
        "date": "",
        "location": "",
        "paragraph": "The hanging of Charles Blackman occurred in Ellaville, Georgia, on January 25, 1889. Stonewall Tondee, a white man, had been murdered on September 5, 1885. Charles Blackman, an African-American man, was tried and convicted for the murder in three trials by all-white, \"gentleman\" juries. The Georgia Supreme Court twice granted Blackman a new trial, but he was convicted and sentenced to hang a third time in September 1888. Blackman was twice granted respite by Georgia Governor John Brown Gordon after the third trial, which delayed Blackman’s execution by three months. Blackman maintained his innocence until his public execution and insisted that he was never given an impartial trial. 5,000 people from across South Georgia travelled to Ellaville, a town of a few hundreds, to witness the hanging. Telegraph wires were cut to ensure that messages from Governor Gordon and other state officials would not be transmitted and interfere with the hanging.\nStonewall Tondee was the 22-year-old son of the Treasurer of Schley County, Georgia, and worked as a store clerk in Ellaville. Late in the evening on Saturday September 5, 1885, Tondee was waiting on customers in the store when someone outside in a cotton patch shot him through the window with a shotgun.[1] Patrons in the store called out for help, and a doctor reached him five minutes after the shooting. Tondee died three minutes after the doctor arrived. A crowd soon assembled to consider who killed Tondee, a “universal favorite” of the town. Suspicion fell on Charles Blackman, who supposedly was “jealous of Mr. Tondee about a negro woman” and “had made threats against him.” Witnesses reported to have seen Blackman in Ellaville on Saturday night and travelling to Americus Sunday morning, but Blackman’s brother claimed Blackman spent Saturday night in his home near Americus. Though residents of Ellaville discussed letting “Judge Lynch” decide Blackman’s fate, prominent figures in the town advocated letting the law take its course.[2]\n"
    },
    {
        "link": "/wiki/Brooks_County_race_war",
        "title": "Brooks County race war",
        "date": "",
        "location": "",
        "paragraph": "The Brooks County \"race war\" was a series of lynchings of African-Americans committed in Brooks County, Georgia in the United States in December 1894.  It was called a \"race war\" at the time.\nAround Christmas 1894, a group of whites attacked and killed five blacks (some reports at the time said seven) while claiming to be searching for black murderers.  Blacks in the county seat Quitman pled for aid from the Governor, while others went into hiding.  No significant action was taken to stop the killing until the mob reached the plantation of Mitchell Brice.  One of the richest planters in the area, Brice threatened to react harshly to any further violence and perhaps press formal legal charges.   His main problem was with the mistreatment of his plantation workers. [1][2][3][4][5][6][7][8][9]\n"
    },
    {
        "link": "/wiki/Lynching_of_William_Byrd",
        "title": "Lynching of William Byrd",
        "date": "May 28, 1922",
        "location": "Brentwood, Wayne County, Georgia",
        "paragraph": "William Byrd was an African-American man who was lynched in Brentwood, Wayne County, Georgia by a mob on May 28, 1922. According to the United States Senate Committee on the Judiciary it was the 31st of 61 lynchings during 1922 in the United States. [1]\nA number of workers were employed to work on the farm of B.W. Moody, a well-off farmer who lived near Byrd. One of those who agreed to work at Moody's farm was Byrd's wife. She wanted to ride in the front of the truck to get to Moody's farm but Moody wouldn't let her. She complained of the slight to her husband, William Byrd.[2]  He went to confront Moody and the argument got out of control with Byrd allegedly shooting and killing Moody and seriously wounded Browning Weaver and Carlos Moody in the arm.[3] [4]\n"
    },
    {
        "link": "/wiki/Lynching_of_Austin_Callaway",
        "title": "Lynching of Austin Callaway",
        "date": "",
        "location": "",
        "paragraph": "Austin Callaway, also known as Austin Brown (d. 9 September 1940), was a young African-American man who was taken from jail by a group of six white men and lynched on September 8, 1940, in LaGrange, Georgia. The day before, Callaway had been arrested as a suspect in an assault of a white woman. The gang carried out extrajudicial punishment and prevented the youth from ever receiving a trial.[1] They shot him numerous times, fatally wounding him and leaving him for dead. Found by a motorist, Callaway was taken to a hospital, where he died of his wounds.\nA white woman in LaGrange, Georgia, the county seat of Troup County, complained to local police that she had been assaulted by a young black man. Austin Callaway was arrested as a suspect. Sources disagree as to his age, reporting him as age 16,[2] 18,[3] or 24.[4]\n"
    },
    {
        "link": "/wiki/Camilla_massacre",
        "title": "Camilla massacre",
        "date": "September 19, 1868",
        "location": "Camilla, Georgia",
        "paragraph": "The Camilla massacre took place in Camilla, Georgia, on Saturday, September 19, 1868. African Americans had been given the right to vote in Georgia's 1868 state constitution, which had passed in April, and in the months that followed, whites across the state used violence to combat their newfound political strength, often through the newly founded Ku Klux Klan. Georgia agents of the Freedmen’s Bureau recorded 336 cases of murder or assault with intent to kill against freedmen from January 1 through November 15.[1]\nThe massacre followed the expulsion of the Original 33 black members of the Georgia General Assembly earlier that month. Among those expelled was southwest Georgia representative Philip Joiner. On September 19, Joiner led a twenty-five-mile march of several hundred blacks (freedmen), as well as a few whites, from Albany, Georgia, to Camilla, the Mitchell County seat, to attend a Republican political rally on the courthouse square.[2] Estimates of the number of participants range from 150[3] to 300.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_Jake_Davis",
        "title": "Lynching of Jake Davis",
        "date": "July 14, 1922",
        "location": "Miller County, Georgia",
        "paragraph": "Jake \"Shake\" Davis was a 62-year-old African-American man who was lynched in Miller County, Georgia by a white mob on July 14, 1922. According to the United States Senate Committee on the Judiciary it was the 38th of 61 lynchings during 1922 in the United States. [1]\nMiscegenation is the interbreeding of people who are considered to be members of different races and was heavily frowned upon in the American south. The historical taboo surrounding white–black relationships among American whites can be seen as a historical consequence of the oppression and racial segregation of African Americans.[2][3] In many U.S. states, interracial marriage was already illegal when the term miscegenation was coined in 1863. Before that, it was called \"amalgamation\". \n"
    },
    {
        "link": "/wiki/Felix_Hall",
        "title": "Felix Hall",
        "date": "",
        "location": "",
        "paragraph": "Felix Hall was a man from Alabama who, at age 19, was lynched, probably by fellow soldiers in Fort Benning, Georgia.[1] A black man from Alabama, he had volunteered to join an African-American unit being trained in Fort Benning. He was last seen alive on February 12, 1941, in one of the fort's white neighborhoods. His body was found six weeks later, on March 28, hanging by a noose tied to a tree in a ravine near the Chattahoochee River.[2]\nThe killers were never found, and evidence suggests that no serious efforts were made at the time by the Army or the FBI to discover the cause of Hall's death.[2] Investigators first called the death a suicide, despite Hall's hands being tied, and later called it a sex crime.[1]\n"
    },
    {
        "link": "/wiki/Leo_Frank",
        "title": "Leo Frank",
        "date": "",
        "location": "",
        "paragraph": "\nLeo Max Frank (April 17, 1884 – August 17, 1915) was an American factory superintendent who was convicted in 1913 of the murder of a 13-year-old employee, Mary Phagan, in Atlanta, Georgia. His trial, conviction, and appeals attracted national attention. His lynching two years later, in response to the commutation of his death sentence, became the focus of social, regional, political, and racial concerns, particularly regarding antisemitism. Today, the consensus of researchers is that Frank was wrongly convicted and Jim Conley was likely the actual murderer.\n"
    },
    {
        "link": "/wiki/Lynching_of_Phillip_Gathers",
        "title": "Lynching of Phillip Gathers",
        "date": "",
        "location": "",
        "paragraph": "Philip Gathers was lynched on June 21, 1920, in Effingham County, Georgia. He was alleged to have raped and murdered a 17-year old white girl named Anza Jaudon.[1] After a week-long search, he was captured by law enforcement and given up to members of the search party. He was then shot, burned, and hanged by a mob of thousands. No one was ever convicted for the lynching.[2][3]\nOn Friday, June 11, 1920, Anza Jaudon traveled for the weekend from Savannah, Georgia to visit her family in Effingham County. While walking from the train station, Jaudon was raped and murdered approximately 500 yards from her family's home. The following Monday, Jaudon's father telephoned her to find out why she had not arrived and realized she was missing. They began a search and found her body near the road.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Glover",
        "title": "Lynching of John Glover",
        "date": "August 2, 1922",
        "location": "Holton in Bibb County, Georgia",
        "paragraph": "John \"Cockey\" Glover[1] was a 35-year-old African-American man who was lynched in Holton in Bibb County, Georgia by a mob of 300 white men on August 2, 1922. According to the United States Senate Committee on the Judiciary it was the 43rd of 61 lynchings during 1922 in the United States. [2]\nIn 1922 three men named John Glover died or were killed. On February 17, 1922, a worker of the Shelton turpentine still which used the Peonage debt system to keep their workers, John Glover was killed after committing \"one of the first mass school shootings\".[3] Five months later John Glover, a white Confederate veteran who was one of the wealthiest citizens in Rome, Georgia died of natural causes. Finally, in August 1922 John \"Cockey\" Glover was lynched by a mob after allegedly taking part in the shooting of \"particularly brutal White sheriff’s deputy\" Walter C. Byrd.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_James_and_Alonzo_Green",
        "title": "Lynching of James and Alonzo Green",
        "date": "July 4, 1914",
        "location": "Jones County, Georgia",
        "paragraph": "Father and son Alonzo and James D. Green were innocent African-Americans lynched near Round Oak and Wayside, Jones County, Georgia in retaliation for the murder of popular white farmer Silas Hardin Turner on July 4, 1915. A third man, William Bostick was also lynched on this day.[1] None of those killed received a trial.\nAlonzo Green worked as an axeman in a local sawmill. He had married Cora in 1902 and had two children James D. (b. abt 1901) and Annie M. (b. abt 1903). White farmer Silas Hardin Turner was a prominent planter in Jones County, Georgia and the son of John D. Turner (1851-1930) and Mattie Hardin (1865-1946).\n"
    },
    {
        "link": "/wiki/Lynching_of_James_Harvey_and_Joe_Jordan",
        "title": "Lynching of James Harvey and Joe Jordan",
        "date": "July 1, 1922,",
        "location": "Liberty County, Georgia",
        "paragraph": "\nJames Harvey and Joe Jordan were two African-American men who were lynched on July 1, 1922, in Liberty County, Georgia, United States. They were seized by a mob of about 50 people and hanged while being transported by police from Wayne County to a jail in Savannah. Investigations by the NAACP showed that the police involved were complicit in their abduction by the mob. Twenty-two men were later indicted for the lynching, with four convicted.\n"
    },
    {
        "link": "/wiki/Lynching_of_Sam_Hose",
        "title": "Lynching of Sam Hose",
        "date": "April 23, 1899 2:30 PM (EST)",
        "location": "Newnan, Coweta County, Georgia, U.S.",
        "paragraph": "\nSam Hose (born Samuel Thomas Wilkes; c. 1875 – April 23, 1899) was an African American man who was tortured and murdered by a white lynch mob in Coweta County, Georgia, after being falsely accused of rape by the mob.\n"
    },
    {
        "link": "/wiki/Isaiah_Nixon",
        "title": "Isaiah Nixon",
        "date": "",
        "location": "",
        "paragraph": "\nIsaiah Nixon (died September 8, 1948) was an African American soldier who was shot and killed in retaliation for voting in the 1948 Georgia Democratic primary.\n"
    },
    {
        "link": "/wiki/Jenkins_County,_Georgia,_riot_of_1919",
        "title": "Jenkins County, Georgia, riot of 1919",
        "date": "April 13, 1919",
        "location": "Carswell Grove Baptist Church and Cemetery, Jenkins County, Georgia",
        "paragraph": "The Jenkins County riot of 1919 took place on Sunday, April 13, 1919, when a series of misunderstandings and out-of-control events spiralled into two white police officers being killed. In retaliation the local white community formed mobs and ravaged the black community, burning black community buildings and killing at least four people.\nThe event began at Carswell Grove Baptist Church, a black church, which was celebrating its anniversary. Preachers from several counties were coming, the Knights of Pythias were present in uniform,[2] the choir was giving a special performance, and a cookout would follow.[3]: 1  More than 3,000 were expected; it was one of the largest gatherings in east Georgia.[3]: 1–2 \n"
    },
    {
        "link": "/wiki/Lynching_of_Paul_Jones",
        "title": "Lynching of Paul Jones",
        "date": "November 2, 1919",
        "location": "Macon, Georgia",
        "paragraph": "Paul Jones[a] was lynched on November 2, 1919, after being accused of attacking a fifty-year-old white woman in Macon, Georgia.\nOn Sunday, November 2, 1919, Paul Jones allegedly attacked a white woman about 2 miles (3.2 km) outside of Macon.[2] Paul Jones was chased through town until he was cornered in a rail boxcar, there the woman positively identified him.[3] A white mob of 400 people quickly assembled and over the protests of Sheriff James R. Hicks they seized Jones. His body was riddled with bullets after being lynched,[4] \"saturated with coal oil\" and lit on fire.[5] He was still alive as the flames consumed his body and the mob watched as he writhed in pain.[1]  There were no arrests.\n"
    },
    {
        "link": "/wiki/Lynching_of_Will_Jones",
        "title": "Lynching of Will Jones",
        "date": "February 13, 1922",
        "location": "Ellaville, Schley County, Georgia",
        "paragraph": "Will Jones was an African-American man who was lynched in Ellaville, Schley County, Georgia by a white mob on February 13, 1922. According to the United States Senate Committee on the Judiciary it was the 13th of 61 lynchings during 1922 in the United States. [1]\n28-year-old Will Jones lived on a farm occupied by the landowner widow Mrs. Dora Fulford, mother-in-law of Bennie DeVane one of the accused and was regarded as an upstanding citizen by the community. News coverage at the time gave no official reason for the lynching but implied it might have been either Jones was going to report on the bootlegging that was going on in the area or that Will Jones came to the defence of 26-year-old African-American man Floyd Flournoy who had insulted Jessie Mae Devane, by asking for a ride in her buggy.[2] [3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Wilbur_Little",
        "title": "Lynching of Wilbur Little",
        "date": "",
        "location": "",
        "paragraph": "\nWilbur Little (also William[1][2] or Wilbert[3] in some sources) was a black American veteran of World War I, lynched in April 1919 in his hometown of Blakely, Georgia, for refusing to remove his military uniform. Servicemen who had been discharged from the army were permitted under War Department regulations to wear their service uniforms for three months after their demobilization date.[4][5] Reportedly, Little was still in uniform beyond that date.[6][7] He was one of many African-American servicemen of the time who were subjected to violence for continuing to wear their uniforms after being discharged from the military.[8]\n"
    },
    {
        "link": "/wiki/Lynching_in_Lee_County,_Georgia",
        "title": "Lee County, Georgia",
        "date": "",
        "location": "",
        "paragraph": "\nLee County is a county located in the U.S. state of Georgia. As of the 2020 census, the population was 33,163.[1] Its county seat is Leesburg.[2]\n"
    },
    {
        "link": "/wiki/Lynchings_in_Harris_County,_Georgia",
        "title": "Harris County, Georgia",
        "date": "",
        "location": "",
        "paragraph": "\nHarris County is a county located in the west-central portion of the U.S. state of Georgia; its western border with the state of Alabama is formed by the Chattahoochee River. As of the 2020 census, the population was 34,668.[1] The county seat is Hamilton.[2] The largest city in the county is Pine Mountain, a resort town that is home to the Franklin D. Roosevelt State Park (the largest state park in Georgia). Harris County was created on December 14, 1827, and named for Charles Harris, a Georgia judge and attorney.[3]\n"
    },
    {
        "link": "/wiki/Lynchings_in_Madison,_Georgia",
        "title": "Madison, Georgia",
        "date": "",
        "location": "",
        "paragraph": "\nMadison is a city in Morgan County, Georgia, United States. It is part of the Atlanta-Athens-Clarke-Sandy Springs Combined Statistical Area. The population was 4,447 at the 2020 census,[3] up from 3,979 in 2010. The city is the county seat of Morgan County and the site of the Morgan County Courthouse.\n"
    },
    {
        "link": "/wiki/Moore%27s_Ford_lynchings",
        "title": "Moore's Ford lynchings",
        "date": "",
        "location": "",
        "paragraph": "The Moore's Ford Lynchings, also known as the 1946 Georgia lynching, refers to the July 25, 1946, murders of four young African Americans by a mob of white men. Tradition says that the murders were committed on Moore's Ford Bridge in Walton and Oconee counties between Monroe and Watkinsville, but the four victims, two married couples, were shot and killed on a nearby dirt road.\nThe case attracted national attention and catalyzed large protests in Washington, DC and New York City. President Harry Truman created the President's Committee on Civil Rights and his administration introduced anti-lynching legislation in Congress, but could not get it past the Southern Democratic bloc. The FBI investigated for four months in 1946, the first time it had been ordered to investigate a civil rights case, but it was unable to discover sufficient evidence to bring any charges.\n"
    },
    {
        "link": "/wiki/Lynching_of_Paul_Reed_and_Will_Cato",
        "title": "Lynching of Paul Reed and Will Cato",
        "date": "",
        "location": "",
        "paragraph": "The lynching of Paul Reed and Will Cato occurred in Statesboro, Georgia on August 16, 1904. Five members of a white farm family, the Hodges, had been murdered and their house burned to hide the crime. Paul Reed and Will Cato, who were African-American, were tried and convicted for the murders. Despite militia having been brought in from Savannah to protect them, the two men were taken by a mob from the courthouse immediately after their trials, chained to a tree stump, and burned. In the immediate aftermath, four more African-Americans were shot, three of them dying, and others were flogged.\nHenry Hodges was a farmer in Bulloch County, Georgia, living about 6 miles (9.7 km) from Statesboro, the county seat. His farm house burned down on the night of Thursday, July 28, 1904. The next day, the bodies of Hodges, his wife Claudia, their nine-year-old daughter Kitty Corrine, two-year-old son Harmon, and six-month-old son Talmadge were found in the burned house. The remains of the five victims were buried in a single coffin the next day.[1][2]\n"
    },
    {
        "link": "/wiki/Screws_v._United_States",
        "title": "Screws v. United States",
        "date": "",
        "location": "",
        "paragraph": "Screws v. United States, 325 U.S. 91 (1945), was a 1945 Supreme Court case that made it difficult for the federal government to bring prosecutions when local government officials killed African-Americans in an extra-judicial manner.\nClaude Screws, the sheriff of Baker County, Georgia,[1] arrested Robert \"Bobby\" Hall, an African American, on January 29, 1943. Hall had allegedly stolen a tire, and was alleged to have tried to fight back against Screws and two of his deputies during the arrest.[2]  Hall was arrested at his home.[3] Screws then beat Hall to death.\n"
    },
    {
        "link": "/wiki/Joseph_Standing",
        "title": "Joseph Standing",
        "date": "",
        "location": "",
        "paragraph": "Joseph Standing[1] (October 5, 1854 – July 21, 1879) was a missionary for the Church of Jesus Christ of Latter-day Saints (LDS Church) who was killed by a mob near the town of Varnell, Whitfield County, Georgia, in 1879.[2]\nBorn in Salt Lake City, Utah Territory, and a resident of Box Elder County, Utah, Standing was born to British immigrants James and Mary Standing. He was one of ten children. His father was a stonemason who worked on the Nauvoo and Logan Temples.[3][4][5][6] Prior to his missionary service, Joseph Standing was a fireman with the Wasatch Engine Company.[7] He was not married and had no children.[8]\n"
    },
    {
        "link": "/wiki/Hazel_%22Hayes%22_Turner",
        "title": "May 1918 lynchings",
        "date": "",
        "location": "",
        "paragraph": "On May 16, 1918, a plantation owner was murdered, prompting a manhunt which resulted in a series of lynchings in May 1918 in southern Georgia, United States. White people killed at least 13 black people during the next two weeks.[1] Among those killed were Hayes and Mary Turner. Hayes was killed on May 18, and the next day (May 19), his pregnant wife Mary was strung up by her feet, doused with gasoline and oil then set on fire. Mary's unborn child was cut from her abdomen and stomped to death. Her body was then repeatedly shot. No one was ever convicted of her lynching[citation needed].\nThese lynchings are examples of the racially-motivated mob violence by white people against black people in the American South, especially during 1880 to 1930, the peak of lynchings. Brooks County in Georgia, and Georgia among the states, had the highest rates of lynching in the nation during this period[citation needed].\n"
    },
    {
        "link": "/wiki/May_1918_lynchings",
        "title": "May 1918 lynchings",
        "date": "",
        "location": "",
        "paragraph": "On May 16, 1918, a plantation owner was murdered, prompting a manhunt which resulted in a series of lynchings in May 1918 in southern Georgia, United States. White people killed at least 13 black people during the next two weeks.[1] Among those killed were Hayes and Mary Turner. Hayes was killed on May 18, and the next day (May 19), his pregnant wife Mary was strung up by her feet, doused with gasoline and oil then set on fire. Mary's unborn child was cut from her abdomen and stomped to death. Her body was then repeatedly shot. No one was ever convicted of her lynching[citation needed].\nThese lynchings are examples of the racially-motivated mob violence by white people against black people in the American South, especially during 1880 to 1930, the peak of lynchings. Brooks County in Georgia, and Georgia among the states, had the highest rates of lynching in the nation during this period[citation needed].\n"
    },
    {
        "link": "/wiki/Berry_Washington",
        "title": "Berry Washington",
        "date": "",
        "location": "",
        "paragraph": "Berry Washington (c. 1847-May 26, 1919) was a 72 year old black man who was lynched in Milan, Georgia, in 1919. He was in jail after killing a white man who was attacking two young girls. He was taken from jail and lynched by a mob.\nAt 1:00 AM on the morning of May 24, 1919, two white men, John Dandy and Levi Evans, went into the black section of Milan. They first tried to get into the home of Emma McCollers who had two young daughters.[1] When the family refused to open the door Dandy fired his gun. This caused the girls to flee to another house, the home of widow Emma Tisber. The two men followed and invaded the Tisber home and attempted to assault two young black girls.[1] When the two girls attempted to hide under the porch, Dandy and Evans began ripping up the floor to get to them.[2] Washington, a black man, attempted to defend the girls and get the men to leave. Dandy fired at Washington and after a struggle, Washington, who was 72 years old, shot and killed Dandy, \"He fell with his\npistol in his right hand and a cigarette in the other, and a flask of liquor fell out of his pocket.\"[1]\n"
    },
    {
        "link": "/wiki/Watkinsville_lynching",
        "title": "Watkinsville lynching",
        "date": "",
        "location": "",
        "paragraph": "\nThe Watkinsville lynching was a mass lynching that occurred in Watkinsville, Georgia, United States on June 30, 1905. The lynching, which saw a large mob seize 9 men from a local jail and kill 8 of them by gunfire, has been described as \"one of the worst episodes of racial violence ever in Georgia.\"[1]\n"
    },
    {
        "link": "/wiki/1999_Atlanta_day_trading_firm_shootings",
        "title": "1999 Atlanta day trading firm shootings",
        "date": "July 27–29, 1999",
        "location": "Stockbridge and Atlanta, Georgia, United States",
        "paragraph": "\nOn July 29, 1999, a shooting spree occurred at two Atlanta-area day trading firms, Momentum Securities and the All-Tech Investment Group. Nine people were killed, and 13 other people were injured. The gunman, identified as 44-year-old former day trader Mark Orrin Barton, later committed suicide in Acworth before he could be apprehended by police.[1]\n"
    },
    {
        "link": "/wiki/2021_Atlanta_spa_shootings",
        "title": "2021 Atlanta spa shootings",
        "date": "March 16, 2021 (2021-03-16) c. 4:50 p.m. EDT (20:50 UTC)",
        "location": "Atlanta and unincorporated Cherokee County, Georgia, United States",
        "paragraph": "\nOn March 16, 2021, a shooting spree occurred at three spas or massage parlors in the metropolitan area of Atlanta, Georgia, United States. Eight people were killed, six of whom were women of Asian descent,[3] and one other person was wounded.\n"
    },
    {
        "link": "/wiki/Atlantic_Station_shooting",
        "title": "Atlantic Station shooting",
        "date": "",
        "location": "",
        "paragraph": "Two young men were shot dead near Atlantic Station in Atlanta, Georgia on Nov. 26, 2022. Zyion Charles, a 12-year-old boy, died at the scene, and six others were wounded.[1] Four or five days later, another 15-year-old boy, Cameron Jackson, died from his injuries. The shooting was suspected by Atlanta Police to have had gang overtones, and Charles was allegedly a gang member. Two persons of interests were caught on camera allegedly celebrating the shooting by making positive hand gestures, such as making fist bumps and showing excited emotions; however,  no suspects have been identified or arrested.\n"
    },
    {
        "link": "/wiki/Heritage_High_School_shooting",
        "title": "Heritage High School (Conyers, Georgia)",
        "date": "",
        "location": "",
        "paragraph": "Heritage High School is one of three public secondary schools in Rockdale County in Conyers, Georgia, United States (the others being Rockdale County High School and Salem High School), under the Rockdale County School District. Heritage High School is home of the Patriots. It has twice been named a School of Excellence. In December 2009, U.S. News & World Report gave Heritage High School a silver medal ranking in the top 500 high schools in the nation.[citation needed] In 2014 Heritage High School became an Academy for Performing and Visual Arts.\nOn May 20, 1999, a month to the day after the Columbine High School massacre, 15-year-old student Anthony \"T.J.\" Solomon opened fire with a .22-caliber rifle on the Heritage campus, wounding six students. A 15-year-old girl was hospitalized in critical condition, and the other victims suffered non-life-threatening injuries. Solomon attempted suicide with a revolver but was talked into surrendering by an assistant principal. Solomon initially faced up to 351 years of prison if convicted of aggravated assault and other charges,[4] but in 2000 he was found guilty but mentally ill, and was sentenced to 40 years in prison and 65 years of probation.[5][6] A judge later reduced his sentence from 40 to 20 years. He was released to his mother's house on parole on July 26, 2016.[7][8]\n"
    },
    {
        "link": "/wiki/Moore%27s_Ford_lynchings",
        "title": "Moore's Ford lynchings",
        "date": "",
        "location": "",
        "paragraph": "The Moore's Ford Lynchings, also known as the 1946 Georgia lynching, refers to the July 25, 1946, murders of four young African Americans by a mob of white men. Tradition says that the murders were committed on Moore's Ford Bridge in Walton and Oconee counties between Monroe and Watkinsville, but the four victims, two married couples, were shot and killed on a nearby dirt road.\nThe case attracted national attention and catalyzed large protests in Washington, DC and New York City. President Harry Truman created the President's Committee on Civil Rights and his administration introduced anti-lynching legislation in Congress, but could not get it past the Southern Democratic bloc. The FBI investigated for four months in 1946, the first time it had been ordered to investigate a civil rights case, but it was unable to discover sufficient evidence to bring any charges.\n"
    },
    {
        "link": "/wiki/Penske_office_shooting",
        "title": "Penske office shooting",
        "date": "January 12, 2010 (2010-01-12) 2:00 p.m.",
        "location": "Kennesaw, Georgia, United States",
        "paragraph": "\nOn January 12, 2010, three people were killed and two others critically injured in a workplace shooting at FedEx located in the city of Kennesaw, Georgia. The fourth victim died in from complications of his injuries. The alleged shooter, Jesse J. Warren, was captured and arrested in the incident.\n"
    },
    {
        "link": "/wiki/1912_racial_conflict_in_Forsyth_County,_Georgia",
        "title": "1912 racial conflict in Forsyth County, Georgia",
        "date": "",
        "location": "",
        "paragraph": "\nIn Forsyth County, Georgia, in September 1912 two separate alleged attacks on white women resulted in black men being accused as suspects. One white woman accused two black men of breaking into her home in Big Creek Community and one of raping her. Another teenage  woman was fatally beaten and raped in the Oscarville Community. Earnest Knox was linked to the Oscarville murder along with his half brother by a hair comb sold to him at the Oscarville store. When confronted, he confessed to the Sheriff and implicated his half brother and mother’s live-in boyfriend. His mother testified against the sons during the jury trial which sentenced both to hanging. 21 days later the sentence was carried out. \nIn the Big Creek assault, a black preacher and his congregation drove to Cumming to demand the release of the men being held for the rape of a young girl from the Big Creek Community. This resulted in a white counter mob showing up in confrontation. Tempers flared and the preacher was harshly beaten for having been heard to suggest that the first woman may have had a consensual relationship with a black man. The Forsyth County Sheriff locked the preacher inside the court house over night to protect him from the mob waiting outside. \n"
    },
    {
        "link": "/wiki/Ahmaud_Arbery",
        "title": "Murder of Ahmaud Arbery",
        "date": "February 23, 2020 (2020-02-23) c. 1:15 p.m.",
        "location": "Satilla Shoresunincorporated Glynn County, Georgia, U.S.",
        "paragraph": "\nOn February 23, 2020, Ahmaud Arbery, a 25-year-old black man, was murdered during a racially motivated hate crime[b] while jogging in Satilla Shores, a neighborhood near Brunswick in Glynn County, Georgia.[1][2][3][4][5][9] Erroneously assuming he was a burglar,[10][2][1][11] three white men pursued Arbery in their trucks for several minutes, using the vehicles to block his path as he tried to run away.[12] Two of the men, Travis McMichael and his father, Gregory McMichael, were armed in one vehicle. Their neighbor, William \"Roddie\" Bryan, was in another vehicle. After overtaking Arbery, Travis McMichael exited his truck and assaulted Arbery with a shotgun.[11] As Arbery attempted to defend himself, Travis McMichael fatally shot him.[3][4] Bryan recorded this confrontation and Arbery's murder on his cell phone.\n"
    },
    {
        "link": "/wiki/George_W._Ashburn",
        "title": "George W. Ashburn",
        "date": "",
        "location": "",
        "paragraph": "George W. Ashburn (1814 – March 30, 1868) was a Radical Republican assassinated by the Ku Klux Klan in Columbus, Georgia for his pro-African-American sentiments. He was the first murder victim of the Klan in Georgia.[1]\nAshburn was born in North Carolina in 1814. He moved to Georgia around 1830. He opposed the Secession of Georgia. During the American Civil War, he was commissioned a Colonel in the Union army. \n"
    },
    {
        "link": "/wiki/Atlanta_murders_of_1979%E2%80%931981",
        "title": "Atlanta murders of 1979–1981",
        "date": "July 21, 1979 – May 21, 1981",
        "location": "City of Atlanta, Fulton County, DeKalb County, Cobb County, Douglas County",
        "paragraph": "\nThe Atlanta murders of 1979–1981, sometimes called the Atlanta child murders, was a series of murders committed in Atlanta, Georgia, between July 1979 and May 1981. Over the two-year period, at least 28 children, adolescents, and adults were killed.\n"
    },
    {
        "link": "/wiki/Atlanta_Ripper",
        "title": "Atlanta Ripper",
        "date": "1909 and 1914",
        "location": "",
        "paragraph": "\nThe Atlanta Ripper was an unidentified serial killer[1] who is suspected of killing at least fifteen Atlanta women between 1909 and 1914.[2]\n"
    },
    {
        "link": "/wiki/Professor_Backwards",
        "title": "Professor Backwards",
        "date": "",
        "location": "",
        "paragraph": "James Edmondson, Sr. (June 10, 1910 – January 29, 1976), also known as Professor Backwards, was a vaudevillian/comedian who appeared on TV from the 1950s to the early 1970s, most notably on The Ed Sullivan Show, The Tonight Show, The Merv Griffin Show, The Dean Martin Show and The Mike Douglas Show, where he appeared more times than any other guest[citation needed].  In addition to traditional stand-up comedy, Edmondson's act featured his ability to write in script that was upside down and/or backwards, spell and pronounce words backwards, and read an inverted blackboard correctly.\n\"I came down from Jacksonville on a train that was the slowest train I'd ever been on. I said to the conductor, 'Can't you run any faster?' He said, 'Yeah, but I gotta stay on the train.' A woman ran up to the conductor and said, 'Stop the train. I have to get to the maternity hospital.' He said, 'You had no business getting on the train in that condition.' She said, 'I didn't.'\"\n"
    },
    {
        "link": "/wiki/Rowland_Barnes",
        "title": "Rowland Barnes",
        "date": "",
        "location": "",
        "paragraph": "Lebanon Valley College\nRowland Wayne Barnes (April 25, 1940 – March 11, 2005) was an American Superior Court Judge in Fulton County, Georgia. He oversaw the 2003 trial of the professional ice hockey player Dany Heatley, who was charged with vehicular homicide after the death of teammate Dan Snyder in a car accident. In an unrelated incident, Judge Barnes was shot to death in his courtroom in 2005.\n"
    },
    {
        "link": "/wiki/Murder_of_Christopher_Barrios_Jr.",
        "title": "Murder of Christopher Barrios Jr.",
        "date": "",
        "location": "",
        "paragraph": "Christopher Michael Barrios Jr. (January 2, 2001 – March 8, 2007) was a six-year-old American boy who was raped and murdered in Brunswick, Georgia, on March 8, 2007. His body was discovered on March 15, 2007, just a few miles from where he disappeared.\nGeorge, David, and Peggy Edenfield were all accused of Barrios' abduction and murder. A fourth person, Donald Dale, originally charged with tampering with evidence and concealing a body, has since pleaded guilty to a lesser charge of lying to police. Superior Court Judge Stephen Scarlett accepted the plea and transferred Dale to a mental-health facility, and banished him from Glynn County.[1] Peggy Edenfield testified in the case against her husband David and agreed to testify against her son George during his trial. In exchange for her testimony, Peggy avoided the death penalty; she was eventually sentenced to sixty years in prison.[2]\n"
    },
    {
        "link": "/wiki/O%27Neil_Bell",
        "title": "O'Neil Bell",
        "date": "",
        "location": "",
        "paragraph": "O'Neil Bell (29 December 1974 – 25 November 2015) was a Jamaican professional boxer who competed from 1998 to 2011. He held the undisputed cruiserweight title in 2006 and the lineal cruiserweight title from 2006 to 2007.\nBell lost his second fight against Algerian amateur star (M. Benguesima) but kept winning for years after that.\nHe defeated former IBF champion Arthur Williams twice by KO and climbed the rankings.\n"
    },
    {
        "link": "/wiki/Nancy_Benoit",
        "title": "Nancy Benoit",
        "date": "",
        "location": "",
        "paragraph": "\nNancy Elizabeth Benoit (formerly Daus, Sullivan, née Toffoloni; May 17, 1964 – June 22, 2007) was an American professional wrestling manager and model. She was best known for her appearances with Extreme Championship Wrestling and World Championship Wrestling in the mid-1990s under the ring name Woman.[3][4]\n"
    },
    {
        "link": "/wiki/Killing_of_James_Brazier",
        "title": "Killing of James Brazier",
        "date": "",
        "location": "",
        "paragraph": "James Brazier (c. 1926–April 25, 1958) was an African-American victim of police brutality and substandard medical care that followed. He was imprisoned, fined, and beaten to death by police officers, in events spanning between 1957 and 1958.[1][2] Brazier was a United States Army veteran and had lived in Dawson, Georgia. \nPolice targeted Brazier because he was black and owned nice cars from the dealership he worked at.[3] He started having police and law enforcement issues in November 1957, when he was first arrested, fined and beaten and was charged with a speeding charge and driving under the influence by Officer Weyman Burchle Cherry (1926–1970).[1][4] Brazier complained about severe headaches after the incident in November 1957, and his wife visited the Dawson police with a medical bill to talk about the ongoing head issues.[1]\n"
    },
    {
        "link": "/wiki/Derwin_Brown",
        "title": "Derwin Brown",
        "date": "",
        "location": "",
        "paragraph": "Derwin Brown (June 22, 1954 – December 15, 2000) was an American police captain and the sheriff-elect of DeKalb County, Georgia, who was assassinated on the evening of December 15, 2000, on the orders of defeated rival Sidney Dorsey.\nThe firstborn of Burvena and George Robert Brown, Derwin was raised in Long Island, New York, where he attended Woodfield Road School and Malverne Jr. High School for his elementary years of grade school and Malverne High School.[2]\n"
    },
    {
        "link": "/wiki/Eugenia_Calle",
        "title": "Eugenia Calle",
        "date": "",
        "location": "",
        "paragraph": "Centers for Disease Control and Prevention\nEugenia E. “Jeanne” Calle (1952–2009) was an American cancer epidemiologist.\n"
    },
    {
        "link": "/wiki/Camoflauge",
        "title": "Camoflauge",
        "date": "",
        "location": "",
        "paragraph": "Jason Johnson (December 9, 1981 – May 19, 2003), also known as Camoflauge, was an American rapper, famous for his songs \"Cut Friends\" and \"Laying My Stunt Down\". He released his final album Keepin It Real in 2002.\nCamoflauge was murdered in Savannah, Georgia, by gunfire outside of Pure Pain Records recording studio while he was walking his toddler son.[1]\n"
    },
    {
        "link": "/wiki/Janice_Chatman",
        "title": "Alvin and Judith Neelley",
        "date": "",
        "location": "",
        "paragraph": "Alvin Howard Neelley, Jr. (July 15, 1953 – October 21, 2005) and Judith Ann Adams Neelley (born June 7, 1964) are an American married couple who committed the kidnappings and torture murders of Lisa Ann Millican and Janice Kay Chatman; they also attempted a third abduction. Judith was sentenced to death in 1983, but her sentence was commuted to life imprisonment in 1999.[1] She served her sentence at the Julia Tutwiler Prison for Women in Wetumpka, Alabama.[2] Alvin was serving a life sentence at the Bostick State Prison in Hardwick, Georgia at the time of his death in 2005.[1]\nAlvin Howard Neelley, Jr., was born in 1953 in Georgia, where he was a car thief during his teenage years. He met his second wife, Judith Ann Adams, when he was 26 years old and she was 15. Alvin divorced his first wife shortly before eloping with Judith in 1980.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Jake_Davis",
        "title": "Lynching of Jake Davis",
        "date": "July 14, 1922",
        "location": "Miller County, Georgia",
        "paragraph": "Jake \"Shake\" Davis was a 62-year-old African-American man who was lynched in Miller County, Georgia by a white mob on July 14, 1922. According to the United States Senate Committee on the Judiciary it was the 38th of 61 lynchings during 1922 in the United States. [1]\nMiscegenation is the interbreeding of people who are considered to be members of different races and was heavily frowned upon in the American south. The historical taboo surrounding white–black relationships among American whites can be seen as a historical consequence of the oppression and racial segregation of African Americans.[2][3] In many U.S. states, interracial marriage was already illegal when the term miscegenation was coined in 1863. Before that, it was called \"amalgamation\". \n"
    },
    {
        "link": "/wiki/Richard_T._Davis",
        "title": "Richard T. Davis",
        "date": "",
        "location": "",
        "paragraph": "Specialist Richard Thomas Davis (March 14, 1978 – July 15, 2003) was an Infantryman in the United States Army.[1][2][3] The son of two US Army veterans, Lanny and Remy Davis, he was born on an Army base in Germany.[1] Davis enlisted in the Army in 1998 and served in Operation Joint Forge in Bosnia and later in the Iraq War, where he and his comrades participated in the April 11, 2003, \"Midtown Massacre,\" a five-hour firefight in downtown Baghdad.[4] On July 15, 2003, less than two days after returning from deployment to Iraq, Davis was murdered outside Fort Benning, Georgia by a fellow soldier from Baker Company, Alberto Martinez.  Three other soldiers were also present and involved in the events that led up to the killing and followed the killing.[1][5]\nInitially, the Army concluded that Davis deserted and despite pleas from Davis' father, would not initiate an investigation into his son's disappearance for nearly two months.[5] Davis' remains were not found until November 2003. He had been stabbed in the head, neck, and chest at least thirty-three times.[5] His body was later dismembered, doused in lighter fluid, and burned.[5] Unnamed sources have suggested that Davis was killed because he had planned to make a complaint about a rape of an Iraqi woman by US troops.[4][5]\n"
    },
    {
        "link": "/wiki/Martin_DeFoor",
        "title": "Martin DeFoor",
        "date": "",
        "location": "",
        "paragraph": "Martin DeFoor (September 17, 1805 – July 25, 1879) was an early Atlanta settler.\nIn the 1840s, he moved his family from Franklin County, Georgia to Panthersville.\nIn 1853, he moved to the Bolton area and took over operation of Montgomery ferry and resided at the Montgomery home the rest of his life. It was thereafter known as DeFoor's Ferry. From that time until his death, DeFoor and his family lived in the former Montgomery home, one of the oldest in the county, and located on the west side of what is now Chattahoochee Avenue, just north of Moore's Mill Road. The house was torn down in August 1879, by Thomas Moore, a son-in-law of DeFoor who used the lumber in erecting a barn on his own place just across the road.[1]\n"
    },
    {
        "link": "/wiki/Murders_of_Russell_and_Shirley_Dermond",
        "title": "Murders of Russell and Shirley Dermond",
        "date": "",
        "location": "",
        "paragraph": "The murders of Russell and Shirley Dermond occurred in early May 2014 in Putnam County, Georgia, United States. The decapitated body of Russell Dermond (age 88) was found on May 6, 2014, in the garage of the house he owned on Lake Oconee. Neither his head nor his wife, Shirley (age 87), could be located in the house. Over a week later, Shirley's body was discovered floating in Lake Oconee, her body having been weighted down with concrete blocks. As of 2022, the murders remain unsolved and Russell's head has not been found.[1]\nRussell Joseph Dermond, a native of Hackensack, New Jersey, served in the United States Navy during World War II.[2]  He married Shirley Wilcox on December 15, 1950. They went on to have four children and nine grandchildren. After working in the fast food industry, including owning several Hardee's locations in Atlanta, Russell retired in 1994. The Dermonds went on to move into Great Waters Reynolds at Lake Oconee, a gated community located about twelve miles northeast of Eatonton.[1][3] In 2000, their oldest son Mark was murdered in Atlanta while attempting to purchase crack cocaine. Investigators believe that there is no connection between this crime and the murder of Mark's parents.[2]\n"
    },
    {
        "link": "/wiki/Kyle_Dinkheller",
        "title": "Murder of Kyle Dinkheller",
        "date": "January 12, 1998 (1998-01-12)",
        "location": "Whipple Crossing RoadLaurens County, Georgia, U.S.",
        "paragraph": "\nThe murder of Kyle Dinkheller took place on Monday, January 12, 1998, when Dinkheller, a deputy in the Laurens County, Georgia, sheriff's office, pulled over motorist and Vietnam War veteran Andrew Howard Brannan for speeding. A verbal confrontation escalated to a shootout resulting in Brannan murdering Dinkheller. The murder continues to receive national attention because the traffic stop and shootout were captured on a personal video recorder Dinkheller had placed on his patrol car dashboard and activated when he stopped Brannan. The recording is widely used for training purposes in U.S. police academies.\n"
    },
    {
        "link": "/wiki/James_Douglas_Edgar",
        "title": "James Douglas Edgar",
        "date": "",
        "location": "",
        "paragraph": "\nJames Douglas Edgar (30 September 1884 – 8 August 1921) was an English professional golfer and golf writer.\n"
    },
    {
        "link": "/wiki/Murder_of_Meredith_Emerson",
        "title": "Murder of Meredith Emerson",
        "date": "",
        "location": "",
        "paragraph": "Meredith Hope Emerson[3] (June 20, 1983 – January 4, 2008) was a 24-year-old woman who was murdered in January 2008 by drifter Gary Michael Hilton. She was last seen alive hiking with her dog on Blood Mountain in northern Georgia on New Year's Day 2008. Witnesses claimed to have seen her with an older man on the Spur Trail connecting the Appalachian Trail with the Byron Herbert Reece Parking Lot. When she did not return home on January 2, 2008, her friends began to search for her, without success. Her dog, Ella, was found on January 4, 2008, in Cumming, Georgia, approximately 60 miles (97 km) away.\nAt the time of her disappearance, Emerson lived in Buford, Georgia.[4][5]\n"
    },
    {
        "link": "/wiki/Vernon_Forrest",
        "title": "Vernon Forrest",
        "date": "",
        "location": "",
        "paragraph": "Vernon Forrest (February 12, 1971 – July 25, 2009) was an American professional boxer who competed from 1992 to 2008. He held multiple world championships in two weight classes, including the WBC, IBF, Ring magazine and lineal welterweight between 2002 and 2003, and the WBC super welterweight title twice between 2007 and 2009. In 2002, Forrest was named Fighter of the Year by The Ring and the Boxing Writers Association of America.\nIn 2009, Forrest was murdered after he was robbed at a gas station in the Mechanicsville neighborhood of Atlanta, Georgia.\n"
    },
    {
        "link": "/wiki/Rhett_Forrester",
        "title": "Rhett Forrester",
        "date": "",
        "location": "",
        "paragraph": "\nRhett Forrester (September 22, 1956 – January 22, 1994) was an American musician best known as the lead singer for New York-based band Riot from 1981 until 1984.\n"
    },
    {
        "link": "/wiki/Leo_Frank",
        "title": "Leo Frank",
        "date": "",
        "location": "",
        "paragraph": "\nLeo Max Frank (April 17, 1884 – August 17, 1915) was an American factory superintendent who was convicted in 1913 of the murder of a 13-year-old employee, Mary Phagan, in Atlanta, Georgia. His trial, conviction, and appeals attracted national attention. His lynching two years later, in response to the commutation of his death sentence, became the focus of social, regional, political, and racial concerns, particularly regarding antisemitism. Today, the consensus of researchers is that Frank was wrongly convicted and Jim Conley was likely the actual murderer.\n"
    },
    {
        "link": "/wiki/Bankroll_Fresh",
        "title": "Bankroll Fresh",
        "date": "",
        "location": "",
        "paragraph": "Trentavious Zamon White (August 2, 1987 – March 4, 2016), better known by his stage name Bankroll Fresh or Yung Fresh, was an American rapper from Atlanta, Georgia. Fresh is best known for his 2015 single \"Walked In\".[1] He starred in the independent short film Take Over Your Trap in 2016.\nWhite originally rapped under the alias Yung Fresh, and under this alias appeared alongside Gucci Mane on multiple records.[2] In 2014, Fresh collaborated with Mike Will Made It, on the song \"Screen Door\". Fresh later also made a guest appearance on song \"For the Love\", which appeared on Metro Boomin's 2013 mixtape 19 & Boomin.[3] Fresh had a hit of his own with the 2014 single \"Hot Boy\", and the same year, he released the mixtape Life of a Hot Boy.[2][4] In 2015, Fresh released Life of a Hot Boy 2,[2] and later that year, Fresh followed it up with a self-titled mixtape.[5] In February 2016, he released a video for his song \"Poppin' Shit\".[6]\nFresh was also featured on Jeezy's hit \"All There\". The music video was released posthumously. Jeezy dedicated it to Fresh, filming the video in his hood with Fresh's family.\n"
    },
    {
        "link": "/wiki/Lynching_of_Phillip_Gathers",
        "title": "Lynching of Phillip Gathers",
        "date": "",
        "location": "",
        "paragraph": "Philip Gathers was lynched on June 21, 1920, in Effingham County, Georgia. He was alleged to have raped and murdered a 17-year old white girl named Anza Jaudon.[1] After a week-long search, he was captured by law enforcement and given up to members of the search party. He was then shot, burned, and hanged by a mob of thousands. No one was ever convicted for the lynching.[2][3]\nOn Friday, June 11, 1920, Anza Jaudon traveled for the weekend from Savannah, Georgia to visit her family in Effingham County. While walking from the train station, Jaudon was raped and murdered approximately 500 yards from her family's home. The following Monday, Jaudon's father telephoned her to find out why she had not arrived and realized she was missing. They began a search and found her body near the road.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Glover",
        "title": "Lynching of John Glover",
        "date": "August 2, 1922",
        "location": "Holton in Bibb County, Georgia",
        "paragraph": "John \"Cockey\" Glover[1] was a 35-year-old African-American man who was lynched in Holton in Bibb County, Georgia by a mob of 300 white men on August 2, 1922. According to the United States Senate Committee on the Judiciary it was the 43rd of 61 lynchings during 1922 in the United States. [2]\nIn 1922 three men named John Glover died or were killed. On February 17, 1922, a worker of the Shelton turpentine still which used the Peonage debt system to keep their workers, John Glover was killed after committing \"one of the first mass school shootings\".[3] Five months later John Glover, a white Confederate veteran who was one of the wealthiest citizens in Rome, Georgia died of natural causes. Finally, in August 1922 John \"Cockey\" Glover was lynched by a mob after allegedly taking part in the shooting of \"particularly brutal White sheriff’s deputy\" Walter C. Byrd.[4]\n"
    },
    {
        "link": "/wiki/Delia_Green",
        "title": "Delia Green",
        "date": "",
        "location": "",
        "paragraph": "Delia Green (1886 – December 25, 1900)[1] was a 14-year-old African-American murder victim who has been identified as the likely inspiration for several well-known traditional American songs, usually known by the titles \"Delia\" or \"Delia's Gone\" or \"Little Delia.\"\nAccording to contemporaneous reports published in Georgia newspapers, Green was shot by 15-year-old Mose (or Moses) Houston late on Christmas Eve, 1900, in the Yamacraw neighborhood of Savannah, Georgia, and died at 3:00 a.m. on Christmas Day.[2] Houston, the newspapers implied, had been involved in a sexual relationship with Green for several months. The shooting took place at the home of Willie West, who chased down Houston after the shooting and turned him over to the city police.\n"
    },
    {
        "link": "/wiki/Lynching_of_James_and_Alonzo_Green",
        "title": "Lynching of James and Alonzo Green",
        "date": "July 4, 1914",
        "location": "Jones County, Georgia",
        "paragraph": "Father and son Alonzo and James D. Green were innocent African-Americans lynched near Round Oak and Wayside, Jones County, Georgia in retaliation for the murder of popular white farmer Silas Hardin Turner on July 4, 1915. A third man, William Bostick was also lynched on this day.[1] None of those killed received a trial.\nAlonzo Green worked as an axeman in a local sawmill. He had married Cora in 1902 and had two children James D. (b. abt 1901) and Annie M. (b. abt 1903). White farmer Silas Hardin Turner was a prominent planter in Jones County, Georgia and the son of John D. Turner (1851-1930) and Mattie Hardin (1865-1946).\n"
    },
    {
        "link": "/wiki/Lynching_of_James_Harvey_and_Joe_Jordan",
        "title": "Lynching of James Harvey and Joe Jordan",
        "date": "July 1, 1922,",
        "location": "Liberty County, Georgia",
        "paragraph": "\nJames Harvey and Joe Jordan were two African-American men who were lynched on July 1, 1922, in Liberty County, Georgia, United States. They were seized by a mob of about 50 people and hanged while being transported by police from Wayne County to a jail in Savannah. Investigations by the NAACP showed that the police involved were complicit in their abduction by the mob. Twenty-two men were later indicted for the lynching, with four convicted.\n"
    },
    {
        "link": "/wiki/Lynching_of_Sam_Hose",
        "title": "Lynching of Sam Hose",
        "date": "April 23, 1899 2:30 PM (EST)",
        "location": "Newnan, Coweta County, Georgia, U.S.",
        "paragraph": "\nSam Hose (born Samuel Thomas Wilkes; c. 1875 – April 23, 1899) was an African American man who was tortured and murdered by a white lynch mob in Coweta County, Georgia, after being falsely accused of rape by the mob.\n"
    },
    {
        "link": "/wiki/Lynching_of_Paul_Jones",
        "title": "Lynching of Paul Jones",
        "date": "November 2, 1919",
        "location": "Macon, Georgia",
        "paragraph": "Paul Jones[a] was lynched on November 2, 1919, after being accused of attacking a fifty-year-old white woman in Macon, Georgia.\nOn Sunday, November 2, 1919, Paul Jones allegedly attacked a white woman about 2 miles (3.2 km) outside of Macon.[2] Paul Jones was chased through town until he was cornered in a rail boxcar, there the woman positively identified him.[3] A white mob of 400 people quickly assembled and over the protests of Sheriff James R. Hicks they seized Jones. His body was riddled with bullets after being lynched,[4] \"saturated with coal oil\" and lit on fire.[5] He was still alive as the flames consumed his body and the mob watched as he writhed in pain.[1]  There were no arrests.\n"
    },
    {
        "link": "/wiki/Murder_of_Sandeela_Kanwal",
        "title": "Murder of Sandeela Kanwal",
        "date": "",
        "location": "",
        "paragraph": "Sandeela Kanwal was a Pakistani woman living in the Atlanta metropolitan area in Clayton County, Georgia, who was murdered by her father Chaudhry Rashid[1] in an honor killing, on July 6, 2008.\nKanwal, aged 25, worked at a Wal-Mart, while her father, Chaudhry Rashid,[1] born in a village in  Pakistan,[2] aged 54 and holding United States permanent residency, ran a pizza restaurant in East Point, Georgia.[3] At the time Rashid was married to a woman who was not Kanwal's mother.[4] Rashid's main languages were Punjabi and Urdu. Kanwal and her father lived in a house in Clayton County, near Jonesboro, with their respective spouses and family members.[3][5]\n"
    },
    {
        "link": "/wiki/Alberta_Williams_King",
        "title": "Alberta Williams King",
        "date": "",
        "location": "",
        "paragraph": "Alberta Christine Williams King (September 13, 1904 – June 30, 1974) was Martin Luther King Jr.'s mother, married to Martin Luther King Sr. She played a significant role in the affairs of the Ebenezer Baptist Church. She was shot and killed in the church by 23-year-old Black Hebrew Israelite Marcus Wayne Chenault six years after the assassination of Martin Luther King Jr.[1]\nAlberta Christine Williams was born on September 13, 1904.[2] Her parents were Reverend Adam Daniel Williams, at the time preacher of the Ebenezer Baptist Church in Atlanta, Georgia, and Jennie Celeste (Parks) Williams.[3] Alberta Williams graduated from high school at the Spelman Seminary, and earned a teaching certificate at the Hampton Normal and Industrial Institute (now Hampton University) in 1924.[4]\n"
    },
    {
        "link": "/wiki/David_Lang_(American_football)",
        "title": "David Lang (American football)",
        "date": "",
        "location": "",
        "paragraph": "David Lang (March 28, 1967 – May 21, 2005) was an American football running back in the National Football League for the Los Angeles Rams and Dallas Cowboys. He played college football at Northern Arizona University.\nLang graduated from Eisenhower High School in 1986. He was an All-league selection at running back as a senior. In track, he anchored the 4 × 100 metres relay team that finished third at the California state finals.\n"
    },
    {
        "link": "/wiki/William_McIntosh",
        "title": "William McIntosh",
        "date": "",
        "location": "",
        "paragraph": "William McIntosh (1775 – April 30, 1825),[1] was also commonly known as Tustunnuggee Hutke (White Warrior), was one of the most prominent chiefs of the Creek Nation between the turn of the nineteenth century and his execution in 1825. He was a chief of Coweta town and commander of a mounted police force. He became a large-scale planter, built and managed a successful inn, and operated a commercial ferry business. Early American historians attributed McIntosh's achievements and influence to his mixed race Scots/European ancestry. Since the late 20th century, historians have argued much of McIntosh's political influence stemmed more from his Creek upbringing and cultural standing, particularly his mother's prominent Wind Clan in the Creek matrilineal system, and to other aspects of Creek culture.[2]\nBecause McIntosh led a group that negotiated and signed the Treaty of Indian Springs in February 1825, which ceded much of remaining Creek lands to the United States in violation of Creek law, for the first time the Creek National Council ordered that a Creek be executed for crimes against the Nation.[3] It sentenced him and other signatories to death. McIntosh was executed by his long-time political nemesis Menawa and a large force of Law Menders in late April 1825.  Two other signatories were executed and another, while McIntosh's son Chilly was shot at, but escaped unharmed.  Menawa signed a treaty in 1826 that was very similar in both language and benefits, but one which the Creek National Council had agreed to and was therefore considered a legitimate treaty according to contemporary Creek law.\n"
    },
    {
        "link": "/wiki/Mark_MacPhail",
        "title": "Troy Davis",
        "date": "",
        "location": "",
        "paragraph": "\nTroy Anthony Davis (October 9, 1968 – September 21, 2011)[1][2] was a man convicted of and executed for the August 19, 1989 murder of police officer Mark MacPhail in Savannah, Georgia. MacPhail was working as a security guard at a Burger King restaurant and was intervening to defend a man being assaulted in a nearby parking lot when he was murdered. During Davis's 1991 trial, seven witnesses testified they had seen Davis shoot MacPhail, and two others testified Davis had confessed the murder to them. There were 34 witnesses who testified for the prosecution, and six others for the defense, including Davis. Although the murder weapon was not recovered, ballistic evidence presented at trial linked bullets recovered at or near the scene to those at another shooting in which Davis was also charged. He was convicted of murder and various lesser charges, including the earlier shooting, and was sentenced to death in August 1991.\n"
    },
    {
        "link": "/wiki/Eddie_Mapp",
        "title": "Eddie Mapp",
        "date": "",
        "location": "",
        "paragraph": "Eddie Mapp (c. 1910 – November 14, 1931)[1] was an American country blues harmonicist. He is best known for his accompaniment on records by Barbecue Bob and Curley Weaver.\nMapp was born in Social Circle, Walton County, Georgia. He relocated in 1922 to Newton County, where he met the guitar player Curley Weaver. Mapp was noted in Newton County as a harmonica virtuoso with a unique style, who often performed for tips on the street. In 1925 Weaver and Mapp left for Atlanta.[2] The twosome played at country dances. Weaver then formed a group with Mapp, Barbecue Bob, and Bob's brother Charlie Hicks and continued to play locally.[3][4]\n"
    },
    {
        "link": "/wiki/Louis_A._McCall_Sr.",
        "title": "Louis A. McCall Sr.",
        "date": "",
        "location": "",
        "paragraph": "\nLouis Anthony McCall Sr. (December 28, 1951 – June 25, 1997) was an American singer, songwriter, drummer, and event planner. McCall is best remembered as the co-founder and drummer of the American funk/R&B band Con Funk Shun,[2][3] which gained fame during the 1970s and 1980s with R&B songs such as: \"Ffun\" (1978), \"Chase Me\" (1979) and \"Baby I'm Hooked (Right into Your Love)\" (1983). McCall's wife is music business consultant and songwriter Linda Lou McCall. In 1997, McCall was murdered in a home invasion robbery at age 45.\n"
    },
    {
        "link": "/wiki/Lita_McClinton",
        "title": "Lita McClinton",
        "date": "",
        "location": "",
        "paragraph": "Lita LaVaughn McClinton (January 7, 1952 – January 16, 1987), the daughter of Georgia state representative JoAnn McClinton and former U.S. Department of Transportation official Emory McClinton, was murdered the day her divorce was to be settled. LaVaughn McClinton was shot when receiving a box of pink roses at her doorstep. In 1997, Phillip Anthony Harwood was identified as the hit man and indicated that he had committed the murder for $25,000 at the behest of James Sullivan, the former husband of Lita McClinton, who had been in Palm Beach, Florida, during the shooting in Atlanta, Georgia. Sullivan escaped arrest by fleeing abroad. On July 2, 2002, he was arrested in Thailand, and in 2004, he was extradited to Atlanta. In March 2006, Sullivan was convicted of murder for arranging the 1987 shooting of his wife and sentenced to life imprisonment without parole, in a Georgia prison. The case was profiled on Unsolved Mysteries in 2001, the year before James Sullivan was arrested.\nPhilip Harwood has since been released.\n"
    },
    {
        "link": "/wiki/David_McMillan_(American_football)",
        "title": "David McMillan (American football)",
        "date": "",
        "location": "",
        "paragraph": "David McMillan (September 20, 1981 – May 18, 2013) was a professional American and Canadian football defensive end. He was drafted by the Cleveland Browns in the fifth round of the 2005 NFL Draft. He played college football for the Kansas Jayhawks.\nMcMillan started 37 of 46 games at defensive end for the University of Kansas and collected 150 tackles with 15 sacks, 30 stops for losses, 19 quarterback pressures, five forced fumbles, 2 fumble recoveries, and 2 interceptions.\n"
    },
    {
        "link": "/wiki/Jeff_Modesitt",
        "title": "Jeff Modesitt",
        "date": "",
        "location": "",
        "paragraph": "\nJeffrey A. Modesitt (January 1, 1964 – August 3, 1990) was an American football tight end who played for one season in the National Football League (NFL). After playing college football for the Delaware Fightin' Blue Hens, he was signed by the Tampa Bay Buccaneers as an undrafted free agent in 1987. He played in one game for the Buccaneers in 1987.\n"
    },
    {
        "link": "/wiki/Moore%27s_Ford_lynchings",
        "title": "Moore's Ford lynchings",
        "date": "",
        "location": "",
        "paragraph": "The Moore's Ford Lynchings, also known as the 1946 Georgia lynching, refers to the July 25, 1946, murders of four young African Americans by a mob of white men. Tradition says that the murders were committed on Moore's Ford Bridge in Walton and Oconee counties between Monroe and Watkinsville, but the four victims, two married couples, were shot and killed on a nearby dirt road.\nThe case attracted national attention and catalyzed large protests in Washington, DC and New York City. President Harry Truman created the President's Committee on Civil Rights and his administration introduced anti-lynching legislation in Congress, but could not get it past the Southern Democratic bloc. The FBI investigated for four months in 1946, the first time it had been ordered to investigate a civil rights case, but it was unable to discover sufficient evidence to bring any charges.\n"
    },
    {
        "link": "/wiki/Moss_family_murders",
        "title": "Moss family murders",
        "date": "April 23, 1998",
        "location": "Griswoldville, Jones County, Georgia, United States",
        "paragraph": "\nThe Moss family murders occurred on April 23, 1998, in Griswoldville, Georgia, United States.[1] Three members of the Moss family, 11-year-old Bryan Moss, 15-year-old Kristin Moss, and their father 37-year-old Steven Moss, were shot to death by two burglars, 18-year-old Brandon Rhode and 19-year-old Daniel Lucas. Both men were given death sentences in 2000; Rhode was executed in 2010 and Lucas was executed in 2016, both via lethal injection.[2][3][4]\n"
    },
    {
        "link": "/wiki/Murder_of_Donovan_Parks",
        "title": "Murder of Donovan Parks",
        "date": "March 28, 1996",
        "location": "",
        "paragraph": "On March 28, 1996, Donovan Corey Parks, an American corrections officer, was murdered by two gang members in Baldwin County, Georgia. His two killers: Robert Earl Butts Jr. (May 14, 1977 – May 4, 2018) and Marion Wilson Jr. (July 29, 1976 – June 20, 2019) were executed for the crime by the state of Georgia via lethal injection, in 2018 and 2019, respectively. Wilson was the 1,500th person to be executed in the United States since capital punishment was resumed in 1976.[1][2][3]\nParks was born in 1971 in Milledgeville, Georgia. At the time of his murder, he was working two jobs, one as a prison guard and the other at a Winn-Dixie grocery store. He was trying to make money to study to become a prison counselor. According to his brother, Parks wanted to help inmates facing long prison sentences, as well as inmates who were getting ready to transition back into society. In 1995, Parks' mother died, and less than six months later, the family home caught fire. Following the fire, Parks' brother moved out of Milledgeville and joined the Army.[4]\n"
    },
    {
        "link": "/wiki/Murder_of_Lemuel_Penn",
        "title": "Murder of Lemuel Penn",
        "date": "",
        "location": "",
        "paragraph": "City of Albany\nCity of Americus\n"
    },
    {
        "link": "/wiki/Penske_office_shooting",
        "title": "Penske office shooting",
        "date": "January 12, 2010 (2010-01-12) 2:00 p.m.",
        "location": "Kennesaw, Georgia, United States",
        "paragraph": "\nOn January 12, 2010, three people were killed and two others critically injured in a workplace shooting at FedEx located in the city of Kennesaw, Georgia. The fourth victim died in from complications of his injuries. The alleged shooter, Jesse J. Warren, was captured and arrested in the incident.\n"
    },
    {
        "link": "/wiki/Terrell_Peterson",
        "title": "Terrell Peterson",
        "date": "",
        "location": "",
        "paragraph": "Terrell Peterson (March 1, 1992 – January 15, 1998) was a five-year-old boy from Atlanta, Georgia, who was tortured and beaten to death while his case was under active state supervision. He was one of more than 800 children who died between 1995 and 1998 after their cases were brought to the attention of the Georgia Department of Human Services' (DHS) Division of Family and Children Services (DFCS).\nSome of the deaths were due to accident and illness, while others, like Terrell's, were due to murder. When Terrell died he weighed only 29 pounds and was covered with cuts, bruises and cigarette burns.[1]\n"
    },
    {
        "link": "/wiki/Mary_Phagan",
        "title": "Leo Frank",
        "date": "",
        "location": "",
        "paragraph": "\nLeo Max Frank (April 17, 1884 – August 17, 1915) was an American factory superintendent who was convicted in 1913 of the murder of a 13-year-old employee, Mary Phagan, in Atlanta, Georgia. His trial, conviction, and appeals attracted national attention. His lynching two years later, in response to the commutation of his death sentence, became the focus of social, regional, political, and racial concerns, particularly regarding antisemitism. Today, the consensus of researchers is that Frank was wrongly convicted and Jim Conley was likely the actual murderer.\n"
    },
    {
        "link": "/wiki/Lil_Phat",
        "title": "Lil Phat",
        "date": "",
        "location": "",
        "paragraph": "Melvin Vernell III (July 25, 1992 – June 7, 2012), better known by his stage name Lil Phat, was an American rapper. Born in Baton Rouge, Louisiana, Vernell began rapping as a teenager and was signed to Trill Entertainment in 2007 when he was 14 years old. He is best known for his contribution to the single \"Independent\" by Webbie. He made a number of guest appearances on Trill Entertainment releases before being killed at the age of 19.[3]\nOn June 7, 2012, Vernell was shot and killed outside Northside Hospital in Sandy Springs, Georgia, where he was awaiting his daughter's birth. Two suspects were spotted fleeing the scene, according to witnesses.[4] Three men were convicted of the murder in August 2014.[5] Related charges concerning a fourth defendant, Mani Chulpayev, were dropped.[6]\n"
    },
    {
        "link": "/wiki/Robert_E._Robinson",
        "title": "Robert E. Robinson",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Edward Robinson (July 30, 1947 – December 18, 1989) was a lawyer, civil rights activist, and city councilmember in Savannah, Georgia. As a teenager, Robinson was involved in the integration of the city's school system and was part of a demonstration that contributed to the desegregation of Savannah Beach. He would later gain his Juris Doctor degree from the University of Georgia School of Law and practice law in Savannah, where he also was elected to the city council. He was murdered in 1989 by a mail bomb sent by Walter Moody, who would later be found guilty of murdering United States federal judge Robert Smith Vance in another mail bombing.\n"
    },
    {
        "link": "/wiki/Murder_of_Antonio_Santiago",
        "title": "Murder of Antonio Santiago",
        "date": "March 21, 2013; 9 years ago (2013-03-21)",
        "location": "Brunswick, Georgia, U.S.",
        "paragraph": "De'Marquise and Lang:\nOne-year-old Antonio Santiago was murdered on March 21, 2013, during an attempted robbery in Brunswick, Georgia, United States. As Santiago and his mother, Sherry West, were returning home from the post office, they were confronted by two youths, 15-year-old Dominique Lang and 17-year-old De'Marquise Elkins.[1] Elkins, who had previously shot another victim he tried to rob,[2] pointed a gun at West and demanded money.[3] When she did not comply he fired two .22-caliber bullets, one of which grazed her head, and the other of which went through her leg. He then shot Santiago in the face, killing him.[4] The murder received national as well as international attention due to the victim's young age.[5][6][7][8][9][10]\n"
    },
    {
        "link": "/wiki/Nancy_Schaefer",
        "title": "Nancy Schaefer",
        "date": "",
        "location": "",
        "paragraph": "Nancy Smith Schaefer (28 June 1936 – 26 March 2010[1]) was an American politician and conservative legislator who served in the Georgia State Senate from 2004 to 2008.\nBorn in Clayton, Georgia and of German descent, Schaefer went to the University of Georgia and the Atlanta College of Art. She then received her bachelor's degree from Wesleyan College.[1]\n"
    },
    {
        "link": "/wiki/Lloyd_Seay",
        "title": "Lloyd Seay",
        "date": "",
        "location": "",
        "paragraph": "Carl D. \"Lightning\" Lloyd Seay (December 14, 1919 – September 2, 1941) was an early stock car racing driver from Georgia. NASCAR founder Bill France Sr. described Seay as the \"best pure race driver I ever saw\".[1] He was shot to death by his cousin Woodrow Anderson over a moonshine operation. His last name was pronounced as \"See\".[2]\nSeay came from a racing family. His cousin Roy Hall was a racer who was the subject of the Jim Croce song \"Rapid Roy, that Stock Car Boy\".[3] Another cousin, Raymond Parks, was the owner of NASCAR's first Strictly Stock Series championship car.\n"
    },
    {
        "link": "/wiki/Murder_of_Maceo_Snipes",
        "title": "Murder of Maceo Snipes",
        "date": "",
        "location": "",
        "paragraph": "On July 18, 1946, Maceo Snipes, a United States Army WWII veteran, was fatally shot in the back just hours after casting his vote in the Georgia Democratic primary.[1][2] Snipes was the only African American to vote in a Democratic primary in Taylor County, Georgia. During this time, the white supremacist terrorist group KKK was in its prime. KKK members were responsible for multiple lynchings of black people who decided to vote following Snipes' murder. For example, two black couples were lynched five days later.[3] Prior to the election, the KKK had made threats to lynch any black person who dared cast a vote. Snipes and his mother were both sharecroppers on Homer Chapman's land in Butler, Georgia. The day after Snipes cast his vote, four white men pulled up to the land Chapman rented to Snipes' family. All four were suspected KKK members: two were later identified as Edward Williamson and Lynwood Harvey, both WWII veterans.[4]\nHaving pulled up outside Snipes' grandfather's house, the four white men asked Snipes' mother to call him outside. They then confronted him, and it ended with Williamson shooting Snipes in the back. After the men left, Snipes and his mother walked to Chapman's house. Chapman helped them walk 3 miles to the hospital in Butler. The hospital staff did not treat Snipes until six hours later. By then, he needed a blood transfusion. The staff claimed that they did not have any \"black blood\". Two days later, Snipes died in the hospital from his injuries. Williamson was an initial suspect in the investigation. In front of a coroner's jury, he claimed that Maceo owed him a $10 debt. Supposedly, Williamson and Harvey went to Snipes to confront him on his debt. Williamson said that Snipes had pulled out a knife, so he shot Snipes twice in the back, claiming self-defense. Coroner J.D. Cooke and a jury declared Williamson's actions as justified.[5] Williamson was exonerated on his charges on July 29, 1946.[6]\n"
    },
    {
        "link": "/wiki/Joseph_Standing",
        "title": "Joseph Standing",
        "date": "",
        "location": "",
        "paragraph": "Joseph Standing[1] (October 5, 1854 – July 21, 1879) was a missionary for the Church of Jesus Christ of Latter-day Saints (LDS Church) who was killed by a mob near the town of Varnell, Whitfield County, Georgia, in 1879.[2]\nBorn in Salt Lake City, Utah Territory, and a resident of Box Elder County, Utah, Standing was born to British immigrants James and Mary Standing. He was one of ten children. His father was a stonemason who worked on the Nauvoo and Logan Temples.[3][4][5][6] Prior to his missionary service, Joseph Standing was a fireman with the Wasatch Engine Company.[7] He was not married and had no children.[8]\n"
    },
    {
        "link": "/wiki/Emogene_Thompson",
        "title": "Michael Harold Chapel",
        "date": "",
        "location": "",
        "paragraph": "Michael Harold Chapel is a former Gwinnett County Georgia police officer, who was convicted in the 1993 murder of fifty-three-year-old Emogene Thompson outside a muffler shop on Peachtree Industrial Boulevard in Sugar Hill, Georgia.\nThompson, who lived in a trailer home with her son, reported to the Gwinnett County Police Department that about half of $14,000 in cash that was in her possession had been stolen. Chapel was the first to respond. He stated to her that because only part of the money was missing, he suspected her son. Thompson told several friends that she was planning to meet with Chapel after he told her he wanted to compare serial numbers on the bills. \n"
    },
    {
        "link": "/wiki/Randy_Thompson_(murder_victim)",
        "title": "Lynn Turner (murderer)",
        "date": "March 3, 1995 / January 22, 2001",
        "location": "",
        "paragraph": "Julia Lynn Turner[1] (July 16, 1968 – August 30, 2010),[2] originally Julia Lynn Womack, was an American convicted murderer. In 1995, her husband, Glenn Turner, died after allegedly being sick with the flu. In 2001, the death of what had been described as her common-law husband, Randy Thompson, under remarkably similar circumstances, aroused the suspicion of law enforcement. After investigation, it was determined by authorities that Lynn Turner had murdered both her husbands by poisoning them with ethylene glycol–based antifreeze. She was tried for Glenn Turner's murder in 2004. She was found guilty and went to trial in 2007 for the murder of Randy Thompson, ultimately being convicted. Turner died in prison on August 30, 2010.[3] The cause of death was an apparent suicide by toxic overdose of blood pressure medication.[4]\nJulia Lynn was adopted by the Womack family shortly after her birth mother gave her up. The Womacks divorced when Lynn was five, after which Helen Womack took custody of Lynn. Shortly afterwards, Helen Womack married again, and Lynn did not get on well with her new stepfather, D.L. Gregory. As a teenager, Lynn took to substance abuse and was admitted to a clinic in Atlanta for drug problems.\n"
    },
    {
        "link": "/wiki/John_A._Treutlen",
        "title": "John A. Treutlen",
        "date": "",
        "location": "",
        "paragraph": "\nJohn Adam Treutlen, born Hans Adam Treuettlen (January 16, 1734 – March 1, 1782), arrived in Colonial America as an indentured servant and rose to become a wealthy merchant and landowner. He was a leader in Georgia during the American Revolution and helped write Georgia's first constitution. In 1777, he was elected Georgia's first (post-British) governor. He was one of Georgia's few governors to die by violence. \n"
    },
    {
        "link": "/wiki/Hazel_%22Hayes%22_Turner",
        "title": "May 1918 lynchings",
        "date": "",
        "location": "",
        "paragraph": "On May 16, 1918, a plantation owner was murdered, prompting a manhunt which resulted in a series of lynchings in May 1918 in southern Georgia, United States. White people killed at least 13 black people during the next two weeks.[1] Among those killed were Hayes and Mary Turner. Hayes was killed on May 18, and the next day (May 19), his pregnant wife Mary was strung up by her feet, doused with gasoline and oil then set on fire. Mary's unborn child was cut from her abdomen and stomped to death. Her body was then repeatedly shot. No one was ever convicted of her lynching[citation needed].\nThese lynchings are examples of the racially-motivated mob violence by white people against black people in the American South, especially during 1880 to 1930, the peak of lynchings. Brooks County in Georgia, and Georgia among the states, had the highest rates of lynching in the nation during this period[citation needed].\n"
    },
    {
        "link": "/wiki/May_1918_lynchings",
        "title": "May 1918 lynchings",
        "date": "",
        "location": "",
        "paragraph": "On May 16, 1918, a plantation owner was murdered, prompting a manhunt which resulted in a series of lynchings in May 1918 in southern Georgia, United States. White people killed at least 13 black people during the next two weeks.[1] Among those killed were Hayes and Mary Turner. Hayes was killed on May 18, and the next day (May 19), his pregnant wife Mary was strung up by her feet, doused with gasoline and oil then set on fire. Mary's unborn child was cut from her abdomen and stomped to death. Her body was then repeatedly shot. No one was ever convicted of her lynching[citation needed].\nThese lynchings are examples of the racially-motivated mob violence by white people against black people in the American South, especially during 1880 to 1930, the peak of lynchings. Brooks County in Georgia, and Georgia among the states, had the highest rates of lynching in the nation during this period[citation needed].\n"
    },
    {
        "link": "/wiki/Maurice_Glenn_Turner",
        "title": "Lynn Turner (murderer)",
        "date": "March 3, 1995 / January 22, 2001",
        "location": "",
        "paragraph": "Julia Lynn Turner[1] (July 16, 1968 – August 30, 2010),[2] originally Julia Lynn Womack, was an American convicted murderer. In 1995, her husband, Glenn Turner, died after allegedly being sick with the flu. In 2001, the death of what had been described as her common-law husband, Randy Thompson, under remarkably similar circumstances, aroused the suspicion of law enforcement. After investigation, it was determined by authorities that Lynn Turner had murdered both her husbands by poisoning them with ethylene glycol–based antifreeze. She was tried for Glenn Turner's murder in 2004. She was found guilty and went to trial in 2007 for the murder of Randy Thompson, ultimately being convicted. Turner died in prison on August 30, 2010.[3] The cause of death was an apparent suicide by toxic overdose of blood pressure medication.[4]\nJulia Lynn was adopted by the Womack family shortly after her birth mother gave her up. The Womacks divorced when Lynn was five, after which Helen Womack took custody of Lynn. Shortly afterwards, Helen Womack married again, and Lynn did not get on well with her new stepfather, D.L. Gregory. As a teenager, Lynn took to substance abuse and was admitted to a clinic in Atlanta for drug problems.\n"
    },
    {
        "link": "/wiki/James_Vann",
        "title": "James Vann",
        "date": "",
        "location": "",
        "paragraph": "James Vann (c. 1762–64 – February 19, 1809) was an influential Cherokee leader, one of the triumvirate with Major Ridge and Charles R. Hicks, who led the Upper Towns of East Tennessee and North Georgia as part of the ᎤᏪᏘ ᏣᎳᎩ ᎠᏰᎵ (Uwet Tsalag Ayetl or Old Cherokee Nation).  He was the son of ᏩᎵ (Wali) Vann and Indian trader Joseph John Vann. He was born into his mother's Clan, ᎠᏂᎪᏓᎨᏫ (Anigodagewi or Wild Potato Clan, also called Blind Savannah Clan).[2]\nVann was among the younger leaders of the Old Cherokee Nation who thought its people needed to acculturate to deal with the European Americans and the United States government. He encouraged the Moravians to establish a mission school on Cherokee land, and became a wealthy plantation owner and slave owner.\n"
    },
    {
        "link": "/wiki/Berry_Washington",
        "title": "Berry Washington",
        "date": "",
        "location": "",
        "paragraph": "Berry Washington (c. 1847-May 26, 1919) was a 72 year old black man who was lynched in Milan, Georgia, in 1919. He was in jail after killing a white man who was attacking two young girls. He was taken from jail and lynched by a mob.\nAt 1:00 AM on the morning of May 24, 1919, two white men, John Dandy and Levi Evans, went into the black section of Milan. They first tried to get into the home of Emma McCollers who had two young daughters.[1] When the family refused to open the door Dandy fired his gun. This caused the girls to flee to another house, the home of widow Emma Tisber. The two men followed and invaded the Tisber home and attempted to assault two young black girls.[1] When the two girls attempted to hide under the porch, Dandy and Evans began ripping up the floor to get to them.[2] Washington, a black man, attempted to defend the girls and get the men to leave. Dandy fired at Washington and after a struggle, Washington, who was 72 years old, shot and killed Dandy, \"He fell with his\npistol in his right hand and a cigarette in the other, and a flask of liquor fell out of his pocket.\"[1]\n"
    },
    {
        "link": "/wiki/Watkinsville_lynching",
        "title": "Watkinsville lynching",
        "date": "",
        "location": "",
        "paragraph": "\nThe Watkinsville lynching was a mass lynching that occurred in Watkinsville, Georgia, United States on June 30, 1905. The lynching, which saw a large mob seize 9 men from a local jail and kill 8 of them by gunfire, has been described as \"one of the worst episodes of racial violence ever in Georgia.\"[1]\n"
    },
    {
        "link": "/wiki/Chris_Wright_(Canadian_football)",
        "title": "Chris Wright (Canadian football)",
        "date": "",
        "location": "",
        "paragraph": "Chris Wright (August 24, 1972 – July 31, 2005) was an award-winning Canadian Football League kick returner and Grey Cup champion.\nWright played college football at Georgia Southern. His first year as a professional was successful, for as kick returner with the Baltimore Stallions he scored 3 touchdowns on punt returns and added an 82-yard punt return for a touchdown in their Grey Cup victory.[1] This won him the Frank M. Gibson Trophy as best rookie in the CFL Southern Conference, and an all-star selection.\n"
    },
    {
        "link": "/wiki/1906_Atlanta_race_riot",
        "title": "1906 Atlanta race riot",
        "date": "September 22–24, 1906",
        "location": "Atlanta, Georgia",
        "paragraph": "\nViolent reprisals by armed mobs of White Americans against African Americans in Atlanta, Georgia, began after a group of black men raped 4 women on the evening of September 22, 1906, and lasted through September 24, 1906.[1] The events were reported by newspapers around the world, including the French Le Petit Journal which described the \"lynchings in the USA\" and the \"massacre of Negroes in Atlanta,\"[2] the Scottish Aberdeen Press & Journal under the headline \"Race Riots in Georgia,\"[3] and the London Evening Standard under the headlines \"Anti-Negro Riots\" and \"Outrages in Georgia.\"[4] The final death toll of the conflict is unknown and disputed, but officially at least 25 African Americans[5] and two whites died.[6] Unofficial reports ranged from 10–100 black Americans killed during the massacre.[7] According to the Atlanta History Center, some black Americans were hanged from lampposts; others were shot, beaten or stabbed to death. They were pulled from street cars and attacked on the street; white mobs invaded black neighborhoods, destroying homes and businesses.\n"
    },
    {
        "link": "/wiki/1912_racial_conflict_in_Forsyth_County,_Georgia",
        "title": "1912 racial conflict in Forsyth County, Georgia",
        "date": "",
        "location": "",
        "paragraph": "\nIn Forsyth County, Georgia, in September 1912 two separate alleged attacks on white women resulted in black men being accused as suspects. One white woman accused two black men of breaking into her home in Big Creek Community and one of raping her. Another teenage  woman was fatally beaten and raped in the Oscarville Community. Earnest Knox was linked to the Oscarville murder along with his half brother by a hair comb sold to him at the Oscarville store. When confronted, he confessed to the Sheriff and implicated his half brother and mother’s live-in boyfriend. His mother testified against the sons during the jury trial which sentenced both to hanging. 21 days later the sentence was carried out. \nIn the Big Creek assault, a black preacher and his congregation drove to Cumming to demand the release of the men being held for the rape of a young girl from the Big Creek Community. This resulted in a white counter mob showing up in confrontation. Tempers flared and the preacher was harshly beaten for having been heard to suggest that the first woman may have had a consensual relationship with a black man. The Forsyth County Sheriff locked the preacher inside the court house over night to protect him from the mob waiting outside. \n"
    },
    {
        "link": "/wiki/1956_Sugar_Bowl",
        "title": "1956 Sugar Bowl",
        "date": "January 2, 1956",
        "location": "New Orleans, Louisiana",
        "paragraph": "The 1956 Sugar Bowl featured the 7th ranked Georgia Tech Yellow Jackets, and the 11th ranked Pittsburgh Panthers. The game was played on January 2, since New Year's Day was a Sunday. Much controversy preceded the 1956 Sugar Bowl. Segregationists and Georgia governor Marvin Griffin used all his political power in an attempt to keep Pitt fullback/linebacker Bobby Grier from playing because he was black. But ultimately, Bobby Grier played making this the first integrated Sugar Bowl and is the first integrated bowl game in the Deep South.[1]\nThis game occurred during segregation battles in the south, including Brown v. Board of Education (1954) and the murder of Emmett Till (1955).  The Sugar Bowl had been racially segregated since its first inception in 1935.  No black players had ever taken the field in it.[2]  There were even different sections of the stadium set aside for black and white attendees.[3]  In the past, most Southern colleges (including Georgia Tech) were all-white and had an unofficial \"gentleman's agreement\" with integrated Northern schools in which the teams would only play against each other if the African American players on the team were benched for the game.[4]  By the 1950s, this agreement was starting to break down, with some Northern schools refusing to honor it and some Southern schools agreeing to play against integrated teams so long as the game took place in the North.  Many Southern schools responded to this shift by simply refusing to play Northern schools at all, resulting in a significant decline in inter-sectional gameplay.  The Bowl games, most of which took place in the South, became a focal point of contention.  The Cotton Bowl in Dallas held its first integrated game in 1948, and the Sun Bowl in El Paso held one in 1950.[5]  But up to 1956, most Southern games still remained strictly segregated.\n"
    },
    {
        "link": "/wiki/1967_Atlanta_riots",
        "title": "1967 Atlanta riots",
        "date": "June 17 – 20, 1967",
        "location": "Atlanta, Georgia",
        "paragraph": "The 1967 Atlanta riots were one of many riots during the Long, hot summer of 1967 lasting from June 17, 1967 to June 20. The riots started after a black male who was holding a beer can was denied from entering the Flamingo Grill by a security guard there at the Dixie Hills Shopping Center and a fight starting afterwards.[1]\nPrior to the riots, the Kerner Report described the city as being racially progressive but tense. Despite the city being racially progressive, there were strong segregationist elements in the city as well. The city had experienced significant growth after World War II through industrialization and annexations along with the city's non white population growing. By the time of the riots 44% of the city was non-white.^ [1]\n"
    },
    {
        "link": "/wiki/1970_Augusta_riot",
        "title": "1970 Augusta riot",
        "date": "May 11–12, 1970",
        "location": "Augusta, Georgia",
        "paragraph": "The Augusta Riot was a collective rebellion of Black citizens in Augusta, Georgia, and the largest urban uprising in the Deep South during the Civil Rights era. Fueled by long-simmering grievances about racial injustice, it was sparked by White officials’ stonewalling in the face of Black citizens’ demand for answers about the beating death of Black teenager Charles Oatman. At its height on the evening of May 11, 1970, two to three thousand people participated, ransacking and setting fire to White- and Chinese-American-owned businesses, damaging $1 million of property over a 130-block area.[1]  White police officers violently suppressed the riot, with the endorsement of Georgia governor Lester Maddox, shoot-to-kill orders from their captain, and reinforcements by the National Guard and State Patrol. Despite the suppression, the riot fundamentally shook the status quo, galvanizing a new wave of activism that opened economic and political doors for Augusta’s Black citizens.\nPolice brutality and severe poverty were deeply woven into the fabric of White supremacy in Augusta, and they showed no signs of weakening as a new decade dawned.[2]  Augusta’s Black organizations had different visions for bringing change: NAACP and SCLC chapters sought to expand on gains of the Civil Rights Movement, the Black Panther Party chapter and a cadre of Paine College students embraced the militancy and self-assertion of Black Power, and the Committee of Ten embodied a middle way, with a militant style but a focus on confronting White officials. Simmering tensions came to a head on the evening of May 9, when news began to circulate that Charles Oatman had been beaten to death in the county jail. The 16-year-old was a popular student at A.R. Johnson Junior High School. He was also mentally challenged. In a grim accident in late March, Oatman had fatally wounded his young niece in the kitchen of his family’s small house, but White authorities charged him with killing her and incarcerated him. Over the course of several weeks in the jail, he was brutally tortured and beaten, ultimately dying of his injuries. His badly mutilated body, with cigarette burns, marks from a fork, and a deep gash in the back of his head, was brought from the jail to University Hospital and then to Mays Mortuary on May 9.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_Charles_Atkins",
        "title": "Lynching of Charles Atkins",
        "date": "May 18, 1922",
        "location": "Davisboro, Washington County, Georgia",
        "paragraph": "Charles Atkins was a 15-year-old African-American boy who was lynched in Davisboro, Washington County, Georgia by a mob on May 18, 1922. According to the United States Senate Committee on the Judiciary it was the 25th of 61 lynchings during 1922 in the United States. [1]\nMrs. Elizabeth \"Billy\" Kitchens, 20, served as a rural mail carrier.[2] While driving her car, 4 miles (6.4 km) from Davisboro, someone pushed their way into her vehicle, placed a shotgun against her head and fired, killing her instantly. [3] Her body was then dragged 50 yards (46 m) away.[4] A local farmer, Sid Lewis, found the body 30 minutes after the shooting and informed Sheriff English at Sandersville, Georgia.\n"
    },
    {
        "link": "/wiki/Atlanta_prison_riots",
        "title": "Atlanta prison riots",
        "date": "November 13–23, 1987",
        "location": "United States Penitentiary, Atlanta, Georgia",
        "paragraph": "\nThe Atlanta prison riots were a series of prison riots that occurred at the U.S. Penitentiary in Atlanta, Georgia, United States in November 1987.  The riot coincided with a similar riot at the Federal Detention Center in Oakdale, Louisiana. \n"
    },
    {
        "link": "/wiki/Lynching_of_William_Byrd",
        "title": "Lynching of William Byrd",
        "date": "May 28, 1922",
        "location": "Brentwood, Wayne County, Georgia",
        "paragraph": "William Byrd was an African-American man who was lynched in Brentwood, Wayne County, Georgia by a mob on May 28, 1922. According to the United States Senate Committee on the Judiciary it was the 31st of 61 lynchings during 1922 in the United States. [1]\nA number of workers were employed to work on the farm of B.W. Moody, a well-off farmer who lived near Byrd. One of those who agreed to work at Moody's farm was Byrd's wife. She wanted to ride in the front of the truck to get to Moody's farm but Moody wouldn't let her. She complained of the slight to her husband, William Byrd.[2]  He went to confront Moody and the argument got out of control with Byrd allegedly shooting and killing Moody and seriously wounded Browning Weaver and Carlos Moody in the arm.[3] [4]\n"
    },
    {
        "link": "/wiki/Camilla_massacre",
        "title": "Camilla massacre",
        "date": "September 19, 1868",
        "location": "Camilla, Georgia",
        "paragraph": "The Camilla massacre took place in Camilla, Georgia, on Saturday, September 19, 1868. African Americans had been given the right to vote in Georgia's 1868 state constitution, which had passed in April, and in the months that followed, whites across the state used violence to combat their newfound political strength, often through the newly founded Ku Klux Klan. Georgia agents of the Freedmen’s Bureau recorded 336 cases of murder or assault with intent to kill against freedmen from January 1 through November 15.[1]\nThe massacre followed the expulsion of the Original 33 black members of the Georgia General Assembly earlier that month. Among those expelled was southwest Georgia representative Philip Joiner. On September 19, Joiner led a twenty-five-mile march of several hundred blacks (freedmen), as well as a few whites, from Albany, Georgia, to Camilla, the Mitchell County seat, to attend a Republican political rally on the courthouse square.[2] Estimates of the number of participants range from 150[3] to 300.[4]\n"
    },
    {
        "link": "/wiki/Dublin,_Georgia_riot",
        "title": "Dublin, Georgia riot",
        "date": "July 1919",
        "location": "Dublin, Georgia, United States",
        "paragraph": "The Dublin, Georgia riot of 1919 were a series of violent racial riots between white and black members of Dublin, Georgia.\nDuring a race riot local African-American, Rob Ashely, was accused in the murder of a white man and wounding another man on July 6, 1919. While in jail the local white community threatened to storm the jail and lynch Ashely. They were thwarted by an armed black community group that was formed to protect the jail and prevent a lynching.[1] Later a company of eighty home guards prevented further trouble, but for weeks the situation was tense.[2] [3]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Atlanta",
        "title": "George Floyd protests in Atlanta",
        "date": "May – June, 2020[note 1]",
        "location": "Atlanta, Georgia, United States",
        "paragraph": "\nThe George Floyd protests in Atlanta were a series of protests occurring in Atlanta, the capital and largest city of Georgia, United States. The protests were part of the George Floyd protests and, more broadly, the 2020–2021 United States racial unrest, which began shortly after the murder of George Floyd by police officer Derek Chauvin in Minneapolis on May 25, 2020. On May 26, protesting occurred in the Minneapolis–Saint Paul area and, over the next several weeks, protests spread to cities throughout the United States and then internationally.\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Georgia",
        "title": "George Floyd protests in Georgia",
        "date": "May 28, 2020 – April 2021",
        "location": "Georgia, United States",
        "paragraph": "\nA series of George Floyd protests took place in Georgia, United States, following the murder of George Floyd in 2020. 11 consecutive days of protests and rallies occurred in Atlanta through June 8, 2020.[3] Through July 2020, protests occurred in twenty various cities and communities in the state.\n"
    },
    {
        "link": "/wiki/Lynching_of_James_and_Alonzo_Green",
        "title": "Lynching of James and Alonzo Green",
        "date": "July 4, 1914",
        "location": "Jones County, Georgia",
        "paragraph": "Father and son Alonzo and James D. Green were innocent African-Americans lynched near Round Oak and Wayside, Jones County, Georgia in retaliation for the murder of popular white farmer Silas Hardin Turner on July 4, 1915. A third man, William Bostick was also lynched on this day.[1] None of those killed received a trial.\nAlonzo Green worked as an axeman in a local sawmill. He had married Cora in 1902 and had two children James D. (b. abt 1901) and Annie M. (b. abt 1903). White farmer Silas Hardin Turner was a prominent planter in Jones County, Georgia and the son of John D. Turner (1851-1930) and Mattie Hardin (1865-1946).\n"
    },
    {
        "link": "/wiki/History_of_Camilla,_Georgia",
        "title": "Camilla, Georgia",
        "date": "",
        "location": "",
        "paragraph": "\nCamilla is a city in Mitchell County, Georgia, United States, and is its county seat.[5]  As of the 2020 census, the city had a population of 5,187,[2] down from 5,360 in 2010.\n"
    },
    {
        "link": "/wiki/Jenkins_County,_Georgia,_riot_of_1919",
        "title": "Jenkins County, Georgia, riot of 1919",
        "date": "April 13, 1919",
        "location": "Carswell Grove Baptist Church and Cemetery, Jenkins County, Georgia",
        "paragraph": "The Jenkins County riot of 1919 took place on Sunday, April 13, 1919, when a series of misunderstandings and out-of-control events spiralled into two white police officers being killed. In retaliation the local white community formed mobs and ravaged the black community, burning black community buildings and killing at least four people.\nThe event began at Carswell Grove Baptist Church, a black church, which was celebrating its anniversary. Preachers from several counties were coming, the Knights of Pythias were present in uniform,[2] the choir was giving a special performance, and a cookout would follow.[3]: 1  More than 3,000 were expected; it was one of the largest gatherings in east Georgia.[3]: 1–2 \n"
    },
    {
        "link": "/wiki/Lynching_of_Paul_Jones",
        "title": "Lynching of Paul Jones",
        "date": "November 2, 1919",
        "location": "Macon, Georgia",
        "paragraph": "Paul Jones[a] was lynched on November 2, 1919, after being accused of attacking a fifty-year-old white woman in Macon, Georgia.\nOn Sunday, November 2, 1919, Paul Jones allegedly attacked a white woman about 2 miles (3.2 km) outside of Macon.[2] Paul Jones was chased through town until he was cornered in a rail boxcar, there the woman positively identified him.[3] A white mob of 400 people quickly assembled and over the protests of Sheriff James R. Hicks they seized Jones. His body was riddled with bullets after being lynched,[4] \"saturated with coal oil\" and lit on fire.[5] He was still alive as the flames consumed his body and the mob watched as he writhed in pain.[1]  There were no arrests.\n"
    },
    {
        "link": "/wiki/Lynching_of_Will_Jones",
        "title": "Lynching of Will Jones",
        "date": "February 13, 1922",
        "location": "Ellaville, Schley County, Georgia",
        "paragraph": "Will Jones was an African-American man who was lynched in Ellaville, Schley County, Georgia by a white mob on February 13, 1922. According to the United States Senate Committee on the Judiciary it was the 13th of 61 lynchings during 1922 in the United States. [1]\n28-year-old Will Jones lived on a farm occupied by the landowner widow Mrs. Dora Fulford, mother-in-law of Bennie DeVane one of the accused and was regarded as an upstanding citizen by the community. News coverage at the time gave no official reason for the lynching but implied it might have been either Jones was going to report on the bootlegging that was going on in the area or that Will Jones came to the defence of 26-year-old African-American man Floyd Flournoy who had insulted Jessie Mae Devane, by asking for a ride in her buggy.[2] [3]\n"
    },
    {
        "link": "/wiki/Laurens_County,_Georgia_race_riot_of_1919",
        "title": "Laurens County, Georgia race riot of 1919",
        "date": "August 27-29, 1919",
        "location": "Laurens County, Georgia, United States",
        "paragraph": "The Laurens County, Georgia race riot was an attack on the black community by white mobs in August of 1919. In the Haynes' report, as summarized in the New York Times, it is called the Ocmulgee, Georgia race riot.[1]\nEarlier in the summer the incident surrounding the Dublin, Georgia riot had greatly alarmed the white community in Laurens County. Even more alarming was a rumour that a Black leader was promising to \"rise up and wipe out the white people.\"[2]\n"
    },
    {
        "link": "/wiki/Putnam_County,_Georgia,_arson_attack",
        "title": "Putnam County, Georgia, arson attack",
        "date": "May 27, 1919",
        "location": "Putnam County, Georgia, United States",
        "paragraph": "The Putnam County, Georgia arson attack was an attack on the black community by white mobs in May of 1919.\nFrom the night of Tuesday, May 27, 1919 until Wednesday, May 28,1919, morning arsonists burned down at least six black churches and multiple black community buildings in and around Eatonton.[1] The Wheeling Intelligencer claimed the buildings were burnt down because of a \"minor racial clash at Dennis Station\" when a black man was refused a bottle of soda water.[2] The community raised $1,100 ($17,200 in 2023) reward for any information about the people responsible for the fires.[2]\n"
    },
    {
        "link": "/wiki/Lynching_of_Paul_Reed_and_Will_Cato",
        "title": "Lynching of Paul Reed and Will Cato",
        "date": "",
        "location": "",
        "paragraph": "The lynching of Paul Reed and Will Cato occurred in Statesboro, Georgia on August 16, 1904. Five members of a white farm family, the Hodges, had been murdered and their house burned to hide the crime. Paul Reed and Will Cato, who were African-American, were tried and convicted for the murders. Despite militia having been brought in from Savannah to protect them, the two men were taken by a mob from the courthouse immediately after their trials, chained to a tree stump, and burned. In the immediate aftermath, four more African-Americans were shot, three of them dying, and others were flogged.\nHenry Hodges was a farmer in Bulloch County, Georgia, living about 6 miles (9.7 km) from Statesboro, the county seat. His farm house burned down on the night of Thursday, July 28, 1904. The next day, the bodies of Hodges, his wife Claudia, their nine-year-old daughter Kitty Corrine, two-year-old son Harmon, and six-month-old son Talmadge were found in the burned house. The remains of the five victims were buried in a single coffin the next day.[1][2]\n"
    },
    {
        "link": "/wiki/Southern_bread_riots",
        "title": "Southern bread riots",
        "date": "April 2, 1863; 159 years ago (1863-04-02)",
        "location": "Confederacy",
        "paragraph": "\nThe Southern bread riots were events of civil unrest in the Confederacy during the American Civil War, perpetrated mostly by women in March and April 1863. During these riots, which occurred in cities throughout the South, hungry women and men invaded and looted various shops and stores.\n"
    },
    {
        "link": "/wiki/University_of_Georgia_desegregation_riot",
        "title": "University of Georgia desegregation riot",
        "date": "",
        "location": "",
        "paragraph": "\nCity of Albany\n"
    },
    {
        "link": "/wiki/Berry_Washington",
        "title": "Berry Washington",
        "date": "",
        "location": "",
        "paragraph": "Berry Washington (c. 1847-May 26, 1919) was a 72 year old black man who was lynched in Milan, Georgia, in 1919. He was in jail after killing a white man who was attacking two young girls. He was taken from jail and lynched by a mob.\nAt 1:00 AM on the morning of May 24, 1919, two white men, John Dandy and Levi Evans, went into the black section of Milan. They first tried to get into the home of Emma McCollers who had two young daughters.[1] When the family refused to open the door Dandy fired his gun. This caused the girls to flee to another house, the home of widow Emma Tisber. The two men followed and invaded the Tisber home and attempted to assault two young black girls.[1] When the two girls attempted to hide under the porch, Dandy and Evans began ripping up the floor to get to them.[2] Washington, a black man, attempted to defend the girls and get the men to leave. Dandy fired at Washington and after a struggle, Washington, who was 72 years old, shot and killed Dandy, \"He fell with his\npistol in his right hand and a cigarette in the other, and a flask of liquor fell out of his pocket.\"[1]\n"
    },
    {
        "link": "/wiki/2021_Atlanta_spa_shootings",
        "title": "2021 Atlanta spa shootings",
        "date": "March 16, 2021 (2021-03-16) c. 4:50 p.m. EDT (20:50 UTC)",
        "location": "Atlanta and unincorporated Cherokee County, Georgia, United States",
        "paragraph": "\nOn March 16, 2021, a shooting spree occurred at three spas or massage parlors in the metropolitan area of Atlanta, Georgia, United States. Eight people were killed, six of whom were women of Asian descent,[3] and one other person was wounded.\n"
    },
    {
        "link": "/wiki/Atlantic_Station_shooting",
        "title": "Atlantic Station shooting",
        "date": "",
        "location": "",
        "paragraph": "Two young men were shot dead near Atlantic Station in Atlanta, Georgia on Nov. 26, 2022. Zyion Charles, a 12-year-old boy, died at the scene, and six others were wounded.[1] Four or five days later, another 15-year-old boy, Cameron Jackson, died from his injuries. The shooting was suspected by Atlanta Police to have had gang overtones, and Charles was allegedly a gang member. Two persons of interests were caught on camera allegedly celebrating the shooting by making positive hand gestures, such as making fist bumps and showing excited emotions; however,  no suspects have been identified or arrested.\n"
    }
]