[
    {
        "link": "/wiki/1999_Honolulu_shootings",
        "title": "1999 Honolulu shootings",
        "date": "November 2, 1999 8:00 a.m. (HST)",
        "location": "1200 N. Nimitz Highway Honolulu, Hawaii 96817 United States",
        "paragraph": "\nThe 1999 Honolulu shootings or the Xerox murders were an incident of mass murder that occurred on November 2, 1999, in a Xerox Corporation building in Honolulu, Hawaii, United States.  Service technician Byran Koji Uyesugi shot at eight people; wounding seven fatally (six co-workers and his supervisor). This was the worst mass shooting in the history of Hawaii.\n"
    },
    {
        "link": "/wiki/1996_Honolulu_hostage_crisis",
        "title": "1996 Honolulu hostage crisis",
        "date": "February 6, 1996; 26 years ago (1996-02-06) c. 7:00 a.m. – c. 2:30 p.m. (UTC-10)",
        "location": "Sand Island, Honolulu, Hawaii, U.S.",
        "paragraph": "\nThe 1996 Honolulu hostage crisis occurred on February 6, 1996, in Sand Island, Honolulu, Hawaii, when 28-year-old John Miranda took hostages at the Seal Masters of Hawaii building, his former place of employment. During the hostage crisis, two hostages were injured, one seriously. Miranda was the only fatality during the crisis itself. However, a few weeks after the event, he was found to have murdered his former girlfriend prior to the crisis.[1]\n"
    },
    {
        "link": "/wiki/Isaac_Davis_(advisor)",
        "title": "Isaac Davis (advisor)",
        "date": "",
        "location": "",
        "paragraph": "\nIsaac Davis (c. 1758–1810) was a Welsh advisor to Kamehameha I, who recruited him to help conquer the other kingdoms in Hawaii, resulting in formation of the Kingdom of Hawaii. He arrived in Hawaii in 1790 as the sole survivor of the massacre of the crew of the Fair American.  Davis and John Young became friends and advisors to Kamehameha. Davis brought western military knowledge to Hawaii and played a prominent role during Hawaii's first contacts with the European powers. He spent the rest of his life in Hawaiʻi and was known as ʻAikake.\n"
    },
    {
        "link": "/wiki/Katsu_Goto",
        "title": "Katsu Goto",
        "date": "",
        "location": "",
        "paragraph": "Katsu (or Jun) Goto (後藤濶) (née Kobayakawa) (1862–1889) was a Japanese merchant, interpreter, and lynching victim.[1] He was the leader of a fledgling Japanese community in Honokaa.\nGoto was born in Kokufu-mura, Naka District, Kanagawa Prefecture. He was the eldest son of Izaemon Kobayakawa.  He had three brothers and two sisters.[2] After receiving an education, Goto worked as a city employee at the Port of Yokohama.  It was there that he learned the English language.[3]\n"
    },
    {
        "link": "/wiki/Joseph_Kahahawai",
        "title": "Joseph Kahahawai",
        "date": "",
        "location": "",
        "paragraph": "Joseph \"Joe\" Kahahawai Jr. (25 December 1909 – 8 January 1932) was a Native Hawaiian prizefighter accused of the rape of Thalia Massie. He was abducted and killed after an inconclusive court case ended with a hung jury mistrial.[1][2]\nKahahawai was born in rural Maui, 25 December 1909. His family moved to Honolulu and Kahahawai's parents divorced. He lived with his mother, who later remarried, while Kahahawai remained in contact with his father. He lived in the Kalihi-Palama area where he was part of the Kauluwela gang, in this case \"gang\" was simply known as a group of friends. After attending Kauluwela school, Kahahawai attended Saint Louis School through an athletic scholarship to play for the high school football team, building up a positive reputation. Due to the Great Depression, Kahahawai never graduated and worked various jobs. He also enlisted in the Territorial National Guard. As a boxer, Kahahawai fought both professionally under the name \"Joe Kalani\" and as a member of the 298th Infantry Regiment.[3]: 99 \n"
    },
    {
        "link": "/wiki/Kamokuiki",
        "title": "Kamokuiki",
        "date": "",
        "location": "",
        "paragraph": "Kamokuiki (c. 1795 – September 26, 1840) was a grandmother of the last two ruling monarchs of the Kingdom of Hawaii.\nKamokuiki was born about 1795 as a daughter of the chief Kanepawale, son of Kaʻihelemoana and Kaʻopa, and his wife chiefess Uaua, daughter of Kaʻehunuiamamaliʻi and Koʻi. Her grandfather's sister was Hikuikekualono, the mother of Kahaopulani, who according to legend hid and nursed the baby Kamehameha I during his infancy when he was being hunted down by Alapainui.[2]\n"
    },
    {
        "link": "/wiki/Roland_Kotani",
        "title": "Roland Kotani",
        "date": "",
        "location": "",
        "paragraph": "\nRoland M. Kotani (June 15, 1954 – July 28, 1989) was an American politician and Democratic member of the Hawaii State House of Representatives. Kotani served as assistant majority floor leader and represented the Pearl City Pacific Palisades area.[1][2]\n"
    },
    {
        "link": "/wiki/Jane_Stanford",
        "title": "Jane Stanford",
        "date": "",
        "location": "",
        "paragraph": "\nJane Elizabeth Lathrop Stanford (August 25, 1828 – February 28, 1905) was an American philanthropist, co-founder of Stanford University in 1885 (opened 1891) along with her husband, Leland Stanford, as a memorial to their only child, Leland Stanford Jr., who died of typhoid fever in 1884 at the age of 15. After her husband's death in 1893, she funded and operated the university almost single-handedly until her unsolved murder by strychnine poisoning in 1905.\n"
    },
    {
        "link": "/wiki/Masumi_Watanabe",
        "title": "Kirk Lankford",
        "date": "",
        "location": "",
        "paragraph": "Kirk Matthew Lankford (born 1985) is an American from Kalihi, Hawaii who was convicted of murdering a Japanese tourist in Pūpūkea, Hawaii.\nOn April 12, 2007, Japanese tourist Masumi Watanabe disappeared in Pūpūkea.[1] Lankford was arrested and charged with second-degree murder on April 26, 2007, after police found blood and items belonging to Watanabe in his pickup truck.[1] Watanabe's body was never found, but the blood in Lankford's truck was determined to have been Watanabe's.\n"
    },
    {
        "link": "/wiki/1895_Wilcox_rebellion",
        "title": "1895 Wilcox rebellion",
        "date": "January 6–9, 1895",
        "location": "Oahu, Hawaii",
        "paragraph": "Republic of Hawaii victory\nThe 1895 Wilcox rebellion, or the Counter-Revolution of 1895[note 1] was a brief war from January 6 to January 9, 1895, that consisted of three battles on the island of Oʻahu, Republic of Hawaii. It was the last major military operation by royalists who opposed the overthrow of the Kingdom of Hawaii.\n"
    },
    {
        "link": "/wiki/Hawaiian_insurgents",
        "title": "Hawaiian Kingdom",
        "date": "",
        "location": "",
        "paragraph": "\nThe Hawaiian Kingdom, or Kingdom of Hawaiʻi (Hawaiian: Ko Hawaiʻi Pae ʻĀina), was a sovereign state located in the Hawaiian Islands. The country was formed in 1795, when the warrior chief Kamehameha the Great, of the independent island of Hawaiʻi, conquered the independent islands of Oʻahu, Maui, Molokaʻi and Lānaʻi and unified them under one government. In 1810, the whole Hawaiian archipelago became unified when Kauaʻi and Niʻihau joined the Hawaiian Kingdom voluntarily. Two major dynastic families ruled the kingdom: the House of Kamehameha and the House of Kalākaua.\n"
    },
    {
        "link": "/wiki/Clarence_W._Ashford",
        "title": "Clarence W. Ashford",
        "date": "",
        "location": "",
        "paragraph": "Clarence Wilder Ashford (February 24, 1857 – July 3, 1921) was the Attorney General of the Hawaiian Kingdom under Kalākaua from 1887 to 1890 and later appointed circuit court judge during the Territory of Hawaii from 1914 to 1919.[1]\nHe was born in Ontario, Canada, and a cousin to Minister of the Interior Samuel Gardner Wilder. He and his brother Volney V. Ashford became involved with the Honolulu Rifles during the 1887 coup against King Kalākaua. He served in the cabinet of Kalākaua and later the House of Representative in the Hawaiian legislature of his successor Queen Liliuokalani from 1892 until the 1893 overthrow of the Hawaiian Kingdom.[2][3] Both brothers were exiled to San Francisco after the 1895 counter-revolution to restore the monarchy. Clarence returned to Hawaii after its annexation by the United States.[4][5]\n"
    },
    {
        "link": "/wiki/Volney_V._Ashford",
        "title": "Volney V. Ashford",
        "date": "",
        "location": "",
        "paragraph": "Volney Vallencourt \"V.V.\" Ashford (1844 – 21 March 1900) was an American soldier and involved in 19th-century rebellion in Hawaii.\nAshford joined the Union Army in 1863 after leaving his home in Port Hope, Ontario. He was a British citizen since Canada was a territory of the United Kingdom. He became a Quartermaster Sergeant in the Grizwold Light Cavalry during the American Civil War. After the Civil War, Ashford, became a surveyor for the Beaverton railway and joined the Prince of Wales' Canadian Dragoons where he made Captain.[2] He was widowed twice in addition to the death of his daughter.  In 1884 his brother and future Attorney General of Hawaii, Clarence W. Ashford, invited him to visit Honolulu. After moving to Hawaii he joined the Honolulu Rifles, a militia. Ashford became responsible for the Rifles' growth from 100 men in 1886 to a battalion of three companies in 1887 and recognition as a paramilitary force. He rapidly moved up the ranks entering with his Canadian rank of Captain, he rose through Major and Lieutenant Colonel becoming Colonel in 1887, the highest rank and commander of the Rifles itself.\n"
    },
    {
        "link": "/wiki/Robert_Napu%CA%BBuako_Boyd",
        "title": "Robert Napuʻuako Boyd",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Napuʻuako Boyd[a] ([ˈɹɑb.ɚt napuʔuako boyd]; September 2, 1864 – September 9, 1914) was a Native Hawaiian insurgent leader during the latter years of the Kingdom of Hawaii. Educated under the government-funded study program of King Kalākaua, he attended the Royal Naval Academy at Livorno in Italy. He became a friend of Robert William Wilcox, another Hawaiian student enrolled at Turin. They were both recalled back in Hawaii after the government stopped funding their education. Back home, he participated with Wilcox in the unsuccessful Wilcox rebellion of 1889 aimed at restoring political power to the king.\n"
    },
    {
        "link": "/wiki/John_Adams_Cummins",
        "title": "John Adams Cummins",
        "date": "",
        "location": "",
        "paragraph": "\nJohn Adams Kuakini Cummins (March 17, 1835 – March 21, 1913) was a member of the nobility of the Kingdom of Hawaii who became a wealthy businessman, and was involved in politics as the kingdom was overthrown.\n"
    },
    {
        "link": "/wiki/William_Henry_Daniels",
        "title": "William Henry Daniels",
        "date": "",
        "location": "",
        "paragraph": "William Henry Daniels (June 2, 1855 – April 17, 1897) was a judge, lawyer, and businessman of Wailuku, Maui during the Kingdom of Hawaii. He was declined reappointment to his office as district magistrate for refusing to take an oath to the Provisional Government of Hawaii and was arrested by the Republic of Hawaii for suspected involvement in the 1895 Counter-Revolution in Hawaii.[1][2][3]\nWilliam Henry Daniels was born on June 2, 1855, at Wailuku, on the island of Maui, of Native Hawaiian and British descent.[4] His father was Henry Wilson Daniels (1817–1879), the English-born circuit judge of Maui, and his mother was the British-Hawaiian Nancy Hannah Kamaekalani Copp (1835–1875), who married Judge Daniels on August 7, 1852 at Hana.[5][6][7] One of his sisters, Emma Daniels (1857–1906), was the wife of Colonel John Dominis Holt.[5]\n"
    },
    {
        "link": "/wiki/Charles_T._Gulick",
        "title": "Charles T. Gulick",
        "date": "",
        "location": "",
        "paragraph": "\nCharles Thomas Gulick (July 25, 1841 – November 7, 1897) was a Kingdom of Hawaiʻi politician and one of the few members of the various missionary families of the time to side with the monarchy in the 1893 overthrow of the Kingdom of Hawaiʻi.\n"
    },
    {
        "link": "/wiki/Jonah_K%C5%ABhi%C5%8D_Kalaniana%CA%BBole",
        "title": "Jonah Kūhiō Kalanianaʻole",
        "date": "",
        "location": "",
        "paragraph": "\nJonah Kūhiō Kalanianaʻole (March 26, 1871 – January 7, 1922) was a prince of the Kingdom of Hawaiʻi until it was overthrown by a coalition of American and European businessmen in 1893. He later went on to become a representative in the Territory of Hawaii as delegate to the United States Congress, and as such is the only member of Congress ever born into royalty.[1]\n"
    },
    {
        "link": "/wiki/David_Kaw%C4%81nanakoa",
        "title": "David Kawānanakoa",
        "date": "",
        "location": "",
        "paragraph": "\nDavid Laʻamea Kahalepouli Kinoiki Kawānanakoa (February 19, 1868 – June 2, 1908) was a prince of the Hawaiian Kingdom and founder of the House of Kawānanakoa. Born into Hawaiian nobility, Kawānanakoa grew up the royal court of his uncle King Kalākaua and aunt Queen Kapiʻolani who adopted him and his brothers after the death of their parents. On multiple occasions, he and his brothers were considered as candidates for the line of succession to the Hawaiian throne after their cousin Princess Kaʻiulani but were never constitutionally proclaimed. He was sent to be educated abroad in the United States and the United Kingdom where he pioneered the sport of surfing. After his education abroad, he served as a political advisor to Kalākaua's successor, Queen Liliʻuokalani until the overthrow of the Hawaiian Kingdom in 1893. After Hawaii's annexation to the United States, he co-founded the Democratic Party of Hawaii.\n"
    },
    {
        "link": "/wiki/John_C._Lane",
        "title": "John C. Lane",
        "date": "",
        "location": "",
        "paragraph": "Revolution of 1895\nJohn Awena-ika-lani-keahi-o-ka-lua-o-Pele Carey Lane, (July 22, 1872 – February 8, 1958) was Mayor of Honolulu from 1915 to 1917.\n"
    },
    {
        "link": "/wiki/Lot_Lane",
        "title": "Lot Lane",
        "date": "",
        "location": "",
        "paragraph": "\nLot Lonoikaua Kamehameha Carey Lane (1864–1953) was the last insurgent to be captured by government forces after the Uprising of 1895 in Hawaii. He advocated better treatment for prisoners of war by the Republic of Hawaii, while being incarcerated himself.\n"
    },
    {
        "link": "/wiki/George_Lycurgus",
        "title": "George Lycurgus",
        "date": "",
        "location": "",
        "paragraph": "George Lycurgus (Greek: Γεώργιος Λυκούργος) (1858–1960) was a Greek American businessman who played an influential role in the early tourist industry of Hawaii. After Queen Lili`uokalani was overthrown[1] in a coup by the Committee Of Safety, he ran afoul of the government of the Republic of Hawaii and was accused of treason. Later he was instrumental in the development of the Hawaiian Volcano Observatory and Hawaiʻi Volcanoes National Park.\nHe was born in 1858 in Vassaras (near Sparta, Greece). After his release from the Greek Army, his father decided to leave the family farm to an older brother and agreed to send George to America to join his eldest brother John, in California. In 1877 he traveled in steerage class to New York City, and worked his way across the country.[2]\nA relative convinced him to join a wholesale fruit business trading between Hawaii and California in 1881. In San Francisco he shipped California produce and wine to his cousin in Honolulu, who shipped Hawaiian bananas to the mainland. Through friends he learned of a small oyster house that was for sale in Sausalito and he was able to buy it.  He named it the Oyster Grotto.[3]  By 1881, the Grotto came to be patronized by such notables as William Randolph Hearst and the sons of the sugar cane baron, Claus Spreckels. He became friends with the sons of Claus Spreckels, whose family owned the Oceanic Steamship Company and a sugar cane business in Hawaii.\nIn 1889 he was supervising shipment being loaded at the docks, when some of the Spreckels family invited him on board for a poker game. By the time he noticed, the ship was on its way across the Pacific. He spent only a week in Hawaii, but must have enjoyed the stay, since he took more trips and spent more time on the islands.\n"
    },
    {
        "link": "/wiki/Emma_N%C4%81wah%C4%AB",
        "title": "Emma Nāwahī",
        "date": "",
        "location": "",
        "paragraph": "\nEmma ʻAʻima Aʻii Nāwahī (September 28, 1854 – December 28, 1935) was a Native Hawaiian political activist, community leader and newspaper publisher. She and her husband Joseph Nāwahī were leaders in the opposition to the overthrow of the Kingdom of Hawaiʻi and they co-founded Ke Aloha Aina, a Hawaiian language newspaper, which served as an important voice in the resistance to the annexation of Hawaiʻi to the United States.[1][2][3] After annexation, she helped establish the Democratic Party of Hawaiʻi and became a supporter of the women's suffrage movement.\n"
    },
    {
        "link": "/wiki/Joseph_N%C4%81wah%C4%AB",
        "title": "Joseph Nāwahī",
        "date": "",
        "location": "",
        "paragraph": "\nJoseph Kahoʻoluhi Nāwahī (January 13, 1842 – September 14, 1896), also known by his full Hawaiian name Iosepa Kahoʻoluhi Nāwahīokalaniʻōpuʻu, was a Native Hawaiian nationalist leader, legislator, lawyer, newspaper publisher, and painter. Through his long political service during the monarchy and the important roles he played in the resistance and opposition to its overthrow, Nāwahī is regarded as an influential Hawaiian patriot.\n"
    },
    {
        "link": "/wiki/Arthur_P._Peterson",
        "title": "Arthur P. Peterson",
        "date": "",
        "location": "",
        "paragraph": "\nArthur Porter Peterson (November 21, 1858 – March 16, 1895) was a lawyer and politician of the Kingdom of Hawaii. He served two separate terms as Attorney General of Hawaii and was a member of Queen Liliuokalani's last cabinet before the Overthrow of the Kingdom of Hawaii. He was arrested and jailed by the Republic of Hawaii in the aftermath of the 1895 Counter-Revolution and then exiled to San Francisco where he died of pneumonia.\n"
    },
    {
        "link": "/wiki/Samuel_K._Pua",
        "title": "Samuel K. Pua",
        "date": "",
        "location": "",
        "paragraph": "\nSamuel Kaholoʻokalani Pua[1] (October 27, 1867 – August 1, 1932) was a Native Hawaiian politician, newspaper editor, lawyer and sheriff of Hawaii. He served as a legislator during the last years of the Kingdom of Hawaii and worked as an assistant editor for the anti-annexationist newspaper Ke Ahailono o Hawaii (translated as The Hawaiian Herald) ran by members of Hui Kālaiʻāina (Hawaiian Political Association), after the overthrow of the monarchy. After the annexation, he became a sheriff during the Territory of Hawaii.\n"
    },
    {
        "link": "/wiki/William_P%C5%ABnohu_White",
        "title": "William Pūnohu White",
        "date": "",
        "location": "",
        "paragraph": "\nWilliam Pūnohuʻāweoweoʻulaokalani White (Hawaiian pronunciation: [puːnohuˌʔaːweoaːweoˌʔuləokəˈlɐni]; August 6, 1851 – November 2, 1925) was a Hawaiian lawyer, sheriff, politician, and newspaper editor. He became a political statesman and orator during the final years of the Kingdom of Hawaii and the beginnings of the Territory of Hawaii. Despite being a leading Native Hawaiian politician in this era, his legacy has been largely forgotten or portrayed in a negative light, mainly because of a reliance on English-language sources to write Hawaiian history. He was known by the nickname of \"Pila Aila\" or \"Bila Aila\" (translated as Oily Bill) for his oratory skills.[1][2]\n"
    },
    {
        "link": "/wiki/Robert_William_Wilcox",
        "title": "Robert William Wilcox",
        "date": "",
        "location": "",
        "paragraph": "Robert William Kalanihiapo Wilcox (February 15, 1855 – October 23, 1903),[2] nicknamed the Iron Duke of Hawaiʻi, was a Native Hawaiian whose father was an American and whose mother was Hawaiian. A revolutionary soldier and politician, he led uprisings against both the government of the Hawaiian Kingdom under King Kalākaua and the Republic of Hawaii under Sanford Dole, what are now known as the Wilcox rebellions. He was later elected the first delegate to the United States Congress for the Territory of Hawaii.\nWilcox was born February 15, 1855, on the island of Maui. His father, Captain William Slocum Wilcox (1814[3]–1910[4]) was a native of Newport, Rhode Island. His mother was a native of Maui,[5] named Kalua. She was the daughter of Makole and Haupa. Makole was the great grandson of Keaweʻīkekahialiʻiokamoku.[6] Wilcox's grandmother, Haupa, was descended from Umi-a-Liloa of Maui (not to be confused with the king of Hawaii Island) and Lonomakaihonua.[6]\n"
    },
    {
        "link": "/wiki/John_H._Wilson_(Hawaii_politician)",
        "title": "John H. Wilson (Hawaii politician)",
        "date": "",
        "location": "",
        "paragraph": "John Henry Wilson (December 15, 1871 – July 3, 1956), was a civil engineer, insurgent, co-founder of the Democratic Party of Hawaii, and Mayor of Honolulu, Hawaii three times:  from 1920 to 1927, from 1929 to 1931, and from 1946 to 1954.\nWilson was born in Honolulu, Hawaii in 1871. His father was Charles B. Wilson (1850–1926), whose ethnic background was Scottish and Tahitian. C.B. Wilson was superintendent of the water works and fire chief under King Kalākaua, and was Marshal of the Kingdom under Queen Liliʻuokalani.[2]\nHis mother was three quarters of European descent and one quarter Hawaiian Eveline M. \"Kitty or Kittie\" Townsend, granddaughter of Captain Henry Blanchard of the ship Thaddeus which had brought the first missionaries of the American Board of Commissioners for Foreign Missions to Hawaii in 1820.\n"
    },
    {
        "link": "/wiki/Clarence_W._Ashford",
        "title": "Clarence W. Ashford",
        "date": "",
        "location": "",
        "paragraph": "Clarence Wilder Ashford (February 24, 1857 – July 3, 1921) was the Attorney General of the Hawaiian Kingdom under Kalākaua from 1887 to 1890 and later appointed circuit court judge during the Territory of Hawaii from 1914 to 1919.[1]\nHe was born in Ontario, Canada, and a cousin to Minister of the Interior Samuel Gardner Wilder. He and his brother Volney V. Ashford became involved with the Honolulu Rifles during the 1887 coup against King Kalākaua. He served in the cabinet of Kalākaua and later the House of Representative in the Hawaiian legislature of his successor Queen Liliuokalani from 1892 until the 1893 overthrow of the Hawaiian Kingdom.[2][3] Both brothers were exiled to San Francisco after the 1895 counter-revolution to restore the monarchy. Clarence returned to Hawaii after its annexation by the United States.[4][5]\n"
    },
    {
        "link": "/wiki/Volney_V._Ashford",
        "title": "Volney V. Ashford",
        "date": "",
        "location": "",
        "paragraph": "Volney Vallencourt \"V.V.\" Ashford (1844 – 21 March 1900) was an American soldier and involved in 19th-century rebellion in Hawaii.\nAshford joined the Union Army in 1863 after leaving his home in Port Hope, Ontario. He was a British citizen since Canada was a territory of the United Kingdom. He became a Quartermaster Sergeant in the Grizwold Light Cavalry during the American Civil War. After the Civil War, Ashford, became a surveyor for the Beaverton railway and joined the Prince of Wales' Canadian Dragoons where he made Captain.[2] He was widowed twice in addition to the death of his daughter.  In 1884 his brother and future Attorney General of Hawaii, Clarence W. Ashford, invited him to visit Honolulu. After moving to Hawaii he joined the Honolulu Rifles, a militia. Ashford became responsible for the Rifles' growth from 100 men in 1886 to a battalion of three companies in 1887 and recognition as a paramilitary force. He rapidly moved up the ranks entering with his Canadian rank of Captain, he rose through Major and Lieutenant Colonel becoming Colonel in 1887, the highest rank and commander of the Rifles itself.\n"
    },
    {
        "link": "/wiki/James_Henderson_Blount",
        "title": "James Henderson Blount",
        "date": "",
        "location": "",
        "paragraph": "James Henderson Blount (September 12, 1837 – March 8, 1903) was an American statesman, soldier and congressman from Georgia. He opposed the annexation of Hawaii in 1893 in his investigation into the American involvement in the political revolution in the Kingdom of Hawai'i.\nBlount was born near Clinton, Jones County, Georgia. He attended private schools there and in Tuscaloosa, Alabama. He graduated from the University of Georgia at Athens in 1858. He studied law and was admitted to the Georgia bar in 1859. During the American Civil War he served in the Confederate States Army as a private in the Second Georgia Battalion, Floyd Rifles for two years, and was later lieutenant colonel for two years.\n"
    },
    {
        "link": "/wiki/Joseph_O._Carter",
        "title": "Joseph O. Carter",
        "date": "",
        "location": "",
        "paragraph": "Joseph Oliver Carter (December 20, 1835 – February 27, 1909), known professionally as Joseph O. Carter, also known as J. O. Carter and Joe Carter, was a legal advisor to Queen Liliʻuokalani, serving on her Privy Council of State.\nHe served in the Provisional Government of Hawaii after the overthrow of the Kingdom of Hawaii and was an opponent to annexation by the United States. Carter was trustee of many large estates in Hawaii and was one of the first directors of the Bishop Museum.\n"
    },
    {
        "link": "/wiki/William_Richards_Castle",
        "title": "William Richards Castle",
        "date": "",
        "location": "",
        "paragraph": "William Richards Castle (March 19, 1849 – June 5, 1935) was a lawyer and politician in the Kingdom of Hawaii and Republic of Hawaii.\nWilliam Richards Castle was born in Honolulu on March 19, 1849. His father was Samuel Northrup Castle (1808–1894), and mother was Mary Tenney Castle (1819–1907). He was a namesake of William Richards (1793–1847) who drafted the first constitution of the kingdom.[1] On October 12, 1875 he married Ida Beatrice Lowrey (1854–1926) on October 12, 1875 and had three children.[2]\n"
    },
    {
        "link": "/wiki/John_F._Colburn",
        "title": "John F. Colburn",
        "date": "",
        "location": "",
        "paragraph": "\nJohn Francis Colburn (September 30, 1859 – March 16, 1920) was a businessman and politician of the Kingdom of Hawaii. He served as the last Minister of the Interior to Queen Liliuokalani. Even though he was part Hawaiian ancestry on his maternal side, Colburn was a key figure in the overthrow of the Hawaiian monarchy and was a proponent of annexation to the United States. Colburn was the treasurer of the estate of Queen Kapiolani.\n"
    },
    {
        "link": "/wiki/Committee_of_Safety_(Hawaii)",
        "title": "Committee of Safety (Hawaii)",
        "date": "",
        "location": "Oʻahu, Hawaii",
        "paragraph": "The Committee of Safety, formally the Citizen's Committee of Public Safety, was a 13-member group of the Annexation Club. The group was composed of mostly Hawaiian subjects of American descent and American citizens who were members of the Missionary Party, as well as some foreign residents in the Kingdom of Hawaiʻi. The group planned and carried out the overthrow of the Kingdom of Hawaiʻi on January 17, 1893. The goal of this group was to achieve annexation of Hawaiʻi by the United States. The new independent Republic of Hawaiʻi government was thwarted in this goal by the administration of President Grover Cleveland, and it was not until 1898 that the United States Congress approved a joint resolution of annexation creating the U.S. Territory of Hawaiʻi.[1][2][3]\nThe Committee of Safety originated from a leadership group when members of the Missionary Party began to run as Independent Party candidates. For the elections of 1884 the Missionary Party strictly ran all candidates as Independent Party candidates. To ensure that Missionaries were on the Independent ticket the \"Committee of Nine\" was formed January 14, 1893, to assume the leadership position of the Independent Party. The Committee of Nine were staunchly loyal to the Missionary Party, having social and economic philosophies that reflected the Missionary values. The Independent Party won 13 seats and was the minority party in the Hawaii legislature. For the following elections of 1886 the committee reconvened, this time calling themselves the \"Committee of Thirteen\" due to the change in members. Their intent was to make the Independent Party the majority party in the legislature. At the end of the elections the Independents won ten seats, a net loss of three seats.\n"
    },
    {
        "link": "/wiki/Henry_E._Cooper",
        "title": "Henry E. Cooper",
        "date": "",
        "location": "",
        "paragraph": "Henry Ernest Cooper (August 28, 1857 – May 15, 1929) was an American lawyer who moved to the Kingdom of Hawaii and became prominent in Hawaiian politics in the 1890s.  He formally deposed Queen Lili'uokalani of Hawaii in 1893, held various offices in the ensuing Provisional Government of Hawaii and Republic of Hawaii governments, and was the first United States Territory of Hawaii Attorney General, 1899–1900.  He later became a circuit judge in Honolulu.\nCooper was born August 28, 1857, in New Albany, Indiana, to Harriet Augusta Cooper and William Giles Cooper, a lawyer from England. He was educated in public schools in Boston and received the LLB degree from the Boston University School of Law in 1878. He was admitted to the bar in Suffolk County, Massachusetts and practiced law there.[1]\n"
    },
    {
        "link": "/wiki/William_H._Cornwell",
        "title": "William H. Cornwell",
        "date": "",
        "location": "",
        "paragraph": "\nWilliam Henry Cornwell (May 30, 1843 – November 18, 1903) was an American businessman, as well as a military colonel and politician of the Kingdom of Hawaii. He served two separate terms as Minister of Finance and was a member of Queen Liliuokalani's last cabinet before the Overthrow of the Kingdom of Hawaii.\n"
    },
    {
        "link": "/wiki/Samuel_Mills_Damon",
        "title": "Samuel Mills Damon",
        "date": "",
        "location": "",
        "paragraph": "Samuel Mills Damon (March 13, 1845 – July 1, 1924) was a businessman and politician in the Kingdom of Hawaii, through the Republic of Hawaii and into the Territory of Hawaii.\nDamon was born  in Honolulu on March 13, 1845.\nHis father was early missionary Samuel Chenery Damon (1815–1885) and his mother was Julia Sherman Mills (1817–1890). They arrived in Honolulu in 1842.[1] \nHis maternal great-uncle was minister Samuel John Mills  (1783–1818), who took part in the Haystack Prayer Meeting which led to the formation of the American Board of Commissioners for Foreign Missions, the group that sent the first American missionaries to Hawaii.[2]\n"
    },
    {
        "link": "/wiki/Benjamin_Franklin_Dillingham",
        "title": "Benjamin Franklin Dillingham",
        "date": "",
        "location": "",
        "paragraph": "Benjamin Franklin Dillingham (September 4, 1844 – April 7, 1918) was a businessman and industrialist during the late Kingdom of Hawaii era, throughout the period of the Republic of Hawaii, and during the first two decades of the Territory of Hawaii.\nDillingham was born on September 4, 1844 into an old New England family in Brewster, on Cape Cod in Massachusetts. His father was Benjamin C. Dillingham and mother was Lydia Sears Howes. At the age of fourteen he became a sailor on the Yankee clipper Southern Cross which was captured and destroyed by the Confederate steamer Florida in 1863 during the American Civil War. In 1865 he became first mate of a barque named Whistler that did a regular run between San Francisco and Honolulu. On his third trip to the island kingdom, Dillingham broke his leg after falling from a horse and was forced to convalesce in Hawaii.\n"
    },
    {
        "link": "/wiki/Sanford_B._Dole",
        "title": "Sanford B. Dole",
        "date": "",
        "location": "",
        "paragraph": "\nSanford Ballard Dole (April 23, 1844 – June 9, 1926) was a lawyer and jurist from the Hawaiian Islands. He lived through the periods when Hawaii was a kingdom, protectorate, republic, and territory.  A descendant of the American missionary community to Hawaii, Dole advocated the westernization of Hawaiian government and culture. After the overthrow of the monarchy, he served as the President of the Republic of Hawaii until his government secured Hawaii's annexation by the United States.[1]\n"
    },
    {
        "link": "/wiki/Charles_T._Gulick",
        "title": "Charles T. Gulick",
        "date": "",
        "location": "",
        "paragraph": "\nCharles Thomas Gulick (July 25, 1841 – November 7, 1897) was a Kingdom of Hawaiʻi politician and one of the few members of the various missionary families of the time to side with the monarchy in the 1893 overthrow of the Kingdom of Hawaiʻi.\n"
    },
    {
        "link": "/wiki/Peter_Cushman_Jones",
        "title": "Peter Cushman Jones",
        "date": "",
        "location": "",
        "paragraph": "Peter Cushman Jones (October 12, 1837 – April 23, 1922) was a businessman and politician during the Kingdom of Hawaii, Provisional Government of Hawaii, Republic of Hawaii and Territory of Hawaii.\nHe founded the second bank in the Hawaiian Islands.\nPeter Cushman Jones was born December 10, 1837, in Boston. His father was also named Peter Cushman Jones (1808–1885), and his mother was Jane MacIntosh Baldwin, whose grandfather Isaac Baldwin (1738–1775)  died in the Battle of Bunker Hill.[1]\nHe traces his ancestry to several notable early Bostonians, including Thomas Dudley (1576–1653) and daughter Anne Dudley who married Simon Bradstreet.\nHe was fourth of nine children.[2]\n"
    },
    {
        "link": "/wiki/James_A._King",
        "title": "James A. King",
        "date": "",
        "location": "",
        "paragraph": "\nJames Anderson King (December 4, 1832 – October 16, 1899) was a ship's master who became a politician of the Republic of Hawaii.\n"
    },
    {
        "link": "/wiki/William_Ansel_Kinney",
        "title": "William Ansel Kinney",
        "date": "",
        "location": "",
        "paragraph": "William Ansel Kinney (1860–1930) was a lawyer and politician in the Kingdom of Hawaii, through the Republic of Hawaii and into the Territory of Hawaii.\nWilliam Ansel Kinney was born October 16, 1860, in Honolulu, Hawaii.\nHis father was William Kinney, who was born April 15, 1832, in Chebogue, Nova Scotia.[1]\nHis uncle Joseph Robbins Kinney (1839–1919) was a member of the House of Commons of Canada.\nHis father came to the Hawaiian Islands in the 1850s and married his mother Caroline Dailey (died March 25, 1897) on July 6, 1857.[2]\nHis father then married up to three different native Hawaiian women, having many other children by them. \nFor example, half-brother William Kihapiʻilani Kinney (1868–1953) married Mary Francesca Vierra, and their son Ernest Kaipoleimanu Kinney (1906–1987) married Esther Kauikeaulani Kaʻulili and had daughter Rubellite Kawena Kinney Johnson, who became a Hawaiian historian.[3]\nThe youngest half-sibling was Ray Kinney, born in Hilo September 26, 1900, who became a popular musician and composer. His father managed the sugarcane plantation at Honomu, Hawaii and died June 3, 1915.[4]\n"
    },
    {
        "link": "/wiki/Lili%CA%BBuokalani%27s_Cabinet_Ministers",
        "title": "Liliʻuokalani's Cabinet Ministers",
        "date": "",
        "location": "",
        "paragraph": "Liliʻuokalani was the first queen regnant and the last sovereign monarch of the Kingdom of Hawaiʻi. The queen ascended to the throne on January 29, 1891, nine days after the death of her brother Kalākaua, and inherited his cabinet ministers. The four cabinet positions were Attorney General, Minister of Finance,  Minister of Foreign Affairs and Minister of the Interior. The ministers were ex-officio members of the House of Nobles in the legislature and the Privy Council of State, a larger body of advisors. \nThe Bayonet Constitution that Kalākaua had been compelled to sign in 1887 allowed the monarch to appoint the cabinet, but transferred the power of their removal to the legislature alone. A legislative \"resolution of want of confidence\" would force the resignation of an entire cabinet. The new law allowed non-residents to vote, but economic and literacy restrictions disenfranchised a majority of  Asians and native Hawaiians.[1] After her brother's funeral, the queen demanded the resignations of his ministers, causing a legal challenge when they refused. The case was decided in her favor by the Supreme Court of the kingdom.[2]\n"
    },
    {
        "link": "/wiki/Lili%CA%BBuokalani",
        "title": "Liliʻuokalani",
        "date": "",
        "location": "",
        "paragraph": "\nLiliʻuokalani (Hawaiian pronunciation: [liˌliʔuokəˈlɐni]; Lydia Liliʻu Loloku Walania Kamakaʻeha; September 2, 1838 – November 11, 1917) was the only queen regnant and the last sovereign monarch of the Hawaiian Kingdom, ruling from January 29, 1891, until the overthrow of the Hawaiian Kingdom on January 17, 1893. The composer of \"Aloha ʻOe\" and numerous other works, she wrote her autobiography Hawaiʻi's Story by Hawaiʻi's Queen during her imprisonment following the overthrow.\n"
    },
    {
        "link": "/wiki/Lili%CA%BBuokalani%27s_Privy_Council_of_State",
        "title": "Liliʻuokalani's Privy Council of State",
        "date": "",
        "location": "",
        "paragraph": "Following the January 20, 1891 death of King Kalākaua in San Francisco, his embalmed body arrived at Honolulu Harbor aboard the USS Charleston, draped in black with its ensigns at half mast.[1] His sister Liliʻuokalani was designated his successor.[2]\nThe Privy Council of State of the Kingdom of Hawaii was a constitutionally-created body purposed to advise and consent to acts made by the monarch. The cabinet ministers were ex-officio members. Other privy counselors were appointed by the monarch according to his (or her) personal wishes.[3] At an emergency meeting of Kalākaua's privy council and justices of the supreme court, they were in accord that Liliʻuokalani be installed as monarch on January 29. She did not wish to discuss affairs of state during the period of mourning, but reluctantly acquiesced, and was given the oath of office by Hawaii Supreme Court Chief Justice Albert Francis Judd. Her husband John Owen Dominis was given the title of Prince Consort.[4][5][6]\n"
    },
    {
        "link": "/wiki/Edward_C._Macfarlane",
        "title": "Edward C. Macfarlane",
        "date": "",
        "location": "",
        "paragraph": "Edward Creamor Macfarlane (October 8, 1848 – February 16, 1902), also known as Ned Macfarlane, was a politician of the Kingdom of Hawaii. He served as Minister of Finance during the reign of Queen Liliuokalani, and was one of her trusted political advisors during the Overthrow of the Kingdom of Hawaii.\nHe was born on October 8, 1848 in Hawaii. His parents were Richard (or Henry) Macfarlane (died 1860) and Eliza Macfarlane (1828–1904). His father was Scottish, of the Highland Clan MacFarlane, while his mother was of English descent from Devonshire. His parents married in Auckland and were early settlers of Hawaii arriving to the islands in 1846 via New Zealand. His brothers were: Henry R. Macfarlane, George W. Macfarlane, who served on as Chamberlain of King Kalākaua, Frederick W. Macfarlane and Clarence W. Macfarlane. A younger sister Helen Blanche Macfarlane married William H. Cornwell. All were born in the island with the exception of Henry who was born at sea.[1][2][3]\n"
    },
    {
        "link": "/wiki/Paul_Neumann_(Attorney_General)",
        "title": "Paul Neumann (Attorney General)",
        "date": "",
        "location": "",
        "paragraph": "Paul Neumann (1839 – July 2, 1901) was a lawyer, politician, and diplomat in California and the Kingdom of Hawaii.\nBorn and educated in Prussia, Neumann and his twin brother Edward relocated to California in 1854. The brothers worked in the goldmines, where Paul broke his leg.[1]\n"
    },
    {
        "link": "/wiki/Samuel_Parker_(Hawaii_politician)",
        "title": "Samuel Parker (Hawaii politician)",
        "date": "",
        "location": "",
        "paragraph": "\nSamuel Parker, known as Kamuela Parker (June 23, 1853 – March 19, 1920) was a major landowner and businessman on the island of Hawaii, heir to the Parker Ranch estate. He was also a leading political figure at a critical time of the history of the Kingdom of Hawaii, serving in its last cabinet.\n"
    },
    {
        "link": "/wiki/Arthur_P._Peterson",
        "title": "Arthur P. Peterson",
        "date": "",
        "location": "",
        "paragraph": "\nArthur Porter Peterson (November 21, 1858 – March 16, 1895) was a lawyer and politician of the Kingdom of Hawaii. He served two separate terms as Attorney General of Hawaii and was a member of Queen Liliuokalani's last cabinet before the Overthrow of the Kingdom of Hawaii. He was arrested and jailed by the Republic of Hawaii in the aftermath of the 1895 Counter-Revolution and then exiled to San Francisco where he died of pneumonia.\n"
    },
    {
        "link": "/wiki/William_Owen_Smith",
        "title": "William Owen Smith",
        "date": "",
        "location": "",
        "paragraph": "\nWilliam Owen Smith (August 4, 1848 – April 13, 1929) was a lawyer from a family of American missionaries who participated in the overthrow of the Kingdom of Hawaii. He was attorney general for the entire duration of the Provisional Government of Hawaii and the Republic of Hawaii.\n"
    },
    {
        "link": "/wiki/John_Harris_Soper",
        "title": "John Harris Soper",
        "date": "",
        "location": "",
        "paragraph": "John Harris Soper (1846–1944) was Marshal of the Kingdom of Hawaii during the period of 1884-86 and 1888-90. \nHe was born November 17, 1846, in Plymouth, Devon, England to Thomas Harris Soper and Mary Kipling Soper.[1]\nA military man, he became Commander-in-chief of military forces of the Provisional Government of Hawaii in 1893; Adjutant General and Chief of Staff during the period of 1894-1907; and retired as Brigadier General of the National Guard of Hawaii in 1907, having previously served in the California National Guard.[2] Also a businessman, he was President of Hawaiian News Company in Honolulu; and also managed Soper, Wright & Company, a sugar plantation, on ʻŌʻōkala, Hawaii.[3][4] \nHe served as honorary vice-president of the Societe des Sauveteurs du Dernier Adieu; and was a member of the Hawaiian Lodge No. 21, F. & A. M. Soper married Mary Elizabeth Wundenberg at Vallejo, California in 1871; they had five children.[1]\nSoper died July 26, 1944 in Honolulu.[5]\n"
    },
    {
        "link": "/wiki/John_L._Stevens",
        "title": "John L. Stevens",
        "date": "",
        "location": "",
        "paragraph": "John Leavitt Stevens (August 1, 1820 – February 8, 1895) was the United States Minister to the Hawaiian Kingdom in 1893 when he was accused of conspiring to overthrow Queen Liliuokalani in association with the Committee of Safety, led by Lorrin A. Thurston and Sanford B. Dole – the first Americans attempting to overthrow a foreign government under the auspices of a United States government officer.[1] Apart from his work as a politician and diplomat, he was also a journalist, author, minister and newspaper publisher. He founded the Republican Party in Maine and served as Maine State Senator.\nJohn Leavitt Stevens was born in 1820 in the town of Mount Vernon, Kennebec County, Maine, to Capt. John Stevens [2] and Charlotte (Lyford) Stevens.[3][4]  He was a lifelong resident of Augusta in the same county, except for his time away at school and his later diplomatic service.[5]  Stevens attended Maine Wesleyan Seminary to prepare for a minister's career in the Universalist church, which he served as pastor for a decade, becoming a leader in the anti-slavery movement. (Stevens later became a firm opponent of capital punishment, and as a Maine State Senator urged the legislature to abolish the death penalty).[6]\n"
    },
    {
        "link": "/wiki/Lorrin_A._Thurston",
        "title": "Lorrin A. Thurston",
        "date": "",
        "location": "",
        "paragraph": "\nLorrin Andrews Thurston (July 31, 1858 – May 11, 1931) was an American lawyer, politician, and businessman born and raised in the Kingdom of Hawaiʻi. Thurston played a prominent role in the Overthrow of the Hawaiian Kingdom that replaced Queen Liliʻuokalani with the Republic of Hawaii, dominated by American interests. He published the Pacific Commercial Advertiser (a forerunner of the present-day Honolulu Star-Advertiser), and owned other enterprises. From 1906 to 1916 he and his network lobbied with national politicians to create a National Park to preserve the Hawaiian Volcanoes. \n"
    },
    {
        "link": "/wiki/Hermann_A._Widemann",
        "title": "Hermann A. Widemann",
        "date": "",
        "location": "",
        "paragraph": "Hermann Adam Widemann (December 24, 1822 – February 7, 1899) was a businessman from Germany who was a judge and member of the cabinet of the Kingdom of Hawaii.\nWidemann was born in Hanover, Germany on December 24, 1822.[1]\nAs a teenager he went to work on a whaling ship. He came to live in the Hawaiian Islands in 1846, after stopping in 1843.\nHe came briefly to the California Gold Rush in 1849, but returned after his companion John von Pfister was murdered.[2]: 149 \nHe married a native Hawaiian Kaumana \"Mary\" Kapoli in 1854 and lived in Līhuʻe.[3]\nHe became sheriff of the island of Kauaʻi in 1854, was elected to the house of representatives in the legislature of the Hawaiian Kingdom in 1855, and in 1863 appointed its circuit judge.[4]\nHe started one of the first sugarcane plantations in Hawaii known as  Grove Farm.\nDuring the American Civil War he supported the Confederate States.[2]: 180 \n"
    },
    {
        "link": "/wiki/George_Norton_Wilcox",
        "title": "George Norton Wilcox",
        "date": "",
        "location": "",
        "paragraph": "George Norton Wilcox (August 15, 1839 – January 21, 1933) was a businessman and politician in the Kingdom of Hawaii and Territory of Hawaii.\nGeorge Norton Wilcox was born in Hilo August 15, 1839.\nHis father was Abner Wilcox (1808–1869) and mother was Lucy Eliza Hart (1814–1869). His parents were in the company of missionaries to Hawaii for the American Board of Commissioners for Foreign Missions, sailing in 1836. His parents taught at the Hilo Mission boarding school founded by David Belden Lyman and his wife.[1] He had one older brother and two younger ones born while at Hilo.\nIn 1846 the family moved to teach at a similar school at the Waiʻoli Mission near Hanalei, Hawaii on the northern coast of the island of Kauaʻi. There he had four more brothers, although one died young.[2]\n"
    },
    {
        "link": "/wiki/Albert_S._Willis",
        "title": "Albert S. Willis",
        "date": "",
        "location": "",
        "paragraph": "\nAlbert Shelby Willis (January 22, 1843 – January 6, 1897) was a United States Representative from Kentucky and a Minister to Hawaii.\n"
    },
    {
        "link": "/wiki/Charles_Burnett_Wilson",
        "title": "Charles Burnett Wilson",
        "date": "",
        "location": "",
        "paragraph": "\nCharles Burnett \"C.B.\" Wilson (4 July 1850 – 12 September 1926) was a British and Tahitian superintendent of the water works, fire chief under King Kalākaua, and Marshal of the Kingdom under Queen Liliʻuokalani.[1] Wilson was also the father of John H. Wilson.\n"
    },
    {
        "link": "/wiki/Gilbert_C._Wiltse",
        "title": "Gilbert C. Wiltse",
        "date": "",
        "location": "",
        "paragraph": "\nGilbert Cornwall Wiltse (November 26, 1838 – April 26, 1893) was an American naval officer. He was known for his command of USS Boston during the Overthrow of the Hawaiian Kingdom.\n"
    }
]