{
    "0": {
        "link": "/wiki/Edward_C._Macfarlane",
        "title": "Edward C. Macfarlane",
        "date": "February 16, 1902(1902-02-16) (aged 53) Chicago, Illinois",
        "year": "1902",
        "location": "",
        "state": "Hawaii",
        "place": "New Zealand",
        "county": "Honolulu County",
        "paragraph": "Edward Creamor Macfarlane (October 8, 1848 – February 16, 1902), also known as Ned Macfarlane, was a politician of the Kingdom of Hawaii. He served as Minister of Finance during the reign of Queen Liliuokalani, and was one of her trusted political advisors during the Overthrow of the Kingdom of Hawaii.\nHe was born on October 8, 1848 in Hawaii. His parents were Richard (or Henry) Macfarlane (died 1860) and Eliza Macfarlane (1828–1904). His father was Scottish, of the Highland Clan MacFarlane, while his mother was of English descent from Devonshire. His parents married in Auckland and were early settlers of Hawaii arriving to the islands in 1846 via New Zealand. His brothers were: Henry R. Macfarlane, George W. Macfarlane, who served on as Chamberlain of King Kalākaua, Frederick W. Macfarlane and Clarence W. Macfarlane. A younger sister Helen Blanche Macfarlane married William H. Cornwell. All were born in the island with the exception of Henry who was born at sea.[1][2][3]\nHe moved to California and worked for The Wasp, a San Francisco magazine, owned by Frank J. Ballinger, for a time before returning to Hawaii.[2]\n",
        "type": []
    },
    "1": {
        "link": "/wiki/Hawaiian_rebellions_(1887%E2%80%931895)",
        "title": "Hawaiian rebellions (1887–1895)",
        "date": "July 6, 1887 - January 9, 1895\n(7 years, 6 months and 4 days)",
        "year": "1887",
        "location": "Hawaiian Islands",
        "state": "Hawaii",
        "place": "Japan",
        "county": "Honolulu County",
        "paragraph": "Hawaiian League victory \nRoyalists \n Kingdom of Hawaii \n United States \n Empire of Japan \nAnnexationists\n Hawaiian League \n Republic of Hawaii\n",
        "type": [
            "riot"
        ]
    },
    "2": {
        "link": "/wiki/John_Harris_Soper",
        "title": "John Harris Soper",
        "date": "",
        "year": "1846",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "John Harris Soper (1846–1944) was Marshal of the Kingdom of Hawaii during the period of 1884-86 and 1888-90. \nHe was born November 17, 1846, in Plymouth, Devon, England to Thomas Harris Soper and Mary Kipling Soper.[1]\nA military man, he became Commander-in-chief of military forces of the Provisional Government of Hawaii in 1893; Adjutant General and Chief of Staff during the period of 1894-1907; and retired as Brigadier General of the National Guard of Hawaii in 1907, having previously served in the California National Guard.[2] Also a businessman, he was President of Hawaiian News Company in Honolulu; and also managed Soper, Wright & Company, a sugar plantation, on ʻŌʻōkala, Hawaii.[3][4] \nHe served as honorary vice-president of the Societe des Sauveteurs du Dernier Adieu; and was a member of the Hawaiian Lodge No. 21, F. & A. M. Soper married Mary Elizabeth Wundenberg at Vallejo, California in 1871; they had five children.[1]\nSoper died July 26, 1944 in Honolulu.[5]\n",
        "type": []
    },
    "3": {
        "link": "/wiki/Sanford_B._Dole",
        "title": "Sanford B. Dole",
        "date": "June 9, 1926(1926-06-09) (aged 82) Honolulu, Territory of Hawaii, U.S.",
        "year": "1926",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nSanford Ballard Dole (April 23, 1844 – June 9, 1926) was a lawyer and jurist from the Hawaiian Islands. He lived through the periods when Hawaii was a kingdom, protectorate, republic, and territory.  A descendant of the American missionary community to Hawaii, Dole advocated the westernization of Hawaiian government and culture. After the overthrow of the monarchy, he served as the President of the Republic of Hawaii until his government secured Hawaii's annexation by the United States.[1]\nDole was born April 23, 1844, in Honolulu to Protestant Christian missionaries from Maine in the United States. His father was Daniel Dole (1808–1878), principal at Oahu College (known as Punahou School after 1934), and his mother was Emily Hoyt Ballard (1808–1844).  His mother died from complications within a few days of his birth. Dole was named after his maternal uncle, Sanford K. Ballard, a classmate of his father's at Bowdoin College who died in 1841.[2] He was nursed by a native Hawaiian, and his father married Charlotte Close Knapp in 1846. In 1855 the family moved to Kōloa on the island of Kauaʻi, where they operated another school, which Sanford attended.[3][4]\n",
        "type": []
    },
    "4": {
        "link": "/wiki/Lorrin_A._Thurston",
        "title": "Lorrin A. Thurston",
        "date": "May 11, 1931(1931-05-11) (aged 72) Honolulu, Territory of Hawaii",
        "year": "1931",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nLorrin Andrews Thurston (July 31, 1858 – May 11, 1931) was an American lawyer, politician, and businessman born and raised in the Kingdom of Hawaiʻi. Thurston played a prominent role in the Overthrow of the Hawaiian Kingdom that replaced Queen Liliʻuokalani with the Republic of Hawaii, dominated by American interests. He published the Pacific Commercial Advertiser (a forerunner of the present-day Honolulu Star-Advertiser), and owned other enterprises. From 1906 to 1916 he and his network lobbied with national politicians to create a National Park to preserve the Hawaiian Volcanoes. \nHe was born on July 31, 1858 in Honolulu, Hawaii.[1] His father was Asa Goodale Thurston and mother Sarah Andrews.[2] On his father's side he was grandson of Asa and Lucy Goodale Thurston, who were in the first company of American Christian missionaries to the Hawaiian Islands in 1820.[3] On his mother's side, he was also the grandson of another early missionary, Lorrin Andrews. His father was speaker of the house of representatives of the Kingdom of Hawaii but died when Lorrin was only a year and a half old in December 1859. He then moved to Maui with his mother.[2][4]\n",
        "type": []
    },
    "5": {
        "link": "/wiki/Committee_of_Safety_(Hawaii)",
        "title": "Committee of Safety (Hawaii)",
        "date": "",
        "year": "",
        "location": "Oʻahu, Hawaii",
        "state": "Hawaii",
        "place": "Oʻahu",
        "county": "Honolulu County",
        "paragraph": "The Committee of Safety, formally the Citizen's Committee of Public Safety, was a 13-member group of the Annexation Club. The group was composed of mostly Hawaiian subjects of American descent and American citizens who were members of the Missionary Party, as well as some foreign residents in the Kingdom of Hawaiʻi. The group planned and carried out the overthrow of the Kingdom of Hawaiʻi on January 17, 1893. The goal of this group was to achieve annexation of Hawaiʻi by the United States. The new independent Republic of Hawaiʻi government was thwarted in this goal by the administration of President Grover Cleveland, and it was not until 1898 that the United States Congress approved a joint resolution of annexation creating the U.S. Territory of Hawaiʻi.[1][2][3]\nThe Committee of Safety originated from a leadership group when members of the Missionary Party began to run as Independent Party candidates. For the elections of 1884 the Missionary Party strictly ran all candidates as Independent Party candidates. To ensure that Missionaries were on the Independent ticket the \"Committee of Nine\" was formed January 14, 1893, to assume the leadership position of the Independent Party. The Committee of Nine were staunchly loyal to the Missionary Party, having social and economic philosophies that reflected the Missionary values. The Independent Party won 13 seats and was the minority party in the Hawaii legislature. For the following elections of 1886 the committee reconvened, this time calling themselves the \"Committee of Thirteen\" due to the change in members. Their intent was to make the Independent Party the majority party in the legislature. At the end of the elections the Independents won ten seats, a net loss of three seats.\nIn January 1887 the Committee of Thirteen formed a secret society called the Hawaiian League. No official records were kept, but Lorrin A. Thurston (the grandson of American missionaries Asa Thurston and Lorrin Andrews) drafted the group's constitution. The group was headed by an executive committee of lawyers and businessmen mostly of non-aboriginal non-indigenous naturalized United States citizens. Membership grew through the year, including some German and British citizens, and a few part-Hawaiians.\nAlthough the politicians changed the name of their party from \"Missionary\" to \"Reform\", many wanted to become part of the United States, not just reform the monarchy.[4]: 347–350  \nThis was why the Hawaiian League was also called the Annexation Club, although not often in public.\n",
        "type": []
    },
    "6": {
        "link": "/wiki/Proposed_1893_Constitution_of_the_Hawaiian_Kingdom",
        "title": "Proposed 1893 Constitution of the Hawaiian Kingdom",
        "date": "",
        "year": "1893",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nThe proposed 1893 Constitution of the Hawaiian Kingdom would have been a replacement of the Constitution of 1887, primarily based on the Constitution of 1864 put forth by Queen Lili'uokalani. While it never became anything more than a draft, the constitution had a profound impact on Hawaiʻi's history: it set off a chain of events that eventually resulted in the overthrow of the Hawaiian Kingdom.\nPrior to 1887, the monarchs of Hawaiʻi ruled the kingdom as executive monarchs. Following the writing of the 1887 Constitution, however, the monarch was reduced to a mere figurehead.\n",
        "type": []
    },
    "7": {
        "link": "/wiki/1895_Wilcox_rebellion",
        "title": "1895 Wilcox rebellion",
        "date": "January 6–9, 1895",
        "year": "1895",
        "location": "Oahu, Hawaii",
        "state": "Hawaii",
        "place": "Oahu",
        "county": "Honolulu County",
        "paragraph": "Republic of Hawaii victory\nThe 1895 Wilcox rebellion, or the Counter-Revolution of 1895[note 1] was a brief war from January 6 to January 9, 1895, that consisted of three battles on the island of Oʻahu, Republic of Hawaii. It was the last major military operation by royalists who opposed the overthrow of the Kingdom of Hawaii.\nBecause of its brevity and few casualties, this conflict is largely forgotten; in some cases those who rediscover it coin a new name for the conflict, but it is frequently referred to as the “Counter-revolution”.\n",
        "type": [
            "riot"
        ]
    },
    "8": {
        "link": "/wiki/Honolulu_Strangler",
        "title": "Honolulu Strangler",
        "date": "",
        "year": "1985",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "The Honolulu Strangler, also known as The Honolulu Rapist, is the nickname given to an unidentified serial killer who is credited with killing five women in Hawaii from 1985 and 1986.[1] He is the second known serial killer active in the state (after Eugene Barrett).[2]\nThe first victim was Vicki Gail Purdy,[3][4] age 25, a military spouse of Gary Purdy, an army helicopter pilot. She had left to go clubbing in Waikīkī on May 29, 1985, but failed to meet her friends. She was last seen by the taxi driver who drove her to the Shorebird Hotel at 12:00 a.m., apparently to retrieve her car, which was later found in the hotel parking lot. The next morning, her body was found in an embankment at Keehi Lagoon, wearing her yellow jumpsuit. Her hands were bound behind her back, and she had been raped and strangled. Her husband told police he suspected her death to be associated with her job, working at a video rental store that also handled pornographic film, where two women were stabbed to death one year earlier.\nThe second victim was Regina Sakamoto,[3][4] age 17, of Leilehua High School. She had missed her bus from Waipahu to school on January 14, 1986, and was last heard from by her boyfriend at 7:15 a.m. when she called to tell him she would be late. On January 15, her body was found at Keehi Lagoon wearing her blue tank top and white sweatshirt, but her lower body was unclothed. Her hands bound behind her back, she had been raped and strangled. She was planning on attending Hawaii Pacific University in the fall. This second case led police to suspect the same killer as the first because of the same modus operandi.\n",
        "type": [
            "rape",
            "murder",
            "killing"
        ]
    },
    "9": {
        "link": "/wiki/Isaac_Davis_(advisor)",
        "title": "Isaac Davis (advisor)",
        "date": "April 1810Honolulu, Oahu, Kingdom of Hawaii",
        "year": "1810",
        "location": "",
        "state": "Hawaii",
        "place": "Oahu",
        "county": "Honolulu County",
        "paragraph": "\nIsaac Davis (c. 1758–1810) was a Welsh advisor to Kamehameha I, who recruited him to help conquer the other kingdoms in Hawaii, resulting in formation of the Kingdom of Hawaii. He arrived in Hawaii in 1790 as the sole survivor of the massacre of the crew of the Fair American.  Davis and John Young became friends and advisors to Kamehameha. Davis brought western military knowledge to Hawaii and played a prominent role during Hawaii's first contacts with the European powers. He spent the rest of his life in Hawaiʻi and was known as ʻAikake.\nIsaac Davis was born about 1758 in Milford Haven, Wales.[1] He was a seaman on the American schooner Fair American, commanded by Thomas Humphrey Metcalfe, engaged with a larger companionship, the Eleanora, in the maritime fur trade between the Pacific Northwest and China.\n",
        "type": []
    },
    "10": {
        "link": "/wiki/Benjamin_Franklin_Dillingham",
        "title": "Benjamin Franklin Dillingham",
        "date": "April 7, 1918(1918-04-07) (aged 73) Oahu, Hawaii",
        "year": "1918",
        "location": "",
        "state": "Hawaii",
        "place": "Oahu",
        "county": "Honolulu County",
        "paragraph": "Benjamin Franklin Dillingham (September 4, 1844 – April 7, 1918) was a businessman and industrialist during the late Kingdom of Hawaii era, throughout the period of the Republic of Hawaii, and during the first two decades of the Territory of Hawaii.\nDillingham was born on September 4, 1844 into an old New England family in Brewster, on Cape Cod in Massachusetts. His father was Benjamin C. Dillingham and mother was Lydia Sears Howes. At the age of fourteen he became a sailor on the Yankee clipper Southern Cross which was captured and destroyed by the Confederate steamer Florida in 1863 during the American Civil War. In 1865 he became first mate of a barque named Whistler that did a regular run between San Francisco and Honolulu. On his third trip to the island kingdom, Dillingham broke his leg after falling from a horse and was forced to convalesce in Hawaii.\nHe decided to stay in Honolulu and by the end of 1865 was a clerk at Diamond Hardware, which he bought out for $28,000 in 1869. On April 26, 1869, he married Emma Louise Smith (1844–1920), of a prominent missionary family. She was the daughter of Reverend Lowell Smith and Abigail Willis Tenney.[1] Dillingham turned out to be an astute businessman, and more importantly, was always willing to take risks. In 1879 he started a dairy farm in upper Honolulu, and during the 1880s became increasingly successful. He founded the Oahu Railway and Land Company (OR&L) that began service in November 1889. Dillingham was well-liked among Honolulu's various communities, and he included King Kalākaua and Queen Liliʻuokalani as his friends. Although he disapproved of the overthrow of the Kingdom of Hawaii in 1893, he looked favorably on the American annexation in 1898, which he believed would bring long-term stability to the islands. Dillingham spent the rest of his life in Hawaii.\n",
        "type": []
    },
    "11": {
        "link": "/wiki/Wyatt_Knight",
        "title": "Wyatt Knight",
        "date": "October 25, 2011(2011-10-25) (aged 56) Maui, Hawaii, U.S.",
        "year": "2011",
        "location": "",
        "state": "Hawaii",
        "place": "Maui",
        "county": "Maui County",
        "paragraph": "Wyatt Knight (January 20, 1955 – October 25, 2011) was an American actor, best known for his role as Tommy Turner in the Porky's trilogy.\nIn addition to his work in the Porky's films, Knight made guest appearances on numerous TV shows including The Waltons, M*A*S*H, Family Ties, Profiler, Chicago Hope and Star Trek: The Next Generation. His final TV appearance came in 2010 on the show Crafty.[citation needed]\nAccording to Knight's wife Silvina, in a statement given to entertainment news website TheWrap, he had a bone marrow transplant for advanced non-Hodgkin's lymphoma in 2003.[2] However, intense cancer treatment including radiation left him, in the words of his wife, \"in physical and emotional pain.\"[citation needed] On October 26, 2011 Wyatt Knight's body was discovered in a remote area on the island of Maui, Hawaii. Knight was a resident of Los Angeles, California but had recently been staying at a house on Maui.\n",
        "type": []
    },
    "12": {
        "link": "/wiki/1999_Honolulu_shootings",
        "title": "1999 Honolulu shootings",
        "date": "November 2, 1999 8:00 a.m. (HST)",
        "year": "1999",
        "location": "1200 N. Nimitz Highway Honolulu, Hawaii 96817 United States",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nThe 1999 Honolulu shootings or the Xerox murders were an incident of mass murder that occurred on November 2, 1999, in a Xerox Corporation building in Honolulu, Hawaii, United States.  Service technician Byran Koji Uyesugi shot at eight people; wounding seven fatally (six co-workers and his supervisor). This was the worst mass shooting in the history of Hawaii.\nAt 8:00 in the morning, Byran Koji Uyesugi, a service technician working at Xerox, opened fire inside the building with a semi-automatic pistol, killing his supervisor and six co-workers, and fired in the direction of another co-worker who fled the building.  The eighth person escaped without injury.\n",
        "type": [
            "shooting",
            "mass murder",
            "mass shooting",
            "murder",
            "killing"
        ]
    },
    "13": {
        "link": "/wiki/Emma_N%C4%81wah%C4%AB",
        "title": "Emma Nāwahī",
        "date": "December 28, 1935(1935-12-28) (aged 81) Hilo. Hawaii County, Territory of Hawaii",
        "year": "1935",
        "location": "",
        "state": "",
        "place": "Hilo",
        "county": "Hawaiʻi County",
        "paragraph": "\nEmma ʻAʻima Aʻii Nāwahī (September 28, 1854 – December 28, 1935) was a Native Hawaiian political activist, community leader and newspaper publisher. She and her husband Joseph Nāwahī were leaders in the opposition to the overthrow of the Kingdom of Hawaiʻi and they co-founded Ke Aloha Aina, a Hawaiian language newspaper, which served as an important voice in the resistance to the annexation of Hawaiʻi to the United States.[1][2][3] After annexation, she helped establish the Democratic Party of Hawaiʻi and became a supporter of the women's suffrage movement.\nBorn on September 28, 1854, at Kūkūau, a rural part of Hilo on the island of Hawaiʻi, she was regarded as a hapa-pākē, of half-Native Hawaiian and half-Chinese descent.[4][5][6] Her mother Kahaoleʻauʻa was the daughter of a minor Hilo chief, while her father Tong Yee was a Chinese immigrant from Xiangshan County, Guangdong. Her father originally left China to take part in the California Gold Rush but later settled in Hilo in 1850 where he became a successful businessman and co-founded Paukaʻa Sugar Plantation with other Chinese sugar planters from lands leased from King Kamehameha V.[7][8] Her parents married on June 25, 1851.[9] Her father adopted the surname Aʻii (based on the Hawaiian pronunciation of his given name) for himself and his children. She and her four sisters: Aʻana, Aʻlai, Aʻoe, and Mihana were known as Ka Pua O Kina (The Flower of China) and regarded as \"famous beauties.\"[10][11]\n",
        "type": []
    },
    "14": {
        "link": "/wiki/Gilbert_C._Wiltse",
        "title": "Gilbert C. Wiltse",
        "date": "April 26, 1893(1893-04-26) (aged 54) New York City, New York, U.S.",
        "year": "1893",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nGilbert Cornwall Wiltse (November 26, 1838 – April 26, 1893) was an American naval officer. He was known for his command of USS Boston during the Overthrow of the Hawaiian Kingdom.\nGilbert Cornwall Wiltse was born on November 26, 1838, in Binghamton, New York to Gilbert Wiltse.[1] Wiltse was appointed to the United States Naval Academy from New York and graduated on September 20, 1855.[1]\n",
        "type": []
    },
    "15": {
        "link": "/wiki/Honolulu_Courthouse_riot",
        "title": "Honolulu Courthouse riot",
        "date": "February 12, 1874",
        "year": "1874",
        "location": "Honolulu, Oahu, Hawaii, Pacific Ocean",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "The Honolulu Courthouse riot, or the Election riot, occurred in February 1874 when Hawaiian followers of Queen Emma, known as Emmaites, attacked supporters of King Kalakaua on the latter's election day and started a riot. Marines and sailors from three American and British warships were landed and they successfully quelled the rioters and Kalakaua took the oath of office the following day without further opposition.[2][3]\nThe Royal Elections of 1874 were held in Hawaii February 12, 1874. It was the second time an election for head of state was held. According to the Constitution of 1864, article 22 stated if the monarch dies before naming a successor \"such vacancy, shall cause a meeting of the Legislative Assembly, who shall elect by ballot some native Ali'i of the Kingdom as Successor,\" therefore the elections were held by the representatives not the public.  Only three candidates were considered seriously.[4]\nAfter the death of King Lunalilo on February 3, 1874, an electoral process began with Queen Emma, the widow of King Kamehameha IV, running against David Kalakaua. Emma was a popular choice among the people, especially in Honolulu, but her pro-British views were unpopular with the Hawaiian legislature dominated by pro-American factions, compared to Kalakaua, who was considered more sympathetic to growing power of the American business interest in the islands, so when election day came on February 12, she lost by a vote of thirty-nine to six, in the legislature. Her supporters were unhappy with the decision. The election proceedings were held at the Honolulu Courthouse, which is where an angry mob of about 100 of the queen's followers gathered. Since the Hawaiian army had been disbanded after a mutiny sometime before, and the militias were unreliable, there was nobody to stop the riot. The Honolulu police force deserted and also joined in the unrest, even fighting against each other depending on their political sympathies. The queen's followers first surrounded and besieged the courthouse at around 3:00 am, then went for the occupants of other buildings which spread the riot throughout most of the city. A carriage was waiting outside of the courthouse to deliver news of the verdict to Kalakaua, who was waiting at his home, but before the electoral committee could tell the driver, the mob tore it apart. Kalakaua's followers put up little to no resistance and the decision was made to consult with the American Minister Henry A. Peirce who requested aid from the United States Navy and Royal Navy commanders at the island. The two American sloops-of-war, USS Tuscarora and USS Portsmouth were anchored in Honolulu Harbor, on an expedition of negotiation to allow the exportation of sugar to America duty-free, but instead their commanders agreed to intervene in a major civil disturbance.[5]\n",
        "type": [
            "riot"
        ]
    },
    "16": {
        "link": "/wiki/Arthur_A._Wilder",
        "title": "Arthur A. Wilder",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Arthur Ashford Wilder (November 3, 1873 – January 4, 1917) was a justice of the Supreme Court of Hawaii from February 13, 1905 to January 25, 1910.[1]\nBorn in Honolulu, Wilder attended that city's Fort Street school and the Punahou School, and then received a Bachelor of Laws from Yale University with high honors in 1897, and a Master of Laws in 1898.[2]\nFrom 1898 to 1905, Wilder practised law with A.G.M. Robertson.[2][3] In 1899, he was one of the organizers if the Hawaii State Bar Association, being its first secretary,[3] and in 1905 he assisted in the compilation of the Revised Laws of Hawaii.[2]\n",
        "type": []
    },
    "17": {
        "link": "/wiki/Peter_Cushman_Jones",
        "title": "Peter Cushman Jones",
        "date": "April 23, 1922(1922-04-23) (aged 84) Honolulu",
        "year": "1922",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Peter Cushman Jones (October 12, 1837 – April 23, 1922) was a businessman and politician during the Kingdom of Hawaii, Provisional Government of Hawaii, Republic of Hawaii and Territory of Hawaii.\nHe founded the second bank in the Hawaiian Islands.\nPeter Cushman Jones was born December 10, 1837, in Boston. His father was also named Peter Cushman Jones (1808–1885), and his mother was Jane MacIntosh Baldwin, whose grandfather Isaac Baldwin (1738–1775)  died in the Battle of Bunker Hill.[1]\nHe traces his ancestry to several notable early Bostonians, including Thomas Dudley (1576–1653) and daughter Anne Dudley who married Simon Bradstreet.\nHe was fourth of nine children.[2]\n\nHe was educated at the Boston Latin School in 1849. However, as he describes himself:",
        "type": []
    },
    "18": {
        "link": "/wiki/Provisional_Government_of_Hawaii",
        "title": "Provisional Government of Hawaii",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "the Republic of Hawaii",
        "county": "Honolulu County",
        "paragraph": "The Provisional Government of Hawaii (abbr.: P.G.; Hawaiian: Aupuni Kūikawā o Hawaiʻi) was proclaimed after the overthrow of the Hawaiian Kingdom on January 17, 1893, by the 13-member Committee of Safety under the leadership of its chairman Henry E. Cooper and former judge Sanford B. Dole as the designated President of Hawaii. It replaced the Kingdom of Hawaii after the overthrow of Queen Liliʻuokalani as a provisional government until the Republic of Hawaii was established on July 4, 1894.\nFollowing the overthrow of the Kingdom of Hawaii, the coup leaders established the Provisional Government and set out to effect Hawaii's speedy annexation by the United States. The provisional government sent a commission including Lorrin A. Thurston to the U.S. and negotiated a treaty with President Benjamin Harrison that was quickly sent to the U.S. Senate for approval. At the same time Princess Victoria Kaʻiulani was in Washington D.C. to campaign for the monarchist side and against the coup, which she decried as illegal.\nShortly after assuming office in March 1893, President Grover Cleveland, himself an anti-imperialist, withdrew the treaty and ordered a congressional investigation into the events surrounding the overthrow of the Hawaiian monarchy. After receiving the committee's official report (that July), Cleveland stated that the U.S. had unlawfully used military force and called for the reinstatement of Queen Liliʻuokalani. The matter was referred by Cleveland to Congress after Sanford Dole refused Cleveland's demands, and the U.S. Senate held an unofficial investigation, culminating in the Morgan Report,[2] which completely rejected that there had been any U.S. involvement in the overthrow. After the findings of this committee were submitted, Cleveland reiterated his position, and denounced the Provisional Government as being neither de facto or de jure.\n",
        "type": []
    },
    "19": {
        "link": "/wiki/George_Lycurgus",
        "title": "George Lycurgus",
        "date": "6 August 1960(1960-08-06) (aged 101) Hilo, Hawaii",
        "year": "1960",
        "location": "",
        "state": "Hawaii",
        "place": "Hilo",
        "county": "Hawaiʻi County",
        "paragraph": "George Lycurgus (Greek: Γεώργιος Λυκούργος) (1858–1960) was a Greek American businessman who played an influential role in the early tourist industry of Hawaii. After Queen Lili`uokalani was overthrown[1] in a coup by the Committee Of Safety, he ran afoul of the government of the Republic of Hawaii and was accused of treason. Later he was instrumental in the development of the Hawaiian Volcano Observatory and Hawaiʻi Volcanoes National Park.\nHe was born in 1858 in Vassaras (near Sparta, Greece). After his release from the Greek Army, his father decided to leave the family farm to an older brother and agreed to send George to America to join his eldest brother John, in California. In 1877 he traveled in steerage class to New York City, and worked his way across the country.[2]\nA relative convinced him to join a wholesale fruit business trading between Hawaii and California in 1881. In San Francisco he shipped California produce and wine to his cousin in Honolulu, who shipped Hawaiian bananas to the mainland. Through friends he learned of a small oyster house that was for sale in Sausalito and he was able to buy it.  He named it the Oyster Grotto.[3]  By 1881, the Grotto came to be patronized by such notables as William Randolph Hearst and the sons of the sugar cane baron, Claus Spreckels. He became friends with the sons of Claus Spreckels, whose family owned the Oceanic Steamship Company and a sugar cane business in Hawaii.\nIn 1889 he was supervising shipment being loaded at the docks, when some of the Spreckels family invited him on board for a poker game. By the time he noticed, the ship was on its way across the Pacific. He spent only a week in Hawaii, but must have enjoyed the stay, since he took more trips and spent more time on the islands.\nIn 1892 he sent for his nephew Demosthenes Lycurgus, who would help him manage his Hawaiian enterprises. Along with other recent immigrants, he formed the Pearl City Fruit Company. Their competition was the Hawaiian Fruit and Packing Company, owned by established descendants of American missionaries such as Lorrin A. Thurston, who was also a powerful politician. Eventually he would sell his restaurant in San Francisco and move to the islands.[4]\n",
        "type": []
    },
    "20": {
        "link": "/wiki/John_C._Lane",
        "title": "John C. Lane",
        "date": "February 8, 1958(1958-02-08) (aged 85) [1]",
        "year": "1958",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Revolution of 1895\nJohn Awena-ika-lani-keahi-o-ka-lua-o-Pele Carey Lane, (July 22, 1872 – February 8, 1958) was Mayor of Honolulu from 1915 to 1917.\nBorn at Makao, Oʻahu, Lane was educated at Hauula School and St. Louis College. He held various jobs as a clerk, and from 1893 to 1900 farmed near Honolulu. John Lane was one of 12 children born of William Carey Lane (1821–1895), an Irish sea captain, and Mary Kukeakalani Kahooilimoku, a Koolau chiefess. Born in County Cork, Ireland, his father was said to be a descendant of Irish kings. Lane's grandfather, a staunch Catholic, had forfeited his lands and moved to New York, taking his son William with him. William Carey Lane later ended up in Hawaii where he married a Hawaiian chiefess. Kukeakalani was the daughter of Kukanaloa, a member of King Kamehameha I's court who served as the keeper of the king's personal war canoe.[2][3][4][5]\n",
        "type": []
    },
    "21": {
        "link": "/wiki/William_H._Cornwell",
        "title": "William H. Cornwell",
        "date": "November 18, 1903(1903-11-18) (aged 60) Waikapu. Territory of Hawaii",
        "year": "1903",
        "location": "",
        "state": "Hawaii",
        "place": "Waimea",
        "county": "Hawaiʻi County",
        "paragraph": "\nWilliam Henry Cornwell (May 30, 1843 – November 18, 1903) was an American businessman, as well as a military colonel and politician of the Kingdom of Hawaii. He served two separate terms as Minister of Finance and was a member of Queen Liliuokalani's last cabinet before the Overthrow of the Kingdom of Hawaii.\nHe was born in Brooklyn, New York, and relocated to Hawaii at an early age with his family where they became involved in sheep ranching in Waimea.  He formed a partnership with James Louzada for a sugar cane plantation on Maui, which was later sold to Claus Spreckels.  Cornwell became a horse breeder, president of the Hawaiian Jockey Club, and a participant in the sport of horse racing.[1]\n",
        "type": []
    },
    "22": {
        "link": "/wiki/Hawaiian_insurgents",
        "title": "Hawaiian Kingdom",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Kingdom of Hawaiʻi",
        "county": "Hawaiʻi County",
        "paragraph": "\nThe Hawaiian Kingdom, or Kingdom of Hawaiʻi (Hawaiian: Ko Hawaiʻi Pae ʻĀina), was a sovereign state located in the Hawaiian Islands. The country was formed in 1795, when the warrior chief Kamehameha the Great, of the independent island of Hawaiʻi, conquered the independent islands of Oʻahu, Maui, Molokai and Lānaʻi and unified them under one government. In 1810, the whole Hawaiian archipelago became unified when Kauaʻi and Niʻihau joined the Hawaiian Kingdom voluntarily. Two major dynastic families ruled the kingdom: the House of Kamehameha and the House of Kalākaua.\nThe kingdom won recognition from the major European powers. The United States became its chief trading partner and watched over it to prevent other powers (such as Britain and Japan) from asserting hegemony. In 1887 King Kalākaua was forced to accept a new constitution in a coup by the Honolulu Rifles, an anti-monarchist militia. Queen Liliʻuokalani, who succeeded Kalākaua in 1891, tried to abrogate the new constitution. She was overthrown in 1893, largely at the hands of the Committee of Safety, a group including Hawaiian subjects and resident foreign nationals of American, British and German descent, many educated in the US.[12] Hawaiʻi was briefly an independent republic until the U.S. illegally annexed it through the Newlands Resolution on July 4, 1898, which created the Territory of Hawaiʻi. United States Public Law 103-150 of 1993 (known as the Apology Resolution), acknowledged that \"the overthrow of the Kingdom of Hawaiʻi occurred with the active participation of agents and citizens of the United States\" and also \"that the Native Hawaiian people never directly relinquished to the United States their claims to their inherent sovereignty as a people over their national lands, either through the Kingdom of Hawaiʻi or through a plebiscite or referendum.\" \n",
        "type": []
    },
    "23": {
        "link": "/wiki/Pan_Am_Flight_830",
        "title": "Pan Am Flight 830",
        "date": "August 11, 1982",
        "year": "1982",
        "location": "",
        "state": "Hawaii",
        "place": "Tokyo",
        "county": "Honolulu County",
        "paragraph": "Pan Am Flight 830 was a flight from New Tokyo International Airport (now known as Narita International Airport) in Tokyo, Japan, to Honolulu International Airport in Hawaii. On August 11, 1982, the Boeing 747-121 serving the flight, nicknamed Clipper Ocean Rover, was en route to Hawaii when the airplane was damaged by a bomb that had been placed on board. Despite the damage to the aircraft, Captain James E. \"Skipper\" O'Halloran III, of Spokane, Washington, was able to land in Honolulu safely. One person was killed while 284 survived; 16 of them were wounded.[2]\nAt the time of the explosion, the aircraft was approximately 225 kilometers (140 mi; 121 nmi) northwest of Hawaii, cruising at 36,000 feet (11,000 m) with 270 passengers and 15 crew on board.[3] The bomb, which had been placed under a seat cushion, killed 16 year-old Toru Ozawa, a Japanese national. The blast also injured 16 other people (including Ozawa's parents) and caused damage to the floor and ceiling. The aircraft remained airborne and made an emergency landing in Honolulu with no further loss of life.\nThe bomb was placed by Mohammed Rashed, a Jordanian linked to the 15 May Organization. In 1988, he was arrested in Greece, tried, convicted of murder and sentenced to 15 years in prison. He was paroled in 1996 after serving eight years. He was later extradited to the US from Egypt in 1998 to stand trial. In 2006, as part of a plea bargain agreement he was sentenced to a further seven years in federal prison. As per his agreement with US prosecutors in providing information about other terrorist plots, he was released from prison in March 2013 but as of March 2014[update] still remained in a federal immigration detention facility in upstate New York awaiting deportation.[4] Rashed was relocated to Mauritania in November 2016.[5]\n",
        "type": [
            "terrorist",
            "murder"
        ]
    },
    "24": {
        "link": "/wiki/William_Ansel_Kinney",
        "title": "William Ansel Kinney",
        "date": "c. 1930",
        "year": "1930",
        "location": "",
        "state": "Hawaii",
        "place": "the Republic of Hawaii",
        "county": "Honolulu County",
        "paragraph": "William Ansel Kinney (1860–1930) was a lawyer and politician in the Kingdom of Hawaii, through the Republic of Hawaii and into the Territory of Hawaii.\nWilliam Ansel Kinney was born October 16, 1860, in Honolulu, Hawaii.\nHis father was William Kinney, who was born April 15, 1832, in Chebogue, Nova Scotia.[1]\nHis uncle Joseph Robbins Kinney (1839–1919) was a member of the House of Commons of Canada.\nHis father came to the Hawaiian Islands in the 1850s and married his mother Caroline Dailey (died March 25, 1897) on July 6, 1857.[2]\nHis father then married up to three different native Hawaiian women, having many other children by them. \nFor example, half-brother William Kihapiʻilani Kinney (1868–1953) married Mary Francesca Vierra, and their son Ernest Kaipoleimanu Kinney (1906–1987) married Esther Kauikeaulani Kaʻulili and had daughter Rubellite Kawena Kinney Johnson, who became a Hawaiian historian.[3]\nThe youngest half-sibling was Ray Kinney, born in Hilo September 26, 1900, who became a popular musician and composer. His father managed the sugarcane plantation at Honomu, Hawaii and died June 3, 1915.[4]\nKinney attended Royal School and later Punahou School 1874–1877 and worked as a clerk in a law office. He graduated from law school at the University of Michigan in 1883.[5]\nHe married Alice Vaughan McBryde on August 16, 1893 in Honolulu.[2]\nHis first law partner was Arthur P. Peterson. In 1887 he became partners with William Owen Smith and Lorrin A. Thurston.[6]\nIn 1887 he was elected to the legislature of the Hawaiian Kingdom as a representative from Hawaiʻi island.[7]\nDuring the summer of 1887, he helped draft the 1887 Constitution of the Kingdom of Hawaii, called the \"Bayonet Constitution\" because King Kalākaua was forced to sign it. The government headed by Walter M. Gibson was forced to resign and was replaced by one including Thurston in the cabinet.[8]\n",
        "type": []
    },
    "25": {
        "link": "/wiki/Adriano_Domingo",
        "title": "Adriano Domingo",
        "date": "August 3, 1943",
        "year": "1943",
        "location": "",
        "state": "Hawaii",
        "place": "Kauai",
        "county": "Kauaʻi County",
        "paragraph": "Adriano Domingo (1910 – January 7, 1944) was the final civilian executed by the Territory of Hawaii prior to their abolition of the death penalty in 1957. Domingo was sentenced to death and hanged for the murder of Helen R. Sakamoto, a 21-year-old secretary, in Kauai on August 3, 1943. Although Domingo's execution made him the final civilian executed by the Territory of Hawaii, there were several executions that took place there during and after World War II for military crimes, some of which were not committed in Hawaii.\nDomingo was born in 1910 in the Philippines. At the time of the 1930 United States census, he was unmarried and living in Koloa, Hawaii, with a romantic partner named Igiton Gomo.[1]\nOn August 3, 1943, 21-year-old Helen R. Sakamoto, a secretary, was walking through a sugarcane field near her home on Kauai when Domingo waylaid her and made a romantic overture. When Sakamoto turned him down, Domingo attempted to rape her before he procured a pair of scissors and stabbed her to death.[2][3] Her body was found hours later after a search, which her father, Junichi Sakamoto, started and led after Sakamoto failed to return home at her expected time.[4]\n",
        "type": [
            "rape",
            "murder"
        ]
    },
    "26": {
        "link": "/wiki/George_Norton_Wilcox",
        "title": "George Norton Wilcox",
        "date": "January 21, 1933(1933-01-21) (aged 93) Honolulu",
        "year": "1933",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "George Norton Wilcox (August 15, 1839 – January 21, 1933) was a businessman and politician in the Kingdom of Hawaii and Territory of Hawaii.\nGeorge Norton Wilcox was born in Hilo August 15, 1839.\nHis father was Abner Wilcox (1808–1869) and mother was Lucy Eliza Hart (1814–1869). His parents were in the company of missionaries to Hawaii for the American Board of Commissioners for Foreign Missions, sailing in 1836. His parents taught at the Hilo Mission boarding school founded by David Belden Lyman and his wife.[1] He had one older brother and two younger ones born while at Hilo.\nIn 1846 the family moved to teach at a similar school at the Waiʻoli Mission near Hanalei, Hawaii on the northern coast of the island of Kauaʻi. There he had four more brothers, although one died young.[2]\nHe graduated from Punahou School 1850–1860,[3] and worked for Samuel Gardner Wilder loading a shipload of guano from Jarvis Island.  He then attended Yale from 1860 to 1862 where he studied civil engineering in the Sheffield Scientific School.[4]\n",
        "type": []
    },
    "27": {
        "link": "/wiki/Charles_Burnett_Wilson",
        "title": "Charles Burnett Wilson",
        "date": "12 September 1926 (aged 76)",
        "year": "1926",
        "location": "",
        "state": "Hawaii",
        "place": "Tahiti",
        "county": "Honolulu County",
        "paragraph": "\nCharles Burnett \"C.B.\" Wilson (4 July 1850 – 12 September 1926) was a British and Tahitian superintendent of the water works, fire chief under King Kalākaua, and Marshal of the Kingdom under Queen Liliʻuokalani.[1] Wilson was also the father of John H. Wilson.\nC. B. Wilson was born at sea, on a voyage between Tahiti and Fanning Island on 4 July 1850. His father Charles Burnett Wilson (1801–1853) was Scottish by ethnicity and a British subject but grew up in Papeete, Tahiti. He became a sea trader and captain of his own ship. He was moving his family to Fanning Island to establish a coconut plantation for producing coconut oil. His mother was Tetaria, a Tahitian chiefess. Wilson's father continued searching for unmapped islands in the Pacific. He was lost at sea en route from Australia to New Zealand in 1853. Tetaria, strained from the stresses of rearing two sons on a plantation island, handed over Wilson and his younger brother Richard to Captain Harry English who ran the plantation, while she returned to Tahiti. English left Wilson and his brother to a Captain Smith and his wife in Hawaii who ran a school which Wilson was enrolled in. Wilson was put on a career path of becoming a blacksmith. He married a hula dancer and friend of Liliʻuokalani, Eveline Townsend. Their son Johnny became a co-founder of the Democratic Party of Hawaii and mayor of Honolulu in the 20th century.\n",
        "type": []
    },
    "28": {
        "link": "/wiki/William_P%C5%ABnohu_White",
        "title": "William Pūnohu White",
        "date": "November 2, 1925(1925-11-02) (aged 74) Honolulu, Oʻahu, Territory of Hawaii",
        "year": "1925",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nWilliam Pūnohuʻāweoweoʻulaokalani White (Hawaiian pronunciation: [puːnohuˌʔaːweoaːweoˌʔuləokəˈlɐni]; August 6, 1851 – November 2, 1925) was a Hawaiian lawyer, sheriff, politician, and newspaper editor. He became a political statesman and orator during the final years of the Kingdom of Hawaii and the beginnings of the Territory of Hawaii. Despite being a leading Native Hawaiian politician in this era, his legacy has been largely forgotten or portrayed in a negative light, mainly because of a reliance on English-language sources to write Hawaiian history. He was known by the nickname of \"Pila Aila\" or \"Bila Aila\" (translated as Oily Bill) for his oratory skills.[1][2]\nBorn in Lahaina, Maui, of mixed Native Hawaiian and English descent, White was descended from Kaiakea, a legendary orator for King Kamehameha I. Representing Lahaina in the legislative assemblies of 1890 and 1892, he became a political leader for the Liberal faction in the government and established himself as a leader in the opposition to the unpopular Bayonet Constitution of 1887. Throughout the terms of both legislatures, White led attempts to pass bills calling for a constitutional convention. He was criticized by the missionary Reform party for his support of the controversial lottery and opium bills. He and  Joseph Nāwahī co-authored the proposed 1893 Constitution with Queen Liliʻuokalani. They were decorated Knight Commanders of the Royal Order of Kalākaua for their service and contribution to the monarchy. When an attempt by the queen to promulgate this constitution failed on January 14, 1893, White's opponents falsely alleged he had tried to incite the people to storm ʻIolani Palace and harm the queen and her ministers. White denied these charges and threatened to sue the newspapers. Three days after the attempted promulgation, the queen was deposed in a coup during the overthrow of the Kingdom of Hawaii on January 17, 1893.\n",
        "type": []
    },
    "29": {
        "link": "/wiki/Felony_murder_rule_in_Hawaii",
        "title": "Felony murder rule in Hawaii",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "",
        "county": "",
        "paragraph": "In the state of Hawaii, the common law felony murder rule has been completely abolished.[1]\nIn Hawaii Revised Statutes §707-701, the Hawaii State Legislature noted the critical history of the felony murder rule and the severe limitation of it in the Model Penal Code.  The legislature determined that the commission of a felony should not serve to automatically classify an offense as murder, and that a separate factual inquiry should be undertaken for each case to determine the significance of a felony on the severity of the offense.[2]\n\n",
        "type": [
            "murder"
        ]
    },
    "30": {
        "link": "/wiki/Wilcox_rebellions",
        "title": "Wilcox rebellions",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "",
        "county": "",
        "paragraph": "The Wilcox Rebellions were an armed rebellion in 1888, a revolt in 1889, and a counter-revolution in 1895, led by Robert William Wilcox against the promulgation of the Bayonet Constitution in 1888 and 1889, and against the overthrow of the monarchy in 1895.  He was considered a royalist and dedicated to the monarchy of the Kingdom of Hawaii.  Wilcox's revolts were part of the Hawaiian Rebellions.\nThe plot was to overthrow King David Kalākaua, king of Hawaii, and replace him with his sister in a coup d'état.\nIn 1887, in response to increased political tension between the legislature and the king, a group of government ministers led by Interior Minister Lorrin A. Thurston with the support of the Honolulu Rifles, forced King David Kalākaua to promulgate the Bayonet Constitution. The constitution stripped Asians of their voting rights while at the same time limited suffrage to wealthy Native Hawaiians, Americans and other Europeans. The king's own powers were limited substantially. Hostilities grew over the new constitution that limited mostly non-white commoners' rights and power. Kalākaua's sister, Princess Liliʻuokalani and wife, Queen Kapiolani returned from Queen Victoria's Golden Jubilee immediately after news reached them in Great Britain.[1]\n",
        "type": [
            "riot"
        ]
    },
    "31": {
        "link": "/wiki/John_L._Stevens",
        "title": "John L. Stevens",
        "date": "February 8, 1895(1895-02-08) (aged 74) Augusta, Maine, United States",
        "year": "1895",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "John Leavitt Stevens (August 1, 1820 – February 8, 1895) was the United States Minister to the Hawaiian Kingdom in 1893 when he was accused of conspiring to overthrow Queen Liliuokalani in association with the Committee of Safety, led by Lorrin A. Thurston and Sanford B. Dole – the first Americans attempting to overthrow a foreign government under the auspices of a United States government officer.[1] Apart from his work as a politician and diplomat, he was also a journalist, author, minister and newspaper publisher. He founded the Republican Party in Maine and served as Maine State Senator.\nJohn Leavitt Stevens was born in 1820 in the town of Mount Vernon, Kennebec County, Maine, to Capt. John Stevens [2] and Charlotte (Lyford) Stevens.[3][4]  He was a lifelong resident of Augusta in the same county, except for his time away at school and his later diplomatic service.[5]  Stevens attended Maine Wesleyan Seminary to prepare for a minister's career in the Universalist church, which he served as pastor for a decade, becoming a leader in the anti-slavery movement. (Stevens later became a firm opponent of capital punishment, and as a Maine State Senator urged the legislature to abolish the death penalty).[6]\nAfter a decade as an activist Universalist minister, Stevens was persuaded by his lifelong friend Maine Governor Anson P. Morrill to give up the pulpit and become a newspaper publisher and politician. Stevens took his friend Morrill's advice, left the ministry and became a newspaper editor and publisher before becoming a Maine delegate to the 1860 Republican National Convention.[7]\n",
        "type": []
    },
    "32": {
        "link": "/wiki/Opposition_to_the_overthrow_of_the_Hawaiian_Kingdom",
        "title": "Opposition to the overthrow of the Hawaiian Kingdom",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "Kingdom",
        "county": "Hawaiʻi County",
        "paragraph": "Opposition to the overthrow of the Hawaiian Kingdom took several forms.  Following the overthrow of the monarchy on January 17, 1893, Hawaii's provisional government—under the leadership of Sanford B. Dole—attempted to annex the land to the United States under Republican Benjamin Harrison's administration.  But the treaty of annexation came up for approval under the administration of Grover Cleveland, a Democrat, anti-expansionist, and friend of the deposed Queen Liliuokalani of Hawaii. Cleveland retracted the treaty on March 4, 1893, and launched an investigation headed by James Henderson Blount; its report is known as the Blount Report.\nThe overthrow of the Hawaiian Kingdom was a result of progressive governmental control by foreigners and their descendants who were coming in increasing numbers to the islands of Hawaii. Many of these foreigners bought Hawaiian land and invested in the lucrative Hawaiian sugar industry. In 1887, these men forced the then reigning king, Kalākaua, to sign the so-called Bayonet Constitution, which stripped him of much of his power, in turn creating a constitutional monarchy. In 1890, the United States enacted the McKinley Tariff; the new law sharply raised the country's import tariffs, ending the Hawaiian sugar industry's dominance in the North American market and depressing prices, pushing Hawaii into turmoil.[2][3]\nFollowing the sugar crash, in 1893 the reigning Queen Lili'uokalani proposed a new constitution to replace the 1887 one. If adopted, the new constitution would revoke many of the foreigners' powers, and put the queen back in control of the Kingdom. The proposal was backed by the majority of the native population; however, it was naturally opposed by the Americans and other foreigners.  Hoping for American intervention, they began planning a coup. Anti-monarchists coalesced, forming the Committee of Safety while royalist leaders formed the Committee of Law and Order in support of the queen and the government.[4]\nThe situation soon escalated as both sides armed themselves. Fearing for American safety, the United States called on USS Boston to land a small force of Marines to protect American interests. Although the Americans were sworn to neutrality and never fired a shot, they did intimidate the royalist defenders, and Queen Lili'uokalani, fearing bloodshed, conceded.[3][5][6]\n",
        "type": []
    },
    "33": {
        "link": "/wiki/Lonopuakau",
        "title": "Kamanawa II",
        "date": "(1840-10-20) October 20, 1840Honolulu",
        "year": "1840",
        "location": "",
        "state": "",
        "place": "Kingdom",
        "county": "Hawaiʻi County",
        "paragraph": "Kamanawa II  known as Kamanawa ʻŌpio or Kamanawa ʻElua (c. 1785 – October 20, 1840) was a Hawaiian high chief and grandfather of the last two ruling monarchs of the Kingdom of Hawaii, King David Kalākaua and Queen Lydia Makaeha Liliʻuokalani. His family had a good reputation until 1840, when he was convicted of murdering his wife.\nKamanawa was born about 1785. His father was High Chief Kepoʻokalani. He was a grandson of Kameʻeiamoku, one of the five Kona chiefs who supported Kamehameha I in his formation of the Kingdom, one of the royal twins on the Coat of Arms of Hawaii. His mother was High Chiefess Alapaʻi Wahine.\nHis half-brother was ʻAikanaka.\n",
        "type": [
            "murder"
        ]
    },
    "34": {
        "link": "/wiki/Kirk_Lankford",
        "title": "Kirk Lankford",
        "date": "",
        "year": "2007",
        "location": "",
        "state": "Hawaii",
        "place": "Kalihi",
        "county": "Honolulu County",
        "paragraph": "Kirk Matthew Lankford (born 1985) is an American from Kalihi, Hawaii who was convicted of murdering a Japanese tourist in Pūpūkea, Hawaii.\nOn April 12, 2007, Japanese tourist Masumi Watanabe disappeared in Pūpūkea.[1] Lankford was arrested and charged with second-degree murder on April 26, 2007, after police found blood and items belonging to Watanabe in his pickup truck.[1] Watanabe's body was never found, but the blood in Lankford's truck was determined to have been Watanabe's.\nLankford denied any involvement in her disappearance and maintained there was a police conspiracy against him. After failing a polygraph exam, he admitted to being involved in her disappearance.\n",
        "type": [
            "murder"
        ]
    },
    "35": {
        "link": "/wiki/David_Kal%C4%81kaua_Kaw%C4%81nanakoa",
        "title": "David Kalākaua Kawānanakoa",
        "date": "May 20, 1953(1953-05-20) (aged 49) Honolulu, Oahu",
        "year": "1953",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nDavid Kalākaua Kawānanakoa (March 10, 1904 – May 20, 1953), also known as Prince Koke, was a member of the House of Kawānanakoa and the only son of Prince David Kawānanakoa and Princess Abigail Campbell Kawānanakoa.\nHe was born on March 10, 1904, at Honolulu, Oahu.[1] He was christened at the St. Augustine's Church on May 22, 1904.[2]\nHis siblings were Abigail Kapiolani Kawānanakoa and Lydia Liliuokalani Kawānanakoa.[3]: 166  He was educated abroad due to his father's status as a former prince and politician. He attended Oʻahu College, Fay School, in Southborough, Massachusetts; Taft School, Watertown, Connecticut, and Belmont Military Academy, Belmont, California. Kawānanakoa served in World War II with the US Coast Guard.\n",
        "type": [
            "murder"
        ]
    },
    "36": {
        "link": "/wiki/Killing_of_Iremamber_Sykap",
        "title": "Killing of Iremamber Sykap",
        "date": "April 5, 2021; 21 months ago (2021-04-05)",
        "year": "2021",
        "location": "Honolulu, Hawaii",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nOn April 5, 2021, Micronesian 16-year-old Iremamber Sykap was killed on Kalākaua Avenue when Honolulu police officer Geoffrey Thom fired 10 rounds at Sykap through the rear window of a stolen car after it had stopped at an intersection following a police pursuit. Thom was charged with second-degree murder for the shooting, and two other Honolulu Police Department officers were charged with attempted second-degree murder.[1] The charges were dismissed in district court on August 18, 2021.[2]\nOn April 5, 2021, officers from the Honolulu Police Department shot at a stolen Honda Accord with six occupants between the ages of 14 and 22, killing 16-year-old Micronesian teen Iremamber Sykap. The department stated that Sykap had been driving the car, that the car was stolen from Kailua, and that it was linked to multiple crimes including an armed robbery in Moiliili that occurred 20 minutes before the shooting. Hours after the shooting, chief of police Susan Ballard told reporters that officers had fired at the car while it rammed two marked police vehicles and drove through a fence into Kalakaua Canal, attributing the decision to open fire to the officers' knowledge that the occupants of the car had been involved in recent crimes.[3]\n",
        "type": [
            "shooting",
            "robbery",
            "murder",
            "killing",
            "robber"
        ]
    },
    "37": {
        "link": "/wiki/Morgan%27s_Corner_murder",
        "title": "Morgan's Corner murder",
        "date": "",
        "year": "1948",
        "location": "",
        "state": "",
        "place": "Nuuanu Valley",
        "county": "Honolulu County",
        "paragraph": "Morgan's Corner murder was committed by two escaped convicts James Majors and John Palakiko in Nuuanu Valley on the outskirts of Honolulu when they burglarized the home of Therese Wilder on March 11, 1948. They left her bound and gagged, which caused her to suffocate. The two were almost sentenced to death by the court, but were given a stay of execution and sentenced to prison instead. After the incident Morgan's Corner gained a reputation for being haunted.\nMorgan's Corner is a bend on Nuuanu Pali Drive that connected Honolulu to Kāneʻohe before it was superseded by Hawaii Route 61. The bend is after a hairpin turn from the Honolulu side of the bend. Morgan's Corner became referred to as a \"corner\" because the bend curves the road perpendicularly so that from Honolulu one enters the bend from the north and exits to the east or from Kāneʻohe one enters the bend from the east and exits to the north. The namesake came from Dr. James Morgan, who built his villa on the inside of the bend in the 1920s.[1] Wilder's house was opposite Morgan's, south of the bend.\nAt the time of the murder the area was a semirural rainforest. Petty criminals James Majors (19) and John Palakiko (21) escaped a prison work crew on March 10, 1948. The next day they intended to get supplies by burglarizing a neighbor of Therese Wilder (68), widow of William Wilder. The pair were hungry and when they smelled Wilder's cooking they decided to rob her instead.[2] The two men attacked, bound, and gagged Wilder, then left her on her bed. During the struggle Wilder had her jaw broken. She suffocated when she was gagged with a broken jaw.[1] Five days later on March 16 Wilder's gardener Isabelo Escalante and maid Miya Matayoshi found her body.\n",
        "type": [
            "murder"
        ]
    },
    "38": {
        "link": "/wiki/Robert_Napu%CA%BBuako_Boyd",
        "title": "Robert Napuʻuako Boyd",
        "date": "September 9, 1914(1914-09-09) (aged 50) Honolulu, Hawaii",
        "year": "1914",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nRobert Napuʻuako Boyd[a] ([ˈɹɑb.ɚt napuʔuako boyd]; September 2, 1864 – September 9, 1914) was a Native Hawaiian insurgent leader during the latter years of the Kingdom of Hawaii. Educated under the government-funded study program of King Kalākaua, he attended the Royal Naval Academy at Livorno in Italy. He became a friend of Robert William Wilcox, another Hawaiian student enrolled at Turin. They were both recalled back in Hawaii after the government stopped funding their education. Back home, he participated with Wilcox in the unsuccessful Wilcox rebellion of 1889 aimed at restoring political power to the king.\nBoyd was born September 2, 1864, in Honolulu, to Edwin Harbottle Boyd (1834–1875) and Maria Punapanaewa Adams Boyd (1841–1891).[1] He was of British and Hawaiian descent. His two-time great-grandfather John Harbottle (1781–1830) was a British naval officer, one of the first foreign residents in Hawaii, and Kamehameha I's port pilot. Harbottle's wife, High Chiefess Papapaunauapu, was the adoptive granddaughter of Kamehameha I. His paternal grandfather Robert Lopaka Boyd (1785–1870), who married one of Harbottle's daughters, had served as the King's shipbuilder, and it is believed that he came from the British West Indies. Boyd's maternal grandfather, Alexander Adams, of Scottish descent, was another well-known foreign advisor of the King and has been credited by some historians as the designer of the flag of Hawaii.[2][3][4]\n",
        "type": []
    },
    "39": {
        "link": "/wiki/Charles_T._Gulick",
        "title": "Charles T. Gulick",
        "date": "November 7, 1897(1897-11-07) (aged 56) Honolulu, Republic of Hawaiʻi",
        "year": "1897",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nCharles Thomas Gulick (July 25, 1841 – November 7, 1897) was a Kingdom of Hawaiʻi politician and one of the few members of the various missionary families of the time to side with the monarchy in the 1893 overthrow of the Kingdom of Hawaiʻi.\nGulick was born on July 25, 1841, to a family of American missionaries.[1] His father was William Gulick, and mother was Eliza Throop Thomas (1804–1903).\nHis father's brother Peter Johnson Gulick married his mother's sister Frances \"Fanny\" Hinckley Thomas (1798–1883), who had seven children (his cousins) who also became missionaries, including Luther Halsey Gulick (1828–1891) and John Thomas Gulick (1832–1923).[2]\n",
        "type": []
    },
    "40": {
        "link": "/wiki/Joseph_O._Carter",
        "title": "Joseph O. Carter",
        "date": "February 27, 1909(1909-02-27) (aged 73)",
        "year": "1909",
        "location": "",
        "state": "Hawaii",
        "place": "Japan",
        "county": "Honolulu County",
        "paragraph": "Joseph Oliver Carter (December 20, 1835 – February 27, 1909), known professionally as Joseph O. Carter, also known as J. O. Carter and Joe Carter, was a legal advisor to Queen Liliʻuokalani, serving on her Privy Council of State.\nHe served in the Provisional Government of Hawaii after the overthrow of the Kingdom of Hawaii and was an opponent to annexation by the United States. Carter was trustee of many large estates in Hawaii and was one of the first directors of the Bishop Museum.\nDuring the reign of King Kalākaua, Carter was Acting Commercial Agent for Japan and served two terms as representative in the Legislature of the Kingdom of Hawaii. He was president of C. Brewer & Co. in Honolulu.\n",
        "type": []
    },
    "41": {
        "link": "/wiki/Joseph_N%C4%81wah%C4%AB",
        "title": "Joseph Nāwahī",
        "date": "September 14, 1896(1896-09-14) (aged 54) San Francisco, California",
        "year": "1896",
        "location": "",
        "state": "Hawaii",
        "place": "Puna",
        "county": "Hawaiʻi County",
        "paragraph": "\nJoseph Kahoʻoluhi Nāwahī (January 13, 1842 – September 14, 1896), also known by his full Hawaiian name Iosepa Kahoʻoluhi Nāwahīokalaniʻōpuʻu, was a Native Hawaiian nationalist leader, legislator, lawyer, newspaper publisher, and painter. Through his long political service during the monarchy and the important roles he played in the resistance and opposition to its overthrow, Nāwahī is regarded as an influential Hawaiian patriot.\nBorn on the island of Hawaii, Nāwahī received his formal education in the Protestant missionary schools of the islands. He began his career as a teacher at the Hilo Boarding School and later became a self-taught lawyer. He was also an accomplished artist, and was one of the few indigenous Hawaiian painters to work in Western styles during the 19th century. Entering the realm of politics in 1872 as a member of the House of Representatives, he represented his home districts of Puna and later Hilo in the Legislature of the Kingdom of Hawaii for two decades. Serving in the final legislative assembly 1892–1893, he became a political leader for the Liberal faction in the government. He established himself as a leader in the opposition to the unpopular Bayonet Constitution of 1887 and as a defender of the idea of Hawaiian nationhood and self-rule. Alongside William Pūnohu White, he was a principal author of the proposed 1893 Constitution with Queen Liliʻuokalani. They were decorated Knight Commanders of the Royal Order of Kalākaua for their service and contribution to the monarchy. Three days after an attempted promulgation of the constitution, the queen was deposed in a coup during the overthrow of the Kingdom of Hawaii on January 17, 1893.\n",
        "type": [
            "riot"
        ]
    },
    "42": {
        "link": "/wiki/Morgan_Report",
        "title": "Morgan Report",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "",
        "county": "",
        "paragraph": "The Morgan Report was an 1894 report concluding an official U.S. Congressional investigation into the events surrounding the overthrow of the Hawaiian Kingdom, including the alleged role of U.S. military troops (both bluejackets and marines) in the overthrow of Queen Liliʻuokalani. Along with the Blount Report submitted in 1893, it is one of the main source documents compiling the testimony of witnesses and participants in the overthrow of the Hawaiian Kingdom in January 1893. The Morgan Report was the final result of an official U.S. Congressional investigation into the overthrow, conducted by the United States Senate Committee on Foreign Relations, whose chairman was Senator John Tyler Morgan, Democrat of Alabama.\nThe Report is formally named the Senate Report 227 of the 53rd Congress, second session, and dated February 26, 1894. It was printed as part of a large volume containing other government documents: \"Reports of Committee on Foreign Relations 1789–1901 Volume 6.\"[1]\nThe Blount Report had concluded that the U.S. Minister to Hawaii John L. Stevens carried out unauthorized partisan activities, including the landing of U.S. Marines under a false or exaggerated pretext, to support the anti-royalist conspirators and that these actions were instrumental to the success of the overthrow of the queen.[3] The Morgan Report contradicted the Blount Report, finding all individuals involved in the overthrow – with the notable exception of Queen Liliʻuokalani – \"not guilty\". The Native Hawaiians Study Commission Report of 1993, commenting on the two competing reports, states: \"The truth lies somewhere between the two reports.\"[4]\n",
        "type": []
    },
    "43": {
        "link": "/wiki/1996_Honolulu_hostage_crisis",
        "title": "1996 Honolulu hostage crisis",
        "date": "February 6, 1996; 26 years ago (1996-02-06) c. 7:00 a.m. – c. 2:30 p.m. (UTC-10)",
        "year": "1996",
        "location": "Sand Island, Honolulu, Hawaii, U.S.",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nThe 1996 Honolulu hostage crisis occurred on February 6, 1996, in Sand Island, Honolulu, Hawaii, when 28-year-old John Miranda took hostages at the Seal Masters of Hawaii building, his former place of employment. During the hostage crisis, two hostages were injured, one seriously. Miranda was the only fatality during the crisis itself. However, a few weeks after the event, he was found to have murdered his former girlfriend prior to the crisis.[1]\nThe incident began just before 7:00 a.m. on February 6, 1996, when 28-year-old John Nahale Miranda burst into the Seal Masters of Hawaii building. The company was a waterproofing business that was based in Sand Island, Honolulu. Miranda had previously worked at the building as an employee but had been fired eight months prior to the crisis. Miranda was enraged over having no money or job; he had also accused company officials of racism and firing him solely because he was Hawaiian/Puerto Rican. Miranda had armed himself with a sawed-off shotgun and a knife. As he made entry, Miranda demanded twenty-thousand dollars in cash from the company.[2] The company owner, Harry Lee, prepared to accept the deal, but Lee's wife insisted on calling the police instead. As the call was made, Miranda took five employees who were working in the building hostage. One of them was his former supervisor and vice president of the company, 59-year-old Guy George. George had been the one to personally fire Miranda at the time of his dismissal. Miranda then opened fire with his sawed-off shotgun and shot George once in the leg. George suffered a serious gunshot wound to his right leg, and nearly half of it was blown off.[3]\n",
        "type": [
            "shooting",
            "mass shooting",
            "murder"
        ]
    },
    "44": {
        "link": "/wiki/Masumi_Watanabe",
        "title": "Kirk Lankford",
        "date": "",
        "year": "2007",
        "location": "",
        "state": "Hawaii",
        "place": "Kalihi",
        "county": "Honolulu County",
        "paragraph": "Kirk Matthew Lankford (born 1985) is an American from Kalihi, Hawaii who was convicted of murdering a Japanese tourist in Pūpūkea, Hawaii.\nOn April 12, 2007, Japanese tourist Masumi Watanabe disappeared in Pūpūkea.[1] Lankford was arrested and charged with second-degree murder on April 26, 2007, after police found blood and items belonging to Watanabe in his pickup truck.[1] Watanabe's body was never found, but the blood in Lankford's truck was determined to have been Watanabe's.\nLankford denied any involvement in her disappearance and maintained there was a police conspiracy against him. After failing a polygraph exam, he admitted to being involved in her disappearance.\n",
        "type": [
            "murder"
        ]
    },
    "45": {
        "link": "/wiki/William_Henry_Daniels",
        "title": "William Henry Daniels",
        "date": "April 17, 1897(1897-04-17) (aged 41) Kailua, Maui, Territory of Hawaii",
        "year": "1897",
        "location": "",
        "state": "Hawaii",
        "place": "Kailua",
        "county": "Honolulu County",
        "paragraph": "William Henry Daniels (June 2, 1855 – April 17, 1897) was a judge, lawyer, and businessman of Wailuku, Maui during the Kingdom of Hawaii. He was declined reappointment to his office as district magistrate for refusing to take an oath to the Provisional Government of Hawaii and was arrested by the Republic of Hawaii for suspected involvement in the 1895 Counter-Revolution in Hawaii.[1][2][3]\nWilliam Henry Daniels was born on June 2, 1855, at Wailuku, on the island of Maui, of Native Hawaiian and British descent.[4] His father was Henry Wilson Daniels (1817–1879), the English-born circuit judge of Maui, and his mother was the British-Hawaiian Nancy Hannah Kamaekalani Copp (1835–1875), who married Judge Daniels on August 7, 1852 at Hana.[5][6][7] One of his sisters, Emma Daniels (1857–1906), was the wife of Colonel John Dominis Holt.[5]\nOn October 23, 1875, Daniels married Margaret Kalauwalu Kahanu (1863–1920), at Waimea, Hawaii. They had ten children.[8][9][10] Daniels became a successful businessman. At one point, he purchased the island of Kahoʻolawe with W. H. Cummings and sold it to C. Sneyd-Kynnersley. He was also an investor in the Hawaiian Fruit and Taro Company in Wailuku.[3][4]\n",
        "type": []
    },
    "46": {
        "link": "/wiki/Horace_Worth_Vaughan",
        "title": "Horace Worth Vaughan",
        "date": "November 10, 1922(1922-11-10) (aged 54) Honolulu, Territory of Hawaii, U.S.",
        "year": "1922",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nHorace Worth Vaughan (December 2, 1867 – November 10, 1922) was an American lawyer, jurist, and politician. He represented Texas in the United States House of Representatives and the United States Senate. In 1915, he received an appointment as assistant Attorney General in the Territory of Hawaii, where he lived the rest of his life.\nVaughan was born to attorney George T. and Tippah Leary Vaughan, on December 2, 1867 in Marion County, Texas.[1] He was of English ancestry, descended from early Jamestown, Virginia settler John Vaughn. He married Pearl Lockett in 1888.  They were the parents of Aileen, Robert Louis and Jean.[2]\n",
        "type": []
    },
    "47": {
        "link": "/wiki/Wilcox_rebellion_of_1889",
        "title": "Wilcox rebellion of 1889",
        "date": "July 30, 1889",
        "year": "1889",
        "location": "Honolulu, Hawaii",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Decisive Reformist Victory\nHonolulu Rifles\nThe Wilcox rebellion of 1889 (also known as the Wilcox insurrection of 1889) was a revolt led by Robert Wilcox to force King Kalākaua of Hawaii to reenact the Hawaiian Constitution of 1864 from the Constitution of 1887.\n",
        "type": [
            "riot"
        ]
    },
    "48": {
        "link": "/wiki/Samuel_Mills_Damon",
        "title": "Samuel Mills Damon",
        "date": "July 1, 1924(1924-07-01) (aged 79)",
        "year": "1924",
        "location": "",
        "state": "",
        "place": "the Republic of Hawaii",
        "county": "Honolulu County",
        "paragraph": "Samuel Mills Damon (March 13, 1845 – July 1, 1924) was a businessman and politician in the Kingdom of Hawaii, through the Republic of Hawaii and into the Territory of Hawaii.\nDamon was born  in Honolulu on March 13, 1845.\nHis father was early missionary Samuel Chenery Damon (1815–1885) and his mother was Julia Sherman Mills (1817–1890). They arrived in Honolulu in 1842.[1] \nHis maternal great-uncle was minister Samuel John Mills  (1783–1818), who took part in the Haystack Prayer Meeting which led to the formation of the American Board of Commissioners for Foreign Missions, the group that sent the first American missionaries to Hawaii.[2]\nHe was educated at Punahou School from 1856 to 1863.\nOn September 5, 1872 he married  Harriet Melinda Baldwin (1846–1932), daughter of missionary Dwight Baldwin  (1798–1886).[3]\n",
        "type": []
    },
    "49": {
        "link": "/wiki/Hawaiian_Pineapple_Company",
        "title": "Dole plc",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nDole plc (previously named Dole Food Company and Standard Fruit Company) is an Irish agricultural multinational corporation headquartered in Dublin, Ireland. The company is among the world's largest producers of fruit and vegetables, operating with 38,500 full-time and seasonal employees who supply some 300 products in 75 countries.[2][3] Dole reported 2021 revenues of $6.5 billion.[2][3]\nAs of 2021, the company had approximately 250 processing plants and distribution centers worldwide in addition to 109,000 acres (44,000 ha) of farmland and real estate. The company operates through four segments: Fresh Fruit (bananas and pineapples; about 35% of 2020 revenues); Diversified Fresh Produce in Europe, the Middle East, and Africa; Diversified Fresh Produce in the Americas and other world regions (combined 37% of 2020 revenues); and Fresh Vegetables (29% of 2020 revenues).[2][4] Dole grows and markets bananas, pineapples, grapes, berries, deciduous and citrus fruits, and vegetable salads.[4] Dole operates a 13-vessel shipping line for importing its produce and exporting third-party goods to Latin America.[3][4][5]\n",
        "type": [
            "rape"
        ]
    },
    "50": {
        "link": "/wiki/Keaoua_Kekuaokalani",
        "title": "Keaoua Kekuaokalani",
        "date": "December 1819Kuamoʻo",
        "year": "1819",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Keaoua Kekua-o-kalani (sometimes known as Kaiwi-kuamoʻo Kekua-o-kalani) was a nephew of the king Kamehameha I, the chief from Hawaii Island who unified the Hawaiian islands.\nHe was the son of Kamehameha's younger brother Keliʻimaikaʻi and Kamehameha's half-sister Kiʻilaweau. After Kamehameha died in 1819, Keaoua rebelled against Kamehameha's successor, his son Kamehameha II. Keaoua's rebellion was brief; he was killed in battle about 21 December 1819.\nHis grandmother was Manono I, and his wife was Manono II.\n",
        "type": []
    },
    "51": {
        "link": "/wiki/John_H._Wilson_(Hawaii_politician)",
        "title": "John H. Wilson (Hawaii politician)",
        "date": "July 3, 1956(1956-07-03) (aged 84) [1]Honolulu, Territory of Hawaii (now State of Hawaii)",
        "year": "1956",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "John Henry Wilson (December 15, 1871 – July 3, 1956), was a civil engineer, insurgent, co-founder of the Democratic Party of Hawaii, and Mayor of Honolulu, Hawaii three times:  from 1920 to 1927, from 1929 to 1931, and from 1946 to 1954.\nWilson was born in Honolulu, Hawaii in 1871. His father was Charles B. Wilson (1850–1926), whose ethnic background was Scottish and Tahitian. C.B. Wilson was superintendent of the water works and fire chief under King Kalākaua, and was Marshal of the Kingdom under Queen Liliʻuokalani.[2]\nHis mother was three quarters of European descent and one quarter Hawaiian Eveline M. \"Kitty or Kittie\" Townsend, granddaughter of Captain Henry Blanchard of the ship Thaddeus which had brought the first missionaries of the American Board of Commissioners for Foreign Missions to Hawaii in 1820.\nWilson attended the Fort Street School and St. Alban's College. After graduating, he worked odd jobs on the West Coast, Hawaii, and Alaska. A construction job that he took in 1890 with Oahu Railway & Land led him to pursue civil engineering as a career.  With financial support from the Queen, he enrolled at Stanford University in 1891. However, lack of funds after the overthrow of the monarchy in 1893 forced him to leave Stanford in 1894. While on the mainland he was approached by revolutionaries looking for suppliers for the 1895 Counter-Revolution in Hawaii, and attempt to restore the monarchy. He took part in the smuggling of guns and ammunition to Maui as part of the arms buildup by rebel forces. After the failed revolution he spoke little about his role in fearing he would be arrested for treason. He admitted he smuggled guns and was of rank to participate in planning his mission. He planned to land a ship of insurgents from Maui to attack Honolulu, but was the mission was aborted after the revolution was exposed and martial law was activated.\n",
        "type": []
    },
    "52": {
        "link": "/wiki/Kamanawa_II",
        "title": "Kamanawa II",
        "date": "(1840-10-20) October 20, 1840Honolulu",
        "year": "1840",
        "location": "",
        "state": "",
        "place": "Kingdom",
        "county": "Hawaiʻi County",
        "paragraph": "Kamanawa II  known as Kamanawa ʻŌpio or Kamanawa ʻElua (c. 1785 – October 20, 1840) was a Hawaiian high chief and grandfather of the last two ruling monarchs of the Kingdom of Hawaii, King David Kalākaua and Queen Lydia Makaeha Liliʻuokalani. His family had a good reputation until 1840, when he was convicted of murdering his wife.\nKamanawa was born about 1785. His father was High Chief Kepoʻokalani. He was a grandson of Kameʻeiamoku, one of the five Kona chiefs who supported Kamehameha I in his formation of the Kingdom, one of the royal twins on the Coat of Arms of Hawaii. His mother was High Chiefess Alapaʻi Wahine.\nHis half-brother was ʻAikanaka.\n",
        "type": [
            "murder"
        ]
    },
    "53": {
        "link": "/wiki/1892_Legislative_Session_of_the_Hawaiian_Kingdom",
        "title": "1892 Legislative Session of the Hawaiian Kingdom",
        "date": "",
        "year": "1892",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "\nThe 1892 Session of the Legislature of the Hawaiian Kingdom, also known as the Longest Legislature, was a period from May 28, 1892, to January 14, 1893, in which the legislative assembly of the Hawaiian Kingdom met for its traditional bi-annual session. This unicameral body was composed of the upper House of Nobles and the lower House of Representatives. This would be the first session during the reign of Queen Liliʻuokalani and the last meeting of the legislative assembly during the Hawaiian monarchy. Three days after the prorogation of the assembly, many of the political tension developed during the legislative debates and the queen's attempt to promulgate a new constitution while her legislators were not in session led to the overthrow of the Hawaiian Kingdom on January 17, 1893.\nMembers of this legislative session included citizens and subjects of the kingdom of either full or mixed Native Hawaiian, Euro-American and Asian descent, who were divided across different party lines. They included the insurgents who would play an eventual role in the deposition of the queen, and also the political resistance leaders who would lead the opposition to the overthrow and attempts to annex the Hawaiian Islands to the United States.\n",
        "type": []
    },
    "54": {
        "link": "/wiki/Leper_War_on_Kaua%CA%BBi",
        "title": "Leper War on Kauaʻi",
        "date": "July 1–13, 1893",
        "year": "1893",
        "location": "Kalalau Valley, Kauaʻi",
        "state": "",
        "place": "Kauaʻi",
        "county": "Kauaʻi County",
        "paragraph": "Disputed\nPyrrhic victory for both sides\nKapahei Kauai  (POW)\nSanford B. Dole\nEdward G. Hitchcock\nWilliam O. Smith \n",
        "type": []
    },
    "55": {
        "link": "/wiki/Byran_Uyesugi",
        "title": "1999 Honolulu shootings",
        "date": "November 2, 1999 8:00 a.m. (HST)",
        "year": "1999",
        "location": "1200 N. Nimitz Highway Honolulu, Hawaii 96817 United States",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nThe 1999 Honolulu shootings or the Xerox murders were an incident of mass murder that occurred on November 2, 1999, in a Xerox Corporation building in Honolulu, Hawaii, United States.  Service technician Byran Koji Uyesugi shot at eight people; wounding seven fatally (six co-workers and his supervisor). This was the worst mass shooting in the history of Hawaii.\nAt 8:00 in the morning, Byran Koji Uyesugi, a service technician working at Xerox, opened fire inside the building with a semi-automatic pistol, killing his supervisor and six co-workers, and fired in the direction of another co-worker who fled the building.  The eighth person escaped without injury.\n",
        "type": [
            "shooting",
            "mass murder",
            "mass shooting",
            "murder",
            "killing"
        ]
    },
    "56": {
        "link": "/wiki/James_A._King",
        "title": "James A. King",
        "date": "October 16, 1899(1899-10-16) (aged 66) Honolulu, Hawaii",
        "year": "1899",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nJames Anderson King (December 4, 1832 – October 16, 1899) was a ship's master who became a politician of the Republic of Hawaii.\nJames Anderson King was born in Bridge of Allan, Scotland in December 4, 1832.\nHe arrived in the Kingdom of Hawaii during the 1860s, just after the American Civil War,  and worked as ship's master on merchant vessels. He sailed the Kona Packet on trading voyages to Alaska, Kamchatka, and Japan.[1] \nWhen Samuel Gardner Wilder arranged to buy the steamship Likelike, King was put in charge.[2]\nAs Wilder grew his fleet, Captain King was made superintendent of all shipping operations.\nHe married Charlotte Holmes Davis, daughter of Robert Grimes Davis. She was the great-granddaughter of Oliver Holmes, an early settler and Governor of Oʻahu, who had married into Hawaiian nobility. Her uncle William Heath Davis  (1822–1909) moved to Alta California in the 1830s.\n",
        "type": []
    },
    "57": {
        "link": "/wiki/Warren_Bolster",
        "title": "Warren Bolster",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "Mokuleia",
        "county": "Honolulu County",
        "paragraph": "Warren Edward Bolster (June 11, 1947 in Arlington, Virginia – September 6, 2006 in Mokuleia, Hawaii)[1] was an American skateboard photographer during the mid-1970s rebirth of skateboarding.\nHe was responsible for reviving Skateboarder Magazine, considered \"the bible\" of skate magazines, and his skateboarding photojournalism helped popularize and define the wheeled sport during its explosive rebirth in the 1970s.  Later in his career, he became an accomplished surfboard photographer in Hawaii.\nHis father was a U.S. foreign service officer and travelled extensively as a diplomat.  Bolster moved with his parents and sister to Sydney, Australia in 1963 when his father was appointed US Consul General.  He attended The Scots College. It was here that he learned to surfboard  and skateboard for the first time, at South Bondi in 1965. He was notable for driving a pillarless Ford Galaxie piled with surfboards around the Sydney beaches looking for good waves. This car had consular plates which meant that the toll collectors on the Sydney Harbour Bridge were required to salute as he went through at no charge, to the delight of all the surfers piled inside.\n",
        "type": []
    },
    "58": {
        "link": "/wiki/Black_Week_(Hawaii)",
        "title": "Black Week (Hawaii)",
        "date": "December 14, 1893 – January 11, 1894",
        "year": "1893",
        "location": "Honolulu, Hawaii",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "United States political victory \nUnited States\nUnited Kingdom\n",
        "type": [
            "riot"
        ]
    },
    "59": {
        "link": "/wiki/Henry_E._Cooper",
        "title": "Henry E. Cooper",
        "date": "May 15, 1929(1929-05-15) (aged 71) Long Beach, California",
        "year": "1929",
        "location": "",
        "state": "Hawaii",
        "place": "Republic of Hawaii",
        "county": "Honolulu County",
        "paragraph": "Henry Ernest Cooper (August 28, 1857 – May 15, 1929) was an American lawyer who moved to the Kingdom of Hawaii and became prominent in Hawaiian politics in the 1890s.  He formally deposed Queen Lili'uokalani of Hawaii in 1893, held various offices in the ensuing Provisional Government of Hawaii and Republic of Hawaii governments, and was the first United States Territory of Hawaii Attorney General, 1899–1900.  He later became a circuit judge in Honolulu.\nCooper was born August 28, 1857, in New Albany, Indiana, to Harriet Augusta Cooper and William Giles Cooper, a lawyer from England. He was educated in public schools in Boston and received the LLB degree from the Boston University School of Law in 1878. He was admitted to the bar in Suffolk County, Massachusetts and practiced law there.[1]\nCooper married Mary Ellen Porter October 2, 1883, in San Diego, California. In 1884 he named his estate Bonita Ranch, and the name was applied to the post office of Bonita, California.[2]\nThere the Coopers had five children: Alfred Dykes Cooper (born 6/8/1886), Henry Ernest Cooper Jr. (born July 1887), Wallace McKay Cooper (August 1888 – April 1, 1966), Theodore Augustus Cooper (born October 28, 1889), and Alice Cooper (December 9, 1890 – 1978).  He worked as an attorney for the California Southern Railroad, including arguing several cases in the Supreme Court of California.[3]\n",
        "type": []
    },
    "60": {
        "link": "/wiki/Kamokuiki",
        "title": "Kamokuiki",
        "date": "(1840-09-26) September 26, 1840Honolulu",
        "year": "1840",
        "location": "",
        "state": "",
        "place": "Kalākaua",
        "county": "Honolulu County",
        "paragraph": "Kamokuiki (c. 1795 – September 26, 1840) was a grandmother of the last two ruling monarchs of the Kingdom of Hawaii.\nKamokuiki was born about 1795 as a daughter of the chief Kanepawale, son of Kaʻihelemoana and Kaʻopa, and his wife chiefess Uaua, daughter of Kaʻehunuiamamaliʻi and Koʻi. Her grandfather's sister was Hikuikekualono, the mother of Kahaopulani, who according to legend hid and nursed the baby Kamehameha I during his infancy when he was being hunted down by Alapainui.[2]\nKamokuiki married High Chief Kamanawa II and with him had a son, Caesar Kapaʻakea (1815–1866). She also had a daughter named Kekahili by another husband named Alapaimaloiki.[3] The House of Kalākaua descends from her son Kapaʻakea. The House of Kawānanakoa descends from her daughter Kekahili.[citation needed]\n",
        "type": [
            "murder"
        ]
    },
    "61": {
        "link": "/wiki/Clarence_W._Ashford",
        "title": "Clarence W. Ashford",
        "date": "July 3, 1921(1921-07-03) (aged 64) Honolulu, Hawaii",
        "year": "1921",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Clarence Wilder Ashford (February 24, 1857 – July 3, 1921) was the Attorney General of the Hawaiian Kingdom under Kalākaua from 1887 to 1890 and later appointed circuit court judge during the Territory of Hawaii from 1914 to 1919.[1]\nHe was born in Ontario, Canada, and a cousin to Minister of the Interior Samuel Gardner Wilder. He and his brother Volney V. Ashford became involved with the Honolulu Rifles during the 1887 coup against King Kalākaua. He served in the cabinet of Kalākaua and later the House of Representative in the Hawaiian legislature of his successor Queen Liliuokalani from 1892 until the 1893 overthrow of the Hawaiian Kingdom.[2][3] Both brothers were exiled to San Francisco after the 1895 counter-revolution to restore the monarchy. Clarence returned to Hawaii after its annexation by the United States.[4][5]\nPresident Woodrow Wilson appointed him First Judge of First Circuit Court, District of Hawaii in 1914, a position he held until his retirement.[2]\n",
        "type": []
    },
    "62": {
        "link": "/wiki/Tyke_(elephant)",
        "title": "Tyke (elephant)",
        "date": "August 20, 1994(1994-08-20) (aged 20–21) Honolulu, Hawaii, United States",
        "year": "1994",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Tyke (1973 – August 20, 1994) was a female African bush elephant from Mozambique who performed with Circus International of Honolulu, Hawaii. On August 20, 1994, during a performance at the Neal Blaisdell Center, she killed her trainer, Allen Campbell, and seriously injured her groomer, Dallas Beckwith. Tyke then ran from the arena and through the streets of the Kakaʻako central business district for more than thirty minutes. Unable to calm the elephant, local police opened fire on the animal, which collapsed from the wounds and died. While the majority of the attack in the arena was recorded on consumer videotape by several spectators, additional professional video footage captured the attack on local publicist Steve Hirano and the shooting of Tyke herself (both of which took place outside of the building).\nAccording to Tyrone Taylor, Tyke's responsible trainer at the time (interviewed in documentary film), Tyke had been involved in three incidents prior to the attack of August 1994.[1][2]\nOn April 21, 1993, Tyke escaped through the front doors of the Altoona, Pennsylvania Jaffa Shrine Center during a performance, remaining untethered for an hour. The rampage caused more than $14,000 in damage. An affidavit obtained from a circus worker by the USDA the following day stated that Tyke had also attacked a tiger trainer, while the circus was in Altoona.[3]\n",
        "type": [
            "shooting"
        ]
    },
    "63": {
        "link": "/wiki/George_Floyd_protests_in_Hawaii",
        "title": "George Floyd protests in Hawaii",
        "date": "May 28, 2020 – June 7, 2020",
        "year": "2020",
        "location": " Hawaii, United States",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nThis is a list of George Floyd protests in Hawaii. Following the murder of George Floyd, protests spread from Minneapolis to other parts of the United States, including Hawaii. Protests broke out in Honolulu on the night of May 30 and spread to over four other cities over the following days.\nOn June 6, around 400 people held a \"paddle out\" around Hanalei Pier at Black Pot Beach Park to support Black Lives Matter and protest the murder of Floyd and other deaths from police violence.[1]\n",
        "type": [
            "murder"
        ]
    },
    "64": {
        "link": "/wiki/Samuel_Parker_(Hawaii_politician)",
        "title": "Samuel Parker (Hawaii politician)",
        "date": "March 19, 1920(1920-03-19) (aged 66) Territory of Hawaii, United States",
        "year": "1920",
        "location": "",
        "state": "Hawaii",
        "place": "Boston",
        "county": "Honolulu County",
        "paragraph": "\nSamuel Parker, known as Kamuela Parker (June 23, 1853 – March 19, 1920) was a major landowner and businessman on the island of Hawaii, heir to the Parker Ranch estate. He was also a leading political figure at a critical time of the history of the Kingdom of Hawaii, serving in its last cabinet.\nSamuel Parker was born on June 23, 1853. His paternal grandfather, John Palmer Parker (1790–1868), was a member of the eponymous Parker House Hotel family. John Parker was born in Boston, Massachusetts, but settled in the Hawaiian Islands. He founded the Hawaiian branch of the family when he married Chiefess Kipikane (1800–1860), who was related to the high-ranking chiefs of the Big Island. John's younger son, and Samuel's father, was Ebenezer Parker (1829–1855). Ebenezer Parker also married a Hawaiian woman, Kilia Nahulanui, on June 7, 1849.[1]\nDespite his American-sounding name and upbringing, Samuel Parker was of three-quarters native Hawaiian ancestry.\n",
        "type": []
    },
    "65": {
        "link": "/wiki/William_Owen_Smith",
        "title": "William Owen Smith",
        "date": "April 13, 1929(1929-04-13) (aged 80) Honolulu",
        "year": "1929",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nWilliam Owen Smith (August 4, 1848 – April 13, 1929) was a lawyer from a family of American missionaries who participated in the overthrow of the Kingdom of Hawaii. He was attorney general for the entire duration of the Provisional Government of Hawaii and the Republic of Hawaii.\nSmith was born August 4, 1848, in Kōloa on the island of Kauaʻi. His parents were the physician James William Smith (1810–1887) and Melicent Knapp Smith (1816-1891), a teacher.[1] His parents were in the tenth set of missionaries to Hawaii from the American Board of Commissioners for Foreign Missions who arrived in 1842.[2] His sister Charlotte Elizabeth \"Lottie\" Smith (1845–1896) married Alfred Stedman Hartwell (1836–1912), who was a former general in the American Civil War, on January 10, 1872. His brother, Jared Knapp Smith (1849–1897), became a physician and carried on his father's medical practice. His sister, Melicent Lena Smith (1854–1943), married William Waterhouse (1852–1942). Waterhouse was mayor of Pasadena, California, 1904–1906.[3]\n",
        "type": []
    },
    "66": {
        "link": "/wiki/Overthrow_of_the_Hawaiian_Kingdom",
        "title": "Overthrow of the Hawaiian Kingdom",
        "date": "January 17, 1893; 130 years ago (1893-01-17)",
        "year": "1893",
        "location": "Honolulu, Hawaii",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nHawaiian League / United States victory\nThe overthrow of the Hawaiian Kingdom was a coup d'état against Queen Liliʻuokalani, which took place on January 17, 1893, on the island of Oahu and led by the Committee of Safety, composed of seven foreign residents and six non-aboriginal Hawaiian Kingdom subjects of American descent in Honolulu.[5][6] The Committee prevailed upon American minister John L. Stevens to call in the U.S. Marines to protect the national interest of the United States of America. The insurgents established the Republic of Hawaii, but their ultimate goal was the annexation of the islands to the United States, which occurred in 1898. \n",
        "type": []
    },
    "67": {
        "link": "/wiki/Robert_William_Wilcox",
        "title": "Robert William Wilcox",
        "date": "October 23, 1903(1903-10-23) (aged 48) Honolulu, Territory of Hawaii",
        "year": "1903",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Robert William Kalanihiapo Wilcox (February 15, 1855 – October 23, 1903),[2] nicknamed the Iron Duke of Hawaiʻi, was a Native Hawaiian whose father was an American and whose mother was Hawaiian. A revolutionary soldier and politician, he led uprisings against both the government of the Hawaiian Kingdom under King Kalākaua and the Republic of Hawaii under Sanford Dole, what are now known as the Wilcox rebellions. He was later elected the first delegate to the United States Congress for the Territory of Hawaii.\nWilcox was born February 15, 1855, on the island of Maui. His father, Captain William Slocum Wilcox (1814[3]–1910[4]) was a native of Newport, Rhode Island. His mother was a native of Maui,[5] named Kalua. She was the daughter of Makole and Haupa. Makole was the great grandson of Keaweʻīkekahialiʻiokamoku.[6] Wilcox's grandmother, Haupa, was descended from Umi-a-Liloa of Maui (not to be confused with the king of Hawaii Island) and Lonomakaihonua.[6]\nHe attended Haleakala Boarding School in the town of Makawao.[2] Upon completion of his studies, Wilcox became a teacher at a Maui country school. In 1880, Wilcox was elected to the royal legislature in Honolulu on the island of Oʻahu. He represented the citizens of Wailuku and its neighboring Maui towns.[7]\n",
        "type": []
    },
    "68": {
        "link": "/wiki/Joseph_Kahahawai",
        "title": "Joseph Kahahawai",
        "date": "8 January 1932(1932-01-08) (aged 22) Honolulu, Hawaii",
        "year": "1932",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Joseph \"Joe\" Kahahawai Jr. (25 December 1909 – 8 January 1932) was a Native Hawaiian prizefighter accused of the rape of Thalia Massie. He was abducted and killed after an inconclusive court case ended with a hung jury mistrial.[1][2]\nKahahawai was born in rural Maui, 25 December 1909. His family moved to Honolulu and Kahahawai's parents divorced. He lived with his mother, who later remarried, while Kahahawai remained in contact with his father. He lived in the Kalihi-Palama area where he was part of the Kauluwela gang, in this case \"gang\" was simply known as a group of friends. After attending Kauluwela school, Kahahawai attended Saint Louis School through an athletic scholarship to play for the high school football team, building up a positive reputation. Due to the Great Depression, Kahahawai never graduated and worked various jobs. He also enlisted in the Territorial National Guard. As a boxer, Kahahawai fought both professionally under the name \"Joe Kalani\" and as a member of the 298th Infantry Regiment.[3]: 99 \nWith a hung jury – stymied by conflicting evidence – resulting in a mistrial, the defendants were released on bail to await a second trial. Though the second trial was to take place soon, many haole community members felt that justice had not been served and a few of them decided to take things into their own hands. On January 8, 1932, Kahahawai was approached by Albert O. Jones with a forged summons document stating that Major Ross, Territorial Police Commander needed to see him for questioning.[4] Kahahawai was taken by Jones and Navy Lieutenant Thomas Massie, while Thalia Massie's mother, Grace Fortescue and Edward J. Lord followed close behind.[1] Kahahawai was taken to the Fortescue's rented bungalow in Manoa where the group attempted to coerce a confession out of him at gunpoint. Although the exact circumstances of what happened are unclear, the fact is Kahahawai was killed by a single gunshot to the heart. The bullet severed his pulmonary artery, causing him to bleed to death.[5]\n",
        "type": [
            "rape",
            "murder"
        ]
    },
    "69": {
        "link": "/wiki/Manono_II",
        "title": "Manono II",
        "date": "December 1819Kuamoʻo",
        "year": "1819",
        "location": "",
        "state": "",
        "place": "Kūkaʻilimoku",
        "county": "Hawaiʻi County",
        "paragraph": "Manono II (died 1819) was a Hawaiian chiefess and member of the royal family during the Kingdom of Hawaii. She along with her second husband Keaoua Kekuaokalani died fighting for the Hawaiian religion after Kamehameha II abolished the kapu system.\nManono's father was Kekuamanoha, and her mother was Kalola-a-Kumukoʻa, the wife of Kamehameha before his victory at the Battle of Mokuʻōhai. Through her father she was a granddaughter of Kekaulike, the King or Moʻi of Maui. From her mother's side, she was the great-granddaughter of King Keaweʻīkekahialiʻiokamoku of Hawaiʻi.[1][2]\nHer half-siblings from her father's first marriage were Kalanimoku, Boki, and Wahinepio. She was the cousin of Kaʻahumanu, Kalākua Kaheiheimālie, and Namahana Piʻia, Kuakini, Governor of Hawaiʻi; and Keʻeaumoku II.[citation needed]\nAround 1809, while still in her youth, Manono was chosen along with her cousin Kekāuluohi by Kamehameha I \"to warm his old age\" thus becoming the old king's last two wives.[3]\nThe two young chiefesses were deemed his wahine pālama, a term that denote their special status and rank which required them to live in a sacred enclosure of lama wood.[4]\n\"Lama\" was the Hawaiian name for endemic ebony trees of genus Diospyros sandwicensis that were used in religious ceremonies.[5]\nOral tradition attested that Kamehameha's last child, a daughter named Kapapauai, was born from one of his wahine pālama, either Manono's or Kekāuluohi's.[3][6]\nShe would later marry High Chief Keaoua Kekuaokalani, a nephew of the Kamehameha I. Kekuaokalani's maternal grandmother was her namesake Manono I, a daughter of Alapainui and Kamakaimoku. Kekuaokalani inherited the guardianship of the Hawaiian god of war, Kūkaʻilimoku after Kamehameha's death.[7]\n",
        "type": []
    },
    "70": {
        "link": "/wiki/John_Adams_Cummins",
        "title": "John Adams Cummins",
        "date": "March 21, 1913(1913-03-21) (aged 78)",
        "year": "1913",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nJohn Adams Kuakini Cummins (March 17, 1835 – March 21, 1913) was a member of the nobility of the Kingdom of Hawaii who became a wealthy businessman, and was involved in politics as the kingdom was overthrown.\nJohn Adams Kuakini Cummins was born March 17, 1835, in Honolulu.\nHe was a namesake of island governor John Adams Kuakini  (1789–1844), who in turn took the name of John Quincy Adams when Americans first settled on the islands in the 1820s. His father was Thomas Cummins (1802–1885) who was born in Lincoln, England, raised in Massachusetts, and came to the Hawaiian Islands in 1828.[1]\nHis mother was High Chiefess Kaumakaokane Papaliʻaiʻaina (1810–1849) who was a distant relative of the royal family of Hawaii. As the custom of native Hawaiians, he was raised as an aliʻi nui because of his mother's family background. His father owned much of land in Waimānalo on the east coast of the island of Oʻahu, starting a horse and cattle ranch in the 1840s. He managed the ranch and converted it to a sugarcane plantation starting in 1877, and built a mill in 1881.[2]\n",
        "type": []
    },
    "71": {
        "link": "/wiki/Robert_Mark_Edwards",
        "title": "Robert Mark Edwards",
        "date": "",
        "year": "1986",
        "location": "",
        "state": "Hawaii",
        "place": "Maui County",
        "county": "Maui County",
        "paragraph": "Robert Mark Edwards (born 1961) is an American murderer who killed two female realtors in sexually-motivated murders, one in California in 1986 and another in Hawaii in 1993. In separate trials, he was sentenced to death and to life imprisonment in the respective states and is currently awaiting execution at the San Quentin State Prison.[1]\nIn May 1986, Edwards went to the Los Alamitos home of 55-year-old realtor Marjorie Elaine Deeble, the mother of his then-girlfriend Katherine Valentine. Once inside, he bound her hands and legs, a gag in her mouth, and a belt tied around her neck.[2] After sexually assaulting her and sodomizing her with a hair mousse can, Edwards proceeded to beat her to death before stealing jewelry from her home and leaving the premises. After being reported missing for several days, police were called in to inspect Deeble's home, only to find her apartment door slightly open and her body lying on the floor.[3] An autopsy was conducted on the day of the discovery, with Lt. Orville Lewis announcing in a press statement the following day that Deeble's death was ruled a murder, and that she was possibly sexually assaulted.[4] At the time, Edwards was routinely questioned regarding the murder, but was not considered a serious suspect.\nSometime after the murder, Edwards, a convicted criminal with a record for offenses such as burglary, theft, auto theft, and drug offenses, violated his parole conditions by moving to Maui County, Hawaii, where he took up work as a roofer, to escape a car theft conviction.[5] In 1990, he was arrested for attempting to stab a woman and charged with assault, but the case was not prosecuted as he was extradited to California to serve out his parole violation, which he served until early 1991.[5] Afterwards, he and a girlfriend returned to Hawaii, where they bought an apartment in Kihei, and Edwards found work at a roofing company called Pat's Quality Roofing, where he was considered \"normal\" by his colleagues and employer alike.[6]\n",
        "type": [
            "theft",
            "rape",
            "burglary",
            "assault",
            "murder"
        ]
    },
    "72": {
        "link": "/wiki/Jonah_K%C5%ABhi%C5%8D_Kalaniana%CA%BBole",
        "title": "Jonah Kūhiō Kalanianaʻole",
        "date": "January 7, 1922(1922-01-07) (aged 50) Waikīkī, Oʻahu, Territory of Hawaii",
        "year": "1922",
        "location": "",
        "state": "Hawaii",
        "place": "Waikīkī",
        "county": "Honolulu County",
        "paragraph": "\nJonah Kūhiō Kalanianaʻole (March 26, 1871 – January 7, 1922) was a prince of the Kingdom of Hawaiʻi until it was overthrown by a coalition of American and European businessmen in 1893. He later went on to become a representative in the Territory of Hawaii as delegate to the United States Congress, and as such is the only member of Congress ever born into royalty.[1]\nKūhiō was often called Ke Ali‘i Maka‘āinana (Prince of the People) and is well known for his efforts to preserve and strengthen the Hawaiian people.[2]\n",
        "type": []
    },
    "73": {
        "link": "/wiki/Roland_Kotani",
        "title": "Roland Kotani",
        "date": "July 28, 1989(1989-07-28) (aged 35) Honolulu, Hawaii",
        "year": "1989",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nRoland M. Kotani (June 15, 1954 – July 28, 1989) was an American politician and Democratic member of the Hawaii State House of Representatives. Kotani served as assistant majority floor leader and represented the Pearl City Pacific Palisades area.[1][2]\nHe was killed by his estranged wife Grace Kotani on July 28, 1989, at the age of 35.[3]\n",
        "type": [
            "murder"
        ]
    },
    "74": {
        "link": "/wiki/Eugene_Barrett",
        "title": "Eugene Barrett",
        "date": "November 8, 2003(2003-11-08) (aged 72) Pali Momi Medical Center, Waimalu, Hawaii, U.S.",
        "year": "2003",
        "location": "",
        "state": "Hawaii",
        "place": "Waimalu",
        "county": "Honolulu County",
        "paragraph": "Eugene Walter Barrett (June 30, 1931 – November 8, 2003) was an American serial killer who murdered three women he was romantically involved with in Honolulu, Hawaii from 1959 to 1995. He was sentenced to life imprisonment for the final murder, and died behind bars in 2003.[1] He was the first confirmed and one of only three known serial killers active in the state, the others being the unidentified Honolulu Strangler and the Kauai serial killer.\nEugene Walter Barrett was born on June 30, 1931, in Oakland, California, the older of two sons born to Howard and Emily Barrett (née Amorin). Little is known about his childhood, other than the fact that he studied at the Washington Intermediate School in Honolulu, HI until he dropped out in the ninth grade.[2] He later joined the Army and fought in the Korean War, but was dishonorably discharged in 1955 due to his excessive drinking.[2]\nAt some point after his discharge, he permanently moved to Honolulu, Hawaii, where he began a romantic relationship with a woman named Annie E. Phillips, a divorced mother of five children. Barrett, a house painter by profession, was unemployed and drank excessively, eventually leading to Phillips severing ties with him in 1959. Unable to handle her rejection, the enraged Barrett decided that he would kill his ex-girlfriend.[3] He armed himself with a gun, got on a bus to her apartment complex in Mayor Wright Homes and forced his way inside.[3] Barrett then walked across the living room, where two of Phillips' children were watching TV, and went into the bedroom, where he found her tending to her youngest child. Before she had time to react, he pulled out his gun and shot her multiple times, killing her on the spot. The ensuing racket alerted the neighbors, who managed to hold down and beat him until police forces could arrive.[4]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "75": {
        "link": "/wiki/Paul_Neumann_(Attorney_General)",
        "title": "Paul Neumann (Attorney General)",
        "date": "July 2, 1901(1901-07-02) (aged 61–62) Honolulu",
        "year": "1901",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Paul Neumann (1839 – July 2, 1901) was a lawyer, politician, and diplomat in California and the Kingdom of Hawaii.\nBorn and educated in Prussia, Neumann and his twin brother Edward relocated to California in 1854. The brothers worked in the goldmines, where Paul broke his leg.[1]\nEventually, Edward relocated to New Orleans and Paul moved to San Francisco. He became a lawyer in California around 1864, and was elected to represent San Francisco for three terms in the California State Senate.[1][2]\n",
        "type": []
    },
    "76": {
        "link": "/wiki/Apology_Resolution",
        "title": "Apology Resolution",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "",
        "county": "",
        "paragraph": "United States Public Law 103-150, informally known as the Apology Resolution, is a Joint Resolution of the U.S. Congress adopted in 1993 that \"acknowledges that the overthrow of the Kingdom of Hawaii occurred with the active participation of agents and citizens of the United States and further acknowledges that the Native Hawaiian people never directly relinquished to the United States their claims to their inherent sovereignty as a people over their national lands, either through the Kingdom of Hawaii or through a plebiscite or referendum\" (U.S. Public Law 103-150 (107 Stat. 1510)).  The resolution has been cited as impetus for the Hawaiian sovereignty movement, and has been the subject of debate.[1][2][3][4]\nThe resolution was adopted by both houses of the United States Congress on November 23, 1993. A joint resolution, it was signed by President of the United States Bill Clinton on the same day.\nThe resolution was passed in the Senate by a vote of 65–34. In the House, it was passed by a two-thirds voice vote. It was sponsored on January 21, 1993, as S.J.Res.19 by Daniel Akaka and co-sponsored by Daniel Inouye, both Democratic senators from Hawaii.\n",
        "type": []
    },
    "77": {
        "link": "/wiki/James_Henderson_Blount",
        "title": "James Henderson Blount",
        "date": "March 8, 1903(1903-03-08) (aged 65) Macon, Bibb County, Georgia",
        "year": "1903",
        "location": "",
        "state": "Hawaii",
        "place": "Jones County",
        "county": "Honolulu County",
        "paragraph": "James Henderson Blount (September 12, 1837 – March 8, 1903) was an American statesman, soldier and congressman from Georgia. He opposed the annexation of Hawaii in 1893 in his investigation into the American involvement in the political revolution in the Kingdom of Hawai'i.\nBlount was born near Clinton, Jones County, Georgia. He attended private schools there and in Tuscaloosa, Alabama. He graduated from the University of Georgia at Athens in 1858. He studied law and was admitted to the Georgia bar in 1859. During the American Civil War he served in the Confederate States Army as a private in the Second Georgia Battalion, Floyd Rifles for two years, and was later lieutenant colonel for two years.\nBlount served in the United States Congress representing the sixth district of Georgia from 1873 to 1893. He was part of the faction of Southern Democrats known as the Redeemers.[1] He was Chairman of the House Committee on Foreign Relations (1891–1893).\n",
        "type": []
    },
    "78": {
        "link": "/wiki/Samuel_K._Pua",
        "title": "Samuel K. Pua",
        "date": "August 1, 1932(1932-08-01) (aged 64)",
        "year": "1932",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nSamuel Kaholoʻokalani Pua[1] (October 27, 1867 – August 1, 1932) was a Native Hawaiian politician, newspaper editor, lawyer and sheriff of Hawaii. He served as a legislator during the last years of the Kingdom of Hawaii and worked as an assistant editor for the anti-annexationist newspaper Ke Ahailono o Hawaii (translated as The Hawaiian Herald) ran by members of Hui Kālaiʻāina (Hawaiian Political Association), after the overthrow of the monarchy. After the annexation, he became a sheriff during the Territory of Hawaii.\nSamuel Kaholoʻokalani Pua was born, in Honolulu, on October 27, 1867, the eldest son of David William Pua (1836–1896) and Mary Nahakuelua Pua (1832–1922).[2][3]\nHis father, the namesake for Pua Lane in Honolulu, was a member of the House of Nobles on the Legislature of the Kingdom of Hawaii. He was educated at the Royal School in Honolulu.[2][4]\n",
        "type": []
    },
    "79": {
        "link": "/wiki/Killing_of_Lindani_Myeni",
        "title": "Killing of Lindani Myeni",
        "date": "April 14, 2021; 21 months ago (2021-04-14)",
        "year": "2021",
        "location": "Nuʻuanu, Hawaii",
        "state": "Hawaii",
        "place": "Nuʻuanu",
        "county": "Honolulu County",
        "paragraph": "On April 14, 2021, three officers from the Honolulu Police Department shot and killed 29-year-old Lindani Myeni fronting a home in Nuʻuanu, Honolulu County, Hawaii during an alleged burglary.[1] Myeni was a Black South African who played professional rugby and had two young children. The shooting took place in a residence's driveway after apparent fighting with Honolulu police officers. All three police officers were injured, and one was hospitalized.[1]\nAfter the killing, Myeni's widow Lindsay Myeni filed a wrongful death lawsuit against the city of Honolulu, while Honolulu Prosecutor Steve Alm decided not to prosecute any of the involved officers after an investigation by his office.\nLindani Myeni was a Black South African man from the Zulu tribe,[3] raised in the town of Empangeni in KwaZulu-Natal,[4] who played professional rugby and had two young children.[5] He was married to Lindsay Myeni, who grew up in Hawaii. The couple met at a hotel in Durban, where Lindani was playing an away game of rugby and Lindsay had a layover during a worldwide Christian missionary trip. Their wedding was 18 months later, and they moved to the United States in January 2020 because of Lindsay's real estate career. Initially living in Tampa, Florida, the couple disliked the racial disparities there and did not feel safe as a mixed-race couple. They subsequently moved to Denver, where Lindani joined the Glendale Merlins while waiting for a work permit, but was arrested and released without charges while traveling with the Merlins in Austin, Texas, and was later stopped by police while walking to rugby practice in Denver. The couple moved to Hawaii as a result, arriving in February 2021[6] with their two children.[7] Lindsay began work selling real estate, while Lindani was a stay-at-home dad.[6]\n",
        "type": [
            "shooting",
            "burglary",
            "killing"
        ]
    },
    "80": {
        "link": "/wiki/Jane_Stanford",
        "title": "Jane Stanford",
        "date": "February 28, 1905(1905-02-28) (aged 76) Honolulu, Territory of Hawaii",
        "year": "1905",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nJane Elizabeth Lathrop Stanford (August 25, 1828 – February 28, 1905) was an American philanthropist, co-founder of Stanford University in 1885 (opened 1891) along with her husband, Leland Stanford, as a memorial to their only child, Leland Stanford Jr., who died of typhoid fever in 1884 at the age of 15. After her husband's death in 1893, she funded and operated the university almost single-handedly until her unsolved murder by strychnine poisoning in 1905.\nBorn Jane Elizabeth Lathrop in Albany, New York, she was the daughter of shopkeeper Dyer Lathrop and Jane Anne (Shields) Lathrop.[1][2]: 502  She attended The Albany Academy for Girls, the longest-running girls' day school in the country.  She was the second or third of six or seven siblings:\n",
        "type": [
            "murder"
        ]
    },
    "81": {
        "link": "/wiki/William_Richards_Castle",
        "title": "William Richards Castle",
        "date": "June 5, 1935(1935-06-05) (aged 86)",
        "year": "1935",
        "location": "",
        "state": "",
        "place": "Republic of Hawaii",
        "county": "Honolulu County",
        "paragraph": "William Richards Castle (March 19, 1849 – June 5, 1935) was a lawyer and politician in the Kingdom of Hawaii and Republic of Hawaii.\nWilliam Richards Castle was born in Honolulu on March 19, 1849. His father was Samuel Northrup Castle (1808–1894), and mother was Mary Tenney Castle (1819–1907). He was a namesake of William Richards (1793–1847) who drafted the first constitution of the kingdom.[1] On October 12, 1875 he married Ida Beatrice Lowrey (1854–1926) on October 12, 1875 and had three children.[2]\nHis brothers George Parmele Castle (1851–1932) and James Bicknell Castle (1855–1918) became executives in the firm Castle & Cooke which was co-founded by his father and Amos Starr Cooke, and developed it into one of the \"Big Five\" corporations that dominated the Territory of Hawaii economy.[3]\n",
        "type": []
    },
    "82": {
        "link": "/wiki/Lili%CA%BBuokalani%27s_Privy_Council_of_State",
        "title": "Liliʻuokalani's Privy Council of State",
        "date": "",
        "year": "1891",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Following the January 20, 1891 death of King Kalākaua in San Francisco, his embalmed body arrived at Honolulu Harbor aboard the USS Charleston, draped in black with its ensigns at half mast.[1] His sister Liliʻuokalani was designated his successor.[2]\nThe Privy Council of State of the Kingdom of Hawaii was a constitutionally-created body purposed to advise and consent to acts made by the monarch. The cabinet ministers were ex-officio members. Other privy counselors were appointed by the monarch according to his (or her) personal wishes.[3] At an emergency meeting of Kalākaua's privy council and justices of the supreme court, they were in accord that Liliʻuokalani be installed as monarch on January 29. She did not wish to discuss affairs of state during the period of mourning, but reluctantly acquiesced, and was given the oath of office by Hawaii Supreme Court Chief Justice Albert Francis Judd. Her husband John Owen Dominis was given the title of Prince Consort.[4][5][6]\nThe 1887 Constitution of the Kingdom of Hawaii had made a key change in regards to the cabinet ministers. The monarch was still empowered to appoint the ministers, but only the legislature, or a voluntary resignation, could remove them from office. After her brother's funeral, the queen demanded the resignations of his ministers, causing a legal challenge when they refused. The case was decided in her favor by the Supreme Court of the kingdom. All four cabinet members submitted their resignations, and three of the four remained on her privy council.[7][8]\n",
        "type": [
            "rape"
        ]
    },
    "83": {
        "link": "/wiki/Kauai_serial_killer",
        "title": "Kauai serial killer",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "Kauai",
        "county": "Kauaʻi County",
        "paragraph": "The Kauai serial killer is an unidentified serial killer and rapist who murdered two women and injured another on the island of Kauai, Hawaii, between April and August of 2000.[1] Despite a composite sketch of the perpetrator and the availability of his DNA, he was never caught, and the murders remain unsolved.[2]\nOn April 7, 2000, the body of Lisa Bissell, a 38-year-old woman from Hanapepe, was found in a ditch close to Polihale state park. She was raped, beaten, and later stabbed to death. Her throat was also slashed. Some of her belongings were found off of a road in Waimea, so it's believed she was abducted from there.[3][4]\nOn May 22, 2000, a 52-year-old woman was severely wounded by the perpetrator in Kekaha. The perpetrator approached the victim in the yard she was working in and told her, \"My name is John and I'm homeless.\" The victim recommended that he visit her neighbors home, where the owners frequently let homeless people camp on their property. When she turned around to continue working, the assailant forcefully took her behind the house and beat her, breaking one of her arms. He then sexually assaulted the victim. He later stabbed her in the chest with a knife, but the knife bent after it hit the victim's breastbone, so he threw it in a bush and fled.[5][6] The victim crawled for three hours until she reached a telephone and called for help.\n",
        "type": [
            "rape",
            "assault",
            "murder"
        ]
    },
    "84": {
        "link": "/wiki/Blount_Report",
        "title": "Blount Report",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "",
        "county": "",
        "paragraph": "The Blount Report is the popular name given to the part of the 1893 United States House of Representatives Foreign Relations Committee Report regarding the overthrow of the Kingdom of Hawaii.  The report was conducted by U.S. Commissioner James H. Blount, appointed by U.S. President Grover Cleveland to investigate the events surrounding the January 1893 overthrow of the Kingdom of Hawaii.\nThe Blount Report \"first provided evidence that officially identified the United States' complicity in the lawless overthrow of the lawful, peaceful government of Hawaii.\"[2] Blount concluded that U.S. Minister to Hawaii John L. Stevens had carried out unauthorized partisan activities, including the landing of U.S. Marines under a false or exaggerated pretext, to support the anti-royalist conspirators; that these actions were instrumental to the success of the revolution; and that the revolution was carried out against the wishes of a majority of the population of Hawaii.[3]\nThe Blount Report was followed in 1894 by the Morgan Report, which contradicted Blount's report by concluding that all participants except for Queen Liliʻuokalani were \"not guilty\".[4]: 648 \n",
        "type": []
    },
    "85": {
        "link": "/wiki/Albert_S._Willis",
        "title": "Albert S. Willis",
        "date": "January 6, 1897(1897-01-06) (aged 53) Honolulu, Hawaii, U.S.",
        "year": "1897",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nAlbert Shelby Willis (January 22, 1843 – January 6, 1897) was a United States Representative from Kentucky and a Minister to Hawaii.\nBorn in Shelbyville, Kentucky, Willis attended the common schools and graduated from the Louisville Male High School in 1860. He taught school for four years before graduating from the University of Louisville School of Law in 1866. He was admitted to the bar and commenced the practice of law in Louisville. He served as prosecuting attorney for Jefferson County from 1874 to 1877.\n",
        "type": []
    },
    "86": {
        "link": "/wiki/Myles_Fukunaga",
        "title": "Myles Fukunaga",
        "date": "November 19, 1929(1929-11-19) (aged 20) O'ahu Prison, O'ahu, Territory of Hawaii",
        "year": "1929",
        "location": "",
        "state": "",
        "place": "O'ahu",
        "county": "Honolulu County",
        "paragraph": "Myles Yukata Fukunaga (1909-1929) was a Japanese-American from Honolulu, Hawaii.[1] In 1928, he kidnapped and murdered George Gill Jamieson, the 10-year-old son of a local banker.[2][3]\nSubsequent to the murder, he demanded a $10,000 ransom.[4] Before the body of the victim was found, the Hawaiian Trust Company offered a reward of $5,000 with no questions asked.[5] Fukunaga eventually received $4,000 in $5 bills from the victim's father before he was arrested.[4] He was convicted of murder, sentenced to death, and executed.\n\n",
        "type": [
            "kidnapped",
            "murder"
        ]
    },
    "87": {
        "link": "/wiki/Hermann_A._Widemann",
        "title": "Hermann A. Widemann",
        "date": "February 7, 1899(1899-02-07) (aged 76) Honolulu",
        "year": "1899",
        "location": "",
        "state": "Hawaii",
        "place": "Kauaʻi",
        "county": "Kauaʻi County",
        "paragraph": "Hermann Adam Widemann (December 24, 1822 – February 7, 1899) was a businessman from Germany who was a judge and member of the cabinet of the Kingdom of Hawaii.\nWidemann was born in Hanover, Germany on December 24, 1822.[1]\nAs a teenager he went to work on a whaling ship. He came to live in the Hawaiian Islands in 1846, after stopping in 1843.\nHe came briefly to the California Gold Rush in 1849, but returned after his companion John von Pfister was murdered.[2]: 149 \nHe married a native Hawaiian Kaumana \"Mary\" Kapoli in 1854 and lived in Līhuʻe.[3]\nHe became sheriff of the island of Kauaʻi in 1854, was elected to the house of representatives in the legislature of the Hawaiian Kingdom in 1855, and in 1863 appointed its circuit judge.[4]\nHe started one of the first sugarcane plantations in Hawaii known as  Grove Farm.\nDuring the American Civil War he supported the Confederate States.[2]: 180 \nAfter selling Grove Farm to its manager George Norton Wilcox[5] in 1865, he moved to Honolulu to work in the capital. On July 10, 1869 he was appointed to the kingdom's supreme court, despite never having any formal law school training.\nOn February 18, 1874 he was appointed to the cabinet as minister of the interior until May 28, 1874, as well as on the Privy Council, the board of education, commissioner of crown lands, president of the bureau of immigration, and board of health.[4]\nIn 1878 he started the Waianae Sugar Company in the Waiʻanae district of Oʻahu island.[6]\n",
        "type": [
            "murder"
        ]
    },
    "88": {
        "link": "/wiki/Katsu_Goto",
        "title": "Katsu Goto",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Katsu (or Jun) Goto (後藤濶) (née Kobayakawa) (1862–1889) was a Japanese merchant, interpreter, and lynching victim.[1] He was the leader of a fledgling Japanese community in Honokaa.\nGoto was born in Kokufu-mura, Naka District, Kanagawa Prefecture. He was the eldest son of Izaemon Kobayakawa.  He had three brothers and two sisters.[2] After receiving an education, Goto worked as a city employee at the Port of Yokohama.  It was there that he learned the English language.[3]\nOn February 8, 1885, he came to the Kingdom of Hawaii as a government contract laborer aboard the SS City of Tokio. He was part of the first shipload of Kanyaku Imin; 25 more shiploads arrived over the next decade.[4] Goto was contracted to a ʻŌʻōkala plantation that had been organized and managed by John Harris Soper prior to his 1884 appointment as marshal of the Hawaiian Kingdom.[2] After working for three years in the sugarcane fields, Goto took over a general merchandise store on the Big Island that had belonged to Bunichiro Onome.[5] Because of his English language fluency and his intolerance at seeing field workers being exploited, he often went to court in defense of the Japanese immigrant laborers.[6]\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "89": {
        "link": "/wiki/Lili%CA%BBuokalani",
        "title": "Liliʻuokalani",
        "date": "November 11, 1917(1917-11-11) (aged 79) Honolulu, Oʻahu, Territory of Hawaii",
        "year": "1917",
        "location": "",
        "state": "",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nLiliʻuokalani (Hawaiian pronunciation: [liˌliʔuokəˈlɐni]; Lydia Liliʻu Loloku Walania Kamakaʻeha; September 2, 1838 – November 11, 1917) was the only queen regnant and the last sovereign monarch of the Hawaiian Kingdom, ruling from January 29, 1891, until the overthrow of the Hawaiian Kingdom on January 17, 1893. The composer of \"Aloha ʻOe\" and numerous other works, she wrote her autobiography Hawaiʻi's Story by Hawaiʻi's Queen during her imprisonment following the overthrow.\nLiliʻuokalani was born on September 2, 1838, in Honolulu, on the island of Oʻahu. While her natural parents were Analea Keohokālole and Caesar Kapaʻakea, she was hānai (informally adopted) at birth by Abner Pākī and Laura Kōnia and raised with their daughter Bernice Pauahi Bishop. Baptized as a Christian and educated at the Royal School, she and her siblings and cousins were proclaimed eligible for the throne by King Kamehameha III. She was married to American-born John Owen Dominis, who later became the Governor of Oʻahu. The couple had no biological children but adopted several. After the accession of her brother David Kalākaua to the throne in 1874, she and her siblings were given Western style titles of Prince and Princess. In 1877, after her younger brother Leleiohoku II's death, she was proclaimed as heir apparent to the throne. During the Golden Jubilee of Queen Victoria, she represented her brother as an official envoy to the United Kingdom.\n",
        "type": []
    },
    "90": {
        "link": "/wiki/Capital_punishment_in_Hawaii",
        "title": "Capital punishment in Hawaii",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "",
        "county": "",
        "paragraph": "\nCapital punishment in Hawaii ended in 1957 when it was still an organized incorporated territory of the United States. About 75 people were executed by the government, all for the crime of murder, and all by hanging. Additionally during and after World War II, at least seven U.S. servicemen were executed by the United States Armed Forces by order of a general court martial.\nUnder post-contact common law criminal justice, the penal laws of the Kingdom, Provisional Government, Republic, and U.S. incorporated Territory of Hawaii allowed for the execution of persons convicted of capital crimes.  The Espy file[1] and historian Joseph Theroux[2] account for about 75 individuals executed between the national and territorial governments, all for murder and all by hanging.\nDuring and a few years after World War II, at least seven U.S. servicemen were executed by the United States Armed Forces by order of a general court martial between 1942 and 1947 at Schofield Barracks, all the cases involving either murder or rape. The executions were mostly by hanging and at least one of the executed servicemen was shot by a firing squad.\n",
        "type": [
            "rape",
            "murder"
        ]
    },
    "91": {
        "link": "/wiki/Hanapepe_massacre",
        "title": "Hanapepe massacre",
        "date": "September 9, 1924",
        "year": "1924",
        "location": "Hanapepe, Hawaii",
        "state": "Hawaii",
        "place": "Hanapepe",
        "county": "Kauaʻi County",
        "paragraph": "Pablo Manlapit\nJack Butler\nThe Hanapēpē Massacre (also called the Battle of Hanapēpē) occurred on September 9, 1924, when an interethnic dispute amongst Filipino strike organizers in Hanapēpē, Kaua'i resulted in a violent exchange between local police officers and Filipinos.[1] The conflict began when two Ilocano youth, allegedly breaking the Filipino-led labor strike, were detained and harassed by a group of Visayans at the Hanapepe strike camp.[2] When the local police were called to settle the dispute, they arrived with a group of heavily armed special deputies.[1] Upon arrival, the officers issued warrants of arrest for the two detained Illocanos, causing the collection of Filipino strikers to rally in opposition.[2] Despite previously ridiculing the two Ilocanos, the remaining Filipinos armed themselves and demanded the boys be released.[2] A violent exchange ensued wherein sixteen Filipino laborers and four police officers were left dead.[1]\n",
        "type": [
            "mass murder",
            "murder"
        ]
    },
    "92": {
        "link": "/wiki/Lot_Lane",
        "title": "Lot Lane",
        "date": "18 December 1953(1953-12-18) (aged 89)",
        "year": "1953",
        "location": "",
        "state": "Hawaii",
        "place": "the Republic of Hawaii",
        "county": "Honolulu County",
        "paragraph": "\nLot Lonoikaua Kamehameha Carey Lane (1864–1953) was the last insurgent to be captured by government forces after the Uprising of 1895 in Hawaii. He advocated better treatment for prisoners of war by the Republic of Hawaii, while being incarcerated himself.\nLane was born 31 July 1864 in Waialua and was personally named after Kamehameha V. He was a brother of John Carey Lane and of Irish-Hawaiian who claimed to be descended from Kamehameha I and the Irish Monarchy. He expressed this claim openly to fellow insurgents receiving the nickname \"Kamehameha\".[1]\n",
        "type": []
    },
    "93": {
        "link": "/wiki/Volney_V._Ashford",
        "title": "Volney V. Ashford",
        "date": "21 March 1900(1900-03-21) (aged 55–56) Oakland, California",
        "year": "1900",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "Volney Vallencourt \"V.V.\" Ashford (1844 – 21 March 1900) was an American soldier and involved in 19th-century rebellion in Hawaii.\nAshford joined the Union Army in 1863 after leaving his home in Port Hope, Ontario. He was a British citizen since Canada was a territory of the United Kingdom. He became a Quartermaster Sergeant in the Grizwold Light Cavalry during the American Civil War. After the Civil War, Ashford, became a surveyor for the Beaverton railway and joined the Prince of Wales' Canadian Dragoons where he made Captain.[2] He was widowed twice in addition to the death of his daughter.  In 1884 his brother and future Attorney General of Hawaii, Clarence W. Ashford, invited him to visit Honolulu. After moving to Hawaii he joined the Honolulu Rifles, a militia. Ashford became responsible for the Rifles' growth from 100 men in 1886 to a battalion of three companies in 1887 and recognition as a paramilitary force. He rapidly moved up the ranks entering with his Canadian rank of Captain, he rose through Major and Lieutenant Colonel becoming Colonel in 1887, the highest rank and commander of the Rifles itself.\nShortly after becoming Colonel, a group of conspirators within the Missionary Party wanted to annex Hawaii to the United States. Ashford believed the monarchy was corrupt and was recruited to what would be known as the Hawaiian League. The Hawaiian League used the Rifles in the Rebellion of 1887 a bloodless revolution to enact the Bayonet Constitution. In 1889 the Rifles did battle with forces of Robert Wilcox in the Wilcox Rebellion. Upon Wilcox's surrender, he offered Ashford his sabre, he accepted the surrender but turned down the sabre. Ashford began to regret his support for the Hawaiian League. He came to believe that the League was more corrupt than the monarchy at advancing their own interests rather than improving Hawaii. He joined the Liberal Party, a third party that supported neither the Monarchy nor the Missionaries. Ashford was arrested in a plot to overthrown both the Monarchy and Bayonet Constitution known as the Burlesque Conspiracy and went into exile. His brother took his place in his absence as commander of the Honolulu Rifles. After the Overthrow of the Hawaiian monarchy, Ashford returned to Hawaii and retired from his position as commander of the Rifles. He was a strong supporter of annexation, but with the establishment of the Republic of Hawaii he gave little support for the new government which he believed was corrupt and later revealed at his military tribunal, disapproved of the mistreatment of Hawaiians by the government.  Ashford was approached by counter-revolutionaries as a consultant to restore the monarchy.\n",
        "type": []
    },
    "94": {
        "link": "/wiki/David_Kaw%C4%81nanakoa",
        "title": "David Kawānanakoa",
        "date": "June 2, 1908(1908-06-02) (aged 40) Hotel Stewart, San Francisco, California",
        "year": "1908",
        "location": "",
        "state": "Hawaii",
        "place": "Kahalepouli",
        "county": "Honolulu County",
        "paragraph": "\nDavid Laʻamea Kahalepouli Kinoiki Kawānanakoa (February 19, 1868 – June 2, 1908) was a prince of the Hawaiian Kingdom and founder of the House of Kawānanakoa. Born into Hawaiian nobility, Kawānanakoa grew up the royal court of his uncle King Kalākaua and aunt Queen Kapiʻolani who adopted him and his brothers after the death of their parents. On multiple occasions, he and his brothers were considered as candidates for the line of succession to the Hawaiian throne after their cousin Princess Kaʻiulani but were never constitutionally proclaimed. He was sent to be educated abroad in the United States and the United Kingdom where he pioneered the sport of surfing. After his education abroad, he served as a political advisor to Kalākaua's successor, Queen Liliʻuokalani until the overthrow of the Hawaiian Kingdom in 1893. After Hawaii's annexation to the United States, he co-founded the Democratic Party of Hawaii.\nKawānanakoa was born February 19, 1868, at Kaʻalaʻa at the mouth of the Pauoa Valley, in Honolulu, on the old homestead of his aunt Queen Kapiʻolani.[3] Kawānanakoa was the first child of his father David Kahalepouli Piʻikoi from Kauaʻi island, and his mother Victoria Kinoiki Kekaulike, a noble from the district of Hilo who was later the royal governor of the island of Hawaiʻi. His younger brothers were Edward Abnel Keliʻiahonui (1869–1887) and Jonah Kūhiō Kalanianaʻole (1871–1922).[4]\n",
        "type": []
    },
    "95": {
        "link": "/wiki/Kaulana_N%C4%81_Pua",
        "title": "Kaulana Nā Pua",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "Mahoe",
        "county": "Hawaiʻi County",
        "paragraph": "\"Kaulana Nā Pua\" (literally, \"Famous are the flowers\") is a Hawaiian patriotic song written by Eleanor Kekoaohiwaikalani Wright Prendergast (April 12, 1865 – December 5, 1902) in 1893 for members of the Royal Hawaiian Band\nwho protested the overthrow of Queen Liliʻuokalani and the Hawaiian Kingdom. The song is also known under the title of Mele ʻAi Pōhaku, the Stone-Eating Song, or Mele Aloha ʻĀina, the Patriot's Song. It is still popular in Hawaiʻi today, although it is not clear how many non-Hawaiian speaking listeners are aware of the song's historical significance or the profound antipathy to U.S. annexation in its lyrics.\nAccording to Elbert and Mahoe (1970), \"The song was considered sacred and not for dancing.\"  However, today hālau hula perform Kaulana Nā Pua as a hula ʻauana for makuahine (a graceful dance for mature women).\nThe Hawaiian lyrics,\nwith one English translation of them, are:\n",
        "type": [
            "riot"
        ]
    },
    "96": {
        "link": "/wiki/John_F._Colburn",
        "title": "John F. Colburn",
        "date": "March 16, 1920(1920-03-16) (aged 60) Honolulu, Territory of Hawaii",
        "year": "1920",
        "location": "",
        "state": "Hawaii",
        "place": "Honolulu",
        "county": "Honolulu County",
        "paragraph": "\nJohn Francis Colburn (September 30, 1859 – March 16, 1920) was a businessman and politician of the Kingdom of Hawaii. He served as the last Minister of the Interior to Queen Liliuokalani. Even though he was part Hawaiian ancestry on his maternal side, Colburn was a key figure in the overthrow of the Hawaiian monarchy and was a proponent of annexation to the United States. Colburn was the treasurer of the estate of Queen Kapiolani.\nHe was born as John Francis Colburn II in Honolulu, the youngest of three children of auctioneer and local fire warden John Francis Colburn[1] and Elizabeth Maughan, descended from Don Francisco de Paula Marín and one of his Hawaiian wives.[2] The elder Colburn was a naturalized citizen of Hawaii who could trace his family back to the Siege of Boston at the 1775 Battle of Bunker Hill; when he died in 1861, the younger Colburn was only two years old.[3]  Elizabeth Maughan died May 22, 1889.[4]\n",
        "type": []
    },
    "97": {
        "link": "/wiki/Castle_%26_Cooke",
        "title": "Castle & Cooke",
        "date": "",
        "year": "",
        "location": "",
        "state": "Hawaii",
        "place": "Kohala",
        "county": "Hawaiʻi County",
        "paragraph": "Castle & Cooke, Inc., is a Los Angeles-based company that was once part of the Big Five companies in territorial Hawaii. The company at one time did most of its business in agriculture, including becoming, through mergers with the modern Dole Food Company, the world's largest producer of fruits and vegetables.[1]  In 1995, it was spun off from Dole and today most of the company's business is in real estate and residential, commercial and retail development.\nCastle & Cooke was founded in 1851 as a partnership between Samuel Northrup Castle and Amos Starr Cooke as a department store that sold farm tools, sewing equipment, and medicine. Joseph Ballard Atherton joined as a clerk in 1858 and rose to become a partner by 1865.[2] Over the next few decades, the company invested heavily in Hawaii's sugar industry, running plantations in Kohala and Haiku. Atherton became president after the deaths of Cooke in 1871 and Castle in 1894 when the company incorporated. After the death of Atherton, George Parmele Castle (1851–1932) became president. G. P. Castle retired in 1916 and Edward Davies Tenney became chairman.[3]\nIn the 1910s, the company, along with three other Big Five companies, invested in Matson Navigation Company. Tenney became president of Matson after William Matson's death. In 1931, the company also bought a 21 percent share of the Hawaiian Pineapple Company, which was later renamed the Dole Food Company. After the death of Tenney, Alexander G. Budge became president in 1935.[4]\nCastle & Cooke bought the remaining shares of Dole in 1961.\n",
        "type": []
    },
    "98": {
        "link": "/wiki/Lili%CA%BBuokalani%27s_Cabinet_Ministers",
        "title": "Liliʻuokalani's Cabinet Ministers",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "place": "",
        "county": "",
        "paragraph": "Liliʻuokalani was the first queen regnant and the last sovereign monarch of the Kingdom of Hawaiʻi. The queen ascended to the throne on January 29, 1891, nine days after the death of her brother Kalākaua, and inherited his cabinet ministers. The four cabinet positions were Attorney General, Minister of Finance,  Minister of Foreign Affairs and Minister of the Interior. The ministers were ex-officio members of the House of Nobles in the legislature and the Privy Council of State, a larger body of advisors. \nThe Bayonet Constitution that Kalākaua had been compelled to sign in 1887 allowed the monarch to appoint the cabinet, but transferred the power of their removal to the legislature alone. A legislative \"resolution of want of confidence\" would force the resignation of an entire cabinet. The new law allowed non-residents to vote, but economic and literacy restrictions disenfranchised a majority of  Asians and native Hawaiians.[1] After her brother's funeral, the queen demanded the resignations of his ministers, causing a legal challenge when they refused. The case was decided in her favor by the Supreme Court of the kingdom.[2]\nShortly after her accession, Liliʻuokalani began to receive petitions through the political party Hui Kālaiʻāina and the National Reform Party to re-write the constitution.[3] The proposed constitution co-written by the queen and two legislators, Joseph Nāwahī and William Pūnohu White, would have restored the power to the monarchy, and voting rights to the disenfranchised population.[4][5]\n",
        "type": []
    },
    "99": {
        "link": "/wiki/Arthur_P._Peterson",
        "title": "Arthur P. Peterson",
        "date": "March 16, 1895(1895-03-16) (aged 36) San Francisco, California",
        "year": "1895",
        "location": "",
        "state": "Hawaii",
        "place": "the Republic of Hawaii",
        "county": "Honolulu County",
        "paragraph": "\nArthur Porter Peterson (November 21, 1858 – March 16, 1895) was a lawyer and politician of the Kingdom of Hawaii. He served two separate terms as Attorney General of Hawaii and was a member of Queen Liliuokalani's last cabinet before the Overthrow of the Kingdom of Hawaii. He was arrested and jailed by the Republic of Hawaii in the aftermath of the 1895 Counter-Revolution and then exiled to San Francisco where he died of pneumonia.\nPeterson was born November 21, 1858 in New Bedford, Massachusetts, of Puritan heritage. His parents were Daniel Porter Peterson and Jerusha Morey Clark. In 1870, at the age of eleven, he and his family settled in the Hawaiian Islands. He was educated at Punahou School in Honolulu, and returned to the United States where he graduated from University of Michigan Law School. He was admitted to the Plymouth County bar and started his law practice in Boston. While in Boston, he also helped established, with William E. Chase, a local newspaper called The Daily Bee.[1][2][3]\n",
        "type": []
    }
}