{
    "0": {
        "link": "/wiki/Sarah_Marie_Johnson",
        "title": "Murder of Diane and Alan Scott Johnson",
        "date": "",
        "year": "new 2003",
        "location": "",
        "state": "Idaho",
        "place": "Bellevue",
        "county": "Blaine County",
        "paragraph": "The murder of Diane and Alan Scott Johnson occurred on September 2, 2003. They were shot to death in their Bellevue, Idaho, home by their 16-year-old daughter, Sarah Marie Johnson.\nSarah Marie Johnson was born January 24, 1987.[1] She grew up in the Idaho city of Bellevue, and attended Wood River High School in Hailey.[2]\nOn September 2, 2003, Alan Scott Johnson and Diane Johnson were shot to death in their Bellevue, Idaho, home. Alan was shot twice in the chest, while Diane was shot in the head. Their daughter, Sarah Johnson, was found guilty of their murder. Sarah was 16 years old at the time. Her apparent motive was her parents' prohibiting her from dating a 19-year-old drug dealer named Bruno Santos.[2]\n",
        "type": [
            "murder"
        ]
    },
    "1": {
        "link": "/wiki/1892_Coeur_d%27Alene_labor_strike",
        "title": "1892 Coeur d'Alene labor strike",
        "date": "July 1892",
        "year": "1892",
        "location": "Coeur d'Alene, Idaho, U.S.",
        "state": "Idaho",
        "place": "Coeur d'Alene",
        "county": "Kootenai County",
        "paragraph": "George Pettibone\nCharlie Siringo\n\n",
        "type": [
            "riot"
        ]
    },
    "2": {
        "link": "/wiki/Lewis%E2%80%93Clark_Valley_murders",
        "title": "Lewis–Clark Valley murders",
        "date": "",
        "year": "new 1979",
        "location": "",
        "state": "Idaho",
        "place": "Lewiston",
        "county": "Nez Perce County",
        "paragraph": "The Lewis–Clark Valley murders refer to a cluster of unsolved murders and disappearances that occurred in the Lewiston-Clarkston metropolitan area of northern Idaho between 1979 and 1982. Law enforcement investigators have identified four victims and possibly a fifth that are connected to a single suspect.[1]\nChristina Lee \"Chrissy\" White, 12, was last seen in Asotin, Washington, on April 28, 1979, at the Asotin County Fair. She called her mother at around 2:30 p.m. from a friend's house to report feeling ill from the heat. Because she did not own a car, her mother was unable to pick her up; instead, she advised Christina to rest, lay down, and apply a moist towel to her neck; then, when she felt better, to return home. Her mother assumed she had gotten better and returned to the fair when she did not phone back.[2][3]\nBetween 7:00 and 10:00 p.m., Christina was last seen on the 500 block of 2nd Street. She was not there when her mother arrived to pick her up. When her classmates last saw her, she was reportedly on her way home. Her schoolwork was discovered in pieces at a field outside of Asotin a few weeks after she vanished. Christina was also last seen riding her white ten-speed bicycle at the time of her disappearance.[4] It has never been located.\n",
        "type": [
            "murder"
        ]
    },
    "3": {
        "link": "/wiki/Joseph_Henry_Loveless",
        "title": "Joseph Henry Loveless",
        "date": "1916 {speculative} (aged 45 - 46)",
        "year": "1916",
        "location": "",
        "state": "Idaho",
        "place": "",
        "county": "",
        "paragraph": "\nJoseph Henry Loveless (December 3 or 28, 1870 – 1916 {speculative}), also known as Charles Smith, Walter Currans, and Walter Cairns,[1] was an American bootlegger and formerly unidentified decedent. In 1916, after being accused of murdering his wife, he escaped from jail with a sawblade he had hidden in his shoe. Loveless's dismembered torso was found stuffed in a sack in an Idaho cave in 1979 with more of his remains discovered in 1991 in the same cave. The body was not positively identified until 2019 with the help of the DNA Doe Project, which noted that the identification was the oldest one they had ever made. The positive identification was made using forensic genealogy.[2]\nJoseph Henry Loveless was born on December 3, 1870,[3] according to some online sources, Loveless was born on December 28, 1870, at, Payson, in what was then Utah Territory. His mother, Sarah Jane Scriggins, was from Massachusetts while his father, Joseph Jackson Loveless, was from Indiana. Both of his parents were early pioneers from the Latter Day Saint movement.[1]\n",
        "type": [
            "murder"
        ]
    },
    "4": {
        "link": "/wiki/Bunker_Hill_Mining_Company",
        "title": "Bunker Hill Mining Company",
        "date": "",
        "year": "",
        "location": "",
        "state": "Idaho",
        "place": "Wardner",
        "county": "Shoshone County",
        "paragraph": "The Bunker Hill Mining Company is a mining company with facilities in Kellogg and Wardner, Idaho.\nSimeon Reed bought the Bunker Hill Mine and Mill, and incorporated the Bunker Hill and Sullivan Mining and Concentrating Company on 29 July 1887.   John Hays Hammond was hired to manage the mine, and a new concentrator, The Old South Mill, became operational in 1891, capable of 150 tons per day.  Hammond became president on 2 July 1891, followed by Nathaniel H. Harris on 15 June 1893, when company headquarters were located in San Francisco.  William Henry Crocker, of Crocker National Bank, served as treasurer, in addition to being the major stockholder.[1]\nWhen the mining boom began in the Coeur d'Alene, Idaho mining district, the area was lightly inhabited. The Bunker Hill and the Sullivan companies built a boarding house for miners in 1887.[2]  By 1894, the company employed 332 workers, and in the late 1890s, the company built single-family houses to attract family men.  In 1900, the company opened a company-built Kellogg school building, contributed to the construction of local churches, and started a loan program so employees could own their homes.[1]: 23, 26, 35 \n",
        "type": [
            "riot"
        ]
    },
    "5": {
        "link": "/wiki/Lyda_Southard",
        "title": "Lyda Southard",
        "date": "February 5, 1958(1958-02-05) (aged 65) Salt Lake City, Utah, U.S.",
        "year": "1958",
        "location": "",
        "state": "Idaho",
        "place": "Twin Falls",
        "county": "Twin Falls County",
        "paragraph": "Lyda Southard (October 16, 1892 – February 5, 1958), also known as Lyda Anna Mae Trueblood, was an American female suspected serial killer. It was suspected that she had killed her four husbands, a brother-in-law, and her daughter by using arsenic poisoning derived from flypaper[2] in order to obtain life insurance money.[3][4]\nLyda Keller was born on October 16, 1892 in Keytesville, Missouri, 60 miles northeast of Kansas City and in the central flatlands of Missouri.[5]\nKeller married Robert Dooley on March 17, 1912. The couple settled with his brother Ed Dooley on a ranch in Twin Falls, Idaho, and had a daughter, Lorraine, in 1914. Lorraine died unexpectedly in 1915, Keller claimed, as a result of drinking water from a dirty well.[6] Edward Dooley died soon afterward in August 1915; the cause of death was ruled ptomaine poisoning. Robert Dooley subsequently fell ill and died of typhoid fever on October 12, 1915, leaving Keller as the sole survivor in the family. Keller collected on the life insurance policies of each person shortly after their death.\n",
        "type": [
            "murder"
        ]
    },
    "6": {
        "link": "/wiki/Kidnapping_of_Hannah_Anderson",
        "title": "Kidnapping of Hannah Anderson",
        "date": "August 3–10, 2013",
        "year": "2013",
        "location": "Murders: 2071 Ross Avenue, Boulevard, CaliforniaAbduction: Lakeside, California to Cascade, Idaho",
        "state": "Idaho",
        "place": "Lakeside",
        "county": "Kootenai County",
        "paragraph": "On or about the afternoon of August 3, 2013,[1] 16-year-old Hannah Marie Anderson (born July 22, 1997)[2][3] was  abducted after cheerleading practice from El Capitan High School  in Lakeside, California. The suspect was later identified by authorities as 40-year-old James Lee DiMaggio, owner of a home in Boulevard, California, about an hour away, where Anderson, her mother Christina and brother Ethan had been overnight guests the previous evening.[4][5]\nThe bodies of Christina Anderson, Ethan Anderson and the family dog were later found in DiMaggio's burned home. An AMBER alert was issued for Hannah Anderson, who was found alive in Cascade, Idaho on August 10, a week after she was abducted. DiMaggio was killed by FBI agents during a shootout at the Frank Church–River of No Return Wilderness in Idaho, where he had been hiding Anderson at a campsite.[6]\nOn August 3, family friend James DiMaggio had invited Christina Anderson and her children to his home in Boulevard, ostensibly to say goodbye because he was planning to move to Texas.[7] The Anderson family, who lived about 45 miles (72 kilometers) away in Lakeside, stayed over at his home.[8] The children's father, Brett Anderson, was on a three-month job in Tennessee at the time.[9]\n",
        "type": [
            "arson",
            "kidnapping",
            "murder"
        ]
    },
    "7": {
        "link": "/wiki/Lynette_Culver",
        "title": "Ted Bundy",
        "date": "January 24, 1989(1989-01-24) (aged 42) Florida State Prison, Raiford, Florida, U.S.",
        "year": "1989",
        "location": "",
        "state": "Idaho",
        "place": "",
        "county": "",
        "paragraph": "\nTheodore Robert Bundy (born Cowell; November 24, 1946 – January 24, 1989) was an American serial killer who kidnapped, raped and murdered numerous young women and girls during the 1970s and possibly earlier. After more than a decade of denials, he confessed to 30 murders committed in seven states between 1974 and 1978. His true victim total is unknown and likely significantly higher.[6]\nBundy was often regarded as charismatic and handsome, traits he exploited to win the trust of both his victims and society as a whole. He would typically approach his victims in public places, either feigning a physical impairment such as an injury, or impersonating an authority figure, before bludgeoning them into unconsciousness and taking them to secondary locations to be raped and strangled. Bundy often revisited his victims, grooming and performing sexual acts with the corpses until decomposition and destruction by wild animals made any further interactions impossible. At least twelve of his victims were decapitated and their severed heads kept as mementos in his apartment. On a few occasions, he broke into homes at night and bludgeoned his victims as they slept.\n",
        "type": [
            "kidnapped",
            "rape",
            "murder"
        ]
    },
    "8": {
        "link": "/wiki/Thomas_Eugene_Creech",
        "title": "Thomas Eugene Creech",
        "date": "",
        "year": "new 2019",
        "location": "",
        "state": "Idaho",
        "place": "",
        "county": "",
        "paragraph": "Thomas Eugene Creech (born September 9, 1950) is an American serial killer.\nHe was convicted of three murders committed between 1974 and 1975, and sentenced to death row in Idaho reduced on two years later appeal to life imprisonment. He was sent to Idaho's death row for a 1981 murder committed while imprisoned. Creech later confessed to a total of 42 murders in various states,[1] some of which allegedly involved the Hells Angels and the Church of Satan. Most of his additional confessions are uncorroborated, but police believe seven additional murder victims may be linked to Creech.[2]\nAs of 2019, Creech was the longest-serving death row inmate in the state.[3]\n",
        "type": [
            "murder"
        ]
    },
    "9": {
        "link": "/wiki/Diane_Johnson_(murder_victim)",
        "title": "Murder of Diane and Alan Scott Johnson",
        "date": "",
        "year": "new 2003",
        "location": "",
        "state": "Idaho",
        "place": "Bellevue",
        "county": "Blaine County",
        "paragraph": "The murder of Diane and Alan Scott Johnson occurred on September 2, 2003. They were shot to death in their Bellevue, Idaho, home by their 16-year-old daughter, Sarah Marie Johnson.\nSarah Marie Johnson was born January 24, 1987.[1] She grew up in the Idaho city of Bellevue, and attended Wood River High School in Hailey.[2]\nOn September 2, 2003, Alan Scott Johnson and Diane Johnson were shot to death in their Bellevue, Idaho, home. Alan was shot twice in the chest, while Diane was shot in the head. Their daughter, Sarah Johnson, was found guilty of their murder. Sarah was 16 years old at the time. Her apparent motive was her parents' prohibiting her from dating a 19-year-old drug dealer named Bruno Santos.[2]\n",
        "type": [
            "murder"
        ]
    },
    "10": {
        "link": "/wiki/George_Floyd_protests_in_Idaho",
        "title": "George Floyd protests in Idaho",
        "date": "May 28, 2020–June 12, 2020",
        "year": "2020",
        "location": "Idaho, United States",
        "state": "Idaho",
        "place": "",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Idaho, United States.\nA handful of people protested in front of the Idaho State Capitol on May 30.[1] Hundreds more gathered on the same steps on May 31.[2] On Monday night, June 1, 100 to 150 protesters gathered at the Capitol again; two opposing groups were present, according to one report.  A single gunshot was fired during the protest; Boise Police subsequently arrested an 18-year-old man and said the incident was being investigated as accidental or unintentional.[3]\n",
        "type": [
            "riot"
        ]
    },
    "11": {
        "link": "/wiki/Rigby_Middle_School_shooting",
        "title": "Jefferson County School District 251",
        "date": "",
        "year": "",
        "location": "",
        "state": "Idaho",
        "place": "Rigby",
        "county": "Jefferson County",
        "paragraph": "\nJefferson County School District 251 is a school district headquartered in Rigby, Idaho.\nIn 2015, the district had 5,106 students. In 2019, that number was up to 5,901. Luke O'Roark of the Post Register wrote in 2019 that the district is \"one of the fastest growing school districts in the area.\"[1]\n",
        "type": []
    },
    "12": {
        "link": "/wiki/Brandon_Hixon",
        "title": "Brandon Hixon",
        "date": "January 9, 2018(2018-01-09) (aged 36) Caldwell, Idaho, U.S.",
        "year": "2018",
        "location": "",
        "state": "Idaho",
        "place": "Caldwell",
        "county": "Canyon County",
        "paragraph": "Brandon Antone Hixon (October 26, 1981 – January 9, 2018) was an American politician and a Republican Partymember of the Idaho House of Representatives from 2012 to 2017, representing District 10, Seat A.[1] He resigned in late 2017 while under criminal investigation and committed suicide in January 2018.\nHixon, a fourth-generation Idahoan, was born in 1981 and raised in Salmon, Idaho.[2][3] He graduated from Salmon High School. He went on to graduate from Idaho State University with a degree in construction management.[2][4]\nHixon ran against Jarom Wagoner for the Republican nomination winning with 51.5% of the vote.[5]\n",
        "type": []
    },
    "13": {
        "link": "/wiki/Ted_Trueblood",
        "title": "Ted Trueblood",
        "date": "September 12, 1982 (1982-09-13) (aged 69) Nampa, Idaho, U.S.",
        "year": "1982",
        "location": "",
        "state": "Idaho",
        "place": "Nampa",
        "county": "Canyon County",
        "paragraph": "\nCecil Whittaker \"Ted\" Trueblood (1913-1982) was an American outdoor writer and conservationist. From 1941 to 1982, he served as an editor and writer for the Field & Stream magazine.\nTrueblood was born in Boise, Idaho on June 25, 1913, and was raised on his family farm near Homedale, Idaho. Trueblood graduated from Wilder High School in 1931. Drawn to writing about the outdoors, he published his first article in National Sportsman magazine in 1931. He attended both the College of Idaho and the University of Idaho, but left before earning his degree.\n",
        "type": []
    },
    "14": {
        "link": "/wiki/Murder_of_Diane_and_Alan_Scott_Johnson",
        "title": "Murder of Diane and Alan Scott Johnson",
        "date": "",
        "year": "new 2003",
        "location": "",
        "state": "Idaho",
        "place": "Bellevue",
        "county": "Blaine County",
        "paragraph": "The murder of Diane and Alan Scott Johnson occurred on September 2, 2003. They were shot to death in their Bellevue, Idaho, home by their 16-year-old daughter, Sarah Marie Johnson.\nSarah Marie Johnson was born January 24, 1987.[1] She grew up in the Idaho city of Bellevue, and attended Wood River High School in Hailey.[2]\nOn September 2, 2003, Alan Scott Johnson and Diane Johnson were shot to death in their Bellevue, Idaho, home. Alan was shot twice in the chest, while Diane was shot in the head. Their daughter, Sarah Johnson, was found guilty of their murder. Sarah was 16 years old at the time. Her apparent motive was her parents' prohibiting her from dating a 19-year-old drug dealer named Bruno Santos.[2]\n",
        "type": [
            "murder"
        ]
    },
    "15": {
        "link": "/wiki/2022_Coeur_d%27Alene_Patriot_Front_arrests",
        "title": "Patriot Front",
        "date": "",
        "year": "2022",
        "location": "United States",
        "state": "Idaho",
        "place": "",
        "county": "",
        "paragraph": "\nPatriot Front is an American white nationalist and neo-fascist hate group.[7] Part of the broader alt-right movement, the group split off from the neo-Nazi organization Vanguard America in the aftermath of the Unite the Right rally in 2017.[1][8][9][10] Patriot Front's aesthetic combines traditional Americana with fascist symbolism. The group reportedly had between 200 and 300 members as of late 2021.[11] According to the Anti-Defamation League, the group generated 82% of reported incidents in 2021 involving distribution of racist, antisemitic, and other hateful propaganda in the United States, comprising 3,992 incidents in every state except Hawaii and Alaska.[12]\nPatriot Front is led by Thomas Ryan Rousseau, who was a teenager when he founded the group. In 2017, Rousseau took control of Vanguard America's web and Discord server several weeks before the Unite the Right rally in Charlottesville, Virginia, in which he participated as the leader of Vanguard America's contingent. Following the bad press arising from the rally, Rousseau left Vanguard. He used the group's domain name to form Patriot Front as a new group and recruit rally participants, though most of Patriot Front's members were former Vanguard members.[1] Rousseau has been arrested repeatedly in the group's activities.[13][14][15]\n",
        "type": [
            "riot"
        ]
    },
    "16": {
        "link": "/wiki/Alan_Scott_Johnson",
        "title": "Murder of Diane and Alan Scott Johnson",
        "date": "",
        "year": "new 2003",
        "location": "",
        "state": "Idaho",
        "place": "Bellevue",
        "county": "Blaine County",
        "paragraph": "The murder of Diane and Alan Scott Johnson occurred on September 2, 2003. They were shot to death in their Bellevue, Idaho, home by their 16-year-old daughter, Sarah Marie Johnson.\nSarah Marie Johnson was born January 24, 1987.[1] She grew up in the Idaho city of Bellevue, and attended Wood River High School in Hailey.[2]\nOn September 2, 2003, Alan Scott Johnson and Diane Johnson were shot to death in their Bellevue, Idaho, home. Alan was shot twice in the chest, while Diane was shot in the head. Their daughter, Sarah Johnson, was found guilty of their murder. Sarah was 16 years old at the time. Her apparent motive was her parents' prohibiting her from dating a 19-year-old drug dealer named Bruno Santos.[2]\n",
        "type": [
            "murder"
        ]
    },
    "17": {
        "link": "/wiki/Coeur_d%27Alene_miners%27_dispute",
        "title": "Coeur d'Alene miners' dispute",
        "date": "",
        "year": "",
        "location": "",
        "state": "Idaho",
        "place": "Coeur d'Alene",
        "county": "Kootenai County",
        "paragraph": "There were two related incidents between miners and mine owners in the Coeur d'Alene Mining District of North Idaho: the Coeur d'Alene, Idaho labor strike of 1892, and the Coeur d'Alene, Idaho labor confrontation of 1899. This article is a brief overview of both events.\nThe strike of 1892 had its roots in the first pay cut by the Bunker Hill Mining Company in 1887. Immediately after the reduction in wages miners organized the first union at Wardner on November 3, 1887. The response to that violence, disastrous for the local miners' union, became the primary motivation for the formation of the Western Federation of Miners (WFM) the following year.\nThe confrontation of 1899 resulted from the miners' frustrations with mine operators that paid lower wages; hired Pinkerton or Thiel operatives to infiltrate the union; and routinely fired any miner who held a union card.\n",
        "type": [
            "riot"
        ]
    },
    "18": {
        "link": "/wiki/James_Edward_Wood",
        "title": "James Edward Wood",
        "date": "February 1, 2004(2004-02-01) (aged 56) Idaho Maximum Security Institution, Kuna, Idaho, U.S.",
        "year": "2004",
        "location": "",
        "state": "Idaho",
        "place": "Kuna",
        "county": "Ada County",
        "paragraph": "James Edward Wood (born James Godwin; December 9, 1947 – February 1, 2004) was an American murderer, serial rapist and self-confessed serial killer. A violent sex offender with an extensive criminal record, Wood was convicted and sentenced to death for the 1993 murder of 11-year-old Jeralee Underwood in Pocatello, Idaho; following his arrest, he was investigated for several murders committed while living in Louisiana, none of which were definitively linked to him.[1] He died at the Idaho Maximum Security Institution in 2004.[1]\nJames Edward Wood was born James Godwin on December 9, 1947,[2] in Pensacola, Florida.[1] At the time of his birth, Godwin's father Sherman, an alcoholic, was imprisoned in Fort Leavenworth, prompting his mother, Hazel Johnson, to leave the state with the two boys and move to Idaho.[3] His childhood was apparently normal until 1955, when the 8-year-old witnessed the tragic death of his mother, who perished in a fire while saving two other workers at a potato warehouse in Rupert.[3] Godwin later claimed that in his distress, he had tried to put his arms around the waist of a nearby woman, who, instead of consoling him, simply pushed him away. This act caused him to develop a hatred towards women, which was greatly aggravated whenever they resembled the woman who had brushed him off.[4]\nShortly after the tragedy, he was adopted by his aunt and uncle in Idaho Falls, who changed his name to James Edward Wood.[3] During this time period, Wood claimed to have been abused both physically and mentally, which caused him to lash out frequently. Unable to control him, his adoptive parents sent him to the Idaho Youth Training Center in St. Anthony, from where Wood attempted to escape on eight separate occasions but was always caught and returned.[3] In 1963, his father was released from prison and offered to take care of him, with Wood readily accepting and boarding the first bus to Shreveport, Louisiana, where Sherman had moved to. They lived together for some time until Wood moved to Missouri to enter flight school, marrying a woman there in 1966. However, he claimed that shortly after his marriage, he began raping women in Missouri and Illinois.[4]\n",
        "type": [
            "murder"
        ]
    },
    "19": {
        "link": "/wiki/Donald_B._Anderson",
        "title": "Donald B. Anderson",
        "date": "December 16, 1956(1956-12-16) (aged 52) Caldwell, Idaho, U.S.",
        "year": "1956",
        "location": "",
        "state": "Idaho",
        "place": "Caldwell",
        "county": "Canyon County",
        "paragraph": "Donald Brown Anderson (October 28, 1904 – December 16, 1956)[1][2] was a justice of the Idaho Supreme Court from 1955 to 1956. He received his LL.B. from the University of Idaho College of Law in 1927.[3]\nBorn in Canada at Cardston, Alberta, Anderson's family moved to the United States in his childhood and farmed near Weiser, Idaho. He graduated from Weiser High School, received his LL.B. degree from the University of Idaho College of Law in 1927,[3] and entered the practice of law in Canyon County at Caldwell.[2]\nAnderson served as the prosecuting attorney of Canyon County for six years in the 1930s, and was a probate judge for four years, from 1937 to 1941. In April 1941, he joined the Federal Bureau of Investigation (FBI), working in Chicago and Washington, D.C., ultimately becoming a special assistant to the Attorney General J. Howard McGrath. Anderson returned to Idaho in 1948 to resume the practice of law, and served as a judge of the Idaho Seventh Judicial District from 1950 to 1954, when he was elected to the state supreme court, where he remained until his death.[2]\n",
        "type": []
    },
    "20": {
        "link": "/wiki/Jacob_Bergquist",
        "title": "Boise Towne Square",
        "date": "",
        "year": "",
        "location": "Boise, Idaho",
        "state": "Idaho",
        "place": "Boise",
        "county": "Ada County",
        "paragraph": "\nBoise Towne Square is a mall in the western United States, located in Boise, Idaho. The largest retail complex in the state, it opened in 1988 after more than 20 years of planning, and features 150 stores, with Macy's (formerly The Bon Marché), JCPenney, Kohl's and Dillard's (added in 1998) as anchor stores. The mall also includes the first Apple Store in Idaho. Boise Towne Square is owned by the Chicago-based Brookfield Properties and is located near the junction of Interstate 84 and Interstate 184.\nBrookfield Properties also operates an adjacent strip mall, Boise Towne Plaza, which is anchored by Nordstrom Rack and Old Navy.[4] In addition, the mall comprises nine freestanding businesses on its property, including major retailers PetSmart and Pier 1 Imports.\n",
        "type": []
    },
    "21": {
        "link": "/wiki/Dylan_Groene",
        "title": "Joseph Edward Duncan",
        "date": "March 28, 2021(2021-03-28) (aged 58) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2021",
        "location": "",
        "state": "Idaho",
        "place": "Coeur d'Alene",
        "county": "Kootenai County",
        "paragraph": "\nJoseph Edward Duncan III (February 25, 1963 – March 28, 2021)[1] was an American convicted serial killer and child molester who was on death row in federal prison in conjunction with the 2005 kidnappings and murders of members of the Groene family of Coeur d'Alene, Idaho. He was also serving eleven consecutive sentences of life without parole in conjunction with the same crimes as well as the 1997 murder of Anthony Martinez of Beaumont, California.[2] Additionally, Duncan confessed to — but had not been charged with — the 1996 murder of two girls, Sammiejo White and Carmen Cubias, in Seattle, Washington.[3] At the time of the attack on the Groene family, Duncan was on the run from a child molestation charge in Minnesota.[4]\nGrowing up in Tacoma, Washington, Duncan had a criminal history dating to when he was fifteen years old. In 1980, he was sentenced to twenty years in prison for sexually assaulting a boy in Tacoma and as a result had spent all but eight years of his adult life in prison. He was paroled in 1994 but was returned to prison in 1997 for violating the terms of his parole.[5]\n",
        "type": [
            "kidnapping",
            "murder",
            "assault"
        ]
    },
    "22": {
        "link": "/wiki/Clark_massacre",
        "title": "Clark massacre",
        "date": "August 6, 1851",
        "year": "1851",
        "location": "near the Raft River, Idaho",
        "state": "Idaho",
        "place": "",
        "county": "",
        "paragraph": "In August, 1851, a band of Shoshoni Indians led by Cho Cho Co (also called Has No Horse) reportedly attacked a wagon train led by Thomas Clark on the Oregon Trail near where the Raft River joins the Snake River in present-day Idaho. Afterward, reports held that the Indians' primary objective was to steal horses from Thomas Clark's wagon train party, and that the Indians killed Clark's mother and brother and another man traveling with them during the horse robbery.\nThomas Clark was an Englishman who loved hunting.  He came overland to the Willamette Valley in Oregon in 1848, but soon decamped with Jackson Vandevert and others to the California Gold Rush.  They decided to invest their gains in bringing high quality cattle and horses to Oregon.  By the spring of 1851 Thomas had acquired 17 horses[1] and a few cattle from Kentucky and Illinois.[2]   On the trail west he brought with him his mother, his 25-year-old sister Grace, his 17-year-old brother, Hodgson, another brother named Charlie, and another married sister with her family.  He had a first class hack built for Grace to drive and his mother to ride in.[3]  It may have been the first such vehicle to cross the plains.[4] He had also become the pilot for several other Illinois families headed to Oregon.[5]   The company moved slowly so the animals could graze and arrive in Oregon in good condition.[6]\nCho Cho Co was only twenty years old in 1851 but was already a veteran guerilla fighter.  He led a band of warriors of the Tussawehee sub-tribe of the Shoshone, the most powerful tribe in the area that would become Eastern Oregon, Idaho, and Western Montana.  In this area, the Shoshone were often known by white people as the Snakes.  By late August, the band was short of supplies, particularly good horses, guns, and ammunition.  Cho Cho Co traveled east along the Oregon Trail to meet his uncle, Deer Fly, and borrow soldiers from him.  Now reinforced, he identified the Clark party as his target.[7]\n",
        "type": [
            "murder",
            "robber",
            "robbery"
        ]
    },
    "23": {
        "link": "/wiki/Paul_Ezra_Rhoades",
        "title": "Paul Ezra Rhoades",
        "date": "November 18, 2011(2011-11-18) (aged 54) Idaho Maximum Security Institution, Kuna, Idaho, U.S.",
        "year": "2011",
        "location": "",
        "state": "Idaho",
        "place": "Kuna",
        "county": "Ada County",
        "paragraph": "Paul Ezra Rhoades (January 18, 1957 – November 18, 2011) was an American spree killer and suspected serial killer convicted of three murders committed in Idaho during a three-week crime spree in 1987. He is the prime suspect in at least four additional killings in Utah and Wyoming dating back to 1984, however, he was never conclusively linked to these murders. He was executed for two of his confirmed murders in 2011, becoming the first person to be executed in Idaho in over seventeen years.[1]\nPaul Ezra Rhoades was born on January 18, 1957,[2] in Idaho Falls, Idaho, the first of four children born to Augustus and Teresa Rhoades. His early life proved turbulent, as Rhoades was struck with polio since the age of 4, for which he constantly had to be hospitalized, and at home, his parents constantly argued.[3] At the age of 10, he began drinking and soon dropped out of high school, after which he started using various drugs. Because of this, Rhoades developed an addiction to methamphetamines which would persist up until his arrest.[3] To provide for his family, he took on various odd jobs both in Idaho and the surrounding states, specializing in sheetrocking.[4] At the same time, however, he started breaking into various homes and stole any valuables he could find.[5]\nOn the morning of March 1, 1987, the body of 21-year-old Stacy Dawn Baldwin, a Red Mini Barn clerk who was working the night shift, was found in an archery range about five miles northwest of Blackfoot.[6] She had been shot three times, and it was quickly determined that her killing was likely linked to a robbery gone wrong that occurred the night before.[6]\n",
        "type": [
            "killing",
            "kidnapping",
            "murder",
            "robber",
            "robbery"
        ]
    },
    "24": {
        "link": "/wiki/Great_Basin_Murders",
        "title": "Great Basin Murders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Idaho",
        "place": "",
        "county": "",
        "paragraph": "The Great Basin Murders is the name given to a series of murders of at least nine women committed between 1983 and 1997 across the states of Wyoming, Utah, Nevada and Idaho. It derives its name from the Great Basin geographical area, as most of the victims had their bodies dumped near interstate highways that pass through it.\nMost of the victims were teenage or adult female hitchhikers who were sexually assaulted then murdered - either by strangulation, stabbing or being shot - and then abandoned on hilltops, deserted expanses, snowdrifts or rivers.[1] Their bodies were posed post-mortem. This led to speculation that all killings were the work of a single serial killer, who was nicknamed \"The Great Basin Killer\".[2] This assertion has since been disregarded, as over the years it has been established that multiple unrelated serial killers operated in the area and that a majority of the killings were committed by different perpetrators.[3]\nThe initial list of victims included the following nine victims:\n",
        "type": [
            "killing",
            "murder",
            "assault"
        ]
    },
    "25": {
        "link": "/wiki/Frank_Steunenberg",
        "title": "Frank Steunenberg",
        "date": "December 30, 1905(1905-12-30) (aged 44) Caldwell, Idaho, U.S.",
        "year": "1905",
        "location": "",
        "state": "Idaho",
        "place": "Caldwell",
        "county": "Canyon County",
        "paragraph": "Frank Steunenberg (August 8, 1861 – December 30, 1905) was the fourth governor of the State of Idaho, serving from 1897 until 1901. He was assassinated in 1905 by one-time union member Harry Orchard, who was also a paid informant for the Cripple Creek Mine Owners' Association.[1] Orchard attempted to implicate leaders of the radical Western Federation of Miners in the assassination. The labor leaders were found not guilty[2] in two trials,[3] but Orchard spent the rest of his life in prison.\nBorn in Keokuk, Iowa, and raised in Knoxville, Steunenberg was the fourth of ten children of Bernardus and Cornelia (Keppel) Steunenberg, with five brothers and four sisters.[4] He attended Iowa State College at Ames and then went on to become a printer's apprentice and publisher. In 1881 he was hired by the Des Moines Register in Des Moines. Steunenberg later published a newspaper in Knoxville until 1886, when he moved west and settled in Caldwell, Idaho Territory, where he joined his younger brother Albert K. Steunenberg (1863–1907) in taking over the Caldwell Tribune for six years.[5]\nSteunenberg became active in politics as a member of the 1889 Idaho Constitutional Convention which led to Idaho's admission to the Union in 1890. In 1890, he was elected to the Idaho House of Representatives as a fusion candidate, endorsed by both the Democratic and Populist Parties, and he served one term.  In addition, he served for several years as chairman of the Caldwell town council.\n",
        "type": [
            "murder"
        ]
    },
    "26": {
        "link": "/wiki/Neale_Stadium",
        "title": "Neale Stadium",
        "date": "",
        "year": "",
        "location": "University of IdahoMoscow, Idaho, U.S.",
        "state": "Idaho",
        "place": "Moscow",
        "county": "Latah County",
        "paragraph": "Neale Stadium was an outdoor athletic stadium in the northwest United States, located on the campus of the University of Idaho in Moscow, Idaho. Opened 86 years ago in 1937 for college football,[6] it was used for over three decades, through the 1968 football season; the track team moved to the venue in the late 1940s.\nIts replacement, the enclosed Kibbie Dome, currently occupies the same site on the west end of campus; the outdoor track is adjacent to the west.\nNeale Stadium was the home field for the Idaho Vandals of the Pacific Coast Conference (PCC) (and later the Big Sky) from 1937 through 1968. In addition to football, it was also used for track and field events after World War II. Approval for the stadium was granted by the board of regents in August 1936,[3][4] and grading began shortly after. During construction the next spring, it was named for Mervin G. Neale,[13][14] the university's president from 1930 to 1937.[15] Its first game was the season-opener in 1937, a 7–6 upset win over conference foe Oregon State on September 25.[16][17][18][19][20]\n",
        "type": [
            "arson"
        ]
    },
    "27": {
        "link": "/wiki/Ernest_Hemingway",
        "title": "Ernest Hemingway",
        "date": "July 2, 1961(1961-07-02) (aged 61) Ketchum, Idaho, U.S.",
        "year": "1961",
        "location": "",
        "state": "Idaho",
        "place": "Ketchum",
        "county": "Blaine County",
        "paragraph": "\nErnest Miller Hemingway (July 21, 1899 – July 2, 1961) was an American novelist, short-story writer, and journalist. His economical and understated style—which included his iceberg theory—had a strong influence on 20th-century fiction, while his adventurous lifestyle and public image brought him admiration from later generations. Hemingway produced most of his work between the mid-1920s and the mid-1950s, and he was awarded the 1954 Nobel Prize in Literature. He published seven novels, six short-story collections, and two nonfiction works. Three of his novels, four short-story collections, and three nonfiction works were published posthumously. Many of his works are considered classics of American literature.\nHemingway was raised in Oak Park, Illinois. After high school, he was a reporter for a few months for The Kansas City Star before leaving for the Italian Front to enlist as an ambulance driver in World War I. In 1918, he was seriously wounded and returned home. His wartime experiences formed the basis for his novel A Farewell to Arms (1929).\n",
        "type": []
    },
    "28": {
        "link": "/wiki/Diamondfield_Jack",
        "title": "Diamondfield Jack",
        "date": "",
        "year": "",
        "location": "",
        "state": "Idaho",
        "place": "Silver City",
        "county": "Owyhee County",
        "paragraph": "Jackson Lee \"Diamondfield Jack\" Davis (12 August 1863 – 2 January 1949) was pardoned for the 1896 Deep Creek Murders in Idaho and would later strike it rich in Nevada,[clarification needed] where he established several mining towns, one named after his nickname \"Diamondfield\".[1][2][3]\nDavis got his nickname when he went west to Silver City, Idaho on the rumor of a diamond strike. The rumor led to nothing but after talking so much about it he got the nickname \"Diamondfield Jack\". After the failed prospecting attempt Jack was hired by Sparks-Harrell cattle company on the Idaho-Nevada border. Davis' job was to keep sheepherders off the cattle's land and after a confrontation that led to wounding of a sheepherder named William Tolman. The sheepherders would change their bed every night to a different position so that the head of the bed would be in a different direction; for the cattlemen would shoot at the head of the beds. Davis was on the run. He began working for the cattle company again the next year and almost immediately as he came back to work, two sheepherders were killed in the area where he was working. Davis became the prime suspect for the killings. A magazine was found in the sheepwagon with a diamond drawn in blood by one of the victims. The sheepmen were killed with .44 caliber bullets shot out of a .45 caliber gun. Diamondfield Jack was known to have bought .44 caliber cartridges when the correct ones were not available. As he was heading towards Mexico, Jack was picked up by authorities in Arizona Territory. He was transported back up to Idaho and sentenced to hang on June 4, 1897. The day before his execution date he was reprieved due to the confessions of two other men to the murders. In February 1899 Davis was transferred to the Idaho State Penitentiary where he stayed until December of that year. Davis was then transferred back to a cell in the Cassia County jail.\nAfter Davis had exhausted his appeals another execution date was scheduled for July 3, 1901. By the time public opinion had shifted in Jack's favor mostly due to the confessions of James Bower and Jeff Gray and to the easing of tension between sheep and cattle herders. The Board of Pardons extended the execution date to July 17, much to the outrage of state prosecutor and future Idaho Senator William Borah. Three hours before Davis' scheduled execution, word arrived at the Cassia County sheriff that his sentence had been commuted to life imprisonment. Davis was moved back to the Idaho State Penitentiary in Boise, Idaho until he was finally pardoned on December 17, 1902 by Idaho Gov. Frank W. Hunt.\n",
        "type": [
            "killing",
            "murder"
        ]
    },
    "29": {
        "link": "/wiki/Murder_of_Cassie_Jo_Stoddart",
        "title": "Murder of Cassie Jo Stoddart",
        "date": "",
        "year": "new 2006",
        "location": "",
        "state": "Idaho",
        "place": "Bannock County",
        "county": "Bannock County",
        "paragraph": "The murder of Cassie Jo Stoddart took place in Bannock County, Idaho, United States, on September 22, 2006, when Stoddart (born December 21, 1989), a student at Pocatello High School, was stabbed to death by classmates Brian Lee Draper (born March 21, 1990) and Torey Michael Adamcik (born June 14, 1990).[1] Both perpetrators received sentences of life imprisonment without parole on August 21, 2007.[2]\nAfter spending most of his childhood in Utah, Brian Draper moved with his family to Pocatello, Idaho. He met Torey Adamcik when they were both students at Pocatello High School. Both boys were interested in films and started recording on their own. The victim, Cassie Jo Stoddart, also attended the same school; she and both killers were in 11th grade.\nOn the night of September 22, 2006, Stoddart was house sitting for her aunt and uncle, Allison and Frank Contreras, on Whispering Cliffs Drive in northeast Bannock County.[3] The Contreras family were out of town and had hired Stoddart to come take care of their three cats and two dogs for the weekend. Stoddart was visited that evening by her boyfriend, Matt Beckham, who arrived around 6:00 p.m. Later, classmates Brian Draper and Torey Adamcik, who were both aged 16 at the time, came over to the house to \"hang out\". Stoddart gave the friends a tour of the house, including the basement. The four teens went into the living room to watch the film Kill Bill, Volume II, but Adamcik and Draper ended up leaving before the film ended, saying they \"wanted to watch a movie at their local movie theater instead.\" Stoddart and Beckham stayed behind.\n",
        "type": [
            "rape",
            "murder"
        ]
    },
    "30": {
        "link": "/wiki/Murder_of_Angie_Dodge",
        "title": "Murder of Angie Dodge",
        "date": "",
        "year": "new 1996",
        "location": "",
        "state": "Idaho",
        "place": "Idaho Falls",
        "county": "Bonneville County",
        "paragraph": "The rape and murder of Angie Dodge occurred in Idaho Falls, Idaho on June 13, 1996. However, the true perpetrator was not apprehended until May 2019.[1][2][3][4]\nFor 20 years, Chris Tapp served time in prison for Dodge's rape and murder while authorities searched for suspects that matched DNA left at the crime scene. In 2017, Tapp's rape conviction was vacated and he was released from prison.[4][5]\nOver the course of Tapp's sentence, authorities continued searching for remaining suspects, partially at the insistence of the murdered girl's mother,[6] and in 2014 accused Michael Usry Jr. of rape and murder. Authorities identified Usry as a suspect through Y-chromosome familial searching, a process by which partial DNA matches to relatives are used to identify an individual. After conducting a DNA test, authorities discovered that Usry did not match the DNA found at the crime scene.[3]\n",
        "type": [
            "rape",
            "murder"
        ]
    },
    "31": {
        "link": "/wiki/Joshua_Row",
        "title": "Robin Lee Row",
        "date": "",
        "year": "new 1992",
        "location": "",
        "state": "Idaho",
        "place": "Tabitha",
        "county": "Ada County",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\nAs the investigation progressed, Row was embezzling money from the YMCA where she worked.[6] Detectives found that Row had taken out life insurance policies on her husband and children, totaling over a quarter of a million dollars. She was arrested and charged with three counts of first-degree murder.[citation needed] Her trial began in 1993, and on December 16, she was found guilty on each count.[7]\n",
        "type": [
            "arson",
            "murder"
        ]
    },
    "32": {
        "link": "/wiki/Albert_Horsley",
        "title": "Albert Horsley",
        "date": "April 13, 1954(1954-04-13) (aged 88) Boise, Idaho, U.S.",
        "year": "1954",
        "location": "",
        "state": "Idaho",
        "place": "Boise",
        "county": "Ada County",
        "paragraph": "Albert Edward Horsley (March 18, 1866 – April 13, 1954), best known by the pseudonym Harry Orchard, was a miner convicted of the 1905 political assassination of former Idaho Governor Frank Steunenberg. The case was one of the most sensational and widely reported of the first decade of the 20th century, involving three prominent leaders of the radical Western Federation of Miners as co-defendants in an alleged conspiracy to commit murder.\nAlbert Edward Horsley was born March 18, 1866, in Wooler, Ontario, Canada, the son of English and Irish parentage.[1]: 3  One of eight children in a poor farm family, Albert was only able to attend formal school through the third grade, helping to support the family by working as soon as he was able.[1]: 3  Albert worked as a farmhand for neighbors, either on a daily or monthly basis, with his parents receiving the income from his work until he was 20 years old.[1]: 4 \nAt the age of 22, Horsley left home to work as a logger in Saginaw, Michigan.[1]: 5  He returned to Canada and married around 1889.[1]: 5  The Horsleys spent some time as cheesemakers, both independently and in the employ of others. His wife gave birth to a daughter, removing her from their cheese factory, while Albert later recalled that he \"lived away beyond my means, and was some in debt, and my credit was not so good.\"[1]: 14 \n",
        "type": [
            "murder"
        ]
    },
    "33": {
        "link": "/wiki/Boise_Towne_Square_shooting",
        "title": "Boise Towne Square",
        "date": "",
        "year": "",
        "location": "Boise, Idaho",
        "state": "Idaho",
        "place": "Boise",
        "county": "Ada County",
        "paragraph": "\nBoise Towne Square is a mall in the western United States, located in Boise, Idaho. The largest retail complex in the state, it opened in 1988 after more than 20 years of planning, and features 150 stores, with Macy's (formerly The Bon Marché), JCPenney, Kohl's and Dillard's (added in 1998) as anchor stores. The mall also includes the first Apple Store in Idaho. Boise Towne Square is owned by the Chicago-based Brookfield Properties and is located near the junction of Interstate 84 and Interstate 184.\nBrookfield Properties also operates an adjacent strip mall, Boise Towne Plaza, which is anchored by Nordstrom Rack and Old Navy.[4] In addition, the mall comprises nine freestanding businesses on its property, including major retailers PetSmart and Pier 1 Imports.\n",
        "type": []
    },
    "34": {
        "link": "/wiki/Randy_Row",
        "title": "Robin Lee Row",
        "date": "",
        "year": "new 1992",
        "location": "",
        "state": "Idaho",
        "place": "Tabitha",
        "county": "Ada County",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\nAs the investigation progressed, Row was embezzling money from the YMCA where she worked.[6] Detectives found that Row had taken out life insurance policies on her husband and children, totaling over a quarter of a million dollars. She was arrested and charged with three counts of first-degree murder.[citation needed] Her trial began in 1993, and on December 16, she was found guilty on each count.[7]\n",
        "type": [
            "arson",
            "murder"
        ]
    },
    "35": {
        "link": "/wiki/Tabitha_Row",
        "title": "Robin Lee Row",
        "date": "",
        "year": "new 1992",
        "location": "",
        "state": "Idaho",
        "place": "Tabitha",
        "county": "Ada County",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\nAs the investigation progressed, Row was embezzling money from the YMCA where she worked.[6] Detectives found that Row had taken out life insurance policies on her husband and children, totaling over a quarter of a million dollars. She was arrested and charged with three counts of first-degree murder.[citation needed] Her trial began in 1993, and on December 16, she was found guilty on each count.[7]\n",
        "type": [
            "arson",
            "murder"
        ]
    },
    "36": {
        "link": "/wiki/Robin_Lee_Row",
        "title": "Robin Lee Row",
        "date": "",
        "year": "new 1992",
        "location": "",
        "state": "Idaho",
        "place": "Tabitha",
        "county": "Ada County",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\nAs the investigation progressed, Row was embezzling money from the YMCA where she worked.[6] Detectives found that Row had taken out life insurance policies on her husband and children, totaling over a quarter of a million dollars. She was arrested and charged with three counts of first-degree murder.[citation needed] Her trial began in 1993, and on December 16, she was found guilty on each count.[7]\n",
        "type": [
            "arson",
            "murder"
        ]
    },
    "37": {
        "link": "/wiki/1899_Coeur_d%27Alene_labor_confrontation",
        "title": "1899 Coeur d'Alene labor confrontation",
        "date": "",
        "year": "1899",
        "location": "",
        "state": "Idaho",
        "place": "Coeur d'Alene",
        "county": "Kootenai County",
        "paragraph": "The Coeur d'Alene, Idaho, labor riot of 1899 was the second of two major labor-management confrontations in the Coeur d'Alene mining district of northern Idaho in the 1890s. Like the first incident  seven years earlier, the 1899 confrontation was an attempt by union miners, led by the Western Federation of Miners to unionize non-union mines, and have them pay the higher union wage scale. As with the 1892 strike, the 1899 incident culminated in a dynamite attack that destroyed a non-union mining facility, the burning of multiple homes and outbuildings and two murders, followed by military occupation of the district.\nThe riot of 1899 resulted from the miners' frustrations with mine operators that paid lower wages, hired Pinkerton or Thiel operatives to infiltrate the union, and the refusal of non-union miners to join or strike.\nAngered by wage cuts, Coeur d'Alene area miners conducted a strike in 1892. The strike erupted in violence when union miners discovered they had been infiltrated by a Pinkerton agent who had routinely provided union information to the mine owners. After several deaths, the U.S. army occupied the area and forced an end to the strike. The response to that violence, disastrous for the local miners' union, became the primary motivation for the formation of the Western Federation of Miners (WFM) the following year.\n",
        "type": [
            "riot",
            "murder"
        ]
    },
    "38": {
        "link": "/wiki/Justin_Eilers",
        "title": "Justin Eilers",
        "date": "December 25, 2008(2008-12-25) (aged 30) Nampa, Idaho, U.S.",
        "year": "2008",
        "location": "",
        "state": "Idaho",
        "place": "Nampa",
        "county": "Canyon County",
        "paragraph": "\nJustin Mark Eilers (June 28, 1978 – December 25, 2008)[2] was an American professional mixed martial artist, formerly with the UFC, WEC and EliteXC. Known for his ground and pound as well as punching power, he won 18 of 19 career bouts via TKO/KO stoppage.\nJustin Mark Eilers was raised in Nampa, Idaho, and developed an early love of football. He began wrestling in the sixth grade and through Nampa High School,[3] but he missed a football scholarship out of high school due to his low SAT scores, and soon took up karate at a local school.[4] He began competing in small full contact shows around Idaho, where he met up and coming fighter Jens Pulver, who was fighting with the same promotion. Eilers was also friends with Mike Kyle and taught Kyle jiu-jitsu techniques when Kyle was a sophomore in high school. Eilers would actually end up fighting Kyle at UFC 49.\n",
        "type": []
    },
    "39": {
        "link": "/wiki/James_DiMaggio",
        "title": "Kidnapping of Hannah Anderson",
        "date": "August 3–10, 2013",
        "year": "2013",
        "location": "Murders: 2071 Ross Avenue, Boulevard, CaliforniaAbduction: Lakeside, California to Cascade, Idaho",
        "state": "Idaho",
        "place": "Lakeside",
        "county": "Kootenai County",
        "paragraph": "On or about the afternoon of August 3, 2013,[1] 16-year-old Hannah Marie Anderson (born July 22, 1997)[2][3] was  abducted after cheerleading practice from El Capitan High School  in Lakeside, California. The suspect was later identified by authorities as 40-year-old James Lee DiMaggio, owner of a home in Boulevard, California, about an hour away, where Anderson, her mother Christina and brother Ethan had been overnight guests the previous evening.[4][5]\nThe bodies of Christina Anderson, Ethan Anderson and the family dog were later found in DiMaggio's burned home. An AMBER alert was issued for Hannah Anderson, who was found alive in Cascade, Idaho on August 10, a week after she was abducted. DiMaggio was killed by FBI agents during a shootout at the Frank Church–River of No Return Wilderness in Idaho, where he had been hiding Anderson at a campsite.[6]\nOn August 3, family friend James DiMaggio had invited Christina Anderson and her children to his home in Boulevard, ostensibly to say goodbye because he was planning to move to Texas.[7] The Anderson family, who lived about 45 miles (72 kilometers) away in Lakeside, stayed over at his home.[8] The children's father, Brett Anderson, was on a three-month job in Tennessee at the time.[9]\n",
        "type": [
            "arson",
            "kidnapping",
            "murder"
        ]
    },
    "40": {
        "link": "/wiki/John_H._Hays",
        "title": "John H. Hays",
        "date": "January 27, 1904(1904-01-27) (aged 59) Troy, Idaho",
        "year": "1904",
        "location": "",
        "state": "Idaho",
        "place": "Troy",
        "county": "Latah County",
        "paragraph": "John Henry Hays (4 August 1844 – 27 January 1904) was a veteran of the American Civil War and recipient of the Medal of Honor.\nHays was born in Ohio, but moved to the state of Iowa at the age of fifteen. He worked on his family's farm for the next three years.\nIn 1862, Hays volunteered to join the Union Army. He was injured multiple times throughout the war, surviving a gunshot wound to his left thumb and being struck by debris from a falling bridge.[1]\nOn April 16, 1865, seven days following the surrender of Confederate General Robert E. Lee at Appomattox Court House, Hays marched on Columbus, Georgia to secure the city's naval yards, weapons factories and supply depots. During the ensuing battle, Hays stormed a bridge over the Chattahoochee River and helped to capture a fort guarding it. During the battle for the fort, Hays captured the flag and the flag bearer of an Austin Battery stationed there. He received the Medal of Honor for this act.[1]\n",
        "type": [
            "battery",
            "murder"
        ]
    },
    "41": {
        "link": "/wiki/Edward_Dexter_Holbrook",
        "title": "Edward Dexter Holbrook",
        "date": "June 18, 1870(1870-06-18) (aged 34) Idaho City, Idaho Territory, U.S.",
        "year": "1870",
        "location": "",
        "state": "Idaho",
        "place": "Idaho City",
        "county": "Boise County",
        "paragraph": "Edward Dexter Holbrook (May 6, 1836 – June 18, 1870) was an American lawyer and politician who served as a congressional delegate for the Idaho Territory from 1865 to 1869.\nBorn in Elyria, Ohio, Holbrook attended public schools and earned a Bachelor of Laws from Oberlin College. \nHe was admitted to the bar in 1859 and practiced law in Elyria, Ohio; Weaverville, California; and Placerville, Idaho.\n",
        "type": [
            "murder"
        ]
    },
    "42": {
        "link": "/wiki/Killings_of_Tylee_Ryan_and_J._J._Vallow",
        "title": "Killings of Tylee Ryan and J. J. Vallow",
        "date": "",
        "year": "new 2019",
        "location": "",
        "state": "Idaho",
        "place": "Rexburg",
        "county": "Madison County",
        "paragraph": "\nTylee Ashlyn Ryan (September 24, 2002 – c. September 9, 2019)[a] and Joshua Jaxon \"J. J.\" Vallow (May 25, 2012 – c. September 23, 2019)[b] were two American children from Chandler, Arizona, who disappeared in September 2019 and whose remains were found buried in shallow graves on June 9, 2020 in Rexburg, Idaho, in their stepfather Chad Daybell's backyard. Tylee was last seen alive at Yellowstone National Park on September 8, 2019. Her younger adopted brother, J.J., was last seen alive on September 23, 2019, at Rexburg's Kennedy Elementary School. He was initially reported missing by relatives concerned about not only the children—whom they had not heard from in weeks—but also several other suspicious incidents.\nIn November 2019, police questioned the children's mother, Lori (Cox) Yanes Lagioia Ryan Vallow Daybell, about the children's whereabouts and welfare. Lori and her new fifth husband, Chad Guy Daybell, claimed that J.J. was staying with family friend Melanie Gibb in Arizona, where they had lived before moving to Idaho in early September 2019, which Gibb later denied. Police efforts to locate J.J. led to the discovery that Tylee was also missing.[2]\n",
        "type": [
            "killing",
            "murder"
        ]
    },
    "43": {
        "link": "/wiki/Keith_Wells",
        "title": "Keith Wells",
        "date": "December 20, 1990",
        "year": "1990",
        "location": "",
        "state": "Idaho",
        "place": "Boise",
        "county": "Ada County",
        "paragraph": "Keith Eugene Wells (May 11, 1962 – January 6, 1994) was an American murderer convicted of the 1990 murders of John Justad and Brandi Rains in Boise, Idaho.[1] He was executed in 1994 by the state of Idaho at the Idaho Maximum Security Institution via lethal injection, only one year and nine months after having been sentenced to death by Judge Gerald Schroeder.[2][3] Wells was the first person to be executed in Idaho since 1957, and only the tenth since Idaho gained statehood.[4][5] He chose not to appeal the death sentence, although it was appealed on his behalf. The United States Supreme Court rejected an appeal filed against his wishes.[6]\nKeith Eugene Wells was born on May 11, 1962, in Moab, Utah, the sixth of eight children born to Paul and Loral Wells.[7] He was raised in Pocatello, Idaho, by his family, who were close-knit Mormons.[8] Wells started experimenting with alcohol and cigarettes from the age of 4, and was smoking pot by the age of 10 or 11. Court reports showed Wells got in trouble at grade school, where he got into fighting and truancy. He also stole money and household items from family and friends.[9]\nBy the time Wells had reached ninth grade, he had a drug problem, with the habit costing him $200 a month for amphetamines and marijuana. Between the ages of 13 and 14, he was regularly stealing to pay for his drug addiction. According to Wells, between 1975 and 1978, he was involved in a total of thirty thefts and assaults, resulting in him getting in trouble with the law or being arrested.[9] Wells was first jailed at the age of 15 for vandalism.[10] At age 17, he was imprisoned and later released, but would not stay out of prison for long. He was released from prison a total of three times for a variety of different offenses.[9]\n",
        "type": [
            "murder",
            "theft",
            "assault"
        ]
    },
    "44": {
        "link": "/wiki/Clay_V._Spear",
        "title": "Clay V. Spear",
        "date": "",
        "year": "",
        "location": "",
        "state": "Idaho",
        "place": "Anaconda",
        "county": "Elmore County",
        "paragraph": "\nClay V. Spear (c. 1914 – May 15, 1974)[1] was a justice of the Idaho Supreme Court from 1965 to 1971.\nBorn in Anaconda, Montana,[1] Spear graduated from the University of Idaho,[1] and received his J.D. from the University of Idaho College of Law in 1936. He served in the European theatre of World War II, where he \"received four battle stars and a Bronze Star medal for service in the Battle of the Bulge\".[1][2] In 1946, he was named head of the VFW of Coeur D'Alene.[2]\nSpear was appointed as a district judge in 1953,[1] and elevated to the Idaho Supreme Court by Governor Robert E. Smylie in 1965, taking office on January 2, 1966.[1][3] A resident of Coeur D'Alene, Idaho, at the time, he was the only member of the court from northern Idaho.[4] Spear retired from the court in December 1971, due to poor health.[5]\n",
        "type": []
    },
    "45": {
        "link": "/wiki/Joseph_Edward_Duncan",
        "title": "Joseph Edward Duncan",
        "date": "March 28, 2021(2021-03-28) (aged 58) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2021",
        "location": "",
        "state": "Idaho",
        "place": "Coeur d'Alene",
        "county": "Kootenai County",
        "paragraph": "\nJoseph Edward Duncan III (February 25, 1963 – March 28, 2021)[1] was an American convicted serial killer and child molester who was on death row in federal prison in conjunction with the 2005 kidnappings and murders of members of the Groene family of Coeur d'Alene, Idaho. He was also serving eleven consecutive sentences of life without parole in conjunction with the same crimes as well as the 1997 murder of Anthony Martinez of Beaumont, California.[2] Additionally, Duncan confessed to — but had not been charged with — the 1996 murder of two girls, Sammiejo White and Carmen Cubias, in Seattle, Washington.[3] At the time of the attack on the Groene family, Duncan was on the run from a child molestation charge in Minnesota.[4]\nGrowing up in Tacoma, Washington, Duncan had a criminal history dating to when he was fifteen years old. In 1980, he was sentenced to twenty years in prison for sexually assaulting a boy in Tacoma and as a result had spent all but eight years of his adult life in prison. He was paroled in 1994 but was returned to prison in 1997 for violating the terms of his parole.[5]\n",
        "type": [
            "kidnapping",
            "murder",
            "assault"
        ]
    },
    "46": {
        "link": "/wiki/Deep_Creek_murders",
        "title": "Deep Creek murders",
        "date": "February 4, 1896",
        "year": "1896",
        "location": "Twin Falls County, Idaho, United States",
        "state": "Idaho",
        "place": "Twin Falls County",
        "county": "Twin Falls County",
        "paragraph": "The Deep Creek murders were the culmination of a minor sheep war in the borderlands of Idaho and Nevada in 1896. On or about February 4, 1896, two Mormon sheepherders were killed by an unknown assailant while they were camping along a creek in what was then part of Cassia County, Idaho.\nThe gunfighter Diamondfield Jack Davis and his associate Jack Gleason were arrested, but the latter was released and Diamondfield Jack was pardoned in 1902, after serving six years in jail. The deaths of the two sheepherders are the only confirmed killings attributed to the conflict, however, according to author J. Anthony Lukas, the incident was \"one of the last great confrontations in the sheep and cattle wars.\"[1][2][3]\nThe leading figure in the conflict was a prominent cattleman named John Sparks. Sparks came to southern Idaho from Nevada in the early 1870s. A former Texas Ranger, Sparks was one of the first people to explore what was still a very isolated wilderness. He later became the partner of another rancher named Jasper Harrell and eventually they established a series of ranches on both sides of the Idaho–Nevada border. By the summer of 1895, Sparks was the most powerful cattleman in Idaho. He controlled huge stretches of territory, though his ownership was still mostly unofficial. Sparks felt that because he had used the lands for so many years without opposition, there was no way he was going to let the hated sheep destroy it.\n",
        "type": [
            "killing",
            "murder"
        ]
    }
}