[
    {
        "link": "/wiki/Neale_Stadium",
        "title": "Neale Stadium",
        "date": "",
        "location": "University of IdahoMoscow, Idaho, U.S.",
        "paragraph": "Neale Stadium was an outdoor athletic stadium in the northwest United States, located on the campus of the University of Idaho in Moscow, Idaho. Opened 86 years ago in 1937 for college football,[6] it was used for over three decades, through the 1968 football season; the track team moved to the venue in the late 1940s.\nIts replacement, the enclosed Kibbie Dome, currently occupies the same site on the west end of campus; the outdoor track is adjacent to the west.\n"
    },
    {
        "link": "/wiki/Robin_Lee_Row",
        "title": "Robin Lee Row",
        "date": "",
        "location": "",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\n"
    },
    {
        "link": "/wiki/Lynette_Culver",
        "title": "Ted Bundy",
        "date": "",
        "location": "",
        "paragraph": "\nTheodore Robert Bundy (born Cowell; November 24, 1946 – January 24, 1989) was an American serial killer who kidnapped, raped and murdered numerous young women and girls during the 1970s and possibly earlier. After more than a decade of denials, he confessed to 30 murders committed in seven states between 1974 and 1978. His true victim total is unknown and likely significantly higher.[6]\n"
    },
    {
        "link": "/wiki/Murder_of_Angie_Dodge",
        "title": "Murder of Angie Dodge",
        "date": "",
        "location": "",
        "paragraph": "The rape and murder of Angie Dodge occurred in Idaho Falls, Idaho on June 13, 1996. However, the true perpetrator was not apprehended until May 2019.[1][2][3][4]\nFor 20 years, Chris Tapp served time in prison for Dodge's rape and murder while authorities searched for suspects that matched DNA left at the crime scene. In 2017, Tapp's rape conviction was vacated and he was released from prison.[4][5]\n"
    },
    {
        "link": "/wiki/Justin_Eilers",
        "title": "Justin Eilers",
        "date": "",
        "location": "",
        "paragraph": "\nJustin Mark Eilers (June 28, 1978 – December 25, 2008)[2] was an American professional mixed martial artist, formerly with the UFC, WEC and EliteXC. Known for his ground and pound as well as punching power, he won 18 of 19 career bouts via TKO/KO stoppage.\n"
    },
    {
        "link": "/wiki/Great_Basin_Murders",
        "title": "Great Basin Murders",
        "date": "",
        "location": "",
        "paragraph": "The Great Basin Murders is the name given to a series of murders of at least nine women committed between 1983 and 1997 across the states of Wyoming, Utah, Nevada and Idaho. It derives its name from the Great Basin geographical area, as most of the victims had their bodies dumped near interstate highways that pass through it.\nMost of the victims were teenage or adult female hitchhikers who were sexually assaulted then murdered - either by strangulation, stabbing or being shot - and then abandoned on hilltops, deserted expanses, snowdrifts or rivers.[1] Their bodies were posed post-mortem. This led to speculation that all killings were the work of a single serial killer, who was nicknamed \"The Great Basin Killer\".[2] This assertion has since been disregarded, as over the years it has been established that multiple unrelated serial killers operated in the area and that a majority of the killings were committed by different perpetrators.[3]\n"
    },
    {
        "link": "/wiki/Dylan_Groene",
        "title": "Joseph Edward Duncan",
        "date": "",
        "location": "",
        "paragraph": "\nJoseph Edward Duncan III (February 25, 1963 – March 28, 2021)[1] was an American convicted serial killer and child molester who was on death row in federal prison in conjunction with the 2005 kidnappings and murders of members of the Groene family of Coeur d'Alene, Idaho. He was also serving eleven consecutive sentences of life without parole in conjunction with the same crimes as well as the 1997 murder of Anthony Martinez of Beaumont, California.[2] Additionally, Duncan confessed to — but had not been charged with — the 1996 murder of two girls, Sammiejo White and Carmen Cubias, in Seattle, Washington.[3] At the time of the attack on the Groene family, Duncan was on the run from a child molestation charge in Minnesota.[4]\n"
    },
    {
        "link": "/wiki/John_H._Hays",
        "title": "John H. Hays",
        "date": "",
        "location": "",
        "paragraph": "John Henry Hays (4 August 1844 – 27 January 1904) was a veteran of the American Civil War and recipient of the Medal of Honor.\nHays was born in Ohio, but moved to the state of Iowa at the age of fifteen. He worked on his family's farm for the next three years.\nIn 1862, Hays volunteered to join the Union Army. He was injured multiple times throughout the war, surviving a gunshot wound to his left thumb and being struck by debris from a falling bridge.[1]\n"
    },
    {
        "link": "/wiki/Edward_Dexter_Holbrook",
        "title": "Edward Dexter Holbrook",
        "date": "",
        "location": "",
        "paragraph": "Edward Dexter Holbrook (May 6, 1836 – June 18, 1870) was an American lawyer and politician who served as a congressional delegate for the Idaho Territory from 1865 to 1869.\nBorn in Elyria, Ohio, Holbrook attended public schools and earned a Bachelor of Laws from Oberlin College. \n"
    },
    {
        "link": "/wiki/Alan_Scott_Johnson",
        "title": "Murder of Diane and Alan Scott Johnson",
        "date": "",
        "location": "",
        "paragraph": "The murder of Diane and Alan Scott Johnson occurred on September 2, 2003. They were shot to death in their Bellevue, Idaho, home by their 16-year-old daughter, Sarah Marie Johnson.\nSarah Marie Johnson was born January 24, 1987.[1] She grew up in the Idaho city of Bellevue, and attended Wood River High School in Hailey.[2]\n"
    },
    {
        "link": "/wiki/Diane_Johnson_(murder_victim)",
        "title": "Murder of Diane and Alan Scott Johnson",
        "date": "",
        "location": "",
        "paragraph": "The murder of Diane and Alan Scott Johnson occurred on September 2, 2003. They were shot to death in their Bellevue, Idaho, home by their 16-year-old daughter, Sarah Marie Johnson.\nSarah Marie Johnson was born January 24, 1987.[1] She grew up in the Idaho city of Bellevue, and attended Wood River High School in Hailey.[2]\n"
    },
    {
        "link": "/wiki/Murder_of_Diane_and_Alan_Scott_Johnson",
        "title": "Murder of Diane and Alan Scott Johnson",
        "date": "",
        "location": "",
        "paragraph": "The murder of Diane and Alan Scott Johnson occurred on September 2, 2003. They were shot to death in their Bellevue, Idaho, home by their 16-year-old daughter, Sarah Marie Johnson.\nSarah Marie Johnson was born January 24, 1987.[1] She grew up in the Idaho city of Bellevue, and attended Wood River High School in Hailey.[2]\n"
    },
    {
        "link": "/wiki/Lewis%E2%80%93Clark_Valley_murders",
        "title": "Lewis–Clark Valley murders",
        "date": "",
        "location": "",
        "paragraph": "The Lewis–Clark Valley murders refer to a cluster of unsolved murders and disappearances that occurred in the Lewiston-Clarkston metropolitan area of northern Idaho between 1979 and 1982. Law enforcement investigators have identified four victims and possibly a fifth that are connected to a single suspect.[1]\nChristina Lee \"Chrissy\" White, 12, was last seen in Asotin, Washington, on April 28, 1979, at the Asotin County Fair. She called her mother at around 2:30 p.m. from a friend's house to report feeling ill from the heat. Because she did not own a car, her mother was unable to pick her up; instead, she advised Christina to rest, lay down, and apply a moist towel to her neck; then, when she felt better, to return home. Her mother assumed she had gotten better and returned to the fair when she did not phone back.[2][3]\n"
    },
    {
        "link": "/wiki/Joseph_Henry_Loveless",
        "title": "Joseph Henry Loveless",
        "date": "",
        "location": "",
        "paragraph": "\nJoseph Henry Loveless (December 3 or 28, 1870 – 1916 {speculative}), also known as Charles Smith, Walter Currans, and Walter Cairns,[1] was an American bootlegger and formerly unidentified decedent. In 1916, after being accused of murdering his wife, he escaped from jail with a sawblade he had hidden in his shoe. Loveless's dismembered torso was found stuffed in a sack in an Idaho cave in 1979 with more of his remains discovered in 1991 in the same cave. The body was not positively identified until 2019 with the help of the DNA Doe Project, which noted that the identification was the oldest one they had ever made. The positive identification was made using forensic genealogy.[2]\n"
    },
    {
        "link": "/wiki/Joshua_Row",
        "title": "Robin Lee Row",
        "date": "",
        "location": "",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\n"
    },
    {
        "link": "/wiki/Randy_Row",
        "title": "Robin Lee Row",
        "date": "",
        "location": "",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\n"
    },
    {
        "link": "/wiki/Tabitha_Row",
        "title": "Robin Lee Row",
        "date": "",
        "location": "",
        "paragraph": "Robin Lee Row (born September 12, 1957)[1] is a death row inmate in Idaho, having been convicted of the murders of her husband and two children. The murders took place on February 10, 1992, when a fire broke out on the first floor of the apartment in which Row's husband, from whom she was separated, and her two children were living. When fire crews reached the scene of the burning structure, they found three bodies that were subsequently identified as her husband Randy and children Joshua, 10, and Tabitha, 8. All three had died due to carbon monoxide poisoning.[2][3]\nFire investigators concluded that a liquid accelerant was used to start the fire and, upon further investigation, that the smoke alarm had been turned off.[4] Row had been living with friends and investigators had placed her as the main suspect.[citation needed] Current Ada County Sheriff Gary Raney was the chief investigator on the case.[citation needed] As he delved into the case, he saw many red flags that indicated that Robin Row was the main suspect.[citation needed] Further investigation concluded that in 1980, she and her son Keith were living in a cabin in California. Her son died in a fire that was caused by a portable heater that ignited his blankets.[5] The boy died, and Row collected $28,000 from the life insurance policy.[citation needed]\n"
    },
    {
        "link": "/wiki/Frank_Steunenberg",
        "title": "Frank Steunenberg",
        "date": "",
        "location": "",
        "paragraph": "Frank Steunenberg (August 8, 1861 – December 30, 1905) was the fourth governor of the State of Idaho, serving from 1897 until 1901. He was assassinated in 1905 by one-time union member Harry Orchard, who was also a paid informant for the Cripple Creek Mine Owners' Association.[1] Orchard attempted to implicate leaders of the radical Western Federation of Miners in the assassination. The labor leaders were found not guilty[2] in two trials,[3] but Orchard spent the rest of his life in prison.\nBorn in Keokuk, Iowa, and raised in Knoxville, Steunenberg was the fourth of ten children of Bernardus and Cornelia (Keppel) Steunenberg, with five brothers and four sisters.[4] He attended Iowa State College at Ames and then went on to become a printer's apprentice and publisher. In 1881 he was hired by the Des Moines Register in Des Moines. Steunenberg later published a newspaper in Knoxville until 1886, when he moved west and settled in Caldwell, Idaho Territory, where he joined his younger brother Albert K. Steunenberg (1863–1907) in taking over the Caldwell Tribune for six years.[5]\n"
    },
    {
        "link": "/wiki/Murder_of_Cassie_Jo_Stoddart",
        "title": "Murder of Cassie Jo Stoddart",
        "date": "",
        "location": "",
        "paragraph": "The murder of Cassie Jo Stoddart took place in Bannock County, Idaho, United States, on September 22, 2006, when Stoddart (born December 21, 1989), a student at Pocatello High School, was stabbed to death by classmates Brian Lee Draper (born March 21, 1990) and Torey Michael Adamcik (born June 14, 1990).[1] Both perpetrators received sentences of life imprisonment without parole on August 21, 2007.[2]\nAfter spending most of his childhood in Utah, Brian Draper moved with his family to Pocatello, Idaho. He met Torey Adamcik when they were both students at Pocatello High School. Both boys were interested in films and started recording on their own. The victim, Cassie Jo Stoddart, also attended the same school; she and both killers were in 11th grade.\n"
    },
    {
        "link": "/wiki/Killings_of_Tylee_Ryan_and_J._J._Vallow",
        "title": "Killings of Tylee Ryan and J. J. Vallow",
        "date": "",
        "location": "",
        "paragraph": "\nTylee Ashlyn Ryan (September 24, 2002 – c. September 9, 2019)[a] and Joshua Jaxon \"J. J.\" Vallow (May 25, 2012 – c. September 23, 2019)[b] were two American children from Chandler, Arizona, who disappeared in September 2019 and whose remains were found buried in shallow graves on June 9, 2020 in Rexburg, Idaho, in their stepfather Chad Daybell's backyard. Tylee was last seen alive at Yellowstone National Park on September 8, 2019. Her younger adopted brother, J.J., was last seen alive on September 23, 2019, at Rexburg's Kennedy Elementary School. He was initially reported missing by relatives concerned about not only the children—whom they had not heard from in weeks—but also several other suspicious incidents.\n"
    },
    {
        "link": "/wiki/Bunker_Hill_Mining_Company",
        "title": "Bunker Hill Mining Company",
        "date": "",
        "location": "",
        "paragraph": "The Bunker Hill Mining Company is a mining company with facilities in Kellogg and Wardner, Idaho.\nSimeon Reed bought the Bunker Hill Mine and Mill, and incorporated the Bunker Hill and Sullivan Mining and Concentrating Company on 29 July 1887.   John Hays Hammond was hired to manage the mine, and a new concentrator, The Old South Mill, became operational in 1891, capable of 150 tons per day.  Hammond became president on 2 July 1891, followed by Nathaniel H. Harris on 15 June 1893, when company headquarters were located in San Francisco.  William Henry Crocker, of Crocker National Bank, served as treasurer, in addition to being the major stockholder.[1]\n"
    },
    {
        "link": "/wiki/Coeur_d%27Alene_miners%27_dispute",
        "title": "Coeur d'Alene miners' dispute",
        "date": "",
        "location": "",
        "paragraph": "There were two related incidents between miners and mine owners in the Coeur d'Alene Mining District of North Idaho: the Coeur d'Alene, Idaho labor strike of 1892, and the Coeur d'Alene, Idaho labor confrontation of 1899. This article is a brief overview of both events.\nThe strike of 1892 had its roots in the first pay cut by the Bunker Hill Mining Company in 1887. Immediately after the reduction in wages miners organized the first union at Wardner on November 3, 1887. The response to that violence, disastrous for the local miners' union, became the primary motivation for the formation of the Western Federation of Miners (WFM) the following year.\n"
    },
    {
        "link": "/wiki/1899_Coeur_d%27Alene_labor_confrontation",
        "title": "1899 Coeur d'Alene labor confrontation",
        "date": "",
        "location": "",
        "paragraph": "The Coeur d'Alene, Idaho, labor riot of 1899 was the second of two major labor-management confrontations in the Coeur d'Alene mining district of northern Idaho in the 1890s. Like the first incident  seven years earlier, the 1899 confrontation was an attempt by union miners, led by the Western Federation of Miners to unionize non-union mines, and have them pay the higher union wage scale. As with the 1892 strike, the 1899 incident culminated in a dynamite attack that destroyed a non-union mining facility, the burning of multiple homes and outbuildings and two murders, followed by military occupation of the district.\nThe riot of 1899 resulted from the miners' frustrations with mine operators that paid lower wages, hired Pinkerton or Thiel operatives to infiltrate the union, and the refusal of non-union miners to join or strike.\n"
    },
    {
        "link": "/wiki/1892_Coeur_d%27Alene_labor_strike",
        "title": "1892 Coeur d'Alene labor strike",
        "date": "July 1892",
        "location": "Coeur d'Alene, Idaho, U.S.",
        "paragraph": "George Pettibone\nCharlie Siringo\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Idaho",
        "title": "George Floyd protests in Idaho",
        "date": "May 28, 2020–June 12, 2020",
        "location": "Idaho, United States",
        "paragraph": "\nThis is a list of George Floyd protests in Idaho, United States.\n"
    }
]