[
    {
        "link": "/wiki/Lynching_of_Samuel_J._Bush",
        "title": "Lynching of Samuel J. Bush",
        "date": "3 June 1893",
        "location": "Decatur, Illinois, United States",
        "paragraph": "\nIn the early hours of 3 June 1893, a black day-laborer named Samuel J. Bush was forcibly taken from the Macon County, Illinois, jail and lynched.[1][2] Mr. Bush stood accused of raping Minnie Cameron Vest, a white woman, who lived in the nearby town of Mount Zion.\n"
    },
    {
        "link": "/wiki/Danville_race_riot",
        "title": "Danville race riot",
        "date": "",
        "location": "",
        "paragraph": "The Danville race riot occurred on July 25, 1903, in Danville, Illinois, when a mob sought to lynch a black man who had been arrested. On their way to county jail, an altercation occurred that led to the death of a rioter and the subsequent lynching of another black man. At least two other black residents were also assaulted. The rioters failed to overtake the police stationed at the jail and the Illinois National Guard restored order the next day.\nA black man, James Wilson, had been arrested for the assault of a white woman in Alvin, Illinois, north of Danville. A mob of about 600 formed to storm the county jail in Danville to kill Wilson. En route, they encountered another black man, a native of Evansville, Indiana, who has been variously identified as J. D. Mayfield, John D. Metcalf, or Bud Fruit. In the ensuing altercation, he shot and killed a member of the mob. Mayfield was intercepted by police and was taken to the nearby police station. Officers barricaded the doors, but they were unable to hold back the mob. Mayfield was captured and taken to the spot where the altercation occurred. There, he was lynched by hanging on the nearest telephone pole.[1]\n"
    },
    {
        "link": "/wiki/East_St._Louis_riots",
        "title": "East St. Louis riots",
        "date": "May 28 and July 1–3, 1917",
        "location": "East St. Louis, Illinois38°37′20″N 90°09′30″W﻿ / ﻿38.62222°N 90.15833°W﻿ / 38.62222; -90.15833Coordinates: 38°37′20″N 90°09′30″W﻿ / ﻿38.62222°N 90.15833°W﻿ / 38.62222; -90.15833",
        "paragraph": "\nThe East St. Louis Riots were a series of outbreaks of labor and race-related violence by White Americans who murdered between 39 and\n150 African Americans in late May and early July 1917. Another 6,000 black people were left homeless,[1] and the burning and vandalism cost approximately $400,000 ($8.46 million in 2021) in property damage.[1] The events took place in and near East St. Louis, Illinois, an industrial city on the east bank of the Mississippi River, directly opposite the city of St. Louis, Missouri. The July 1917 episode in particular was marked by white-led violence throughout the city. The multi-day riot has been described as the \"worst case of labor-related violence in 20th-century American history\",[2] and among the worst racial riots in U.S. history.\n"
    },
    {
        "link": "/wiki/William_%22Froggie%22_James",
        "title": "William \"Froggie\" James",
        "date": "",
        "location": "",
        "paragraph": "William \"Froggie\" James, an African-American man, was lynched and his dead body mutilated on November 11, 1909 by a mob in the Illinois town of Cairo  after he was charged with the rape and murder On November 2, 1909 of 23-year-old shop clerk Anna Pelley.[1][2][3][4]\nJames was denied due process and killed before the police investigation had been completed. The townspeople of Cairo formed a mob and murdered him, along with a second prisoner from the town jail whose trial had been delayed. The lynching drew crowds of thousands, and led the Illinois State Legislature to pass a series of anti-lynch and anti-mob laws that led to major reforms throughout the Midwest involving the sentencing and protections for African American people in Illinois. The lynching also mobilized advocacy groups in the state to push for more legal protections of African-American communities in smaller towns.\n"
    },
    {
        "link": "/wiki/Lynching_of_William_Johnson",
        "title": "Lynching of William Johnson",
        "date": "",
        "location": "",
        "paragraph": "The lynching of William Johnson occurred at Thebes, Illinois on April 26, 1903. Johnson had been accused of assaulting a 10-year-old girl. He was apprehended by a mob of farmers and hanged.\nWilliam Johnson was an African American man who lived in a work camp for erecting the Thebes Bridge in Thebes, Illinois, over the Mississippi River. In late April 1903, Johnson was accused of assaulting the 10-year-old daughter of Branson Davis at his residence a half-mile east of Santa Fe, Illinois (modern day Fayville). A mob of farmers gathered to apprehend Johnson on April 26, but he had already been taken into police custody. The farmers overwhelmed the officers and Johnson was captured. They brought him back to Thebes near the bridge that was being constructed and hanged him from an oak tree. After Johnston expired, the mob shot up the body. The mob then attacked the work camp, exchanging fire and injuring several workers. The farmers then burned the camp and then dispersed. On May 1, the mob raided another work camp on May 1 and dispersed the black workers there.[1]\n"
    },
    {
        "link": "/wiki/Elijah_Parish_Lovejoy",
        "title": "Elijah Parish Lovejoy",
        "date": "",
        "location": "",
        "paragraph": "\nElijah Parish Lovejoy (November 9, 1802 – November 7, 1837) was an American Presbyterian minister, journalist, newspaper editor, and abolitionist. Following his murder by a mob, he became a martyr to the abolitionist cause opposing slavery in the United States.[1] He was also hailed as a defender of free speech and freedom of the press.[1][2][3]\n"
    },
    {
        "link": "/wiki/Robert_Prager",
        "title": "Robert Prager",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Paul Prager (February 28, 1888 – April 5, 1918) was a German immigrant who was lynched in the United States during World War I as a result of anti-German sentiment. He had worked as a baker in southern Illinois and then as a laborer in a coal mine, settling in Collinsville, a center of mining. At a time of rising anti-German sentiment, he was rejected for membership in the Maryville, Illinois local of the United Mine Workers of America. Afterward he angered area mine workers by posting copies of his letter around town that complained of his rejection and criticized the local president.\n"
    },
    {
        "link": "/wiki/Hyrum_Smith",
        "title": "Hyrum Smith",
        "date": "",
        "location": "",
        "paragraph": "\nHyrum Smith (February 9, 1800 – June 27, 1844) was an American religious leader in the Church of Jesus Christ of Latter Day Saints, the original church of the Latter Day Saint movement. He was the older brother of the movement's founder, Joseph Smith, and was killed with his brother at Carthage Jail where they were being held awaiting trial.\n"
    },
    {
        "link": "/wiki/Joseph_Smith",
        "title": "Joseph Smith",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Killing_of_Joseph_Smith",
        "title": "Killing of Joseph Smith",
        "date": "June 27, 1844; 178 years ago (1844-06-27)",
        "location": "Carthage, Illinois, U.S.",
        "paragraph": "\nJoseph Smith, the founder and leader of the Latter Day Saint movement, and his brother, Hyrum Smith, were killed by a mob in Carthage, Illinois, United States, on June 27, 1844, while awaiting trial in the town jail.\n"
    },
    {
        "link": "/wiki/Lynching_of_F._W._Stewart",
        "title": "Lynching of F. W. Stewart",
        "date": "",
        "location": "",
        "paragraph": "The lynching of F. W. Stewart occurred shortly after midnight on November 7, 1898, about a mile outside of Lacon, Illinois. Stewart had been accused of the assault of a miner's daughter in Toluca. About one hundred miners formed a mob and broke into the Marshall County jail to retrieve Stewart, who they hanged.\nF. W. \"George\" Stewart was an African American from Toluca, Illinois, a mining town along the Atchison, Topeka, and Santa Fe Railway. Stewart had previously served a sentence in Peoria County for an 1896 burglary and had lived in Toluca for about four months following his release. Racial tensions were stoked by the fast growth of Toluca and the recent Virden Mine Riot further south in Illinois; according to the Chicago Tribune, \"many colored men were forced to leave town because feeling was running so high. Among those\nwho persisted in staying, however, was F.\nW. Stewart...\"[1] The United Mine Workers of America 1897-98 coal strike, and the presence of African-American strikebreakers, caused several Illinois mining towns to go \"sundown\".\n"
    },
    {
        "link": "/wiki/Lynching_of_David_Wyatt",
        "title": "Lynching of David Wyatt",
        "date": "",
        "location": "",
        "paragraph": "\nDavid Wyatt was an African-American teacher in Brooklyn, Illinois. In June 1903, Wyatt was denied renewal for his teaching certificate by the district superintendent, Charles Hertel. After hearing about his denial, Wyatt shot Hertel and was immediately arrested. While in jail, a mob captured Wyatt, lynched him in the public square, and set his body on fire.[1]\n"
    },
    {
        "link": "/wiki/Aurora,_Illinois_shooting",
        "title": "Aurora, Illinois shooting",
        "date": "February 15, 2019 (2019-02-15) 1:24 – 2:59 p.m.[1] (CST, UTC−6)",
        "location": "Henry Pratt Company,641 Archer Ave,Aurora, Illinois, United States",
        "paragraph": "\nOn February 15, 2019, a mass shooting took place at Henry Pratt Company in Aurora, Illinois, United States. Six people died, including the perpetrator, 45-year-old former employee Gary Montez Martin, who was shot and killed by responding police officers. Six others were injured, including five police officers.\n"
    },
    {
        "link": "/wiki/Benito_Juarez_Community_Academy",
        "title": "Benito Juarez Community Academy",
        "date": "",
        "location": "",
        "paragraph": "Benito Juarez Community Academy, (commonly known as Juarez High School), is a public 4–year high school in the Pilsen neighborhood on the west side of Chicago, Illinois, United States. Juarez is named for Mexican president Benito Pablo Juárez García. The school is a part of the Chicago Public Schools (CPS) district. As of 2014 it is the largest high school in Pilsen.[3] It was designed by architect Pedro Ramírez Vázquez.\nThe school was proposed to the Chicago Board of Education multiple times but ultimately rejected. This led to protests and boycotts from many Mexican students and families. Finally, in June 1974, the Chicago Board of Education approved $8.9 million in funding to build a high school in Pilsen. Benito Juarez Community Academy opened in 1977 and as of 2017 has a 94 percent Latino student body. The school is decorated with murals and statues that portray Mexican culture and famous leaders.[4]\n"
    },
    {
        "link": "/wiki/Brown%27s_Chicken_massacre",
        "title": "Brown's Chicken massacre",
        "date": "January 8, 1993",
        "location": "Palatine, Illinois, United States",
        "paragraph": "The Brown's Chicken Massacre was a mass murder that occurred on January 8, 1993 in Palatine, Illinois, when two robbers killed seven employees at a Brown's Chicken fast-food restaurant.\nThe case remained unsolved for nearly nine years, until one of the assailants was implicated by his girlfriend in 2002. Police used DNA samples from the murder scene to match one of the suspects, Juan Luna. Luna was put on trial in 2007, found guilty of seven counts of first degree murder, and sentenced to life imprisonment. James Degorski, the other assailant, was found guilty in 2009 on all seven counts of first degree murder, and sentenced to life imprisonment without parole.\n"
    },
    {
        "link": "/wiki/Don_Carter_Lanes_shooting",
        "title": "Don Carter Lanes shooting",
        "date": "December 26, 2020",
        "location": "Rockford, Illinois, United States",
        "paragraph": "\nOn December 26, 2020, three people were killed and three others injured in a mass shooting at Don Carter Lanes, a bowling alley in Rockford, Illinois, U.S. A sole suspect was arrested after the shooting and later identified as Duke Webb, who at the time was an active-duty Special Forces soldier.[1]\n"
    },
    {
        "link": "/wiki/Dunbar_Vocational_High_School_shooting",
        "title": "Dunbar Vocational High School",
        "date": "",
        "location": "",
        "paragraph": "Dunbar Vocational High School (also known as Dunbar Vocational Career Academy, or DVCA) is a public 4–year vocational high school located in the Bronzeville neighborhood on the south side of Chicago, Illinois, United States. Dunbar opened in 1942[6] and is operated by the Chicago Public Schools (CPS) district. The school is named in honor of the African–American poet, novelist, and playwright Paul Laurence Dunbar.[7]\nOpening in September 1942[8] as a Dunbar Trade School, the school was created to provide skill workers for the war. When the school opened, the school had a student enrollment of 1,500; Mostly all of which were African–American. The school was considered as a \"vocational branch\" of Wendell Phillips High School, considering both schools were predominately African–American. In 1946, the Chicago Public Schools changed the trade school into a public high school, accepting ninth grade students in January of that year. The school's first location was in a former elementary school building located at 4401 South St.  Lawrence Avenue. In addition to the school building, twenty–two mobile classroom which served as vocational shops were constructed on the site over the course of several months after its opening.[9]\n"
    },
    {
        "link": "/wiki/Englewood,_Chicago_shooting",
        "title": "Gangster Disciples",
        "date": "",
        "location": "",
        "paragraph": "The Gangster Disciples (often abbreviated as the GD's, formerly GDN) are an African American street and prison gang, which was formed in 1969, by Larry Hoover and David Barksdale. The two rival gangsters united together to form the Black Gangster Disciple Nation (BGDN). Since 1989, after a decline in leadership caused friction between the two gangs, the BGDN has divided into different factions known today as the Gangster Disciples and the other being the Black Disciples.\nAs of 2022, the Gangster Disciples have no full leadership following Hoover's departure.[11]\n"
    },
    {
        "link": "/wiki/Highland_Park_parade_shooting",
        "title": "Highland Park parade shooting",
        "date": "July 4, 2022 (2022-07-04) 10:14 a.m. CDT (UTC–05:00)",
        "location": "Central Ave. and 2nd St. in Highland Park, Illinois, U.S.",
        "paragraph": "\nOn July 4, 2022, a mass shooting occurred during an Independence Day parade in Highland Park, Illinois, United States. The shooting occurred at 10:14 a.m. CDT (UTC−05:00), roughly 15 minutes after the parade had started. Seven people were killed, and 48 others were wounded by bullets or shrapnel.\n"
    },
    {
        "link": "/wiki/June_2021_Chicago_mass_shooting",
        "title": "List of mass shootings in the United States in 2021",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Lane_Bryant_shooting",
        "title": "Lane Bryant shooting",
        "date": "February 2, 2008 (2008-02-02) c. 10:45 a.m. (UTC-6)",
        "location": "Tinley Park, Illinois, United States",
        "paragraph": "The Lane Bryant shooting was an incident of mass murder and armed robbery at a Lane Bryant clothing outlet in the Brookside Marketplace in Tinley Park, Illinois, a suburb of Chicago, that occurred on February 2, 2008. The shooting resulted in five deaths and one injury.\nThe identity of the shooter remains unknown. Police released a sketch of the suspect on February 11, 2008, receiving two dozen leads on the very first day.[1]\n"
    },
    {
        "link": "/wiki/Magnificent_Mile_shooting",
        "title": "Magnificent Mile shooting",
        "date": "May 19, 2022 (2022-05-19) 10:40 – c. 11:30 p.m. (CDT; UTC−05:00)",
        "location": "800 North State Street,Chicago, Illinois, U.S.",
        "paragraph": "On May 19, 2022, a mass shooting occurred in Chicago, Illinois, United States, in the city's Magnificent Mile shopping district, near Michigan Avenue.[4] Two people were killed, and eight others were injured.[5] The accused perpetrator, Jaylun Sanders, was taken into custody with the weapon also being obtained by Chicago police.\nThe shooting occurred at about 10:40 p.m. CDT (UTC−05:00), near a McDonald's establishment on the Near North Side neighborhood of Chicago.[5][6] The incident occurred a few blocks from the city's Magnificent Mile shopping district. The shooting happened as a result of an altercation outside the McDonald's restaurant.[5] The cause of the altercation is not yet known; however it was described as \"personal\" by detectives.[7][3] The shooting was triggered when police officers, who were near the area noticed two groups engaging in a fight.[3]\n"
    },
    {
        "link": "/wiki/2021_Normal_shooting",
        "title": "Normal, Illinois",
        "date": "",
        "location": "",
        "paragraph": "Normal is a town in McLean County, Illinois, United States.  As of the 2020 census, the town's population was 52,736. Normal is the smaller of two principal municipalities of the Bloomington–Normal metropolitan area, and Illinois' seventh most populous community outside the Chicago metropolitan area. As of 2022, Chris Koos has been Normal's mayor since 2003.[2]\nThe main campus of Illinois' oldest public university, Illinois State University, a fully accredited four-year institution, is in Normal, as is Heartland Community College, a fully accredited two-year institution. There was also a satellite campus of Lincoln College, which offered associate degrees as well as four-year programs.\n"
    },
    {
        "link": "/wiki/Northern_Illinois_University_shooting",
        "title": "Northern Illinois University shooting",
        "date": "February 14, 2008; 14 years ago (2008-02-14) c. 3:05 – 3:11 p.m. (CST)",
        "location": "DeKalb, Illinois, United States",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Saint_Valentine%27s_Day_Massacre",
        "title": "Saint Valentine's Day Massacre",
        "date": "February 14, 1929 10:30 am (CST)",
        "location": "Warehouse at Dickens and Clark in Lincoln Park, Chicago",
        "paragraph": "\nThe Saint Valentine's Day Massacre was the murder of seven members and associates of Chicago's North Side Gang that occurred on Saint Valentine's Day 1929. The men were gathered at a Lincoln Park, Chicago garage on the morning of February 14, 1929. They were lined up against a wall and shot by four unknown assailants, two dressed as police officers. \n"
    },
    {
        "link": "/wiki/Joe_Aiello",
        "title": "Joe Aiello",
        "date": "",
        "location": "",
        "paragraph": "\nGiuseppe \"Joe\" Aiello (Italian pronunciation: [dʒuˈzɛppe aˈjɛllo]; September 27, 1890 – October 23, 1930) was a Sicilian bootlegger and organized crime leader in Chicago during the Prohibition era. He was best known for his long and bloody feud with Chicago Outfit boss Al Capone.\n"
    },
    {
        "link": "/wiki/Louis_Alterie",
        "title": "Louis Alterie",
        "date": "",
        "location": "",
        "paragraph": "\nLouis \"Two Gun\" Alterie (August 2, 1886 – July 18, 1935), born Leland A. Varain, and aka \"Diamond Jack Alterie\", was a Californian who became a notorious hitman for the Chicago North Side Gang during the early years of Prohibition.\n"
    },
    {
        "link": "/wiki/Samuzzo_Amatuna",
        "title": "Samuzzo Amatuna",
        "date": "",
        "location": "",
        "paragraph": "Salvatore \"Samoots\" Ammatuna (August 3, 1898 – November 13, 1925) was an Italian-born American mobster and member of the Genna Brothers in Chicago who served as president of the Unione Siciliane.\nAmmatuna was born in Pozzallo, Sicily in 1898 and emigrated to the United States in the early 20th century, eventually arriving in Chicago's Little Italy. As a teenager, he worked as a messenger for the Genna Brothers, a group of ruthless Sicilian gangsters. He earned a full membership in the Genna gang on February 21, 1916 at age 17 by murdering Frank Lombardi outside a saloon. Lombardi was a supporter of incumbent Chicago alderman John Powers, a bitter enemy of the Genna brothers. The brutal warfare between the Gennas and Powers became known in Chicago as the Aldermen's Wars.\n"
    },
    {
        "link": "/wiki/Malcolm_Lee_Beggs",
        "title": "Malcolm Lee Beggs",
        "date": "",
        "location": "",
        "paragraph": "Malcolm Lee Beggs (1907 – December 10, 1956) was an American stage, television and film actor.\nThe son of actor/director Lee Beggs and stage actress Doris Singleton, he began performing professionally on the stage at the age of 5. He made appearances in two silent films: The Silent Plea (1914) and In Bridal Attire (1915). In 1936 he made his Broadway debut as Don Abacchio in Bitter Stream. He went on to appear in the original Broadway productions of Devils Galore (1945), Metropole (1949), Seventh Heaven (1955), and Mr. Wonderful (1956). He also starred as William M. Tweed in the 1947 Broadway revival of Up in Central Park.\n"
    },
    {
        "link": "/wiki/William_Morris_Bioff",
        "title": "William Morris Bioff",
        "date": "",
        "location": "",
        "paragraph": "William Morris (\"Willie\") Bioff (October 12, 1900 – November 4, 1955) was a Jewish-American organized crime figure who operated as a Chicago pimp and corrupt union leader between the 1920s and the 1940s. Using his position as head of the movie production workers' union, Bioff helped Chicago Outfit boss Frank Nitti successfully extort millions of dollars from Hollywood film studios by using the threat of a general strike that would paralyze the American film industry.[1][2]\nBioff was born and briefly raised in a kosher Jewish household in Chicago, but his father kicked him out on the street when he was eight years old.[1] Bioff soon became involved in criminal ventures, beginning with petty theft, then minor protection rackets and working his way up to pimping in Chicago's Levee vice district, of which he was later convicted in 1922. Bioff later worked for Harry and Jake \"Greasy Thumb\" Guzik where, through Guzik, Bioff met Al Capone and later Frank \"The Enforcer\" Nitti.[citation needed]\n"
    },
    {
        "link": "/wiki/John_M._Bolton",
        "title": "John M. Bolton",
        "date": "",
        "location": "",
        "paragraph": "John M. Bolton (October 5, 1901 – July 9, 1936) was an American businessman and politician in Chicago.\nBolton was born in Chicago and attended Chicago public schools.[1] He was in the floral business and insurance business.[1] A Democrat, he was first elected to the Illinois House of Representatives, representing the Second District, in the fall of 1930, taking office in early 1931.[2][3] He was re-elected in 1932,[4] and in 1934 (unopposed).[5][1]\n"
    },
    {
        "link": "/wiki/Sol_Butler",
        "title": "Sol Butler",
        "date": "",
        "location": "",
        "paragraph": "Solomon Wellings “Sol” Butler (March 3, 1895 – December 1, 1954) was a multi-talented athlete who competed in American football and track and field. He finished seventh in the long jump competition at the 1920 Summer Olympics.[2] He also played in the National Football League for the Hammond Pros, Akron Pros, Canton Bulldogs, Buffalo Bisons, and Rock Island Independents. Referenced sometimes as Edward Solomon Butler, was a name used by alternate people to gain notoriety off the exploits of Solomon W. Butler in various parts of the country.[3]\nButler was born in Kingfisher, Oklahoma, the youngest child of Ben and Mary Butler. His father was from Morgan County, Alabama, and born a slave in 1842; his mother was born in Georgia in 1867. His father fought in the Civil War and took the last name of Butler from General Butler whom he admired. The Butler family escaped slavery and settled in Wichita, Kansas, before moving to Hutchinson, Kansas, in 1909. \"Sol\", as he was known, made the varsity football team as a starting halfback during his freshman year. He led the school in football and in track and field. His sophomore year, he helped Hutchinson to a runner-up finish at the state meet after setting state records in the 100-yard dash. In 1913, as a junior in Hutchinson High School (Kansas) at a district meet he won six firsts, broke five meet records and unofficially broke a world record in the 50-yard dash. He along with his older brother Benjamin followed his high school coach to Rock Island High School in Rock Island, Illinois, for his senior season in 1914. Facing 300 of the best track stars of the Midwest in Chicago, he competed in the regional interscholastic meet held at Northwestern University. He placed in the 60-yard dash and hurdles, the 440 yard dash, and also in the broad jump. He broke one meet record, tied a world record, and won fourth place overall, competing against entire track teams.\n"
    },
    {
        "link": "/wiki/Ricky_Byrdsong",
        "title": "Ricky Byrdsong",
        "date": "",
        "location": "",
        "paragraph": "Ricky Byrdsong (June 24, 1956 – July 3, 1999) was an American college basketball coach and insurance executive. He served as the head men's basketball coach at the University of Detroit Mercy (1988–1993) and Northwestern University (1993–1997), compiling a career coaching record of 89–163. Byrdsong was the first African American head coach of the Northwestern Wildcats men's basketball program. On July 2, 1999, he was shot during a racially motivated killing spree and died the next day.\nByrdsong grew up in Atlanta, Georgia, raised by his mother with his younger sister Marcia. He attended Frederick Douglass High School. Besides basketball, Byrdsong played the saxophone in the band, sang with the chorus and appeared in school plays. After graduation in 1974, Byrdsong accepted a basketball scholarship to Pratt Community College in Pratt, Kansas.[1]\n"
    },
    {
        "link": "/wiki/Richard_Cain",
        "title": "Richard Cain",
        "date": "",
        "location": "",
        "paragraph": "\nRichard Cain (October 4, 1931 – December 20, 1973), also known as Richard Scalzitti, was a notoriously corrupt Chicago police officer and a close associate of Mafia boss Sam Giancana.\n"
    },
    {
        "link": "/wiki/Mary_Kate_Chamizo",
        "title": "Murder of Peggy Johnson",
        "date": "",
        "location": "",
        "paragraph": "\nPeggy Lynn Johnson (formerly known as Racine County Jane Doe), also known by the last name Schroeder, was an American woman whose body was discovered in 1999 in the town of Raymond, Racine County, Wisconsin.[1] She was 23 years old at the time of her death, which had occurred after enduring several weeks of  extreme neglect and both physical and sexual abuse.[2] New developments in the case emerged after her body was exhumed on October 16, 2013, including isotope analysis.[3] In November 2019, authorities announced that after two decades she was finally identified. Both the victim's and the murderer's name were released on November 8, 2019.[4] In March 2022, Linda La Roche was convicted of her murder.[5] In May 2022, she was sentenced to life in prison without the possibility of parole.[6] Johnson's murder received national attention both preceding and following her identification.[7]\n"
    },
    {
        "link": "/wiki/Carl_Choisser",
        "title": "Carl Choisser",
        "date": "",
        "location": "",
        "paragraph": "William Carl Choisser (July 10, 1895 – September 25, 1939) was an American newspaper editor, lawyer, and politician.\nChoisser was born in Ozark, Johnson County, Illinois. In 1917, he graduated from the University of Illinois College of Law, where he received a bachelor of laws, and was on the varsity wrestling team.[1][2] He then served in the United States Army Air Service during World War I. Choisser practiced law in Benton, Illinois, and was the editor of the Benton Evening News. Choisser served in the Illinois House of Representatives from 1923 to 1929 and was a Republican. In 1939, Choisser was murdered with a firearm in Benton, Illinois, after a quarrel with a defendant involving a murder trial.[3][4][5]\n"
    },
    {
        "link": "/wiki/Merle_E._Clutts",
        "title": "Thomas Silverstein",
        "date": "",
        "location": "",
        "paragraph": "\nThomas Edward Silverstein (February 4, 1952 – May 11, 2019) was an American criminal who spent the last 42 years of his life in prison after being convicted of four separate murders while imprisoned for armed robbery, one of which was overturned.[2] Silverstein spent the last 36 years of his life in solitary confinement for killing Corrections Officer Merle Clutts at the Marion Penitentiary in Illinois. Prison authorities described him as a brutal killer and a former leader of the Aryan Brotherhood prison gang. Silverstein maintained that the dehumanizing conditions inside the prison system contributed to the three murders he committed. He was held \"in a specially designed cell\" in what is called \"Range 13\" at ADX Florence federal penitentiary in Colorado.[3] He was the longest-held prisoner in solitary confinement within the Bureau of Prisons at the time of his death.[4] Many prison guards refused to talk to Silverstein out of respect for Clutts.[5]\n"
    },
    {
        "link": "/wiki/Big_Jim_Colosimo",
        "title": "Big Jim Colosimo",
        "date": "",
        "location": "",
        "paragraph": "\nVincenzo Colosimo[2] (Italian: [vinˈtʃɛntso koˈlɔːzimo]; February 16, 1878 – May 11, 1920), known as James \"Big Jim\" Colosimo or as \"Diamond Jim\", was an Italian-American Mafia crime boss who emigrated from Calabria, Italy, in 1895 and built a criminal empire in Chicago based on prostitution, gambling and racketeering. He gained power through petty crime and by heading a chain of brothels. From about 1902 until his death in 1920, he led a gang that became known after his death as the Chicago Outfit. Colosimo was assassinated on May 11, 1920, and no one was ever charged with his murder.[3] Johnny Torrio, an enforcer whom Colosimo imported in 1909 from New York, seized control of Colosimo's businesses after his death. Al Capone, a close associate of Torrio, has been accused of involvement in Colosimo's murder, but was not yet in Chicago at the time.[3]\n"
    },
    {
        "link": "/wiki/Nick_Corwin",
        "title": "Murder of Nick Corwin",
        "date": "",
        "location": "",
        "paragraph": "Nicholas B. Corwin was an eight-year-old boy murdered by Laurie Dann, a mentally ill woman, in a Winnetka, Illinois elementary school on May 20, 1988.\nDann also shot several other students, all of whom survived, then took a family hostage and set a fire in their house before committing suicide. Earlier that day, she had tried to poison several acquaintances and set fires in a school and a daycare.\n"
    },
    {
        "link": "/wiki/Amber_Creek",
        "title": "Murder of Amber Creek",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Patrick_Henry_Cronin",
        "title": "Patrick Henry Cronin",
        "date": "",
        "location": "",
        "paragraph": "\nPhilip Patrick Henry Cronin (August 7, 1846 – May 4, 1889) was an Irish immigrant to the United States, a physician, and a member of Clan na Gael in Chicago. In 1889, Cronin was murdered by affiliates of Clan na Gael. Following an extensive investigation into his death, the murder trial was, at the time, the longest-running trial in U.S. history.[2] Cronin's murder caused a public backlash against secret societies, including protests and written condemnations by the leadership of the Catholic Church.\n"
    },
    {
        "link": "/wiki/Ioan_Petru_Culianu",
        "title": "Ioan Petru Culianu",
        "date": "",
        "location": "",
        "paragraph": "Ioan Petru Culianu or Couliano (5 January 1950 – 21 May 1991) was a Romanian historian of religion, culture, and ideas, a philosopher and political essayist, and a short story writer. He served as professor of the history of religions at the University of Chicago from 1988 to his death, and had previously taught the history of Romanian culture at the University of Groningen.\nAn expert in Gnosticism and Renaissance magic, he was encouraged and befriended by Mircea Eliade, though he gradually distanced himself from his mentor. Culianu published seminal work on the interrelation of the occult, Eros, magic, physics, and history.[1]\n"
    },
    {
        "link": "/wiki/Anthony_D%27Andrea",
        "title": "Anthony D'Andrea",
        "date": "",
        "location": "",
        "paragraph": "Anthony D'Andrea (born Antonio D'Andrea; Italian pronunciation: [anˈtɔːnjo danˈdreːa]; June 7, 1872 – May 12, 1921) was an Italian-born Mafia boss of Chicago in the late 1910s to early 1920s. He was also a Democrat and a political leader who was a president of the Unione Siciliana and was involved in a heated battle for alderman. D'Andrea was killed by an assassin's bullet in 1921.\nD'Andrea was born in Valledolmo, Sicily, in 1872 to a large family, he studied law at the University of Palermo in Palermo, Sicily. In 1897, D'Andrea immigrated to the United States, briefly settling in Buffalo, New York. He later attended seminary at St. Mary's Academy in Baltimore and St. Bonaventura's Academy in Allegheny, Pennsylvania. In June, 1899, D'Andrea moved to Chicago, where he was ordained a priest and appointed pastor of St. Anthony's Italian (Independent) Catholic Church under Bishop Antoni Kozlowski [pl]. His brother Orazio (Horace) also became a priest.\n"
    },
    {
        "link": "/wiki/Keith_Dardeen",
        "title": "Dardeen family homicides",
        "date": "November 17–18, 1987",
        "location": "Ina, Illinois, U.S.",
        "paragraph": "On the evening of November 18, 1987, police went to the mobile home of Russell Keith Dardeen, 29, and his family outside Ina, Illinois, United States, after he had failed to show up for work that day. There, they found the bodies of his wife and son, both brutally beaten. Ruby Elaine Dardeen, 30, who had been pregnant with the couple's daughter, had been beaten so badly she had gone into labor, and the killer or killers had also beaten the newborn to death.[1]\nThe killings had apparently taken place the day before. Investigators at first believed that Keith was the prime suspect. The next day, however, his body was found in a nearby field. He had been shot and his genitals mutilated;[2] his car was found parked near the police station in Benton. Forensic examination showed he had been killed within an hour of his family.\n"
    },
    {
        "link": "/wiki/William_Dauber",
        "title": "William Dauber",
        "date": "",
        "location": "",
        "paragraph": "William E. \"Billy\" Dauber (June 30, 1935-July 2, 1980) was a Chicago mobster, hitman and associate in the Chicago Outfit's South Side chop shop ring. \nBorn in Chicago and moved to Blue Island, Dauber was brought into the Chicago crime syndicate by mobster James \"Jimmy the Bomber\" Catuara, who operated illegal gambling and vice in Chicago's Southside. One of only a few southerners within the syndicate, Dauber quickly proved to be a valuable member of \"The Outfit.\" As Catuara's protégé, Dauber was suspected in over 20 unsolved homicides, between 1969 and 1980, in the decade-long struggle for Steven Ostrowski's lucrative South Side chop shop operation. \n"
    },
    {
        "link": "/wiki/George_Davenport",
        "title": "George Davenport",
        "date": "",
        "location": "",
        "paragraph": "Colonel George Davenport, born George William King (1783 – July 4, 1845), was a 19th-century English-American sailor, frontiersman, fur trader, merchant, postmaster, US Army soldier, Indian agent, and city planner. A prominent and well-known settler in the Iowa Territory, he was one of the earliest settlers in Rock Island. He spent much of his life involved in the early settlement of the Mississippi Valley and the \"Quad Cities\". The present-day city of Davenport, Iowa, is named after him.[1]\nGeorge Davenport was born in 1783 in Lincolnshire, England, becoming an apprentice to his uncle, a merchant captain, and going to sea at an early age. During the next several years, he visited ports in the Baltic as well as in France, Spain, and Portugal. In the fall of 1803, shortly after arriving with a cargo from Liverpool, Davenport was arrested with the rest of his crew while in port at St. Petersburg when the Czarist Russian government acceded to Napoleon's embargo on British vessels (the \"Continental System\"). Davenport was imprisoned until the spring when he was released and allowed to return to his home country.[2]\n"
    },
    {
        "link": "/wiki/Dantrell_Davis",
        "title": "Dantrell Davis",
        "date": "",
        "location": "",
        "paragraph": "\nDantrell Davis (July 31, 1985 – October 13, 1992) was a 7-year-old boy from Chicago, Illinois, who was murdered in October 1992. Davis was walking to school with his mother in the Cabrini-Green housing projects when he was accidentally shot by Anthony Garrett, a member of a local street gang who intended to shoot a rival. Dantrell's death sparked an increased awareness of the extensive violence occurring in Chicago's inner-city projects, and led to the first street gang truce in Cabrini–Green, which lasted for three years. Garrett was convicted of first-degree murder for Davis' death, and received a 100-year sentence.\n"
    },
    {
        "link": "/wiki/Sam_DeStefano",
        "title": "Sam DeStefano",
        "date": "",
        "location": "",
        "paragraph": "\nSamuel \"Mad Sam\" DeStefano (September 13, 1909 − April 14, 1973) was a Mobster who was associated with the Chicago Outfit. He was one of the organization's most notorious loan sharks and sociopathic killers. Chicago-based Federal Bureau of Investigation (FBI) agents, such as William F. Roemer Jr., considered DeStefano to be the worst torture-murderer in the history of the United States.[1] The Outfit used the mentally unstable and sadistic DeStefano for the torture-murders of Leo Foreman and Arthur Adler, the murder of DeStefano's younger brother, Michael DeStefano (an Outfit enforcer), and many others. However, due to DeStefano's deranged mental state, the Outfit never let him become a made man. At least one Outfit insider, Charles Crimaldi, claimed DeStefano was a devil worshipper.[2]\n"
    },
    {
        "link": "/wiki/Vito_Di_Giorgio",
        "title": "Vito Di Giorgio",
        "date": "",
        "location": "",
        "paragraph": "Vito Di Giorgio (Italian pronunciation: [ˈviːto di ˈdʒordʒo]; March 19, 1880 – May 13, 1922) was an Italian-born crime boss based in Los Angeles. Originally from Palermo, Sicily, Di Giorgio lived most of his life as a grocer in New Orleans, where he was also an active Black Hander. While he lived in Los Angeles, he was known as a wealthy food importer. He survived two shootings, only to be killed while visiting Chicago in 1922.\nBorn to Filippo Di Giorgio and Giuseppa Casabianca in Borgetto, Sicily, in 1880,[1] Di Giorgio came to the United States around 1904. After a brief stay in New York City with his reported cousin, he moved to New Orleans. There, he married Maria Cristoforo on April 23, 1909, and joined the community of organized criminals. He was acknowledged as a cousin and a friend to New York City Mafia boss Giuseppe Morello, and with this connection became a leading Black Hander. It is not known when he joined the Honored Society; he may have been a member in Sicily. Using the alias of Joseph Caronia, he was arrested in 1908 for extortion. He was the leader of a Black Hand group that sent an extortion letter demanding money from a leading Italian grocer. He signed the letter \"King of the Mafia.\" He and his associates were freed after a short stay in jail due to lack of evidence. Further investigation showed that Di Giorgio killed a man, Joseph Campisciano, in self-defense about a year earlier. He had used the name Caronia at that time too.\n"
    },
    {
        "link": "/wiki/Allen_Dorfman",
        "title": "Allen Dorfman",
        "date": "",
        "location": "",
        "paragraph": "\nAllen Melnick Dorfman[2] (January 6, 1923 – January 20, 1983) was an American insurance agency owner and a consultant to the International Brotherhood of Teamsters (IBT) Central States Pension Fund. He was a close associate of longtime IBT President Jimmy Hoffa and associated with organized crime via the Chicago Outfit. Dorfman was convicted on several felony counts and was murdered in 1983.\n"
    },
    {
        "link": "/wiki/Jaclyn_Dowaliby",
        "title": "Murder of Jaclyn Dowaliby",
        "date": "",
        "location": "",
        "paragraph": "Jaclyn Marie Dowaliby (May 17, 1981 – September 10, 1988) was an American girl who disappeared from her bedroom during the night in Cook County, Illinois, United States. The murdered child's body was found four days later.\nOn September 10, 1988, seven-year-old Jaclyn was taken from her home in Midlothian, Illinois, United States, at some point during the night.[1] The next morning, her mother Cynthia Dowaliby reported her as a missing child, possibly an abduction, and said that she \"prayed for her return\".[2] Police reportedly found a broken window, but it may have been a faked break-in as her adoptive father David Dowaliby later recalled the back door was left open. Search parties were organized, but for four days Jaclyn was nowhere to be found.\n"
    },
    {
        "link": "/wiki/Edmund_Durfee",
        "title": "Edmund Durfee",
        "date": "",
        "location": "",
        "paragraph": "Edmund Durfee (Durfy) Sr. (October 3, 1788 – November 15, 1845) was an American settler and early member of the Latter Day Saint movement who is remembered as a martyr by Latter-day Saints.[1][2][3][4][5]\nBorn in Tiverton, Rhode Island, Durfee was a farmer, carpenter, and millwright.  He married Magdalena Pickle, and they later became the parents of thirteen children. The Durfees joined the Church of Jesus Christ of Latter Day Saints in the 1830s in Ohio. After being driven as religious refugees from Mormon settlements in Ohio and Missouri (see Missouri Executive Order 44), they moved to Morley's Settlement in Hancock County, Illinois, about 25 miles due south of Nauvoo, Illinois.[1][2][3][4][5]\n"
    },
    {
        "link": "/wiki/Jimmy_Elliott",
        "title": "Jimmy Elliott",
        "date": "",
        "location": "",
        "paragraph": "\nJimmy Elliot (1838, Athlone, Ireland – March 1, 1883) was an Irish-American boxer who was Heavyweight Champion of the World from 1865 to 1868. On December 12, 1870 Elliott was arrested and convicted of highway robbery and assault with intent to kill. He was sentenced to sixteen years and ten months at the Eastern State Penitentiary in Philadelphia. He was released early in the spring of 1879 due to an eye disease. On March 1, 1883, a gambler by the name of Jere Dunn shot Elliot in a Chicago saloon. He died shortly after.\n"
    },
    {
        "link": "/wiki/Maurice_Enright",
        "title": "Maurice Enright",
        "date": "",
        "location": "",
        "paragraph": "\nMaurice \"Mossy\" or \"Mossie\" Enright (died February 2, 1920) was an Irish-American gangster and one of the earliest Chicago labor racketeers in the early 20th century.\nLittle is known of Maurice Enright's background before his gang's violent and brutal methods managed to dominate Chicago's labor unions by the end of the 19th century. A veteran of the \"Circulation Wars,\" he became a major figure in the city's steamfitters' union during the early 1910s and was instrumental in the rise of Johnny Torrio, who provided Enright with invaluable political protection from Chicago's First Ward vice district Aldermen \"Bathhouse\" John Couglin and Michael \"Hinky Dink\" Kenna.\n"
    },
    {
        "link": "/wiki/Joe_Esposito_(politician)",
        "title": "Joe Esposito (politician)",
        "date": "",
        "location": "",
        "paragraph": "\nJoseph Esposito (born Giuseppe Esposito, Italian pronunciation: [dʒuˈzɛppe eˈspɔːzito], October 6, 1871[1] - March 21, 1928) was an American politician best known for his involvement in bootlegging, extortion, prostitution and labor racketeering in Chicago, Illinois during the Prohibition era.[2][3]\n"
    },
    {
        "link": "/wiki/Riley_Fox",
        "title": "Murder of Riley Fox",
        "date": "",
        "location": "",
        "paragraph": "Riley Fox (March 31, 2001 – June 6, 2004) was a 3-year-old girl from Wilmington, Illinois, who was murdered on June 6, 2004.[1] After Riley's father was initially accused and then cleared by DNA evidence, paroled convict Scott Eby confessed to the crime and was convicted.\nOn June 6, 2004, the night of the disappearance, Riley's father Kevin Fox had picked up his children from their grandmother's house around 1 am. Because the kids' beds didn't have clean sheets and blankets on them, he laid Riley on the couch and Riley's older brother Tyler on the living room chair.  He then went to his room, watched TV and went to sleep around 2:30.[2] The next morning he was awakened by Tyler, who told him that Riley was gone. After searching and checking with neighbors, he called police.[2]\n"
    },
    {
        "link": "/wiki/Tony_Genna",
        "title": "Tony Genna",
        "date": "",
        "location": "",
        "paragraph": "Antonio \"the Gentleman\" Genna (Italian pronunciation: [anˈtɔːnjo ˈdʒɛnna]; July 12, 1890 – July 8, 1925) was an Italian-born mobster in Chicago. He headed the Genna crime family with his brothers. Genna was ambushed by a Genna family turncoat on orders of North Side Gang leaders Vince Drucci and Bugs Moran.\nAntonio Genna was born on July 12, 1890,[1] to Sicilian parents, Antonio Genna Sr. and Maria Concetta Utica in Marsala, Sicily. He had six brothers: Michele \"the Devil\", Vincenzo \"Jim\", Pietro \"Peter\", Salvatore \"Sam\", Angelo \"Bloody Angelo\", and Nicola Genna; and two sisters: Rosa Laudicina and Caterina Mariana.[2] He and his brothers entered the U.S. through New York around 1910.[3][unreliable source?]\n"
    },
    {
        "link": "/wiki/Sam_Giancana",
        "title": "Sam Giancana",
        "date": "",
        "location": "",
        "paragraph": "\nSalvatore Mooney Giancana[1] (/dʒiɑːnˈkɑːnə/; born Gilormo Giangana;[nb 1] Italian: [dʒiˈlɔrmo dʒaŋˈɡaːna ]; May 24, 1908[nb 2] – June 19, 1975) was an American mobster who was boss of the Chicago Outfit from 1957 to 1966.\n"
    },
    {
        "link": "/wiki/Charles_Gioe",
        "title": "Charles Gioe",
        "date": "",
        "location": "",
        "paragraph": "Charles Joye \"Cherry Nose\" Gioe (February 6, 1904 – August 18, 1954) was a lieutenant in the Chicago Outfit criminal organization and a partner in the Hollywood extortion scandals of the 1940s.\nCharles Joey Gioe was born on February 6, 1904. He became a high-ranking lieutenant for the Chicago Outfit, specializing in extortion and blackmail, under Frank Nitti after Al Capone's 1931 tax evasion conviction.  In 1936, Gioe went to Des Moines, Iowa to expand syndicate operations.  He eventually returned to Chicago, leaving underboss Louis \"Cock-Eyed Louie\" Fratto in control of the Des Moines operations. During the mid-1930s, Gioe, Paul \"The Waiter\" Ricca and Louis \"Little New York\" Campagna, began financially supporting extortion operations by Willie Morris Bioff and George Brown against Hollywood movie studios.  In exchange for annual payoffs to the Outfit, the mob-controlled  projectionist unions would refrain from labor strikes and disruptions.\n"
    },
    {
        "link": "/wiki/Fred_Goetz",
        "title": "Fred Goetz",
        "date": "",
        "location": "",
        "paragraph": "\nFred Samuel Goetz (February 14, 1897 – March 21, 1934), also known as \"Shotgun\" George Ziegler, was a Chicago Outfit mobster and a suspected participant in the Saint Valentine's Day Massacre, in 1929.[1]\n"
    },
    {
        "link": "/wiki/Barbara_Grimes",
        "title": "Murder of the Grimes sisters",
        "date": "",
        "location": "",
        "paragraph": "\nThe murder of the Grimes sisters is an unsolved double murder that occurred in Chicago, Illinois, on December 28, 1956, in which two sisters named Barbara and Patricia Grimes—aged 15 and 12[n 2] respectively—disappeared while traveling from a Brighton Park movie theater to their home in McKinley Park. Their disappearance initiated one of the largest missing persons investigations in the history of Chicago.[2] The girls' nude bodies were discovered alongside a deserted road in Willow Springs on January 22, 1957.\n"
    },
    {
        "link": "/wiki/Patricia_Grimes",
        "title": "Murder of the Grimes sisters",
        "date": "",
        "location": "",
        "paragraph": "\nThe murder of the Grimes sisters is an unsolved double murder that occurred in Chicago, Illinois, on December 28, 1956, in which two sisters named Barbara and Patricia Grimes—aged 15 and 12[n 2] respectively—disappeared while traveling from a Brighton Park movie theater to their home in McKinley Park. Their disappearance initiated one of the largest missing persons investigations in the history of Chicago.[2] The girls' nude bodies were discovered alongside a deserted road in Willow Springs on January 22, 1957.\n"
    },
    {
        "link": "/wiki/Frank_Gusenberg",
        "title": "Frank Gusenberg",
        "date": "",
        "location": "",
        "paragraph": "\nFrank Gusenberg (October 11, 1893 – February 14, 1929) was an American contract killer and a victim of the Saint Valentine's Day massacre in Chicago, Illinois.\n"
    },
    {
        "link": "/wiki/Peter_Gusenberg",
        "title": "Peter Gusenberg",
        "date": "",
        "location": "",
        "paragraph": "\nPeter Gusenberg a.k.a. \"Goosey\" (September 22, 1888 – February 14, 1929) and his brother Frank were German-American contract killers and members of Chicago's North Side Gang, the main rival to the Chicago Outfit.  Peter Gusenberg participated in an infamous attack on Al Capone during a vicious gang war.\n"
    },
    {
        "link": "/wiki/Fred_Hampton",
        "title": "Fred Hampton",
        "date": "",
        "location": "",
        "paragraph": "\nFredrick Allen Hampton Sr. (August 30, 1948 – December 4, 1969) was an American activist. He came to prominence in Chicago as deputy chairman of the national Black Panther Party and chair of the Illinois chapter. As a progressive African American, he founded the antiracist, anticlassist Rainbow Coalition,[4] a prominent multicultural political organization that initially included the Black Panthers, Young Patriots (which organized poor whites), and the Young Lords (which organized Hispanics), and an alliance among major Chicago street gangs to help them end infighting and work for social change. A Marxist–Leninist,[5][6] Hampton considered fascism the greatest threat, saying, \"nothing is more important than stopping fascism, because fascism will stop us all.”[7]\n"
    },
    {
        "link": "/wiki/Carter_Harrison_Sr.",
        "title": "Carter Harrison Sr.",
        "date": "",
        "location": "",
        "paragraph": "\nCarter Henry Harrison Sr. (February 15, 1825 – October 28, 1893) was an American politician who served as mayor of Chicago, Illinois, from 1879 until 1887; he was subsequently elected to a fifth term in 1893 but was assassinated before completing the term. He previously served two terms in the United States House of Representatives. Harrison was the first cousin twice removed of President William Henry Harrison, whose grandson, Benjamin Harrison, had also been president until just months prior to the assassination. He was also the father of Carter Harrison Jr., who would follow in his father's footsteps, and would serve five terms as the mayor of Chicago himself.\n"
    },
    {
        "link": "/wiki/Stuart_Heaton_case",
        "title": "Stuart Heaton case",
        "date": "",
        "location": "",
        "paragraph": "\nThe Stuart Heaton case was a controversial murder investigation that resulted in the conviction of a man named Stuart Heaton for the 1991 murder of a sixteen-year-old, Krystal Naab, in Ramsey, Illinois. Heaton was sentenced to life imprisonment without the possibility of parole. The case against him was largely circumstantial, except for a semen sample found on the victim. DNA profiling that was conducted and presented at the trial as evidence against Heaton was disputed by some scientists.[1]\nIn 2001 another DNA test was performed which proved 31 billion to 1 accuracy that Heaton was the killer.\n"
    },
    {
        "link": "/wiki/Henry_Manning_(murder_victim)",
        "title": "Wanda Stopa",
        "date": "",
        "location": "",
        "paragraph": "\nWanda Elaine Stopa (May 5, 1900 – April 25, 1924) was a Polish-American lawyer and murderer who committed suicide the day after committing her crime.\n"
    },
    {
        "link": "/wiki/Murder_of_Jason_Hudson",
        "title": "Murder of Jason Hudson",
        "date": "October 24, 2008; 14 years ago (2008-10-24) 8:00–9:00 (US Central time (UTC−06:00))",
        "location": "Chicago, Illinois",
        "paragraph": "The murder of 29-year-old Jason Hudson and his mother Darnell Donerson, occurred on October 24, 2008. They were discovered shot to death inside Donerson's home in Chicago, Illinois.[1] The victims were the brother and mother of singer Jennifer Hudson. Jennifer's seven-year-old nephew Julian King, the son of her elder sister Julia Hudson, was initially reported missing and an AMBER Alert was issued; Julian King's body was found on October 27 in Chicago's West Side area, in a parked car matching the AMBER Alert description.[2] Autopsy results indicated that Julian King's death was due to \"multiple gunshot wounds.\"[3] A pistol found in a West Side vacant lot was confirmed as the murder weapon by Chicago police.[4]\nOn the day that the bodies of Hudson's mother and brother were discovered, Chicago police took Julia Hudson's estranged husband William Balfour, 27, into custody but did not file charges against him.[5] Balfour was on parole and spent nearly seven years in prison for attempted murder, vehicular hijacking and possession of a stolen vehicle. The Illinois Department of Corrections' records reveal one of Balfour's addresses to be the home where Donerson and Jason Hudson were murdered.[1]\n"
    },
    {
        "link": "/wiki/Brice_Hunter",
        "title": "Brice Hunter",
        "date": "",
        "location": "",
        "paragraph": "Brice H. Hunter (April 21, 1974 – April 19, 2004) was an American football wide receiver in the National Football League. He was drafted by the Miami Dolphins in the seventh round of the 1996 NFL Draft with the 251st overall pick. He played college football at Georgia.\nHunter was shot and killed outside of his Chicago apartment in 2004.[1]\n"
    },
    {
        "link": "/wiki/William_Jackson_(gangster)",
        "title": "William Jackson (gangster)",
        "date": "",
        "location": "",
        "paragraph": "William Jackson, also known as Action Jackson (December 13, 1920 – August 11, 1961) was an enforcer and loan collector for the Chicago Outfit. He earned his nickname of \"Action\" because it was slang for \"Juice Man\", which meant debt-collector. He was tortured to death by his fellow gangsters, allegedly on suspicion that he had become an informant for the FBI.\nChicago police described Jackson as \"a man with the body of a giant and the brain of a child\", who was known in syndicate circles as a mob \"juice\" collector who specialized in pain for delinquent customers. In 1941 he was arrested in Green Bay, Wisconsin, for assault and robbery. In 1947, he was arrested and charged with rape, but was not convicted. In 1949, he was arrested and sentenced to four to eight years in prison for robbery. In 1953, he was paroled and became a muscle man for gangsters in Chicago.\n"
    },
    {
        "link": "/wiki/Hale_Johnson",
        "title": "Hale Johnson",
        "date": "",
        "location": "",
        "paragraph": "Hale Johnson (August 21, 1847 – November 4, 1902) was an American attorney and politician who served as the Prohibition Party's vice presidential nominee in 1896 and ran for its presidential nomination in 1900.\nHale Johnson was born on August 21, 1847, in Montgomery County, Indiana to John B. Johnson and Sarah Ann Davisson and named after the abolitionist Senator John P. Hale.[1] During the Civil War his father served as assistant surgeon while he enlisted into Company D, 135th Indiana Infantry at the age of 17. At the end of the Civil War his family moved to Illinois.\n"
    },
    {
        "link": "/wiki/Murder_of_Peggy_Johnson",
        "title": "Murder of Peggy Johnson",
        "date": "",
        "location": "",
        "paragraph": "\nPeggy Lynn Johnson (formerly known as Racine County Jane Doe), also known by the last name Schroeder, was an American woman whose body was discovered in 1999 in the town of Raymond, Racine County, Wisconsin.[1] She was 23 years old at the time of her death, which had occurred after enduring several weeks of  extreme neglect and both physical and sexual abuse.[2] New developments in the case emerged after her body was exhumed on October 16, 2013, including isotope analysis.[3] In November 2019, authorities announced that after two decades she was finally identified. Both the victim's and the murderer's name were released on November 8, 2019.[4] In March 2022, Linda La Roche was convicted of her murder.[5] In May 2022, she was sentenced to life in prison without the possibility of parole.[6] Johnson's murder received national attention both preceding and following her identification.[7]\n"
    },
    {
        "link": "/wiki/Peggy_Lynn_Johnson",
        "title": "Murder of Peggy Johnson",
        "date": "",
        "location": "",
        "paragraph": "\nPeggy Lynn Johnson (formerly known as Racine County Jane Doe), also known by the last name Schroeder, was an American woman whose body was discovered in 1999 in the town of Raymond, Racine County, Wisconsin.[1] She was 23 years old at the time of her death, which had occurred after enduring several weeks of  extreme neglect and both physical and sexual abuse.[2] New developments in the case emerged after her body was exhumed on October 16, 2013, including isotope analysis.[3] In November 2019, authorities announced that after two decades she was finally identified. Both the victim's and the murderer's name were released on November 8, 2019.[4] In March 2022, Linda La Roche was convicted of her murder.[5] In May 2022, she was sentenced to life in prison without the possibility of parole.[6] Johnson's murder received national attention both preceding and following her identification.[7]\n"
    },
    {
        "link": "/wiki/Dragi%C5%A1a_Ka%C5%A1ikovi%C4%87",
        "title": "Dragiša Kašiković",
        "date": "",
        "location": "",
        "paragraph": "Dragiša Kašiković (Serbian Cyrillic: Драгиша Кашиковић; 9 August 1932 – 19 June 1977)[1] was a Bosnian writer who came to international renown after he and his nine-year-old stepdaughter were murdered by the State Security Administration (UDBA) of the Socialist Federal Republic of Yugoslavia.[2]\nKašiković was born on 9 August 1932, in Hadžići near Sarajevo in an upper-middle class Bosnian Serb family originally from Trebinje, East Herzegovina. His father's name was Branko and his mother's Nevenka (née Rakić). Dragiša's grandfather was Nikola Kašiković, the editor of Bosanska vila which was one of the most well-known Serbian newspapers of that time.\n"
    },
    {
        "link": "/wiki/Rebecca_Klein",
        "title": "Nicole Abusharif",
        "date": "",
        "location": "",
        "paragraph": "Nicole M. Abusharif[1] (born September 14, 1980)[2] is an American woman, convicted of the 2007 Villa Park, Illinois murder of her domestic partner, Rebecca \"Becky\" Klein. After being found guilty of first-degree murder in May 2009, Abusharif was sentenced to 50 years in prison at the Dwight Correctional Center in Nevada Township, Illinois. The case made national news because of the intrigue of a \"lesbian love triangle\" murder.\nRebecca Lyn Klein (born April 4, 1974) was born in Chicago. She attended Streamwood High School, and graduated from Illinois State University.[3]\n"
    },
    {
        "link": "/wiki/Jean_La_Lime",
        "title": "Jean La Lime",
        "date": "",
        "location": "",
        "paragraph": "\nJean La Lime or Lalime (died June 17, 1812) was a trader from Quebec, Canada who worked in what became the Northwest Territory of the United States. He worked as an agent for William Burnett, also of Canada, to sell to the Native Americans and take furs in exchange. He was among the first European permanent settlers in Chicago. He was killed there in 1812, in what was called the \"first murder in Chicago\", by John Kinzie, a trading partner of Burnett who was another early settler from Canada.\nDuring the time of the American Revolutionary War, France joined the cause of the Americans against the British. Because of this, in their Canadian territories, the British treated those of French heritage more harshly. Several families, the first two being the families of Jean La Lime and Antoinne Ouillemette, fled to the Eschikagou (Chicago) area to escape the harsh treatment.[1] After trading along the frontier and likely in Detroit, La Lime arrived in the Chicago area on August 17, 1792 as an agent for William Burnett of Canada. In 1800, he purchased the homestead of Jean Baptiste Point du Sable for Burnett for 6,000 livres.[2] The bill of sale was filed in Detroit, Michigan on September 18, 1800, although dated in Chicago on May 7 of that year.[3]\n"
    },
    {
        "link": "/wiki/Jake_Lingle",
        "title": "Jake Lingle",
        "date": "",
        "location": "",
        "paragraph": "\nAlfred \"Jake\" Lingle (July 2, 1891 – June 9, 1930) was an American reporter for the Chicago Tribune. He was shot dead gangland-style in the underpass leading to the Illinois Central Randolph Street station on the afternoon on June 9, 1930, as dozens of people watched.[1][2] The man convicted of the murder was mob associate Leo Vincent Brothers.\n"
    },
    {
        "link": "/wiki/Pasqualino_Lolordo",
        "title": "Pasqualino Lolordo",
        "date": "",
        "location": "",
        "paragraph": "Pasquale Lolordo (1887 – January 8, 1929), also known as Pasqualino or \"Patsy\", was an Italian-born American Mafia boss from Ribera, Sicily, and head of the Chicago chapter of the Unione Siciliana, a \"front\" organization for the Mafia. Lolordo was considered one of the most powerful mafia bosses during the late 1920s.\nLolordo succeeded Antonio \"The Scourge\" Lombardo, an associate of Al Capone, as chapter president. Lombardo had been killed only months before after he refused to turn the presidency over to Mafia mobster Joe Aiello. Lolordo was supported by the national Unione Siciliana president, Frankie Yale, in New York. Some speculate that Lolordo wanted to reform the organization like another former chapter leader, Mike Merlo.\n"
    },
    {
        "link": "/wiki/Antonio_Lombardo",
        "title": "Antonio Lombardo",
        "date": "",
        "location": "",
        "paragraph": "\nAntonio \"Tony the Scourge\" Lombardo (Italian pronunciation: [anˈtɔːnjo lomˈbardo]; November 23, 1891 – September 7, 1928) was an Italian-born American mobster. He was consigliere to Al Capone, and later the President of the Unione Siciliana.\nBorn in the town of Galati Mamertino in Sicily on November 23, 1891, Antonio Lombardo immigrated to the United States in the early 20th century where he became a successful wholesale grocery business owner in Chicago, Illinois. In September 1917 he was involved in the killing of Cleveland Police Officer Elmer Glaefke[1] A long time Mafia associate, Lombardo became Al Capone's advisor after John Torrio retired in 1925.\n"
    },
    {
        "link": "/wiki/Elijah_Parish_Lovejoy",
        "title": "Elijah Parish Lovejoy",
        "date": "",
        "location": "",
        "paragraph": "\nElijah Parish Lovejoy (November 9, 1802 – November 7, 1837) was an American Presbyterian minister, journalist, newspaper editor, and abolitionist. Following his murder by a mob, he became a martyr to the abolitionist cause opposing slavery in the United States.[1] He was also hailed as a defender of free speech and freedom of the press.[1][2][3]\n"
    },
    {
        "link": "/wiki/Rudy_Lozano",
        "title": "Rudy Lozano",
        "date": "",
        "location": "",
        "paragraph": "Rudy Lozano (July 17, 1951 – June 8, 1983) was a labor activist and community organizer from Little Village, Chicago, Illinois.[1] Lozano was important in organizing \"Black-Brown unity\" in the election of Harold Washington, the first African American mayor of Chicago. Lozano was murdered shortly after Washington's election, which was \"a severe setback for the Chicago Mexican community, [who] lost a dynamic, rising political star and their major liaison in the Washington camp.\"[2]\nBorn in Harlingen, Texas, his parents moved the family early on to Chicago's predominantly Mexican-American southwest side Pilsen neighborhood. As a student at Harrison High School and later the University of Illinois at Chicago, he organized students to demand courses on Mexican history, and for more Latin faculty. In his 20s, Lozano became an organizer for the International Ladies Garment Workers Union.[citation needed]\n"
    },
    {
        "link": "/wiki/Lawrence_Mangano",
        "title": "Lawrence Mangano",
        "date": "",
        "location": "",
        "paragraph": "Lawrence \"Dago Lawrence\" Mangano (February 27, 1892 – August 3, 1944) was a Chicago organized crime figure and member of the Chicago Outfit during the 1920s to the 1940s. He was a relative of Joseph Mangano and Philip Mangano, of Chicago, and a suspected relative of New York City Mafia Boss Vincent Mangano.\nA made man and a caporegime in Al Capone's Chicago Outfit during Prohibition, Mangano oversaw the extortion of protection money from all criminals in the Near West Side of Chicago, including everyone involved in illegal gambling, fencing, extortion and prostitution. Although Mangano received police protection through bribery, in 1928, a number of Mangano's establishments were raided by police Captain Luke Garrick. Garrick's house was then bombed in retaliation. Although Garrick survived the bombing, no further interference was taken by local law enforcement in the district. Over the course of his life, Mangano claimed he had been arrested over 200 times without ever spending a night in jail, explaining, \"They were all bum raps...and besides I had good lawyers.\"\n"
    },
    {
        "link": "/wiki/Katherine_McCarron",
        "title": "Karen McCarron",
        "date": "",
        "location": "",
        "paragraph": "Karen Frank-McCarron (born December 20, 1968) is a German-born American pathologist convicted in Illinois of first degree murder of her autistic daughter Katherine “Katie” McCarron.\nKaren Frank-McCarron was born Karen Frank to Erna and Walter \"Robert\" Frank on December 20, 1968, in Germany.[1][2] She graduated from Maine South High School in Park Ridge, Illinois and from Southern Illinois University School of Medicine in Springfield, Illinois in 1995 with a Doctor of Medicine degree.[3] Frank-McCarron, a pathologist, worked at Methodist Medical Center and Proctor Hospital, both in Peoria, Illinois. She volunteered as a clinical assistant professor at the University of Illinois College of Medicine at Peoria.[4]\n"
    },
    {
        "link": "/wiki/Jack_McGurn",
        "title": "Jack McGurn",
        "date": "",
        "location": "",
        "paragraph": "\nJack \"Machine Gun Jack\" McGurn (born Vincenzo Antonio Gibaldi; Italian: [vinˈtʃɛntso anˈtɔːnjo dʒiˈbaldi]; July 2, 1902 – February 15, 1936) was a Sicilian-American boxer, mobster, and eventually a made man and caporegime in Al Capone's Chicago Outfit.\n"
    },
    {
        "link": "/wiki/James_McLain",
        "title": "James McLain",
        "date": "",
        "location": "",
        "paragraph": "James \"Revolvers\" McLain (1903 – September 23, 1934) was a member of Jack McGurn's crew, in the Chicago Outfit, and believed to be  involved in the 1929 St. Valentine's Day Massacre.[citation needed]\nHe was born Antonio Trangorello in Trapani, Sicily. His family emigrated to New York City three years later, arriving at Ellis Island on July 18, 1906. He later moved to Chicago with his family and girlfriend. One time he and a few of his friends were in a movie theater, when local Irish police raided it. He changed his name to James McLain to avoid being beaten up.\n"
    },
    {
        "link": "/wiki/Gordon_McNaughton",
        "title": "Gordon McNaughton",
        "date": "",
        "location": "",
        "paragraph": "Gordon Joseph McNaughton (July 31, 1910 – August 6, 1942) was a pitcher in Major League Baseball who played briefly for the Boston Red Sox during the 1932 season. Listed at 6' 1\", 190 lb., Leheny batted and threw right-handed. A native of Chicago, Illinois, he attended Loyola University Chicago and Xavier University.\nIn a six-game career, McNaughton posted a 0–1 record with a 6.43 ERA, including two starts, two games finished, 21 hits allowed,  six strikeouts, 22 walks, and 21.0 innings of work.\n"
    },
    {
        "link": "/wiki/Lee_Miglin",
        "title": "Lee Miglin",
        "date": "",
        "location": "",
        "paragraph": "\nLee Albert Miglin (July 12, 1924 – May 4, 1997) was an American business tycoon and philanthropist. After starting his career as a door-to-door salesman and then broker, Miglin became a successful real estate developer. He was an early developer of business parks. His firm, at one point, proposed the construction of the Miglin-Beitler Skyneedle, which was planned to be the tallest building in the world. Miglin was murdered in his home in May 1997 by Andrew Cunanan, a spree\nkiller.\n"
    },
    {
        "link": "/wiki/Murder_of_Michele_LeAnn_Morgan",
        "title": "Murder of Michele LeAnn Morgan",
        "date": "",
        "location": "",
        "paragraph": "Michele LeAnn Morgan[1][2][3][4][5] (July 20, 1957 – August 11, 1961) was an American child abuse victim who was murdered by her stepmother at the age of four. Her story was documented on an episode of Cold Case Files.[6][7]\nMichele suffered multiple injuries to the chest and back, a broken nose, burns on her skin, and a broken arm before the age of four at the hands of her stepmother, Mary Rae. These led to over 20 visits to a hospital, including one in which she was hospitalized for a month.[8]\n"
    },
    {
        "link": "/wiki/Murders_of_Lee_Rotatori_and_Thomas_Freeman",
        "title": "Murders of Lee Rotatori and Thomas Freeman",
        "date": "c. July 1982 (murder)October 30, 1982 (discovery of body)",
        "location": "Cobden, Illinois, U.S.",
        "paragraph": "On June 25, 1982, Lee Gunsalus Rotatori, a 32-year old American woman, was sexually assaulted and murdered in her hotel room by Thomas Oscar Freeman in Council Bluffs, Iowa. The murder went unsolved for nearly 40 years, until it was announced by authorities in 2022 that the perpetrator had been identified as Freeman using investigative genetic genealogy.\nAround July 1982, Freeman himself was murdered by an unidentified perpetrator in Cobden, Illinois. His decomposing body was found in a shallow grave around three months after his murder. As of 2022, the murder remains unsolved and the case remains open, and investigators believe the two murders were connected.\n"
    },
    {
        "link": "/wiki/Timothy_D._Murphy",
        "title": "Timothy D. Murphy",
        "date": "",
        "location": "",
        "paragraph": "\nTimothy D. \"Big Tim\" Murphy (1885 – June 26, 1928)[1] was a Chicago mobster and labor racketeer who controlled several major railroad, laundry and dye workers' unions during the 1910s and early 1920s.[2]\n"
    },
    {
        "link": "/wiki/Jeanine_Nicarico_murder_case",
        "title": "Jeanine Nicarico murder case",
        "date": "",
        "location": "",
        "paragraph": "The Jeanine Nicarico murder case was a complex and influential homicide investigation and prosecution in which two men, Rolando Cruz and Alejandro Hernandez, both Latinos, were wrongfully convicted of abduction, rape and murder in 1985 in DuPage County, Illinois. They were both sentenced to death. The case was scrutinized during appeals for being weak in evidence.\nAfter appeals, one man was acquitted in 1995 at his third trial at which a witness recanted previous testimony and new DNA evidence was introduced; the second man, already serving time after being twice convicted, had his charges dismissed by the Illinois State's Attorney. Because of the notoriety of the case and the possibility at one point that two innocent men would have been executed, it was an influence on Governor George H. Ryan's decision in 2000 to impose a death penalty moratorium in the state. \n"
    },
    {
        "link": "/wiki/Charles_Nicoletti",
        "title": "Charles Nicoletti",
        "date": "",
        "location": "",
        "paragraph": "\nCharles Nicoletti (/ˌnɪkəˈlɛti/; December 3, 1916 – March 29, 1977), also known as \"Chuckie the Typewriter\", was an American mobster of the Chicago Outfit, who served as hitman under boss Sam Giancana before and after Giancana's rise and fall. Nicoletti was murdered on March 29, 1977.\n"
    },
    {
        "link": "/wiki/Dean_O%27Banion",
        "title": "Dean O'Banion",
        "date": "",
        "location": "",
        "paragraph": "\nCharles Dean O'Banion (July 8, 1892 – November 10, 1924) was an American mobster who was the main rival of Johnny Torrio and Al Capone during the brutal Chicago bootlegging wars of the 1920s. The newspapers of his day made him better known as Dion O'Banion, although he never went by that first name. He led the North Side Gang until 1924, when he was shot and killed, reportedly by Frankie Yale, John Scalise and Albert Anselmi.\n"
    },
    {
        "link": "/wiki/Edward_J._O%27Hare",
        "title": "Edward J. O'Hare",
        "date": "",
        "location": "",
        "paragraph": "\nEdward Joseph O'Hare, aka \"Easy Eddie\" (September 5, 1893 – November 8, 1939), was a lawyer in St. Louis and later in Chicago, where he began working with Al Capone, and later helped federal prosecutors convict Capone of tax evasion.  In 1939, a week before Capone was released from Alcatraz, O'Hare was shot to death while driving. He was the father of Medal of Honor recipient Butch O'Hare, for whom O'Hare International Airport is named.\n"
    },
    {
        "link": "/wiki/Murder_of_Evelyn_Okubo",
        "title": "Murder of Evelyn Okubo",
        "date": "July 18, 1970",
        "location": "Chicago, Illinois, U.S.",
        "paragraph": "Evelyn Okubo was a Japanese-American sansei teenager killed during the 1970 convention of the Japanese American Citizens League (JACL) at the Palmer House hotel in Chicago, Illinois. Her 17-year-old roommate, Ranko Carol Yamada, was also severely wounded, yet survived. The murder caused a significant stir within the Japanese-American community, in part because Yamada alleged that the killer was African-American, just at the height of violence associated with the Black Panther Party.[1] The killer was never found.[2]\nEvelyn Okubo was 18 years old and hailed from the Japanese community of Stockton, California.[3] She and Ranko Carol Yamada had traveled to Chicago as representatives of the Japanese-American youth organization Yellow Seed to the national convention of the JACL, which was then focused on fighting for racial justice and against the Vietnam War.[3] Prior to the murder, Okubo was believed to have attended racial issue discussion meetings with groups like the Black Panthers and the Young Lords, a Latino community organization with roots as a Chicago street gang.[4]\n"
    },
    {
        "link": "/wiki/Atcel_Olmedo",
        "title": "Murder of Atcel Olmedo",
        "date": "",
        "location": "",
        "paragraph": "Atcel Olmedo (previously known as the DuPage Johnny Doe) was an American toddler who was allegedly murdered by his abusive stepfather and his mother in 2005 and disposed of in Naperville, Illinois. His body was not positively identified until 2011.[2] The case received national attention and was broadcast on several different television shows. Forensic evidence obtained from the body during the investigation was analyzed to assist in his future identification.[3] His case remains unprosecuted; the two main suspects were released on a bond, and promptly disappeared. Authorities believe the suspects fled to the Mexico City area.[4][5]\nIn October 2005, a small body was found in an unincorporated area alongside the Ronald Reagan Memorial Tollway (Interstate 88).[2][3][6][7] between Naperville and Warrenville, Illinois. The corpse was wrapped in a blue laundry bag and clothed in a blue button-down collared shirt with matching pants. The remains were decomposed beyond recognition, having been exposed to the elements for at least several weeks and possibly as long as one year.[4][8]\n"
    },
    {
        "link": "/wiki/Elsie_Paroubek",
        "title": "Elsie Paroubek",
        "date": "",
        "location": "",
        "paragraph": "\nEliška \"Elsie\" Paroubek (1906–1911) was a Czech American girl who was a victim of kidnapping and murder in the spring of 1911. Her disappearance and the subsequent search for her preoccupied Illinois, Wisconsin and Minnesota law enforcement for six weeks. Her funeral was attended by between 2,000 and 3,000 people.[1]\n"
    },
    {
        "link": "/wiki/Robert_Prager",
        "title": "Robert Prager",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Paul Prager (February 28, 1888 – April 5, 1918) was a German immigrant who was lynched in the United States during World War I as a result of anti-German sentiment. He had worked as a baker in southern Illinois and then as a laborer in a coal mine, settling in Collinsville, a center of mining. At a time of rising anti-German sentiment, he was rejected for membership in the Maryville, Illinois local of the United Mine Workers of America. Afterward he angered area mine workers by posting copies of his letter around town that complained of his rejection and criticized the local president.\n"
    },
    {
        "link": "/wiki/James_Ragen",
        "title": "James Ragen",
        "date": "",
        "location": "",
        "paragraph": "\nJames Matthew Ragen, Sr. (August 9, 1880 – August 15, 1946) was an Irish businessman and co-founder of the Chicago-based street gang and political club Ragen's Colts.\nAfter taking control of the social organization Ragen's Athletic and Benevolent Association with his brother Frank Ragen in the late 1890s, later known as Ragen's Colts, Ragen would soon become involved in the gang's usual activities including political intimidation, labor slugging and particularly bootlegging during Prohibition. A veteran of Chicago's \"circulation wars\" during the 1910s, Ragen would work under Moses Annenberg with other future Chicago mobsters such as Maurice Enright, Walter Stevens and Peter Gentleman in \"bootjacking\" or forcing downtown newspaper stands to sell Chicago American.\n"
    },
    {
        "link": "/wiki/Bugs_Raymond",
        "title": "Bugs Raymond",
        "date": "",
        "location": "",
        "paragraph": "Arthur Lawrence \"Bugs\" Raymond (February 24, 1882 – September 7, 1912) was a Major League Baseball pitcher from 1904 to 1911. He played for the Detroit Tigers, St. Louis Cardinals, and New York Giants.\nRaymond was born in Chicago. He started his professional baseball career with the Waterloo Microbes in 1904.[1] After a short stint with the Tigers, Raymond returned to the minors. He developed his spitball sometime in 1906. With the new pitch, he had a big season in 1907, going 35-11 for the South Atlantic League's Charleston Sea Gulls. Raymond pitched a no-hitter that year, as well, and led Charleston to the pennant.[2] The Cardinals purchased him in September, and in 1908, he was the best pitcher on the team. His 2.03 earned run average ranked tenth in the National League, and his 145 strikeouts were fourth-best. During the 1908 season, he gave up fewer hits per game than Christy Mathewson and threw five shutouts, but he was also on the mound eleven times when the Cardinals failed to score.[3]\n"
    },
    {
        "link": "/wiki/Charles_Reiser",
        "title": "Charles Reiser",
        "date": "",
        "location": "",
        "paragraph": "Charles \"The Ox\" Reiser (1878 – October 10, 1921) was a safecracker and mentor to many of the organized crime leaders of the early 20th century including Dean O'Banion, George \"Bugs\" Moran, Earl \"Hymie\" Weiss,[1] and John Mahoney. \nHe was born in 1878; very little is known of Reiser's early life. Reiser quickly started a rap sheet. In 1902, Reiser was arrested for safecracking. Released on bail, he reportedly killed the witness to this crime and the case was later dropped. In 1905, Reiser was again arrested and released, the witness disappeared, and the case was dropped. \n"
    },
    {
        "link": "/wiki/Maria_Ridulph",
        "title": "Murder of Maria Ridulph",
        "date": "",
        "location": "",
        "paragraph": "\nMaria Elizabeth Ridulph (March 12, 1950 – c. December 1957) was a seven-year-old girl who disappeared from Sycamore, Illinois on December 3, 1957. Her remains were found almost five months later in a wooded area near Woodbine, Illinois, approximately 90 miles from her home.[1][2] Maria was last seen by her friend on her neighborhood corner of Center Cross Street and Archie Place with an unknown man in his early twenties who called himself \"Johnny\".[1]\n"
    },
    {
        "link": "/wiki/Theodore_Roe",
        "title": "Theodore Roe",
        "date": "",
        "location": "",
        "paragraph": "Theodore L. \"Teddy\" Roe (August 26, 1898 – August 4, 1952) was an African-American organized crime figure who led an illegal gambling empire in South Side, Chicago during the 1940s and early 1950s. Roe earned the nickname \"Robin Hood\" because of his philanthropy among the neighborhood poor.[1][2] After refusing to pay \"street tax\" or hand over his illegal gambling empire to the Chicago Outfit, Roe fatally shot a made man who had been ordered to assassinate him.\nRoe was born in Galliano, Louisiana to an African American sharecropper, and raised in Little Rock, Arkansas.[3]  As a child, he received no formal education, and when he was of age, he did odd jobs for a tailor and learned how to sew. Some time after that, he got involved in bootlegging and gained a notorious reputation as a colorful racketeer who could pass for white. His career as a bootlegger ended after a few years and he moved to Detroit, where he worked in an automobile plant. When he was 31 years old, he took what he learned working for the tailor in Arkansas, and moved from Detroit to Chicago and began working for an African American tailor named Edward P. Jones. Shortly after Roe began working for Jones, Jones decided to get involved in policy and he made Roe his first \"runner\", or salesman of lottery chances. Under the protection of politicians Edward Joseph Kelly and Patrick Nash, the Kelly-Nash Machine, Jones was making $2000 a day by 1930. By 1938 he had increased his earnings to $10,000 per day and Roe was pulling down nice cuts from the profits. They soon caught the attention of The Chicago Outfit after Jones met Sam Giancana in prison, and they set out to take over the numbers racket in Chicago. The Jones-Roe wheels were netting over $25 million annually, by 1946 and the mob, seeking to move in on the Jones brothers and Roe, kidnapped Ed Jones and held him for a ransom that included $100,000 and a promise to relinquish his policy business. Roe paid the $100,000 ransom but after Jones was released, he decided not to give up his share of the business. However, the Jones brothers fled to Mexico, leaving the entire business to Roe.\n"
    },
    {
        "link": "/wiki/Robert_Sandifer",
        "title": "Robert Sandifer",
        "date": "",
        "location": "",
        "paragraph": "\nRobert Sandifer (March 12, 1983 – September 1, 1994) (also known as Yummy) was an 11-year-old boy from Chicago, Illinois. His murder by fellow gang members in Chicago garnered national attention because of his age,[1][2][3][4] resulting in his appearance on the cover of Time magazine in September 1994.[5] His nickname originates from his love for cookies.[6] Standing 137 cm (4 ft 6 in), Sandifer was a young member of the Chicago street gang the Black Disciples (BD).\n"
    },
    {
        "link": "/wiki/Murder_of_Laree_Slack",
        "title": "Murder of Laree Slack",
        "date": "",
        "location": "",
        "paragraph": "Laree A. Slack (July 4, 1989 – November 11, 2001) was the victim of child abuse that led to her death[where?]. She was whipped with \"an inch-thick section of rubberized electrical cable filled with strands of wire\"[1] repeatedly [2] and died from internal bleeding several hours later.\nHer father, Larry Slack Sr., was convicted of first-degree murder in 2006 as a result of the beating.[3] He received a life sentence for the murder and a 30-year sentence for aggravated battery of a child.[4] The mother, Constance Slack, received a 25-year sentence after pleading guilty to murder.[5] The beatings of Laree and her eight-year-old brother started because of a claimed failure to properly clear away laundry, leading to difficulty finding a credit card. The father's interpretation of Biblical injunctions regarding the punishment of children were a factor in the severity of the beating. The parents were devout Jehovah's Witnesses who home-schooled their six children. Investigators said the parents decided to administer Biblical discipline in the form of \"40 lashes minus one, three times\".[1]\n"
    },
    {
        "link": "/wiki/Karyn_Hearn_Slover",
        "title": "Murder of Karyn Hearn Slover",
        "date": "September 27, 1996 (1996-09-27)",
        "location": "Decatur, Illinois",
        "paragraph": "The murder of Karyn Hearn Slover occurred on September 27, 1996 in Decatur, Illinois, when Karyn Slover, a 23-year-old mother of one, disappeared shortly after leaving her job as an advertising sales representative. Two days later, authorities discovered Slover's dismembered remains, wrapped in plastic bags, in and near Lake Shelbyville.\nIn 2002, Slover's ex-husband, Michael Slover Jr., his mother Jeannette Slover, and his father Michael Slover Sr. were convicted of Karyn Slover's murder and all three were sentenced to 60 years in prison.[1] The case is notable for being one of the first instances of dog DNA used as evidence in a murder trial.[2]\n"
    },
    {
        "link": "/wiki/Stephen_B._Small",
        "title": "Stephen B. Small",
        "date": "",
        "location": "",
        "paragraph": "Stephen Burrell Small (18 March 1947 – 2 September 1987)[1] was a prominent businessman in Kankakee, Illinois. In 1987, he was kidnapped and held for ransom by Danny Edwards and Nancy Rish. The conditions of his confinement caused him to die of asphyxiation. As a result, Edwards was given the death penalty (later commuted) and Rish was sentenced to life in prison without parole.\nSmall was born in 1947 and raised in Kankakee, Illinois. His parents, Burrell and Reva Small, owned and operated a media conglomerate called Mid America Media; the Small family also owned the controlling interest in United Press International; and this is where Small himself worked. His great grandfather was Illinois governor Len Small. Stephen Small had received his education at Lake Forest Academy, the University of Denver and Mark Hopkins College.[2]  In 1969, he married Nancy Pedersen, with whom he had three sons.\n"
    },
    {
        "link": "/wiki/Donald_R._Smith",
        "title": "Donald R. Smith",
        "date": "",
        "location": "",
        "paragraph": "Donald R. Smith (November 13, 1926 – February 4, 1982)[1] was an American politician.\nSmith graduated from York High School in Elmhurst, Illinois and then joined the United States Navy in 1944 during World War II and served until 1946. He went to Loyola University Chicago and John Marshall Law School In Chicago, Illinois. He served as County Treasurer of DuPage County, Illinois and served on the DuPage County Commission. He was a Republican. From 1965 until 1977, Smith served as chief fiscal officer in the office of the Illinois Treasurer. In 1977, he was appointed Illinois Treasurer when Alan J. Dixon resigned to served as Illinois Secretary of State. Smith served until 1979.[2]\n"
    },
    {
        "link": "/wiki/Hyrum_Smith",
        "title": "Hyrum Smith",
        "date": "",
        "location": "",
        "paragraph": "\nHyrum Smith (February 9, 1800 – June 27, 1844) was an American religious leader in the Church of Jesus Christ of Latter Day Saints, the original church of the Latter Day Saint movement. He was the older brother of the movement's founder, Joseph Smith, and was killed with his brother at Carthage Jail where they were being held awaiting trial.\n"
    },
    {
        "link": "/wiki/Joseph_Smith",
        "title": "Joseph Smith",
        "date": "",
        "location": "",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Anthony_Spilotro",
        "title": "Anthony Spilotro",
        "date": "",
        "location": "",
        "paragraph": "Anthony John Spilotro (May 19, 1938 – June 14, 1986), nicknamed \"Tony the Ant\", was an American mobster and high ranking member for the Chicago Outfit in Las Vegas during the 1970s and '80s.\nSpilotro managed the Outfit's illegal casino profits (the \"skim\") when four of the casinos, The Stardust, The Fremont, The Hacienda, and The Marina, were managed by Frank Rosenthal, replacing Outfit member John Roselli in Las Vegas.[1] He was the leader of the \"Hole in the Wall Gang\", which he formed in Las Vegas when he moved there in 1971.\n"
    },
    {
        "link": "/wiki/Michael_Spilotro",
        "title": "Michael Spilotro",
        "date": "",
        "location": "",
        "paragraph": "Michael Peter \"Micky\" Spilotro (September 12, 1944 – June 14, 1986) was the younger brother of Anthony \"Tony the Ant\" Spilotro and was an associate of the Chicago organized crime organization referred to as \"The Outfit\".\nMichael was born in Chicago, Illinois, on September 12, 1944. He was the son of Pasquale Spilotro, Sr. (1899–1954), a restaurant owner, and his wife, Antoinette. Michael had five brothers, Vincent, Victor, Pasquale \"Pat\" Jr., Tony and John.\n"
    },
    {
        "link": "/wiki/Mary_Stachowicz",
        "title": "Murder of Mary Stachowicz",
        "date": "",
        "location": "",
        "paragraph": "Mary Stachowicz (née Frank; 1951 – November 13, 2002) was a Polish American woman and mother of four, who on November 13, 2002 was murdered by Nicholas Gutierrez in Chicago, Illinois.\nOn November 13, 2002, Stachowicz attended Mass at the Basilica of St. Hyacinth in the Chicago neighborhood of Avondale before beginning a favor as a Polish–English translator at the Sikorski Funeral Home, where Gutierrez worked as a janitor.[1] Nineteen-year-old Gutierrez tipped police off when he speculated he thought someone had killed her and stuffed her body in the building's crawlspace.[2] He was working at the funeral parlor and had recently been laid off and was being evicted.[2] Area 5 Cmdr. Lee Epplen of the Chicago Police stated that Stachowicz and Gutierrez got into an argument after the woman harangued him about his sexuality, calling him and his roommate derogatory names, police and prosecutors said. Gutierrez told police he became enraged after Stachowicz kept questioning him, said Cook County Assistant State's Atty. Nancy Galassini during a bond hearing. Gutierrez claimed that she proceeded to ask him \"Why do you sleep with boys?\", after which he became even more angry and Nancy Galassini said \"The defendant punched and kicked and stabbed the victim until he was tired. He then placed a plastic garbage bag over her head and strangled her.\" He then continued to rape her.\n"
    },
    {
        "link": "/wiki/Danny_Stanton",
        "title": "Danny Stanton",
        "date": "",
        "location": "",
        "paragraph": "\nDanny Stanton (September 24, 1896 – May 5, 1943) was a Chicago mobster and labor union racketeer for the Chicago Outfit during Prohibition. An early leader of the Sheldon Gang, he later headed members of the Ragen's Colts on behalf of Al Capone in support of the Druggan-Lake Gang during the bootleg wars of the mid-1920s.\n"
    },
    {
        "link": "/wiki/A._Andrew_Torrence",
        "title": "A. Andrew Torrence",
        "date": "",
        "location": "",
        "paragraph": "A. Andrew Torrence (June 8, 1902 – April 8, 1940) was an American lawyer and politician.[1]\nBorn in Baltimore, Maryland, Torrence went to University of Detroit, Central YMCA College, Northwestern University School of Law, and University of Chicago Law School. He practiced law in Chicago, Illinois and taught public speaking at the University of Chicago Law School. Torrence was an African-American and a Republican. From 1939 until his death in 1940, Torrence served in the Illinois House of Representatives. Torrence was stabbed and shot by Cecil Woodward, an African-American, in a campaign headquarters the day before the Illinois Primary Election. Woodward was upset about losing a precinct captain position. Woodward later died suddenly while being questioned in the state's attorney's office.[2][3]\n"
    },
    {
        "link": "/wiki/Roger_Touhy",
        "title": "Roger Touhy",
        "date": "",
        "location": "",
        "paragraph": "\nRoger Touhy (September 18, 1898 – December 16, 1959) was an Irish American mob boss and prohibition-era bootlegger from Chicago, Illinois, in the United States. He is best remembered for having been framed for the 1933 faked kidnapping of gangster John \"Jake the Barber\" Factor, a brother of cosmetics manufacturer Max Factor Sr. Despite numerous appeals and at least one court ruling freeing him, Touhy spent 26 years in prison. Touhy was released in November 1959, and murdered by the Chicago Outfit less than a month later.\n"
    },
    {
        "link": "/wiki/Sharon_Tyndale",
        "title": "Sharon Tyndale",
        "date": "",
        "location": "",
        "paragraph": "Sharon Tyndale (January 19, 1816 – April 29, 1871) was the Secretary of State of Illinois, United States, from 1865 to 1869. His tenure is notable for his redesign of the Great Seal of the State of Illinois.\nBorn in Philadelphia, Pennsylvania, Tyndale moved to Belleville, Illinois in 1833 and worked in the mercantile business. He moved back to Philadelphia and worked in the mercantile business with his father. In 1845, he moved to Peoria, Illinois and studied to be a civil engineer. In 1857, Tyndale was elected County Surveyor of St. Clair County, Illinois. President Abraham Lincoln appointed Tyndale postmaster of Belleville, Illinois in 1861. From 1865 to 1869, Tyndale served as Illinois Secretary of State, as a Republican. After Tyndale left office, he stayed in Springfield, Illinois and worked for Gilman, Clinton and Springfield Railroad doing a survey. His brother was Hector Tyndale, a United States Army officer.[1]\n"
    },
    {
        "link": "/wiki/Hampton_W._Wall",
        "title": "Hampton W. Wall",
        "date": "",
        "location": "",
        "paragraph": "Hampton W. Wall (November 10, 1831–April 16, 1898) was an American politician and businessman.\nWall was born on a farm near Staunton, Illinois. He went to the public schools. Wall was a banker and lived in Staunton, Illinois with his wife and family. He served on the Macoupin County Board of Supervisors and as a justice of the peace. Wall served in the Illinois House of Representatives from 1877 to 1881. Wall then served in the Illinois Senate from 1893 to 1897 and was a Democrat. Wall was murdered by a tenant in Staunton, Illinois with a firearm.[1][2][3]\n"
    },
    {
        "link": "/wiki/Murder_of_Joseph_Wallace",
        "title": "Murder of Joseph Wallace",
        "date": "",
        "location": "",
        "paragraph": "Joseph Wayne Wallace (July 29, 1989 – April 19, 1993) was a three-year-old boy who was murdered by his mother in their Chicago, Illinois apartment in 1993. Wallace's mother, Amanda Wallace (July 24, 1965 – August 3, 1997), was known to be mentally ill. Despite this, Joseph and his younger brother Joshua were removed from a foster family and returned to Amanda, who killed Joseph with an electrical cord.[1] The circumstances of Wallace's death and the ensuing public outcry precipitated large changes in the Illinois child welfare system and the Cook County juvenile court.[2]\nIn June 1996, Amanda Wallace was convicted of her son's murder. She avoided the death penalty which had been sought by the state of Illinois and was instead sentenced to life imprisonment.[3] Amanda committed suicide by hanging in her prison cell on August 3, 1997.[4]\n"
    },
    {
        "link": "/wiki/Hymie_Weiss",
        "title": "Hymie Weiss",
        "date": "",
        "location": "",
        "paragraph": "\nEarl J. \"Hymie\" Weiss (born Henryk Wojciechowski;[1] January 25, 1898 – October 11, 1926), was a Polish-American mob boss who became a leader of the Prohibition-era North Side Gang and a bitter rival of Al Capone. He was known as \"the only man Al Capone feared\".[2]\n"
    },
    {
        "link": "/wiki/William_White_(gangster)",
        "title": "William White (gangster)",
        "date": "",
        "location": "",
        "paragraph": "William Jack \"Three Fingers\" White (1900-January 23, 1934) was a Prohibition gangster and member of the Chicago Outfit. His nickname was related to a childhood accident after a falling brick from a construction site had crushed his right hand, resulting in the loss of two fingers. Self-conscious of his deformed hand, White would wear a white glove in public with cotton stuffed in the empty fingers. \nIn 1919, he was convicted of robbery and served a prison sentence in Joliet Correctional Center until winning parole within four years.\n"
    },
    {
        "link": "/wiki/Sonny_Boy_Williamson_I",
        "title": "Sonny Boy Williamson I",
        "date": "",
        "location": "",
        "paragraph": "John Lee Curtis \"Sonny Boy\" Williamson (March 30, 1914 – June 1, 1948) was an American blues harmonica player, singer and songwriter.[1] He is often regarded as the pioneer of the blues harp as a solo instrument. He played on hundreds of recordings by many pre–World War II blues artists. Under his own name, he was one of the most recorded blues musicians of the 1930s and 1940s and is closely associated with Chicago producer Lester Melrose[2] and Bluebird Records. His popular songs, original or adapted, include \"Good Morning, School Girl\", \"Sugar Mama\", \"Early in the Morning\", and \"Stop Breaking Down\".\nWilliamson's harmonica style was a great influence on postwar performers. Later in his career, he was a mentor to many up-and-coming blues musicians who moved to Chicago, including Muddy Waters. In an attempt to capitalize on Williamson's fame, Aleck \"Rice\" Miller began recording and performing as Sonny Boy Williamson in the early 1940s, and later, to distinguish the two, John Lee Williamson came to be known as Sonny Boy Williamson I or \"the original Sonny Boy\".\n"
    },
    {
        "link": "/wiki/Ben_Wilson_(basketball)",
        "title": "Ben Wilson (basketball)",
        "date": "",
        "location": "",
        "paragraph": "\nBenjamin Wilson Jr. (March 18, 1967 – November 21, 1984) was an American high school basketball player from Chicago, Illinois.[1] Wilson, a Neal F. Simeon Vocational High School basketball player, was regarded as the top high school player in the U.S. by scouts and coaches attending the 1984 Athletes For Better Education basketball camp. Wilson is noted as the first Chicago athlete to receive this honor. On November 21, 1984, Wilson died due to injuries he sustained in a shooting the day before.[2][3][4][5][6]\n"
    },
    {
        "link": "/wiki/Gus_Winkler",
        "title": "Gus Winkler",
        "date": "",
        "location": "",
        "paragraph": "Gus Winkler (March 28, 1901 – October 9, 1933) was an American gangster who headed a Prohibition-era criminal gang specializing in armed robbery and murder for hire with Fred \"Killer\" Burke. Winkler was a senior associate of Chicago Outfit boss Al Capone and is considered a suspect in the St. Valentine's Day Massacre. Winkler is believed to be the first member of the National Crime Syndicate to be murdered for talking to the FBI.\nWinkler was born August Henry Winkeler to Bernard J. Winkeler (September 28, 1862- November 23, 1928) and Mary K. (June 1, 1862- March 5, 1923) in Lemay, Missouri of German descent; he was a brother to Clara (April 21, 1895 – June 23, 1987), Jacob C. (1893-1961) and Anna C. (1890-1960).\n"
    },
    {
        "link": "/wiki/Murder_of_Yingying_Zhang",
        "title": "Murder of Yingying Zhang",
        "date": "9 June 2017",
        "location": "Urbana-Champaign, Illinois, U.S.",
        "paragraph": "The kidnapping and murder of Yingying Zhang occurred in Urbana, Illinois on June 9, 2017, when Zhang, a visiting Chinese scholar at the University of Illinois Urbana–Champaign, was abducted by Brendt Allen Christensen, a Champaign resident and former physics graduate student at the university. Christensen lured Zhang into his car at a bus stop on campus posing as a police officer with the promise of a ride after she missed a bus, but then took her to his apartment where he raped and murdered her while his wife was out of town for the weekend.\nOn June 30, 2017, the Federal Bureau of Investigation (FBI) arrested and charged Christensen in federal court. Christensen was tried and convicted of one count of kidnapping resulting in death and two counts of making false statements to agents of the FBI, but the jury deadlocked on whether or not to impose the death penalty. Christensen was thus sentenced on July 18, 2019 to life imprisonment without the possibility of parole plus 10 years.\n"
    },
    {
        "link": "/wiki/Yingying_Zhang_(victim)",
        "title": "Murder of Yingying Zhang",
        "date": "9 June 2017",
        "location": "Urbana-Champaign, Illinois, U.S.",
        "paragraph": "The kidnapping and murder of Yingying Zhang occurred in Urbana, Illinois on June 9, 2017, when Zhang, a visiting Chinese scholar at the University of Illinois Urbana–Champaign, was abducted by Brendt Allen Christensen, a Champaign resident and former physics graduate student at the university. Christensen lured Zhang into his car at a bus stop on campus posing as a police officer with the promise of a ride after she missed a bus, but then took her to his apartment where he raped and murdered her while his wife was out of town for the weekend.\nOn June 30, 2017, the Federal Bureau of Investigation (FBI) arrested and charged Christensen in federal court. Christensen was tried and convicted of one count of kidnapping resulting in death and two counts of making false statements to agents of the FBI, but the jury deadlocked on whether or not to impose the death penalty. Christensen was thus sentenced on July 18, 2019 to life imprisonment without the possibility of parole plus 10 years.\n"
    },
    {
        "link": "/wiki/Killing_of_Zheng_Shaoxiong",
        "title": "Killing of Zheng Shaoxiong",
        "date": "November 9, 2021",
        "location": "Chicago, Illinois, U.S.",
        "paragraph": "The killing of Zheng Shaoxiong occurred in Chicago, United States on November 9, 2021, when Dennis Zheng Shaoxiong, a 24-year-old graduate at the University of Chicago,[1] was fatally shot by Alton Spann, a 19-year-old Chicago resident, on the sidewalk in the 900 block of East 54th Street in Hyde Park.[2] Court documents say that when Spann saw Zheng, who was holding a large laptop, he and two others were driving a stolen car, and Spann used a gun to rob Zheng. The suspect shot the victim one time in the chest when the victim was struggling with the suspect and trying to escape. Zheng was pronounced dead after being taken to the University of Chicago Medical Center.[3] On November 12, Spann was charged with first-degree murder, unlawful use of a weapon and armed robbery.[4]\nZheng was the second international student from Mainland China to be killed in Chicago in 2021.[note 1][6]\n"
    },
    {
        "link": "/wiki/Zheng_Shaoxiong",
        "title": "Killing of Zheng Shaoxiong",
        "date": "November 9, 2021",
        "location": "Chicago, Illinois, U.S.",
        "paragraph": "The killing of Zheng Shaoxiong occurred in Chicago, United States on November 9, 2021, when Dennis Zheng Shaoxiong, a 24-year-old graduate at the University of Chicago,[1] was fatally shot by Alton Spann, a 19-year-old Chicago resident, on the sidewalk in the 900 block of East 54th Street in Hyde Park.[2] Court documents say that when Spann saw Zheng, who was holding a large laptop, he and two others were driving a stolen car, and Spann used a gun to rob Zheng. The suspect shot the victim one time in the chest when the victim was struggling with the suspect and trying to escape. Zheng was pronounced dead after being taken to the University of Chicago Medical Center.[3] On November 12, Spann was charged with first-degree murder, unlawful use of a weapon and armed robbery.[4]\nZheng was the second international student from Mainland China to be killed in Chicago in 2021.[note 1][6]\n"
    },
    {
        "link": "/wiki/List_of_incidents_of_civil_unrest_in_Chicago",
        "title": "List of incidents of civil unrest in Chicago",
        "date": "",
        "location": "",
        "paragraph": "\nThis list is about incidents of civil unrest, rioting, violent labor disputes, or minor insurrections or revolts in Chicago, Illinois.\n"
    },
    {
        "link": "/wiki/1966_Chicago_West_Side_riots",
        "title": "1966 Chicago West Side riots",
        "date": "July 12–15, 1966",
        "location": "West Side, Chicago, Illinois",
        "paragraph": "Black residents of the West Side\nThe 1966 Chicago West Side riots was a public disorder that occurred between July 12 and 15 in Chicago, Illinois. After police arrested a man that was wanted for armed robbery, black residents  took to the streets in anger and looted and burned various stores throughout the West Side until the arrival of 1,200 National Guardsmen on July 15. Violence quickly subsided and most of the troops were sent home on July 20.[1]\n"
    },
    {
        "link": "/wiki/1968_Chicago_riots",
        "title": "1968 Chicago riots",
        "date": "April 5, 1968 (1968-04-05) – April 7, 1968 (1968-04-07)",
        "location": "Chicago, Illinois, United States41°52′N 87°44′W﻿ / ﻿41.867°N 87.733°W﻿ / 41.867; -87.733Coordinates: 41°52′N 87°44′W﻿ / ﻿41.867°N 87.733°W﻿ / 41.867; -87.733",
        "paragraph": " United States government\n Government of Illinois\n"
    },
    {
        "link": "/wiki/Airport_Homes_race_riots",
        "title": "Airport Homes race riots",
        "date": "",
        "location": "",
        "paragraph": "\nThe Airport Homes race riots were a series of riots in 1946 in the West Lawn and West Elsdon neighborhoods of Chicago, Illinois.[1] It was the worst episode of racial inspired violence that the city faced in some thirty years.[2]\n\"Airport Homes\" was the name of the site in nearby West Lawn established by the Chicago Housing Authority to provide temporary housing to returning veterans and their families during the postwar housing shortage. Residents of West Lawn and West Elsdon rioted and succeeded in intimidating a few black war veterans and their families from joining white veterans in the homes.[1]\n"
    },
    {
        "link": "/wiki/Aldermen%27s_wars",
        "title": "Aldermen's wars",
        "date": "1916 – 1921",
        "location": "19th ward, Chicago, Illinois, United States",
        "paragraph": "The Alderman's wars was a series of murders and violent rioting between warring Alderman Johnny \"de Pow\" Powers and Anthony D'Andrea from 1916 until 1921. Over a period of five years, over 30 deaths were reported during the struggle for control over the \"Bloody\" 19th Ward of Chicago's Little Italy.\nJohnny Powers, a local Irish-American saloonkeeper and longtime political boss of the predominantly Irish 19th Ward, had been in power since the 1880s and despite the large influx of Italian immigrants over the decades managed to retain power among the area despite his reputation for corruption and offering political protection to criminal elements in Chicago's underworld.\n"
    },
    {
        "link": "/wiki/Chicago_Bulls_Championship_riots",
        "title": "Chicago Bulls Championship riots",
        "date": "",
        "location": "",
        "paragraph": "Mass rioting and looting occurred in Chicago, Illinois in the immediate aftermath of the Chicago Bulls winning six NBA Championships in the 1990s.\nDuring the 1990s, the Chicago Bulls, led by Michael Jordan, won six NBA Championships in two three-peats from 1991–93 and 1996–98.\n"
    },
    {
        "link": "/wiki/Chicago_railroad_strike_of_1877",
        "title": "Chicago railroad strike of 1877",
        "date": "",
        "location": "Chicago, Illinois",
        "paragraph": "\nThe Chicago railroad strike of 1877 was a series of work stoppages and civil unrest in Chicago, Illinois, which occurred as part of the larger national strikes and rioting of the Great Railroad Strike of 1877. Meetings of working men in Chicago on July 26 led to workers from a number of industries striking on the following morning, and over the next few days, large crowds gathered throughout the city, resulting in violent clashes with police. By the time order was restored on the evening of July 26, 14 to 30 rioters were dead or dying, and 35 to 100 civilian and nine to 13 policemen were wounded.\n"
    },
    {
        "link": "/wiki/1905_Chicago_teamsters%27_strike",
        "title": "1905 Chicago teamsters' strike",
        "date": "April - July 1905",
        "location": "Chicago, Illinois",
        "paragraph": "Cornelius Shea; Charles Dold\nJohn G. Shedd; Levy Mayer\n"
    },
    {
        "link": "/wiki/Days_of_Rage",
        "title": "Days of Rage",
        "date": "October 8–11, 1969",
        "location": "Chicago, Illinois",
        "paragraph": "\nLaw enforcement\n"
    },
    {
        "link": "/wiki/1968_Democratic_National_Convention_protests",
        "title": "1968 Democratic National Convention protests",
        "date": "August 23–28, 1968",
        "location": "Chicago, Illinois",
        "paragraph": "Protesters\nSecurity forces\n"
    },
    {
        "link": "/wiki/Disco_Demolition_Night",
        "title": "Disco Demolition Night",
        "date": "July 12, 1979(First game of a doubleheader)",
        "location": "Comiskey Park, Chicago, Illinois, U.S.",
        "paragraph": "\nDisco Demolition Night was a Major League Baseball (MLB) promotion on Thursday, July 12, 1979, at Comiskey Park in Chicago, Illinois, that ended in a riot. At the climax of the event, a crate filled with disco records was blown up on the field between games of the twi-night doubleheader between the Chicago White Sox and the Detroit Tigers. Many of those in attendance had come to see the explosion rather than the games and rushed onto the field after the detonation. The playing field was so damaged by the explosion and by the fans that the White Sox were required to forfeit the second game to the Tigers.\n"
    },
    {
        "link": "/wiki/Division_Street_riots",
        "title": "Division Street riots",
        "date": "June 12–14, 1966",
        "location": "Humboldt Park, Chicago, Illinois, United States",
        "paragraph": "The Division Street riots were episodes of rioting and civil unrest, which started on June 12 and continued through June 14, 1966. These riots are remembered as a turning point in Puerto Rican civic involvement in Chicago.[1][2] This was the first riot in the United States attributed to Puerto Ricans.[3]\nPuerto Rican migration to Chicago peaked in the 1950s and 60s, and the Puerto Rican population of Chicago jumped from 255 in 1950 to 32,371 in 1960.[4] Puerto Ricans in Chicago worked low-paying jobs in the service industries or labored in factories. This was in part because of the recruitment efforts of Castle, Barton and Associates, an employment agency. They offered domestic and foundry work contracts, and paid the airfare for Puerto Ricans coming to Chicago.[5] Another factor behind Puerto Rican migration to Chicago was the unemployment and harsh economic conditions created by Operation Bootstrap.[5]\n"
    },
    {
        "link": "/wiki/Englewood_race_riot",
        "title": "Englewood race riot",
        "date": "November 8 - 12, 1949",
        "location": "Englewood, Chicago, Illinois",
        "paragraph": "The Englewood race riot, or Peoria Street riot, was one of many post-World War II race riots in Chicago, Illinois that took place in November 1949.\nWhites in the neighborhood rioted, attacking other whites, partially based on rumors and misinformation that blacks were meeting to take over their neighborhood.\n"
    },
    {
        "link": "/wiki/Fernwood_Park_race_riot",
        "title": "Fernwood Park race riot",
        "date": "",
        "location": "",
        "paragraph": "The Fernwood Park Race Riot was a Race Massacre instigated by white residents against African American residents who inhabited the Chicago Housing Authority (CHA) veterans' housing project in the Fernwood Park neighborhood in Chicago. Area residents viewed this as one of several attempts by the CHA to initiate racial integration into white communities.[1] The riot took place between 98th and 111th streets and lasted for three days, from the day veterans and their families moved into the project, August 13th, 1947 to August 16th, 1947. The Chicago Police Department did little to stop the rioting, as was the case a year before at the Airport Homes race riots.[2] It was one of the worst race riots in Chicago history. \nHousing projects in Chicago emerged during the 1940s with the sole purpose of resolving the shortage of affordable homes for war-industry workers, many who were African American, as America prepared for World War II.[2] As Chicago proved to be a crucial steel production center for the war effort, hundreds of thousands of black workers and their families migrated from the South to Chicago in the second wave of the Great Migration.[2] Historian Devereux Bowly iterates some alarming statistics about public housing in Chicago that arose from 1940 census data: 1) 55,157 housing units were overcrowded (exceeding 1.5 persons per room), and 2) 206,103 housing units either had no access to a private bathroom or needed major repairs to interior structures.[2] To answer to such dismal conditions, the CHA opened four housing projects in low income areas with high concentrations of war-industry workers: the Frances Cabrini Homes in August 1942, the Lawndale Gardens in December 1942, the Bridgeport Homes in May 1943, and the Robert H. Brooks Homes in March 1943.[3] For families to live in these new projects, they needed to have at least one child; the family had to have one member working in a critical war industry (like steel); the family income had to total less than $2,000; and it was preferred that the family's nationality was American.[4]\n"
    },
    {
        "link": "/wiki/Haymarket_affair",
        "title": "Haymarket affair",
        "date": "May 4, 1886",
        "location": "Chicago, Illinois, United States41°53′5.6″N 87°38′38.9″W﻿ / ﻿41.884889°N 87.644139°W﻿ / 41.884889; -87.644139Coordinates: 41°53′5.6″N 87°38′38.9″W﻿ / ﻿41.884889°N 87.644139°W﻿ / 41.884889; -87.644139",
        "paragraph": "\nAugust Spies; Albert R. Parsons; Samuel Fielden\n"
    },
    {
        "link": "/wiki/Humboldt_Park_riot",
        "title": "Humboldt Park riot",
        "date": "June 4–5, 1977",
        "location": "Chicago, Illinois, United States",
        "paragraph": "\nThe Humboldt Park riot was the second major conflict between Puerto Ricans in Chicago and the Chicago Police Department. The riot began on June 4, 1977 and lasted a day and a half.[2] Following the shooting deaths of two Puerto Rican men, locals (mostly young Puerto Ricans) battled Chicago police officers in Humboldt Park and in the streets surrounding. The riot led the community to hold the Division Street Puerto Rican Day Parade,[3] which started in 1978.[4]\n"
    },
    {
        "link": "/wiki/Lager_Beer_Riot",
        "title": "Lager Beer Riot",
        "date": "April 21, 1855",
        "location": "Chicago, Illinois",
        "paragraph": "Mayor Levi Boone\nThe Lager Beer Riot occurred on April 21, 1855 in Chicago, Illinois, and was the first major civil disturbance in the city. Mayor Levi Boone, a Nativist politician, renewed enforcement of an old local ordinance mandating that taverns be closed on Sundays and led the city council to raise the cost of a liquor license from $50 per year to $300 per year, renewable quarterly.[1] The move was seen as targeting German immigrants in particular and so caused a greater sense of community within the group.[2]\n"
    },
    {
        "link": "/wiki/Marquette_Park_rallies",
        "title": "Marquette Park rallies",
        "date": "",
        "location": "",
        "paragraph": "From the mid 1960s until the late 1980s, Chicago's Marquette Park was the scene of many racially charged rallies that erupted in violence. The rallies often spilled into the residential areas surrounding the park.\nMarquette Park is the largest park on Chicago's southwest side and is in the Chicago Lawn neighborhood. The neighborhood is also called Marquette Park by most locals.\n"
    },
    {
        "link": "/wiki/1937_Memorial_Day_massacre",
        "title": "1937 Memorial Day massacre",
        "date": "May 30, 1937",
        "location": "Chicago, Illinois, United States41°40′58″N 87°32′24″W﻿ / ﻿41.682895°N 87.539912°W﻿ / 41.682895; -87.539912Coordinates: 41°40′58″N 87°32′24″W﻿ / ﻿41.682895°N 87.539912°W﻿ / 41.682895; -87.539912",
        "paragraph": "Dorothy Day\nIn the Memorial Day massacre of 1937, the Chicago Police Department shot and killed ten unarmed demonstrators in Chicago, on May 30, 1937. The incident took place during the Little Steel strike in the United States.\n"
    },
    {
        "link": "/wiki/Chicago_race_riot_of_1919",
        "title": "Chicago race riot of 1919",
        "date": "July 27 – August 3, 1919",
        "location": "Chicago, United States",
        "paragraph": "\nThe Chicago race riot of 1919 was a violent racial conflict between white Americans and black Americans that began on the South Side of Chicago, Illinois, on July 27 and ended on August 3, 1919.[1][2] During the riot, 38 people died (23 black and 15 white).[3] Over the week, injuries attributed to the episodic confrontations stood at 537, two thirds black and one third white; and between 1,000 and 2,000 residents, most of them black, lost their homes.[4] Due to its sustained violence and widespread economic impact, it is considered the worst of the scores of riots and civil disturbances across the United States during the \"Red Summer\" of 1919, so named because of its racial and labor violence.[5] It was also one of the worst riots in the history of Illinois.[6]\n"
    },
    {
        "link": "/wiki/Trumbull_Park_Homes",
        "title": "Trumbull Park Homes",
        "date": "",
        "location": "Bounded by 105th and 109th Streets and by Bensley and Oglesby Avenues. (South Deering)[1] Chicago, Illinois   United States",
        "paragraph": "Trumbull Park Homes is a Chicago Housing Authority (CHA) public housing project located in the South Deering neighborhood on the Far-South Side of Chicago, Illinois, United States. Built in 1938, it consists of 55 buildings and 434 apartments.[2] Its chief architect was John A. Holabird.\nOn July 30, 1953, the CHA moved Betty Howard, a light-skinned black woman, and her family into the project. Starting on August 5 and lasting for weeks, white residents of the projects attacked the Howard home with rocks, fireworks, with police doing little to stop them. In October 1953, the CHA decided to move 10 more black families in, sparking a new wave of violence. It was not until 1963 that blacks could go to the neighborhood park without police protection.[3][4]\n"
    },
    {
        "link": "/wiki/Disco_Demolition_Night",
        "title": "Disco Demolition Night",
        "date": "July 12, 1979(First game of a doubleheader)",
        "location": "Comiskey Park, Chicago, Illinois, U.S.",
        "paragraph": "\nDisco Demolition Night was a Major League Baseball (MLB) promotion on Thursday, July 12, 1979, at Comiskey Park in Chicago, Illinois, that ended in a riot. At the climax of the event, a crate filled with disco records was blown up on the field between games of the twi-night doubleheader between the Chicago White Sox and the Detroit Tigers. Many of those in attendance had come to see the explosion rather than the games and rushed onto the field after the detonation. The playing field was so damaged by the explosion and by the fans that the White Sox were required to forfeit the second game to the Tigers.\n"
    },
    {
        "link": "/wiki/Murder_of_Jaclyn_Dowaliby",
        "title": "Murder of Jaclyn Dowaliby",
        "date": "",
        "location": "",
        "paragraph": "Jaclyn Marie Dowaliby (May 17, 1981 – September 10, 1988) was an American girl who disappeared from her bedroom during the night in Cook County, Illinois, United States. The murdered child's body was found four days later.\nOn September 10, 1988, seven-year-old Jaclyn was taken from her home in Midlothian, Illinois, United States, at some point during the night.[1] The next morning, her mother Cynthia Dowaliby reported her as a missing child, possibly an abduction, and said that she \"prayed for her return\".[2] Police reportedly found a broken window, but it may have been a faked break-in as her adoptive father David Dowaliby later recalled the back door was left open. Search parties were organized, but for four days Jaclyn was nowhere to be found.\n"
    },
    {
        "link": "/wiki/Don_Carter_Lanes_shooting",
        "title": "Don Carter Lanes shooting",
        "date": "December 26, 2020",
        "location": "Rockford, Illinois, United States",
        "paragraph": "\nOn December 26, 2020, three people were killed and three others injured in a mass shooting at Don Carter Lanes, a bowling alley in Rockford, Illinois, U.S. A sole suspect was arrested after the shooting and later identified as Duke Webb, who at the time was an active-duty Special Forces soldier.[1]\n"
    },
    {
        "link": "/wiki/Highland_Park_parade_shooting",
        "title": "Highland Park parade shooting",
        "date": "July 4, 2022 (2022-07-04) 10:14 a.m. CDT (UTC–05:00)",
        "location": "Central Ave. and 2nd St. in Highland Park, Illinois, U.S.",
        "paragraph": "\nOn July 4, 2022, a mass shooting occurred during an Independence Day parade in Highland Park, Illinois, United States. The shooting occurred at 10:14 a.m. CDT (UTC−05:00), roughly 15 minutes after the parade had started. Seven people were killed, and 48 others were wounded by bullets or shrapnel.\n"
    },
    {
        "link": "/wiki/Magnificent_Mile_shooting",
        "title": "Magnificent Mile shooting",
        "date": "May 19, 2022 (2022-05-19) 10:40 – c. 11:30 p.m. (CDT; UTC−05:00)",
        "location": "800 North State Street,Chicago, Illinois, U.S.",
        "paragraph": "On May 19, 2022, a mass shooting occurred in Chicago, Illinois, United States, in the city's Magnificent Mile shopping district, near Michigan Avenue.[4] Two people were killed, and eight others were injured.[5] The accused perpetrator, Jaylun Sanders, was taken into custody with the weapon also being obtained by Chicago police.\nThe shooting occurred at about 10:40 p.m. CDT (UTC−05:00), near a McDonald's establishment on the Near North Side neighborhood of Chicago.[5][6] The incident occurred a few blocks from the city's Magnificent Mile shopping district. The shooting happened as a result of an altercation outside the McDonald's restaurant.[5] The cause of the altercation is not yet known; however it was described as \"personal\" by detectives.[7][3] The shooting was triggered when police officers, who were near the area noticed two groups engaging in a fight.[3]\n"
    },
    {
        "link": "/wiki/2021_Normal_shooting",
        "title": "Normal, Illinois",
        "date": "",
        "location": "",
        "paragraph": "Normal is a town in McLean County, Illinois, United States.  As of the 2020 census, the town's population was 52,736. Normal is the smaller of two principal municipalities of the Bloomington–Normal metropolitan area, and Illinois' seventh most populous community outside the Chicago metropolitan area. As of 2022, Chris Koos has been Normal's mayor since 2003.[2]\nThe main campus of Illinois' oldest public university, Illinois State University, a fully accredited four-year institution, is in Normal, as is Heartland Community College, a fully accredited two-year institution. There was also a satellite campus of Lincoln College, which offered associate degrees as well as four-year programs.\n"
    },
    {
        "link": "/wiki/Nauvoo_Temple",
        "title": "Nauvoo Temple",
        "date": "",
        "location": "Nauvoo, Illinois, United States",
        "paragraph": "\nCoordinates: 40°33′02″N 91°23′04″W﻿ / ﻿40.5505°N 91.3844°W﻿ / 40.5505; -91.3844\n"
    },
    {
        "link": "/wiki/Nauvoo_Illinois_Temple",
        "title": "Nauvoo Illinois Temple",
        "date": "",
        "location": "Nauvoo, Illinois, United States",
        "paragraph": "\nCoordinates: 40°33′01.5″N 91°23′04.4″W﻿ / ﻿40.550417°N 91.384556°W﻿ / 40.550417; -91.384556\n"
    },
    {
        "link": "/wiki/List_of_incidents_of_civil_unrest_in_Chicago",
        "title": "List of incidents of civil unrest in Chicago",
        "date": "",
        "location": "",
        "paragraph": "\nThis list is about incidents of civil unrest, rioting, violent labor disputes, or minor insurrections or revolts in Chicago, Illinois.\n"
    },
    {
        "link": "/wiki/1966_Chicago_West_Side_riots",
        "title": "1966 Chicago West Side riots",
        "date": "July 12–15, 1966",
        "location": "West Side, Chicago, Illinois",
        "paragraph": "Black residents of the West Side\nThe 1966 Chicago West Side riots was a public disorder that occurred between July 12 and 15 in Chicago, Illinois. After police arrested a man that was wanted for armed robbery, black residents  took to the streets in anger and looted and burned various stores throughout the West Side until the arrival of 1,200 National Guardsmen on July 15. Violence quickly subsided and most of the troops were sent home on July 20.[1]\n"
    },
    {
        "link": "/wiki/1968_Chicago_riots",
        "title": "1968 Chicago riots",
        "date": "April 5, 1968 (1968-04-05) – April 7, 1968 (1968-04-07)",
        "location": "Chicago, Illinois, United States41°52′N 87°44′W﻿ / ﻿41.867°N 87.733°W﻿ / 41.867; -87.733Coordinates: 41°52′N 87°44′W﻿ / ﻿41.867°N 87.733°W﻿ / 41.867; -87.733",
        "paragraph": " United States government\n Government of Illinois\n"
    },
    {
        "link": "/wiki/Airport_Homes_race_riots",
        "title": "Airport Homes race riots",
        "date": "",
        "location": "",
        "paragraph": "\nThe Airport Homes race riots were a series of riots in 1946 in the West Lawn and West Elsdon neighborhoods of Chicago, Illinois.[1] It was the worst episode of racial inspired violence that the city faced in some thirty years.[2]\n\"Airport Homes\" was the name of the site in nearby West Lawn established by the Chicago Housing Authority to provide temporary housing to returning veterans and their families during the postwar housing shortage. Residents of West Lawn and West Elsdon rioted and succeeded in intimidating a few black war veterans and their families from joining white veterans in the homes.[1]\n"
    },
    {
        "link": "/wiki/Aldermen%27s_wars",
        "title": "Aldermen's wars",
        "date": "1916 – 1921",
        "location": "19th ward, Chicago, Illinois, United States",
        "paragraph": "The Alderman's wars was a series of murders and violent rioting between warring Alderman Johnny \"de Pow\" Powers and Anthony D'Andrea from 1916 until 1921. Over a period of five years, over 30 deaths were reported during the struggle for control over the \"Bloody\" 19th Ward of Chicago's Little Italy.\nJohnny Powers, a local Irish-American saloonkeeper and longtime political boss of the predominantly Irish 19th Ward, had been in power since the 1880s and despite the large influx of Italian immigrants over the decades managed to retain power among the area despite his reputation for corruption and offering political protection to criminal elements in Chicago's underworld.\n"
    },
    {
        "link": "/wiki/Chicago_Bulls_Championship_riots",
        "title": "Chicago Bulls Championship riots",
        "date": "",
        "location": "",
        "paragraph": "Mass rioting and looting occurred in Chicago, Illinois in the immediate aftermath of the Chicago Bulls winning six NBA Championships in the 1990s.\nDuring the 1990s, the Chicago Bulls, led by Michael Jordan, won six NBA Championships in two three-peats from 1991–93 and 1996–98.\n"
    },
    {
        "link": "/wiki/Chicago_railroad_strike_of_1877",
        "title": "Chicago railroad strike of 1877",
        "date": "",
        "location": "Chicago, Illinois",
        "paragraph": "\nThe Chicago railroad strike of 1877 was a series of work stoppages and civil unrest in Chicago, Illinois, which occurred as part of the larger national strikes and rioting of the Great Railroad Strike of 1877. Meetings of working men in Chicago on July 26 led to workers from a number of industries striking on the following morning, and over the next few days, large crowds gathered throughout the city, resulting in violent clashes with police. By the time order was restored on the evening of July 26, 14 to 30 rioters were dead or dying, and 35 to 100 civilian and nine to 13 policemen were wounded.\n"
    },
    {
        "link": "/wiki/1905_Chicago_teamsters%27_strike",
        "title": "1905 Chicago teamsters' strike",
        "date": "April - July 1905",
        "location": "Chicago, Illinois",
        "paragraph": "Cornelius Shea; Charles Dold\nJohn G. Shedd; Levy Mayer\n"
    },
    {
        "link": "/wiki/Days_of_Rage",
        "title": "Days of Rage",
        "date": "October 8–11, 1969",
        "location": "Chicago, Illinois",
        "paragraph": "\nLaw enforcement\n"
    },
    {
        "link": "/wiki/1968_Democratic_National_Convention_protests",
        "title": "1968 Democratic National Convention protests",
        "date": "August 23–28, 1968",
        "location": "Chicago, Illinois",
        "paragraph": "Protesters\nSecurity forces\n"
    },
    {
        "link": "/wiki/Disco_Demolition_Night",
        "title": "Disco Demolition Night",
        "date": "July 12, 1979(First game of a doubleheader)",
        "location": "Comiskey Park, Chicago, Illinois, U.S.",
        "paragraph": "\nDisco Demolition Night was a Major League Baseball (MLB) promotion on Thursday, July 12, 1979, at Comiskey Park in Chicago, Illinois, that ended in a riot. At the climax of the event, a crate filled with disco records was blown up on the field between games of the twi-night doubleheader between the Chicago White Sox and the Detroit Tigers. Many of those in attendance had come to see the explosion rather than the games and rushed onto the field after the detonation. The playing field was so damaged by the explosion and by the fans that the White Sox were required to forfeit the second game to the Tigers.\n"
    },
    {
        "link": "/wiki/Division_Street_riots",
        "title": "Division Street riots",
        "date": "June 12–14, 1966",
        "location": "Humboldt Park, Chicago, Illinois, United States",
        "paragraph": "The Division Street riots were episodes of rioting and civil unrest, which started on June 12 and continued through June 14, 1966. These riots are remembered as a turning point in Puerto Rican civic involvement in Chicago.[1][2] This was the first riot in the United States attributed to Puerto Ricans.[3]\nPuerto Rican migration to Chicago peaked in the 1950s and 60s, and the Puerto Rican population of Chicago jumped from 255 in 1950 to 32,371 in 1960.[4] Puerto Ricans in Chicago worked low-paying jobs in the service industries or labored in factories. This was in part because of the recruitment efforts of Castle, Barton and Associates, an employment agency. They offered domestic and foundry work contracts, and paid the airfare for Puerto Ricans coming to Chicago.[5] Another factor behind Puerto Rican migration to Chicago was the unemployment and harsh economic conditions created by Operation Bootstrap.[5]\n"
    },
    {
        "link": "/wiki/Englewood_race_riot",
        "title": "Englewood race riot",
        "date": "November 8 - 12, 1949",
        "location": "Englewood, Chicago, Illinois",
        "paragraph": "The Englewood race riot, or Peoria Street riot, was one of many post-World War II race riots in Chicago, Illinois that took place in November 1949.\nWhites in the neighborhood rioted, attacking other whites, partially based on rumors and misinformation that blacks were meeting to take over their neighborhood.\n"
    },
    {
        "link": "/wiki/Fernwood_Park_race_riot",
        "title": "Fernwood Park race riot",
        "date": "",
        "location": "",
        "paragraph": "The Fernwood Park Race Riot was a Race Massacre instigated by white residents against African American residents who inhabited the Chicago Housing Authority (CHA) veterans' housing project in the Fernwood Park neighborhood in Chicago. Area residents viewed this as one of several attempts by the CHA to initiate racial integration into white communities.[1] The riot took place between 98th and 111th streets and lasted for three days, from the day veterans and their families moved into the project, August 13th, 1947 to August 16th, 1947. The Chicago Police Department did little to stop the rioting, as was the case a year before at the Airport Homes race riots.[2] It was one of the worst race riots in Chicago history. \nHousing projects in Chicago emerged during the 1940s with the sole purpose of resolving the shortage of affordable homes for war-industry workers, many who were African American, as America prepared for World War II.[2] As Chicago proved to be a crucial steel production center for the war effort, hundreds of thousands of black workers and their families migrated from the South to Chicago in the second wave of the Great Migration.[2] Historian Devereux Bowly iterates some alarming statistics about public housing in Chicago that arose from 1940 census data: 1) 55,157 housing units were overcrowded (exceeding 1.5 persons per room), and 2) 206,103 housing units either had no access to a private bathroom or needed major repairs to interior structures.[2] To answer to such dismal conditions, the CHA opened four housing projects in low income areas with high concentrations of war-industry workers: the Frances Cabrini Homes in August 1942, the Lawndale Gardens in December 1942, the Bridgeport Homes in May 1943, and the Robert H. Brooks Homes in March 1943.[3] For families to live in these new projects, they needed to have at least one child; the family had to have one member working in a critical war industry (like steel); the family income had to total less than $2,000; and it was preferred that the family's nationality was American.[4]\n"
    },
    {
        "link": "/wiki/Haymarket_affair",
        "title": "Haymarket affair",
        "date": "May 4, 1886",
        "location": "Chicago, Illinois, United States41°53′5.6″N 87°38′38.9″W﻿ / ﻿41.884889°N 87.644139°W﻿ / 41.884889; -87.644139Coordinates: 41°53′5.6″N 87°38′38.9″W﻿ / ﻿41.884889°N 87.644139°W﻿ / 41.884889; -87.644139",
        "paragraph": "\nAugust Spies; Albert R. Parsons; Samuel Fielden\n"
    },
    {
        "link": "/wiki/Humboldt_Park_riot",
        "title": "Humboldt Park riot",
        "date": "June 4–5, 1977",
        "location": "Chicago, Illinois, United States",
        "paragraph": "\nThe Humboldt Park riot was the second major conflict between Puerto Ricans in Chicago and the Chicago Police Department. The riot began on June 4, 1977 and lasted a day and a half.[2] Following the shooting deaths of two Puerto Rican men, locals (mostly young Puerto Ricans) battled Chicago police officers in Humboldt Park and in the streets surrounding. The riot led the community to hold the Division Street Puerto Rican Day Parade,[3] which started in 1978.[4]\n"
    },
    {
        "link": "/wiki/Lager_Beer_Riot",
        "title": "Lager Beer Riot",
        "date": "April 21, 1855",
        "location": "Chicago, Illinois",
        "paragraph": "Mayor Levi Boone\nThe Lager Beer Riot occurred on April 21, 1855 in Chicago, Illinois, and was the first major civil disturbance in the city. Mayor Levi Boone, a Nativist politician, renewed enforcement of an old local ordinance mandating that taverns be closed on Sundays and led the city council to raise the cost of a liquor license from $50 per year to $300 per year, renewable quarterly.[1] The move was seen as targeting German immigrants in particular and so caused a greater sense of community within the group.[2]\n"
    },
    {
        "link": "/wiki/Marquette_Park_rallies",
        "title": "Marquette Park rallies",
        "date": "",
        "location": "",
        "paragraph": "From the mid 1960s until the late 1980s, Chicago's Marquette Park was the scene of many racially charged rallies that erupted in violence. The rallies often spilled into the residential areas surrounding the park.\nMarquette Park is the largest park on Chicago's southwest side and is in the Chicago Lawn neighborhood. The neighborhood is also called Marquette Park by most locals.\n"
    },
    {
        "link": "/wiki/1937_Memorial_Day_massacre",
        "title": "1937 Memorial Day massacre",
        "date": "May 30, 1937",
        "location": "Chicago, Illinois, United States41°40′58″N 87°32′24″W﻿ / ﻿41.682895°N 87.539912°W﻿ / 41.682895; -87.539912Coordinates: 41°40′58″N 87°32′24″W﻿ / ﻿41.682895°N 87.539912°W﻿ / 41.682895; -87.539912",
        "paragraph": "Dorothy Day\nIn the Memorial Day massacre of 1937, the Chicago Police Department shot and killed ten unarmed demonstrators in Chicago, on May 30, 1937. The incident took place during the Little Steel strike in the United States.\n"
    },
    {
        "link": "/wiki/Chicago_race_riot_of_1919",
        "title": "Chicago race riot of 1919",
        "date": "July 27 – August 3, 1919",
        "location": "Chicago, United States",
        "paragraph": "\nThe Chicago race riot of 1919 was a violent racial conflict between white Americans and black Americans that began on the South Side of Chicago, Illinois, on July 27 and ended on August 3, 1919.[1][2] During the riot, 38 people died (23 black and 15 white).[3] Over the week, injuries attributed to the episodic confrontations stood at 537, two thirds black and one third white; and between 1,000 and 2,000 residents, most of them black, lost their homes.[4] Due to its sustained violence and widespread economic impact, it is considered the worst of the scores of riots and civil disturbances across the United States during the \"Red Summer\" of 1919, so named because of its racial and labor violence.[5] It was also one of the worst riots in the history of Illinois.[6]\n"
    },
    {
        "link": "/wiki/Trumbull_Park_Homes",
        "title": "Trumbull Park Homes",
        "date": "",
        "location": "Bounded by 105th and 109th Streets and by Bensley and Oglesby Avenues. (South Deering)[1] Chicago, Illinois   United States",
        "paragraph": "Trumbull Park Homes is a Chicago Housing Authority (CHA) public housing project located in the South Deering neighborhood on the Far-South Side of Chicago, Illinois, United States. Built in 1938, it consists of 55 buildings and 434 apartments.[2] Its chief architect was John A. Holabird.\nOn July 30, 1953, the CHA moved Betty Howard, a light-skinned black woman, and her family into the project. Starting on August 5 and lasting for weeks, white residents of the projects attacked the Howard home with rocks, fireworks, with police doing little to stop them. In October 1953, the CHA decided to move 10 more black families in, sparking a new wave of violence. It was not until 1963 that blacks could go to the neighborhood park without police protection.[3][4]\n"
    }
]