[
    {
        "link": "/wiki/Greenwood_Park_Mall_shooting",
        "title": "Greenwood Park Mall shooting",
        "date": "July 17, 2022 5:56 p.m. (EDT)",
        "year": "2022",
        "location": "Greenwood, Indiana, U.S.",
        "state": "Indiana",
        "county": "Greenwood",
        "paragraph": "\nOn July 17, 2022, a mass shooting occurred at the Greenwood Park Mall in Greenwood, Indiana, United States. The shooting occurred at 5:56 p.m. EDT (UTC−04:00) and lasted less than one minute. Three people were killed and two others were injured in the shooting[1] before the perpetrator, 20-year-old Jonathan Sapirman, was fatally shot by 22-year-old Elisjsha Dicken, a legally armed civilian bystander.[2]\nAround 4:55 p.m. on July 17, 2022, the perpetrator of the attack, Jonathan Sapirman, a local citizen from Greenwood, walked a mile from his apartment to the mall, carrying a SIG Sauer M400 semi-automatic rifle, a Smith & Wesson M&P15 AR-15 style semi-automatic rifle, a Glock 33 pistol, and over 100 rounds of ammunition. He went into a restroom near the mall's food court, and did not come out until an hour and two minutes later, at which point he started shooting.[3]\n"
    },
    {
        "link": "/wiki/Grandview_Apostolic_Church",
        "title": "Grandview Apostolic Church",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Brown County",
        "paragraph": "Grandview Apostolic Church was a historic church building in Brown County, Indiana, United States.  Built in 1892 along Grandview Ridge Road near the community of New Bellsville,[1] it lay in far eastern Van Buren Township.[2]  The church was a frame structure with a facade that featured a steeple,[3] while the interior consisted of only a single room.[4]\nA part of the denomination known as the Apostolic Church,[5] Grandview Apostolic was the second oldest existing church building in Brown County.[6]  It closed during the twentieth century, but a congregation was restarted there in the early 1990s, and the building remained in active use by that congregation until 2010.[7]  In 1991, the church building and two related structures, plus the cemetery, were added to the National Register of Historic Places because of their place in local history and because of their well-preserved historic architecture.[1]  Such a distinction is unusual; both cemeteries and religious properties must pass higher hurdles than most other types of properties in order to qualify for inclusion on the National Register.[8]\nBefore dawn on July 14, 2010, a neighbor called firefighters to report that the church was burning,[6] prompting a response from firefighters from the Hamblen Township, Fruitdale, Nashville, and Van Buren Township volunteer fire departments.[9]  Little more than half an hour after the initial emergency call, the fire was under control, but the church had already been destroyed;[6] the only thing saved was the pastor's Bible.[10]  Determined to continue as a congregation, the church's forty-five members later decided to take the name of \"New Beginnings Church\" and began worshipping elsewhere.[11]\n"
    },
    {
        "link": "/wiki/Jeffries_Ford_Covered_Bridge",
        "title": "Jeffries Ford Covered Bridge",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Bridgeton",
        "paragraph": "The Jeffries Ford Covered Bridge was southwest of Bridgeton, Indiana, United States. The double-span Burr Arch covered bridge structure was built by J. A. Britton in 1915 and destroyed by arson on April 2, 2002.[1]\nAt the time the Jeffries Ford Bridge was built Joseph A. Britton was 75 years old. Throughout his years as a bridge builder Britton had been assisted by his family and this bridge was no different, some of his sons, four by his first wife and five by his second, would have done the actual construction work. His son Eugene Britton built the Bowsher Ford Covered Bridge the same year.[3]\nIt was added to the National Register of Historic Places in 1978.[2]\n"
    },
    {
        "link": "/wiki/Snyderman_House",
        "title": "Snyderman House",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Fort Wayne",
        "paragraph": "The Snyderman House was a spectacular, widely published single-family residence in Fort Wayne, Indiana, designed for Sanford and Joy Snyderman in 1972 by architect Michael Graves. Celebrated in both the architectural and popular press as a tour-de-force of late modernism, it was a splendid example of Graves' imaginative, sophisticated work. It stood, along with Graves' Hanselman House, Richard Meier's New Harmony Athenaeum —which was related to the Snyderman House—and the buildings of Columbus, Indiana, as national icons of modern architecture located in the state of Indiana (Graves' home state).\nIn her feature article on the Snyderman House in Progressive Architecture, Suzanne Stephens wrote in 1978 that \"Because of the house's successful fragments and particular spaces, because of its manner of referring back to previous work as well as anticipating that which is to come, it will probably occupy a prominent place in the history of Michael Graves' oeuvre.\"\nMartin Filler, in an overview of Graves' work as of 1980, wrote that \"The Synderman House is a central work in Michael Graves' career. It is his largest completed building to date, but its significance comes not from its size. It is transitional work, and transitional works in architecture are much rarer than in other art forms, a result of the architectural artifact taking so long to produce.  The Snyderman House, designed in 1972 and completed five years later, spans Michael Graves' two stylistic phases.  The house is composed of a white, cage-like exterior frame, typical of his first projects. But within that Cubist grill are set massive volumes--sheer gray wall planes, an undulating terra cotta facade--and relatively small expanses of glass, all of which are more characteristic of his current projects.  This is an early Michael Graves building with a later Michael Graves building trapped inside it, fighting to emerge.  Its debt both in form and color to the earlier work of John Hejduk, and its impact on later work by other architects (such as Richard Meier's Atheneum of 1975-70 in New Harmony, Ind.) confirm it as an important work of the 1970's.\"\n"
    },
    {
        "link": "/wiki/Wilbur_Wynant_House",
        "title": "Wilbur Wynant House",
        "date": "",
        "year": "",
        "location": "600 Fillmore St., Gary, Indiana",
        "state": "Indiana",
        "county": "Gary",
        "paragraph": "The Wilbur Wynant House (also known as 600 Fillmore or simply the Wynant House) was a house designed by architect Frank Lloyd Wright in Gary, Indiana, United States. During the end of the house's lifespan it was in poor condition; in the mid-2000s it was purchased by a man who planned to restore it, but it was destroyed by fire on January 9, 2006.[2]\nOn January 9, 2006, the Wynant House burned.[2] Officials suspect arson as the cause of this unexpected fire.[3] The remaining structure was subsequently razed and the lot was confirmed to be vacant in November 2012.\n Media related to Wynant House at Wikimedia Commons\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Tucker",
        "title": "Lynching of John Tucker",
        "date": "July 4, 1845",
        "year": "1845",
        "location": "Indianapolis, Indiana",
        "state": "Indiana",
        "county": "Indianapolis",
        "paragraph": "John Tucker (born around 1800) was the victim of a racial terror lynching that took place on July 4, 1845, in downtown Indianapolis, Indiana. Tucker was a free Black man, a husband and a father, who was working as a farmer at the time of his death. Tucker was attacked and killed by three drunken white men in front of a crowd. Two of the men were arrested for Tucker's murder, but only one was convicted.\nIn his early life, John Tucker was enslaved in Kentucky. Tucker obtained his freedom and relocated to Indianapolis. At the time of his death, he and his wife were the parents of two young children, Mary and William. The family lived \"in a house near the intersection of St. Clair and Delaware Streets\" in downtown Indianapolis. Tucker worked as a farmer for City Postmaster Samuel Henderson.[1]\nOn the afternoon of July 4, 1845, John Tucker was lynched in downtown Indianapolis. Finding himself being accosted by a drunken white man, Nicholas Wood, Tucker began to walk toward the Indianapolis Magistrate's office to seek help. But Wood was soon joined by two other white men, William Ballenger (a saloon owner) and Edward Davis.[1] According to the Indiana State Sentinel, an Indiana newspaper that covered the lynching, the assailants attacked Tucker with clubs, stones, and brickbats.[2] The minister of Second Presbyterian Church, located very near the site of Tucker's death, Reverend Henry Ward Beecher, wrote that Tucker \"defended himself with desperate determination\" during the attack.[1] While a few people attempted to \"separate Tucker from his assaulters,\" a large crowd gathered who cheered for Tucker's death.[1] Those involved continued to beat Tucker after he was already dead.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_James_Dillard",
        "title": "Lynching of James Dillard",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Indianapolis",
        "paragraph": "In November 1902, a white mob from Sullivan and Knox counties lynched James Dillard, a young Black man from Indianapolis. Dillard's death resulted in a lengthy legal battle over Indiana's 1899 anti-lynching law. \nJames Dillard and his mother moved from Tennessee to Indianapolis in 1895.[1] In Indianapolis, Dillard worked a variety of jobs including being a porter at the Columbia Club and at Young’s Billiard Room.[2] At the time of his death, Dillard was in his twenties. He had left Indianapolis in the spring of 1901 and it is unknown why he was in Sullivan County.[1]\nIn November 1902, residents in Sullivan and Knox counties accused James Dillard of assaulting two white women, the wives of Milton Davis and John Lemon.[2][3] On November 19, police apprehended Dillard in Lawrenceville, Illinois, shooting him three times in the process.[2][4] After police arrested Dillard, they transported him to Sullivan.[4] While being transported, a mob of approximately 50 local farmers gathered in the area, causing the Sullivan County sheriff, John S. Dudley, to invoke Indiana's 1899 anti-lynching law by requesting that Governor Winfield Durbin send in militia.[5][6][4] The militia was sent from Vincennes, many miles south of the mob and too far away to make it before Dudley conceded Dillard to the mob.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Johnson,_Squire_Taylor,_and_Charles_Davis",
        "title": "Lynching of George Johnson, Squire Taylor, and Charles Davis",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Charlestown",
        "paragraph": "George Johnson, Squire Taylor, and Charles Davis, were three Black men who were killed in a spectacle lynching in 1871 in Charlestown, Indiana. They were memorialized in 2022.\nA white mob lynched George Johnson, Squire Taylor, and Charles Davis, all Black men, in Charlestown, Clark County, Indiana, in 1871.[1] The three men were accused of killing the family of Cyprus Park, a farmer who lived near Henryville, Indiana. A neighbor near the Parks family believed that he was also a target but managed to keep the assailants out of his home. The neighbor believed that the assailants were white. Even so, George Johnson, a Black man, was arrested on suspicion of committing the murders and was tortured until he confessed. He also gave out the names of two other Black men, Squire Taylor, and Charles Davis. These men were then arrested. The trial followed quite quickly. The grand jury declared the men not guilty based on the lack of evidence, but the men remained in custody and were sent to a Charlestown jail.[1]\nSoon after arrival, a white mob gathered and took the three men from the jail. The mob then hanged all three men and tortured Squire Taylor before he was killed. The guilt of the men in question was viewed as highly dubious by some at the time. Information about this spectacle lynching was released only a year later in a pamphlet titled, “Murder and Mob Law in Indiana,”  by James Hiatt. The author decried the lack of proof of the Black men's guilt and acknowledged the overwhelming evidence of their innocence.[2] No one was charged or arrested for the murder of these men even though the family came forward with names of suspects and filed a law suit against the sheriff involved. The actions of the white mob led the Indiana governor at the time, Conrad Baker, to call for the suppression of illegal organizations. Referring to the Enforcement Act of 1870, adopted during Reconstruction, Baker proposed that the U.S. Federal government could be asked to intervene to stop the actions of mobs that terrorized Black people. The Indiana government, however, did not follow through on that proposal and mob violence continued.[3]\n"
    },
    {
        "link": "/wiki/Edmund_Kayser",
        "title": "Edmund Kayser",
        "date": "August 25, 1915 (40-years-old)Tolleston, Indiana",
        "year": "1915",
        "location": "",
        "state": "Indiana",
        "county": "Tolleston",
        "paragraph": "Pastor Edmund Kayser of St. James' Evangelical Lutheran Church in Tolleston, Indiana, was assassinated on August 25, 1916, for his pro-German views during World War I.[1]\nWorld War I had started on July 28, 1914, when the Austro-Hungarian Empire declared war on Serbia. By 1916, nearly all of the European nations and empires had entered the war. The United States maintained its neutrality, and some of its sizeable German population supported Imperial Germany and its Axis of Central Powers that was fighting the Entente Powers. In the 1910 census there were 2.3 million German-born immigrants living in the United States and 550 German newspapers in the country.[2] The large number of German-Americans was also a factor in keeping America out of World War I until the fighting had been going on for three years.[3]\nEdmund Kayser was born in Bavaria.[4] He moved to the United States and established an independent Lutheran church that paid him $50 ($1,245 in 2023) a month. It was said that he had other sources of income buying and selling land.[5]\n"
    },
    {
        "link": "/wiki/Lynching_of_William_Keemer",
        "title": "Lynching of William Keemer",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Greenfield",
        "paragraph": "William Keemer was the victim of a racial terror spectacle lynching in 1875 in Greenfield, Indiana.[1] Keemer, a Black man, was dragged from his jail cell in Hancock County, Indiana on June 25, 1875 by a white mob from Hancock, Shelby, and Rush counties. Keemer was hung at the Hancock County fairgrounds and over 1,000 people traveled to view the body.[2][3][4] Keemer was arrested on June 24 for an alleged sexual assault against a white women in Carthage, Indiana. No trial was held for the alleged crime and William Keemer remains innocent.[3][5] In 2021 a historical marker commemorating the anti-Black violence committed against Keemer was approved by the Indiana Historical Bureau.[6]\nWilliam Keemer was born in 1849. The location is unknown, but he had a brother, James, who was born in 1850 in Ohio.[4] According to James’ death certificate, their parents were born in Kentucky and his mother’s maiden name was Flood.[7] Keemer's father, James H. Keemer, served in the Civil War from 1865-1866 and was a resident of the Beech Settlement, an early Black rural community, in Carthage, Indiana.[8] William Keemer was also a resident of the Beech Settlement and by the time of his death, the population there was declining.[2] William worked as a carpenter for Charles S. Wiltsie, who was the prosecuting attorney for Marion County, Indiana.[8] In 1875, William was not known to have any children.[6]\nWilliam Keemer was lynched on the night of June 25, 1875. A mob of 150 to 160 white, masked individuals gathered outside the Hancock County Jail in Greenfield, that evening, demanding a spectacle lynching.[2][3][9] The mob restrained the sheriff in order to force entry into the jail and met resistance from Keemer. The mob then took Keemer from his jail cell to the Hancock County fairground where they hung him from a structure.[3][4] His body remained there until the morning of June 26. On Keemer’s back, a note was found that read, “It is the verdict of 160 men of Hancock, Shelby and Rush, that this life is inadequate to meet the demands of justice.”[3][9] Keemer’s body was taken to the Wills and Pratt, a funeral parlor, with the noose still around his neck. Over 1,000 people came to view the body.[4] On Sunday, June 27, Keemer’s body was buried in an unmarked grave in a potter’s field.[3][4][6]\n"
    },
    {
        "link": "/wiki/Lynching_in_Posey_County,_Indiana",
        "title": "Lynching in Posey County, Indiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Sr.",
        "paragraph": "On October 11, 1878, Jim Good, Jeff Hopkins, Ed Warner, William Chambers, and Dan Harris, Sr. were lynched in Posey County, Indiana, near the town of Mount Vernon.[1] These men, who were allegedly connected to the robbery of a brothel, were killed by a white mob who broke into the jail where they were being held. Two other men, Dan Harris, Jr. and John Harris, were also lynched in the days leading up to October 11, in connection with the same alleged offense. This racial terror lynching is the largest reported lynching in Indiana's history.[2]\nOn October 7, 1878, Mount Vernon newspapers reported that a group of Black men had robbed a group of white women working as sex workers at a brothel near Mount Vernon, Indiana in Posey County.[3][4][5][6] Law enforcement officers listed Jim Good, Jeff Hopkins, Ed Warner, William Chambers, John Harris, and Dan Harris, Jr. as suspects, and began to search for them.\nOfficers arrested Good, Hopkins, Warner, and Chambers, and brought them to jail to await trial. White mobs lynched two men, Dan Harris, Jr. and John Harris, before officers could locate them.[3] Officers were unaware of this when they went to the Mount Vernon home of Harris, Jr.'s father, Dan Harris, Sr. When they arrived, intending to arrest Dan Harris, Jr., Harris, Sr. informed them that his son had already been lynched the day before. The officers accused Harris, Sr. of harboring his son within the home. When officers attempted to forcefully enter, Harris, Sr. shot Deputy Sheriff Cyrus Thomas with a shotgun. The city marshal shot back, wounding Harris, Sr. before taking him into custody at the same jail as Good, Hopkins, Warner, and Chambers. Deputy Sheriff Thomas died at the scene.[7][8]\n"
    },
    {
        "link": "/wiki/Lynching_of_Joe_Holly,_Bud_Rowland,_and_Jim_Henderson",
        "title": "Lynching of Joe Holly, Bud Rowland, and Jim Henderson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Rockport",
        "paragraph": "Bud Rowland and Jim Henderson, two Black men, were lynched in Rockport, Indiana on December 16, 1900.[1] The following day, Joe Holly was lynched in Boonville, Indiana for the same alleged crime. [2]\nOn December 16, 1900, Bud Rowland and Jim Henderson, two Black men, were arrested for the murder of a white barber, Hollie L. Simmons in Rockport, Indiana. He was reportedly jumped by two men and was bashed across the skull with a nail-covered club.[1] The news of the murder spread through town, and suspects were quickly identified that same night. Of those who were questioned, Henderson and Rowland were arrested in Rockport.\nShortly after authorities placed Rowland and Henderson in the local jail, a large group of angry white people used sledgehammers and a broken telegraph pole to ram into the jail.[2] While the mob was getting ready to hang Rowland, he said that he had one more accomplice named ‘Crowfoot’. The white crowd first pulled Rowland out of his cell and hanged him from a tree on the east side of the courthouse, before shooting his body with bullets.[2] The group returned to retrieve Henderson from his cell. They shot him in his cell, dragged him across the courtyard, and hanged him next to Rowland.[1]\n"
    },
    {
        "link": "/wiki/Posey_County,_Indiana,_lynchings",
        "title": "Posey County, Indiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Posey County",
        "paragraph": "\nPosey County is the southernmost, southwesternmost, and westernmost county in the U.S. state of Indiana. Its southern border is formed by the Ohio River, and its western border by the Wabash River, a tributary to the Ohio. As of 2010, the population was 25,910.[1] The county seat is Mount Vernon.[2]\nPosey County is part of the Evansville, IN–KY Metropolitan Statistical Area. The Ports of Indiana-Mt. Vernon, on the Ohio River, is the seventh largest inland port complex in the nation. Mechanization of dock technology has altered the number of workers at the port, but Posey County is still the seventh-largest internal port in the United States, based on the tons of materials handled. Grain from the Midwest is among the products shipped.\n"
    },
    {
        "link": "/wiki/Reno_Gang",
        "title": "Reno Gang",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "county": "Canada",
        "paragraph": "The Reno Gang, also known as the Reno Brothers Gang and The Jackson Thieves, were a group of criminals that operated in the Midwestern United States during and just after the American Civil War. Though short-lived, the gang carried out the first three peacetime train robberies in U.S. history. Most of the stolen money was never recovered.\nThe gang was broken up by the lynchings of ten of its members by vigilante mobs in 1868. The murders created an international diplomatic incident with Canada and Great Britain, a general public uproar, and international newspaper coverage. No one was ever identified or prosecuted for the lynchings.\nThe Reno Brothers have been portrayed in at least three films, including Elvis Presley's film debut in Love Me Tender (1956), in which he starred as Clint Reno, and Rage at Dawn (1955), featuring Randolph Scott.\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Scott",
        "title": "Lynching of George Scott",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Clay County",
        "paragraph": "In the early hours of December 12, 1880, a white mob in Clay County, Indiana lynched George Scott, an African American man. Scott had fled after being accused of a crime in nearby Eaglesfield, Indiana, and was captured near Indianapolis and brought to the Clay County jail in Brazil, Indiana.[1] Rumors swirled that a mob might form, but the local Sheriff, James Lankford, paid them no heed. However, the man left in charge of the jail, ex-Sheriff Jacob Baumunk, took the precaution of giving the keys to Sheriff Lankford, who would not be on-site at the jail, after locking up.[2] Sometime between one and three in the morning on Sunday, December 12, a mob of over 100 men, masked, descended on the jail and demanded that Baumunk give them the keys.[1][3] After informing the mob that he did not have the keys, he was told to “retire to his room.”[2]\nAfter Baumunk removed himself, the mob began to attack the jail with sledgehammers and the like in order to reach Scott’s cell. Between three and four in the morning, Scott was removed from his cell by the mob who took him to a nearby oak tree, where he was hanged. Scott’s body remained there until he was discovered by the Clay County Coroner, Dr. George Pell, who transported Scott’s body to the courthouse around seven in the morning.[2] Prior to this, Scott’s hanged body had been viewed by “several thousand” individuals. After his body was transported to the courthouse, it was “exhibited for public inspection” before finally being released to family members near Indianapolis.[1]\nThis crime-related article is a stub. You can help Wikipedia by expanding it."
    },
    {
        "link": "/wiki/Lynching_of_Thomas_Shipp_and_Abram_Smith",
        "title": "Lynching of Thomas Shipp and Abram Smith",
        "date": "March 3, 1960(1960-03-03) (aged 74)Marion, Indiana, U.S.",
        "year": "1960",
        "location": "",
        "state": "Indiana",
        "county": "Marion",
        "paragraph": "\nJ. Thomas Shipp and Abraham S. Smith were young African-American men who were murdered in a spectacle lynching by a mob of thousands on August 7, 1930, in Marion, Indiana. They were taken from jail cells, beaten, and hanged from a tree in the county courthouse square. They had been arrested that night as suspects in a robbery, murder and rape case. A third African-American suspect, 16-year-old James Cameron, had also been arrested and narrowly escaped being killed by the mob; an unknown woman and a local sports hero intervened, and he was returned to jail. Cameron later stated that Shipp and Smith had committed the murder but that he had run away before that event.[1]\nThe local chapter of the NAACP had tried, unsuccessfully, to evacuate the suspects from town to avoid the mob violence. The NAACP and the State's Attorney General pressed to indict leaders of the lynch mob, but, as was typical in lynchings, no one was ever charged for their deaths, nor for the attack on Cameron.[2]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Tompkins",
        "title": "Lynching of George Tompkins",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Indianapolis",
        "paragraph": "George Tompkins, a young Black man living in Indianapolis, was the victim of a racial terror lynching in 1922. His death was declared a suicide by white authorities, and no further investigation of the death was undertaken by authorities at the time. In March 2022, Tompkins was memorialized by the Indiana Remembrance Coalition and his death certificate was amended to reflect his death by homicide.\nGeorge Tompkins was born in 1902.[2] He migrated to Indianapolis from Frankfort, Kentucky in 1920. Prior to this move, he had resided with his great aunt and great uncle, Fannie and Robert Smith, since he had been placed in their care at nine months old. Upon moving to Indianapolis, Tompkins and his family first lived on Colton Street and eventually moved to Holborn Street, both locations now beneath the current IUPUI campus. Tompkins was employed at the Fairmount Glass Works.[3]\nGeorge Tompkins was found dead in Riverside Park around twelve o’clock in the afternoon on March 16, 1922. He was discovered bound to a tree by his neck with a length of rope, and had his hands bound behind his back. There was also evidence that Tompkins may have been dragged due to dirt on his body.[4] “Four or five small limbs” from the tree Tompkins was found on had been removed “apparently with a small pen knife,” a sign that Tompkins' killers had possibly taken them as souvenirs of their crime.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Ward",
        "title": "Lynching of George Ward",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Vigo County",
        "paragraph": "\nA mob of white Vigo County, Indiana residents lynched George Ward, a black man, on February 26, 1901 in Terre Haute, Indiana, for the suspected murder of a white woman. An example of a spectacle lynching, the event was public in nature and drew a crowd of over 1,000 white participants. Ward was dragged from a jail cell in broad daylight, struck in the back of the head with a sledgehammer, hanged from a bridge, and burned. His toes and the hobnails from his boots were collected as souvenirs. A grand jury was convened but no one was ever charged with the murder of Ward. It is the only known lynching in Vigo County. The lynching was memorialized 120 years later with a historical marker and ceremony.\nGeorge Ward was born in Kentucky, raised by his grandmother in Circleville, Ohio,[1] and moved to Terre Haute, Indiana around 1896.[2] Ward worked at the Filbeck Hotel as a porter, as a coal miner in nearby Seeleyville, and at the Terre Haute Car and Manufacturing Company. According to newspaper reports at the time of his death, Ward was considered by co-workers to be a good worker. He had a previous conviction for burglary and was jailed for 30 days in 1899.[1]\n"
    },
    {
        "link": "/wiki/Greenwood_Park_Mall_shooting",
        "title": "Greenwood Park Mall shooting",
        "date": "July 17, 2022 5:56 p.m. (EDT)",
        "year": "2022",
        "location": "Greenwood, Indiana, U.S.",
        "state": "Indiana",
        "county": "Greenwood",
        "paragraph": "\nOn July 17, 2022, a mass shooting occurred at the Greenwood Park Mall in Greenwood, Indiana, United States. The shooting occurred at 5:56 p.m. EDT (UTC−04:00) and lasted less than one minute. Three people were killed and two others were injured in the shooting[1] before the perpetrator, 20-year-old Jonathan Sapirman, was fatally shot by 22-year-old Elisjsha Dicken, a legally armed civilian bystander.[2]\nAround 4:55 p.m. on July 17, 2022, the perpetrator of the attack, Jonathan Sapirman, a local citizen from Greenwood, walked a mile from his apartment to the mall, carrying a SIG Sauer M400 semi-automatic rifle, a Smith & Wesson M&P15 AR-15 style semi-automatic rifle, a Glock 33 pistol, and over 100 rounds of ammunition. He went into a restroom near the mall's food court, and did not come out until an hour and two minutes later, at which point he started shooting.[3]\n"
    },
    {
        "link": "/wiki/Hamilton_Avenue_murders",
        "title": "Hamilton Avenue murders",
        "date": "June 1, 2006",
        "year": "2006",
        "location": "Indianapolis, Indiana",
        "state": "Indiana",
        "county": "Indianapolis",
        "paragraph": "\nThe Hamilton Avenue murders is the colloquial name for the mass murder of seven people in a house at 560 North Hamilton Avenue in Indianapolis, Indiana, on June 1, 2006.\nAccording to the television program America's Most Wanted, the Indianapolis Police Department responded to a 911 call just after 10:00 p.m. They found seven dead victims, three of whom were children. The victims were shot with a military-style weapon, police charged. Evidence technicians recovered 23 discharged 7.62x39mm cartridge casings from the scene. These cartridges accommodate high velocity bullets used in AK-47 and SKS-type rifles.[1]\n"
    },
    {
        "link": "/wiki/Indianapolis_FedEx_shooting",
        "title": "Indianapolis FedEx shooting",
        "date": "April 15, 2021 (2021-04-15) c. 11:00[1] – c. 11:04 p.m.[2] (UTC)",
        "year": "2021",
        "location": "Indianapolis, Indiana, U.S.",
        "state": "Indiana",
        "county": "Indianapolis",
        "paragraph": "\nOn April 15, 2021, a mass shooting occurred at a FedEx Ground facility in Indianapolis, Indiana, United States. Nine people were killed, including the gunman, 19 year-old former employee Brandon Scott Hole, who committed suicide. Seven others were injured, including four by gunfire.[1][4][5][6] It is the deadliest mass shooting in the history of Indiana.[2]\nThe FedEx facility where the shooting occurred is located in the southwestern part of the city, near Indianapolis International Airport.[7] The building is equipped with metal detectors and security turnstiles at its entrance requiring the employees to scan their FedEx badges.[8] There were at least 100 people in the facility at the time of the shooting, and many of them were changing shifts or on lunch breaks.[9][10]\n"
    },
    {
        "link": "/wiki/Evansville_race_riot",
        "title": "Evansville race riot",
        "date": "July 6 - 10, 1903",
        "year": "1903",
        "location": "Evansville, Indiana37°58′24.4″N 87°34′22.8″W﻿ / ﻿37.973444°N 87.573000°W﻿ / 37.973444; -87.573000Coordinates: 37°58′24.4″N 87°34′22.8″W﻿ / ﻿37.973444°N 87.573000°W﻿ / 37.973444; -87.573000",
        "state": "Indiana",
        "county": "Evansville",
        "paragraph": "Indiana National Guard  Evansville Police Department  Vanderburgh County Sheriff's Department\nThe Evansville Race Riot occurred in July 1903 in Evansville, Indiana and was the worst riot in the city's history. The riots occurred after a black man shot and killed a white policeman and ultimately resulted in 12 deaths.[1][2][3]\nOn July 3, an African-American man named Lee Brown, aka Robert Lee, had a dispute with another African-American man, Tom Berry, at a bar and attempted to return to the bar with a gun but was stopped by Louis N. Massey, the most senior policeman on the force. Massey attempted to arrest Brown but Brown shot and fatally wounded Massey, however Massey was able to fire back before dying, wounding Brown who eventually succumbed to injuries as well on July 31.[1][3] A mob of several thousand citizens (mostly all white) formed outside the Vanderburgh County Jail on July 6 and attempted to storm the jail with the intention of lynching Brown and 16 other black inmates. Around 200 militiamen then opened fire on the mob, killing and injuring several rioters. The crowd then began looting hardware stores of weapons and stormed into black neighborhoods in an attempt to expel black people from Evansville.[1][2][3][4] The rioting continued until July 10 and a total of 12 people died during the riot, with more than 40 others seriously wounded and about 2,000 of Evansville's 8,000 black residents fleeing the city.[5][1][4]\nIt is unclear as to whether the mob or the militia were to blame for the deaths. Several accounts describe the escalation as coming to a head after a rock was thrown by someone in the crowd, at the militia, who in turn fired warning shots which caused chaos.[6]\n"
    },
    {
        "link": "/wiki/Garfield_Park_riot_of_1919",
        "title": "Garfield Park riot of 1919",
        "date": "July 1919",
        "year": "1919",
        "location": "Garfield Park, Indianapolis, United States",
        "state": "Indiana",
        "county": "Garfield Park",
        "paragraph": "The Garfield Park riot of 1919 was a race riot that began in Garfield Park in Indianapolis, Indiana on July 14, 1919. Multiple people, including a seven-year-old girl, were wounded when gunfire broke out.\nAmidst racial tensions during the summer of 1919, a group of white youths in Indianapolis thought that they were being followed by groups of African-Americans. On July 14, 1919, hundreds of white boys 16 to 19 years old converged on Garfield Park. There they used bricks and clubs to beat any black people they came across. When a group of African-Americans took shelter in the house of Nathan Weather, a local black man, the white mob followed them and surrounded the house. Weather fired into the crowd in hopes of dispersing the mob. A seven-year-old onlooker, Charlotte Pieper, received a flesh wound from stray buckshot. Another youth, Paul Karbwitz, 18, was also hit. Police were eventually able to disperse the mob and quell the riot.[1]\nThis uprising was one of several incidents of civil unrest that began in the so-called American Red Summer of 1919. The Summer consisted of terrorist attacks on black communities, and white oppression in over three dozen cities and counties. In most cases, white mobs attacked African American neighborhoods. In some cases, black community groups resisted the attacks, especially in Chicago and Washington, D.C. Most deaths occurred in rural areas during events such as the Elaine Race Riot in Arkansas, where an estimated 100 to 240 black people and 5 white people were killed. Also occurring in 1919 were the Chicago Race Riot and the Washington D.C. race riot which killed 38 and 39 people, respectively, and with both having many more non-fatal injuries and extensive property damage reaching up into the millions of dollars.[2]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Indiana",
        "title": "George Floyd protests in Indiana",
        "date": "May 28, 2020 – July 2020",
        "year": "2020",
        "location": " Indiana, United States",
        "state": "Indiana",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Indiana, United States. As of July 2020, protests had occurred in at least 25 communities throughout the state.\nMore than 100 people attended a march through downtown and congregated at the Anderson Police Department headquarters on May 30. After midnight, a car window was broken and water bottles were thrown at police, but no injuries were reported.[1][2]\n"
    },
    {
        "link": "/wiki/Indianapolis_streetcar_strike_of_1913",
        "title": "Indianapolis streetcar strike of 1913",
        "date": "October 31, 1913 – November 7, 1913",
        "year": "1913",
        "location": "Indianapolis, Indiana",
        "state": "Indiana",
        "county": "Indianapolis",
        "paragraph": "\nThe Indianapolis streetcar strike of 1913 and the subsequent police mutiny and riots was a breakdown in public order in Indianapolis, Indiana. The events began as a workers strike by the union employees of the Indianapolis Traction & Terminal Company and their allies on Halloween night, October 31, 1913. The company was responsible for public transportation in Indianapolis, the capital city and transportation hub of the U.S. state of Indiana. The unionization effort was being organized by the Amalgamated Street Railway Employees of America who had successfully enforced strikes in other major United States cities. Company management suppressed the initial attempt by some of its employees to unionize and rejected an offer of mediation by the United States Department of Labor, which led to a rapid rise in tensions, and ultimately the strike. Government response to the strike was politically charged, as the strike began during the week leading up to public elections. The strike effectively shut down mass transit in the city and caused severe interruptions of statewide rail transportation and the 1913 city elections.\nA riot that lasted four days broke out on November 2 when strikebreakers attempted to restart transit services. At its height, eight to ten thousand rioters flooded downtown Indianapolis and vandalized the city's main business district. Numerous workers, strikebreakers, policemen, and bystanders were injured. Two strikebreakers and four union members were killed. The city police were unable to control the situation and refused orders to combat the rioters as the violence worsened. After pleas for help from city leaders following continued rioting on Election Day, Governor Samuel Ralston called out the Indiana National Guard and put the city under martial law on the evening of November 5.\n"
    },
    {
        "link": "/wiki/New_Castle_Correctional_Facility",
        "title": "New Castle Correctional Facility",
        "date": "",
        "year": "",
        "location": "1000 Van Nuys Road  New Castle, Indiana, U.S.",
        "state": "Indiana",
        "county": "",
        "paragraph": "New Castle Correctional Facility is a privately run (but state-owned) prison located in New Castle, Indiana, United States. It opened in 2002. In September 2005, the state signed a contract with the for-profit GEO Group, Inc. of Boca Raton, Florida, to run the prison. The facility is rated as minimum- to medium-security, but also has a maximum-security psychiatric unit and annex. It is currently the second-largest prison in Indiana, and can hold approximately 3,270 inmates.\nOn Tuesday, April 24, 2007, it was about noon when a disturbance in the prison dining hall occurred. A little after 2:00 p.m., the local New Castle police department responded en masse, as did forces from the Henry County Fire Department and Sheriff's Department. Sheriff's Deputies from adjacent Delaware County, along with elements of the Indiana State Police also responded.\nReportedly, it started with a cluster of Arizona prisoners transported there against their will consequent to a memorandum of understanding with the state of Arizona and GEO Group. They refused to wear state-issued smocks over T-shirts as a display of non-compliance during the midday meal. This is when Captain Deaton stepped in and tried to handcuff several offenders and was severely beaten by three inmates.\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Tucker",
        "title": "Lynching of John Tucker",
        "date": "July 4, 1845",
        "year": "1845",
        "location": "Indianapolis, Indiana",
        "state": "Indiana",
        "county": "Indianapolis",
        "paragraph": "John Tucker (born around 1800) was the victim of a racial terror lynching that took place on July 4, 1845, in downtown Indianapolis, Indiana. Tucker was a free Black man, a husband and a father, who was working as a farmer at the time of his death. Tucker was attacked and killed by three drunken white men in front of a crowd. Two of the men were arrested for Tucker's murder, but only one was convicted.\nIn his early life, John Tucker was enslaved in Kentucky. Tucker obtained his freedom and relocated to Indianapolis. At the time of his death, he and his wife were the parents of two young children, Mary and William. The family lived \"in a house near the intersection of St. Clair and Delaware Streets\" in downtown Indianapolis. Tucker worked as a farmer for City Postmaster Samuel Henderson.[1]\nOn the afternoon of July 4, 1845, John Tucker was lynched in downtown Indianapolis. Finding himself being accosted by a drunken white man, Nicholas Wood, Tucker began to walk toward the Indianapolis Magistrate's office to seek help. But Wood was soon joined by two other white men, William Ballenger (a saloon owner) and Edward Davis.[1] According to the Indiana State Sentinel, an Indiana newspaper that covered the lynching, the assailants attacked Tucker with clubs, stones, and brickbats.[2] The minister of Second Presbyterian Church, located very near the site of Tucker's death, Reverend Henry Ward Beecher, wrote that Tucker \"defended himself with desperate determination\" during the attack.[1] While a few people attempted to \"separate Tucker from his assaulters,\" a large crowd gathered who cheered for Tucker's death.[1] Those involved continued to beat Tucker after he was already dead.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_James_Dillard",
        "title": "Lynching of James Dillard",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Indianapolis",
        "paragraph": "In November 1902, a white mob from Sullivan and Knox counties lynched James Dillard, a young Black man from Indianapolis. Dillard's death resulted in a lengthy legal battle over Indiana's 1899 anti-lynching law. \nJames Dillard and his mother moved from Tennessee to Indianapolis in 1895.[1] In Indianapolis, Dillard worked a variety of jobs including being a porter at the Columbia Club and at Young’s Billiard Room.[2] At the time of his death, Dillard was in his twenties. He had left Indianapolis in the spring of 1901 and it is unknown why he was in Sullivan County.[1]\nIn November 1902, residents in Sullivan and Knox counties accused James Dillard of assaulting two white women, the wives of Milton Davis and John Lemon.[2][3] On November 19, police apprehended Dillard in Lawrenceville, Illinois, shooting him three times in the process.[2][4] After police arrested Dillard, they transported him to Sullivan.[4] While being transported, a mob of approximately 50 local farmers gathered in the area, causing the Sullivan County sheriff, John S. Dudley, to invoke Indiana's 1899 anti-lynching law by requesting that Governor Winfield Durbin send in militia.[5][6][4] The militia was sent from Vincennes, many miles south of the mob and too far away to make it before Dudley conceded Dillard to the mob.[4]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Johnson,_Squire_Taylor,_and_Charles_Davis",
        "title": "Lynching of George Johnson, Squire Taylor, and Charles Davis",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Charlestown",
        "paragraph": "George Johnson, Squire Taylor, and Charles Davis, were three Black men who were killed in a spectacle lynching in 1871 in Charlestown, Indiana. They were memorialized in 2022.\nA white mob lynched George Johnson, Squire Taylor, and Charles Davis, all Black men, in Charlestown, Clark County, Indiana, in 1871.[1] The three men were accused of killing the family of Cyprus Park, a farmer who lived near Henryville, Indiana. A neighbor near the Parks family believed that he was also a target but managed to keep the assailants out of his home. The neighbor believed that the assailants were white. Even so, George Johnson, a Black man, was arrested on suspicion of committing the murders and was tortured until he confessed. He also gave out the names of two other Black men, Squire Taylor, and Charles Davis. These men were then arrested. The trial followed quite quickly. The grand jury declared the men not guilty based on the lack of evidence, but the men remained in custody and were sent to a Charlestown jail.[1]\nSoon after arrival, a white mob gathered and took the three men from the jail. The mob then hanged all three men and tortured Squire Taylor before he was killed. The guilt of the men in question was viewed as highly dubious by some at the time. Information about this spectacle lynching was released only a year later in a pamphlet titled, “Murder and Mob Law in Indiana,”  by James Hiatt. The author decried the lack of proof of the Black men's guilt and acknowledged the overwhelming evidence of their innocence.[2] No one was charged or arrested for the murder of these men even though the family came forward with names of suspects and filed a law suit against the sheriff involved. The actions of the white mob led the Indiana governor at the time, Conrad Baker, to call for the suppression of illegal organizations. Referring to the Enforcement Act of 1870, adopted during Reconstruction, Baker proposed that the U.S. Federal government could be asked to intervene to stop the actions of mobs that terrorized Black people. The Indiana government, however, did not follow through on that proposal and mob violence continued.[3]\n"
    },
    {
        "link": "/wiki/Edmund_Kayser",
        "title": "Edmund Kayser",
        "date": "August 25, 1915 (40-years-old)Tolleston, Indiana",
        "year": "1915",
        "location": "",
        "state": "Indiana",
        "county": "Tolleston",
        "paragraph": "Pastor Edmund Kayser of St. James' Evangelical Lutheran Church in Tolleston, Indiana, was assassinated on August 25, 1916, for his pro-German views during World War I.[1]\nWorld War I had started on July 28, 1914, when the Austro-Hungarian Empire declared war on Serbia. By 1916, nearly all of the European nations and empires had entered the war. The United States maintained its neutrality, and some of its sizeable German population supported Imperial Germany and its Axis of Central Powers that was fighting the Entente Powers. In the 1910 census there were 2.3 million German-born immigrants living in the United States and 550 German newspapers in the country.[2] The large number of German-Americans was also a factor in keeping America out of World War I until the fighting had been going on for three years.[3]\nEdmund Kayser was born in Bavaria.[4] He moved to the United States and established an independent Lutheran church that paid him $50 ($1,245 in 2023) a month. It was said that he had other sources of income buying and selling land.[5]\n"
    },
    {
        "link": "/wiki/Lynching_of_William_Keemer",
        "title": "Lynching of William Keemer",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Greenfield",
        "paragraph": "William Keemer was the victim of a racial terror spectacle lynching in 1875 in Greenfield, Indiana.[1] Keemer, a Black man, was dragged from his jail cell in Hancock County, Indiana on June 25, 1875 by a white mob from Hancock, Shelby, and Rush counties. Keemer was hung at the Hancock County fairgrounds and over 1,000 people traveled to view the body.[2][3][4] Keemer was arrested on June 24 for an alleged sexual assault against a white women in Carthage, Indiana. No trial was held for the alleged crime and William Keemer remains innocent.[3][5] In 2021 a historical marker commemorating the anti-Black violence committed against Keemer was approved by the Indiana Historical Bureau.[6]\nWilliam Keemer was born in 1849. The location is unknown, but he had a brother, James, who was born in 1850 in Ohio.[4] According to James’ death certificate, their parents were born in Kentucky and his mother’s maiden name was Flood.[7] Keemer's father, James H. Keemer, served in the Civil War from 1865-1866 and was a resident of the Beech Settlement, an early Black rural community, in Carthage, Indiana.[8] William Keemer was also a resident of the Beech Settlement and by the time of his death, the population there was declining.[2] William worked as a carpenter for Charles S. Wiltsie, who was the prosecuting attorney for Marion County, Indiana.[8] In 1875, William was not known to have any children.[6]\nWilliam Keemer was lynched on the night of June 25, 1875. A mob of 150 to 160 white, masked individuals gathered outside the Hancock County Jail in Greenfield, that evening, demanding a spectacle lynching.[2][3][9] The mob restrained the sheriff in order to force entry into the jail and met resistance from Keemer. The mob then took Keemer from his jail cell to the Hancock County fairground where they hung him from a structure.[3][4] His body remained there until the morning of June 26. On Keemer’s back, a note was found that read, “It is the verdict of 160 men of Hancock, Shelby and Rush, that this life is inadequate to meet the demands of justice.”[3][9] Keemer’s body was taken to the Wills and Pratt, a funeral parlor, with the noose still around his neck. Over 1,000 people came to view the body.[4] On Sunday, June 27, Keemer’s body was buried in an unmarked grave in a potter’s field.[3][4][6]\n"
    },
    {
        "link": "/wiki/Lynching_in_Posey_County,_Indiana",
        "title": "Lynching in Posey County, Indiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Sr.",
        "paragraph": "On October 11, 1878, Jim Good, Jeff Hopkins, Ed Warner, William Chambers, and Dan Harris, Sr. were lynched in Posey County, Indiana, near the town of Mount Vernon.[1] These men, who were allegedly connected to the robbery of a brothel, were killed by a white mob who broke into the jail where they were being held. Two other men, Dan Harris, Jr. and John Harris, were also lynched in the days leading up to October 11, in connection with the same alleged offense. This racial terror lynching is the largest reported lynching in Indiana's history.[2]\nOn October 7, 1878, Mount Vernon newspapers reported that a group of Black men had robbed a group of white women working as sex workers at a brothel near Mount Vernon, Indiana in Posey County.[3][4][5][6] Law enforcement officers listed Jim Good, Jeff Hopkins, Ed Warner, William Chambers, John Harris, and Dan Harris, Jr. as suspects, and began to search for them.\nOfficers arrested Good, Hopkins, Warner, and Chambers, and brought them to jail to await trial. White mobs lynched two men, Dan Harris, Jr. and John Harris, before officers could locate them.[3] Officers were unaware of this when they went to the Mount Vernon home of Harris, Jr.'s father, Dan Harris, Sr. When they arrived, intending to arrest Dan Harris, Jr., Harris, Sr. informed them that his son had already been lynched the day before. The officers accused Harris, Sr. of harboring his son within the home. When officers attempted to forcefully enter, Harris, Sr. shot Deputy Sheriff Cyrus Thomas with a shotgun. The city marshal shot back, wounding Harris, Sr. before taking him into custody at the same jail as Good, Hopkins, Warner, and Chambers. Deputy Sheriff Thomas died at the scene.[7][8]\n"
    },
    {
        "link": "/wiki/Lynching_of_Joe_Holly,_Bud_Rowland,_and_Jim_Henderson",
        "title": "Lynching of Joe Holly, Bud Rowland, and Jim Henderson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Rockport",
        "paragraph": "Bud Rowland and Jim Henderson, two Black men, were lynched in Rockport, Indiana on December 16, 1900.[1] The following day, Joe Holly was lynched in Boonville, Indiana for the same alleged crime. [2]\nOn December 16, 1900, Bud Rowland and Jim Henderson, two Black men, were arrested for the murder of a white barber, Hollie L. Simmons in Rockport, Indiana. He was reportedly jumped by two men and was bashed across the skull with a nail-covered club.[1] The news of the murder spread through town, and suspects were quickly identified that same night. Of those who were questioned, Henderson and Rowland were arrested in Rockport.\nShortly after authorities placed Rowland and Henderson in the local jail, a large group of angry white people used sledgehammers and a broken telegraph pole to ram into the jail.[2] While the mob was getting ready to hang Rowland, he said that he had one more accomplice named ‘Crowfoot’. The white crowd first pulled Rowland out of his cell and hanged him from a tree on the east side of the courthouse, before shooting his body with bullets.[2] The group returned to retrieve Henderson from his cell. They shot him in his cell, dragged him across the courtyard, and hanged him next to Rowland.[1]\n"
    },
    {
        "link": "/wiki/Posey_County,_Indiana,_lynchings",
        "title": "Posey County, Indiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Posey County",
        "paragraph": "\nPosey County is the southernmost, southwesternmost, and westernmost county in the U.S. state of Indiana. Its southern border is formed by the Ohio River, and its western border by the Wabash River, a tributary to the Ohio. As of 2010, the population was 25,910.[1] The county seat is Mount Vernon.[2]\nPosey County is part of the Evansville, IN–KY Metropolitan Statistical Area. The Ports of Indiana-Mt. Vernon, on the Ohio River, is the seventh largest inland port complex in the nation. Mechanization of dock technology has altered the number of workers at the port, but Posey County is still the seventh-largest internal port in the United States, based on the tons of materials handled. Grain from the Midwest is among the products shipped.\n"
    },
    {
        "link": "/wiki/Reno_Gang",
        "title": "Reno Gang",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "county": "Canada",
        "paragraph": "The Reno Gang, also known as the Reno Brothers Gang and The Jackson Thieves, were a group of criminals that operated in the Midwestern United States during and just after the American Civil War. Though short-lived, the gang carried out the first three peacetime train robberies in U.S. history. Most of the stolen money was never recovered.\nThe gang was broken up by the lynchings of ten of its members by vigilante mobs in 1868. The murders created an international diplomatic incident with Canada and Great Britain, a general public uproar, and international newspaper coverage. No one was ever identified or prosecuted for the lynchings.\nThe Reno Brothers have been portrayed in at least three films, including Elvis Presley's film debut in Love Me Tender (1956), in which he starred as Clint Reno, and Rage at Dawn (1955), featuring Randolph Scott.\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Scott",
        "title": "Lynching of George Scott",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Clay County",
        "paragraph": "In the early hours of December 12, 1880, a white mob in Clay County, Indiana lynched George Scott, an African American man. Scott had fled after being accused of a crime in nearby Eaglesfield, Indiana, and was captured near Indianapolis and brought to the Clay County jail in Brazil, Indiana.[1] Rumors swirled that a mob might form, but the local Sheriff, James Lankford, paid them no heed. However, the man left in charge of the jail, ex-Sheriff Jacob Baumunk, took the precaution of giving the keys to Sheriff Lankford, who would not be on-site at the jail, after locking up.[2] Sometime between one and three in the morning on Sunday, December 12, a mob of over 100 men, masked, descended on the jail and demanded that Baumunk give them the keys.[1][3] After informing the mob that he did not have the keys, he was told to “retire to his room.”[2]\nAfter Baumunk removed himself, the mob began to attack the jail with sledgehammers and the like in order to reach Scott’s cell. Between three and four in the morning, Scott was removed from his cell by the mob who took him to a nearby oak tree, where he was hanged. Scott’s body remained there until he was discovered by the Clay County Coroner, Dr. George Pell, who transported Scott’s body to the courthouse around seven in the morning.[2] Prior to this, Scott’s hanged body had been viewed by “several thousand” individuals. After his body was transported to the courthouse, it was “exhibited for public inspection” before finally being released to family members near Indianapolis.[1]\nThis crime-related article is a stub. You can help Wikipedia by expanding it."
    },
    {
        "link": "/wiki/Lynching_of_Thomas_Shipp_and_Abram_Smith",
        "title": "Lynching of Thomas Shipp and Abram Smith",
        "date": "March 3, 1960(1960-03-03) (aged 74)Marion, Indiana, U.S.",
        "year": "1960",
        "location": "",
        "state": "Indiana",
        "county": "Marion",
        "paragraph": "\nJ. Thomas Shipp and Abraham S. Smith were young African-American men who were murdered in a spectacle lynching by a mob of thousands on August 7, 1930, in Marion, Indiana. They were taken from jail cells, beaten, and hanged from a tree in the county courthouse square. They had been arrested that night as suspects in a robbery, murder and rape case. A third African-American suspect, 16-year-old James Cameron, had also been arrested and narrowly escaped being killed by the mob; an unknown woman and a local sports hero intervened, and he was returned to jail. Cameron later stated that Shipp and Smith had committed the murder but that he had run away before that event.[1]\nThe local chapter of the NAACP had tried, unsuccessfully, to evacuate the suspects from town to avoid the mob violence. The NAACP and the State's Attorney General pressed to indict leaders of the lynch mob, but, as was typical in lynchings, no one was ever charged for their deaths, nor for the attack on Cameron.[2]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Tompkins",
        "title": "Lynching of George Tompkins",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Indianapolis",
        "paragraph": "George Tompkins, a young Black man living in Indianapolis, was the victim of a racial terror lynching in 1922. His death was declared a suicide by white authorities, and no further investigation of the death was undertaken by authorities at the time. In March 2022, Tompkins was memorialized by the Indiana Remembrance Coalition and his death certificate was amended to reflect his death by homicide.\nGeorge Tompkins was born in 1902.[2] He migrated to Indianapolis from Frankfort, Kentucky in 1920. Prior to this move, he had resided with his great aunt and great uncle, Fannie and Robert Smith, since he had been placed in their care at nine months old. Upon moving to Indianapolis, Tompkins and his family first lived on Colton Street and eventually moved to Holborn Street, both locations now beneath the current IUPUI campus. Tompkins was employed at the Fairmount Glass Works.[3]\nGeorge Tompkins was found dead in Riverside Park around twelve o’clock in the afternoon on March 16, 1922. He was discovered bound to a tree by his neck with a length of rope, and had his hands bound behind his back. There was also evidence that Tompkins may have been dragged due to dirt on his body.[4] “Four or five small limbs” from the tree Tompkins was found on had been removed “apparently with a small pen knife,” a sign that Tompkins' killers had possibly taken them as souvenirs of their crime.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Ward",
        "title": "Lynching of George Ward",
        "date": "",
        "year": "",
        "location": "",
        "state": "Indiana",
        "county": "Vigo County",
        "paragraph": "\nA mob of white Vigo County, Indiana residents lynched George Ward, a black man, on February 26, 1901 in Terre Haute, Indiana, for the suspected murder of a white woman. An example of a spectacle lynching, the event was public in nature and drew a crowd of over 1,000 white participants. Ward was dragged from a jail cell in broad daylight, struck in the back of the head with a sledgehammer, hanged from a bridge, and burned. His toes and the hobnails from his boots were collected as souvenirs. A grand jury was convened but no one was ever charged with the murder of Ward. It is the only known lynching in Vigo County. The lynching was memorialized 120 years later with a historical marker and ceremony.\nGeorge Ward was born in Kentucky, raised by his grandmother in Circleville, Ohio,[1] and moved to Terre Haute, Indiana around 1896.[2] Ward worked at the Filbeck Hotel as a porter, as a coal miner in nearby Seeleyville, and at the Terre Haute Car and Manufacturing Company. According to newspaper reports at the time of his death, Ward was considered by co-workers to be a good worker. He had a previous conviction for burglary and was jailed for 30 days in 1899.[1]\n"
    },
    {
        "link": "/wiki/Newton_County_John_Does",
        "title": "Newton County John Does",
        "date": "c. May 29, 1983 (aged 19)Lake Village, Newton County, Indiana",
        "year": "1983",
        "location": "",
        "state": "Indiana",
        "county": "Lake Village",
        "paragraph": "The Newton County John Does are two young murder victims whose remains were discovered by mushroom foragers in Lake Village, Newton County, Indiana, on October 18, 1983.[1] Both victims were discovered alongside two other murder victims whose bodies were identified within months of their discovery. All four were victims of the serial killer Larry Eyler.\nNumerous efforts have been made to discover the identity of the Newton County John Does, including forensic facial reconstructions generated by a forensic anthropologist, depicting how each decedent may have appeared in life. The National Center for Missing and Exploited Children has also created detailed composite drawings of the decedents.[2] Furthermore, DNA was extracted from both decedents for genetic testing against the DNA of any individual who may be related to them.[3]\nThese decedents are collectively known as the Newton County John Does due to the name of the county in which their bodies were discovered.[4] They are individually known as Adam and Brad; names given by Newton County coroner Scott McCord decades after their murders in an effort to individualize and humanize the victims.[1][5]\n"
    }
]