[
    {
        "link": "/wiki/Greenwood_Park_Mall_shooting",
        "title": "Greenwood Park Mall shooting",
        "date": "July 17, 2022 5:56 p.m. (EDT)",
        "location": "Greenwood, Indiana, U.S.",
        "paragraph": "\nOn July 17, 2022, a mass shooting occurred at the Greenwood Park Mall in Greenwood, Indiana, United States. The shooting occurred at 5:56 p.m. EDT (UTC−04:00) and lasted less than one minute. Three people were killed and two others were injured in the shooting[1] before the perpetrator, 20-year-old Jonathan Sapirman, was fatally shot by 22-year-old Elisjsha Dicken, a legally armed civilian bystander.[2]\n"
    },
    {
        "link": "/wiki/Grandview_Apostolic_Church",
        "title": "Grandview Apostolic Church",
        "date": "",
        "location": "",
        "paragraph": "Grandview Apostolic Church was a historic church building in Brown County, Indiana, United States.  Built in 1892 along Grandview Ridge Road near the community of New Bellsville,[1] it lay in far eastern Van Buren Township.[2]  The church was a frame structure with a facade that featured a steeple,[3] while the interior consisted of only a single room.[4]\nA part of the denomination known as the Apostolic Church,[5] Grandview Apostolic was the second oldest existing church building in Brown County.[6]  It closed during the twentieth century, but a congregation was restarted there in the early 1990s, and the building remained in active use by that congregation until 2010.[7]  In 1991, the church building and two related structures, plus the cemetery, were added to the National Register of Historic Places because of their place in local history and because of their well-preserved historic architecture.[1]  Such a distinction is unusual; both cemeteries and religious properties must pass higher hurdles than most other types of properties in order to qualify for inclusion on the National Register.[8]\n"
    },
    {
        "link": "/wiki/Jeffries_Ford_Covered_Bridge",
        "title": "Jeffries Ford Covered Bridge",
        "date": "",
        "location": "",
        "paragraph": "The Jeffries Ford Covered Bridge was southwest of Bridgeton, Indiana, United States. The double-span Burr Arch covered bridge structure was built by J. A. Britton in 1915 and destroyed by arson on April 2, 2002.[1]\nAt the time the Jeffries Ford Bridge was built Joseph A. Britton was 75 years old. Throughout his years as a bridge builder Britton had been assisted by his family and this bridge was no different, some of his sons, four by his first wife and five by his second, would have done the actual construction work. His son Eugene Britton built the Bowsher Ford Covered Bridge the same year.[3]\n"
    },
    {
        "link": "/wiki/Snyderman_House",
        "title": "Snyderman House",
        "date": "",
        "location": "",
        "paragraph": "The Snyderman House was a spectacular, widely published single-family residence in Fort Wayne, Indiana, designed for Sanford and Joy Snyderman in 1972 by architect Michael Graves. Celebrated in both the architectural and popular press as a tour-de-force of late modernism, it was a splendid example of Graves' imaginative, sophisticated work. It stood, along with Graves' Hanselman House, Richard Meier's New Harmony Athenaeum —which was related to the Snyderman House—and the buildings of Columbus, Indiana, as national icons of modern architecture located in the state of Indiana (Graves' home state).\nIn her feature article on the Snyderman House in Progressive Architecture, Suzanne Stephens wrote in 1978 that \"Because of the house's successful fragments and particular spaces, because of its manner of referring back to previous work as well as anticipating that which is to come, it will probably occupy a prominent place in the history of Michael Graves' oeuvre.\"\n"
    },
    {
        "link": "/wiki/Wilbur_Wynant_House",
        "title": "Wilbur Wynant House",
        "date": "",
        "location": "600 Fillmore St., Gary, Indiana",
        "paragraph": "The Wilbur Wynant House (also known as 600 Fillmore or simply the Wynant House) was a house designed by architect Frank Lloyd Wright in Gary, Indiana, United States. During the end of the house's lifespan it was in poor condition; in the mid-2000s it was purchased by a man who planned to restore it, but it was destroyed by fire on January 9, 2006.[2]\nOn January 9, 2006, the Wynant House burned.[2] Officials suspect arson as the cause of this unexpected fire.[3] The remaining structure was subsequently razed and the lot was confirmed to be vacant in November 2012.\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Tucker",
        "title": "Lynching of John Tucker",
        "date": "July 4, 1845",
        "location": "Indianapolis, Indiana",
        "paragraph": "John Tucker (born around 1800) was the victim of a racial terror lynching that took place on July 4, 1845, in downtown Indianapolis, Indiana. Tucker was a free Black man, a husband and a father, who was working as a farmer at the time of his death. Tucker was attacked and killed by three drunken white men in front of a crowd. Two of the men were arrested for Tucker's murder, but only one was convicted.\nIn his early life, John Tucker was enslaved in Kentucky. Tucker obtained his freedom and relocated to Indianapolis. At the time of his death, he and his wife were the parents of two young children, Mary and William. The family lived \"in a house near the intersection of St. Clair and Delaware Streets\" in downtown Indianapolis. Tucker worked as a farmer for City Postmaster Samuel Henderson.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_James_Dillard",
        "title": "Lynching of James Dillard",
        "date": "",
        "location": "",
        "paragraph": "In November 1902, a white mob from Sullivan and Knox counties lynched James Dillard, a young Black man from Indianapolis. Dillard's death resulted in a lengthy legal battle over Indiana's 1899 anti-lynching law. \nJames Dillard and his mother moved from Tennessee to Indianapolis in 1895.[1] In Indianapolis, Dillard worked a variety of jobs including being a porter at the Columbia Club and at Young’s Billiard Room.[2] At the time of his death, Dillard was in his twenties. He had left Indianapolis in the spring of 1901 and it is unknown why he was in Sullivan County.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Johnson,_Squire_Taylor,_and_Charles_Davis",
        "title": "Lynching of George Johnson, Squire Taylor, and Charles Davis",
        "date": "",
        "location": "",
        "paragraph": "George Johnson, Squire Taylor, and Charles Davis, were three Black men who were killed in a spectacle lynching in 1871 in Charlestown, Indiana. They were memorialized in 2022.\nA white mob lynched George Johnson, Squire Taylor, and Charles Davis, all Black men, in Charlestown, Clark County, Indiana, in 1871.[1] The three men were accused of killing the family of Cyprus Park, a farmer who lived near Henryville, Indiana. A neighbor near the Parks family believed that he was also a target but managed to keep the assailants out of his home. The neighbor believed that the assailants were white. Even so, George Johnson, a Black man, was arrested on suspicion of committing the murders and was tortured until he confessed. He also gave out the names of two other Black men, Squire Taylor, and Charles Davis. These men were then arrested. The trial followed quite quickly. The grand jury declared the men not guilty based on the lack of evidence, but the men remained in custody and were sent to a Charlestown jail.[1]\n"
    },
    {
        "link": "/wiki/Edmund_Kayser",
        "title": "Edmund Kayser",
        "date": "",
        "location": "",
        "paragraph": "Pastor Edmund Kayser of St. James' Evangelical Lutheran Church in Tolleston, Indiana, was assassinated on August 25, 1916, for his pro-German views during World War I.[1]\nWorld War I had started on July 28, 1914, when the Austro-Hungarian Empire declared war on Serbia. By 1916, nearly all of the European nations and empires had entered the war. The United States maintained its neutrality, and some of its sizeable German population supported Imperial Germany and its Axis of Central Powers that was fighting the Entente Powers. In the 1910 census there were 2.3 million German-born immigrants living in the United States and 550 German newspapers in the country.[2] The large number of German-Americans was also a factor in keeping America out of World War I until the fighting had been going on for three years.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_William_Keemer",
        "title": "Lynching of William Keemer",
        "date": "",
        "location": "",
        "paragraph": "William Keemer was the victim of a racial terror spectacle lynching in 1875 in Greenfield, Indiana.[1] Keemer, a Black man, was dragged from his jail cell in Hancock County, Indiana on June 25, 1875 by a white mob from Hancock, Shelby, and Rush counties. Keemer was hung at the Hancock County fairgrounds and over 1,000 people traveled to view the body.[2][3][4] Keemer was arrested on June 24 for an alleged sexual assault against a white women in Carthage, Indiana. No trial was held for the alleged crime and William Keemer remains innocent.[3][5] In 2021 a historical marker commemorating the anti-Black violence committed against Keemer was approved by the Indiana Historical Bureau.[6]\nWilliam Keemer was born in 1849. The location is unknown, but he had a brother, James, who was born in 1850 in Ohio.[4] According to James’ death certificate, their parents were born in Kentucky and his mother’s maiden name was Flood.[7] Keemer's father, James H. Keemer, served in the Civil War from 1865-1866 and was a resident of the Beech Settlement, an early Black rural community, in Carthage, Indiana.[8] William Keemer was also a resident of the Beech Settlement and by the time of his death, the population there was declining.[2] William worked as a carpenter for Charles S. Wiltsie, who was the prosecuting attorney for Marion County, Indiana.[8] In 1875, William was not known to have any children.[6]\n"
    },
    {
        "link": "/wiki/Lynching_in_Posey_County,_Indiana",
        "title": "Lynching in Posey County, Indiana",
        "date": "",
        "location": "",
        "paragraph": "On October 11, 1878, Jim Good, Jeff Hopkins, Ed Warner, William Chambers, and Dan Harris, Sr. were lynched in Posey County, Indiana, near the town of Mount Vernon.[1] These men, who were allegedly connected to the robbery of a brothel, were killed by a white mob who broke into the jail where they were being held. Two other men, Dan Harris, Jr. and John Harris, were also lynched in the days leading up to October 11, in connection with the same alleged offense. This racial terror lynching is the largest reported lynching in Indiana's history.[2]\nOn October 7, 1878, Mount Vernon newspapers reported that a group of Black men had robbed a group of white women working as sex workers at a brothel near Mount Vernon, Indiana in Posey County.[3][4][5][6] Law enforcement officers listed Jim Good, Jeff Hopkins, Ed Warner, William Chambers, John Harris, and Dan Harris, Jr. as suspects, and began to search for them.\n"
    },
    {
        "link": "/wiki/Lynching_of_Joe_Holly,_Bud_Rowland,_and_Jim_Henderson",
        "title": "Lynching of Joe Holly, Bud Rowland, and Jim Henderson",
        "date": "",
        "location": "",
        "paragraph": "Bud Rowland and Jim Henderson, two Black men, were lynched in Rockport, Indiana on December 16, 1900.[1] The following day, Joe Holly was lynched in Boonville, Indiana for the same alleged crime. [2]\nOn December 16, 1900, Bud Rowland and Jim Henderson, two Black men, were arrested for the murder of a white barber, Hollie L. Simmons in Rockport, Indiana. He was reportedly jumped by two men and was bashed across the skull with a nail-covered club.[1] The news of the murder spread through town, and suspects were quickly identified that same night. Of those who were questioned, Henderson and Rowland were arrested in Rockport.\n"
    },
    {
        "link": "/wiki/Posey_County,_Indiana,_lynchings",
        "title": "Posey County, Indiana",
        "date": "",
        "location": "",
        "paragraph": "\nPosey County is the southernmost, southwesternmost, and westernmost county in the U.S. state of Indiana. Its southern border is formed by the Ohio River, and its western border by the Wabash River, a tributary to the Ohio. As of 2010, the population was 25,910.[1] The county seat is Mount Vernon.[2]\n"
    },
    {
        "link": "/wiki/Reno_Gang",
        "title": "Reno Gang",
        "date": "",
        "location": "",
        "paragraph": "The Reno Gang, also known as the Reno Brothers Gang and The Jackson Thieves, were a group of criminals that operated in the Midwestern United States during and just after the American Civil War. Though short-lived, the gang carried out the first three peacetime train robberies in U.S. history. Most of the stolen money was never recovered.\nThe gang was broken up by the lynchings of ten of its members by vigilante mobs in 1868. The murders created an international diplomatic incident with Canada and Great Britain, a general public uproar, and international newspaper coverage. No one was ever identified or prosecuted for the lynchings.\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Scott",
        "title": "Lynching of George Scott",
        "date": "",
        "location": "",
        "paragraph": "In the early hours of December 12, 1880, a white mob in Clay County, Indiana lynched George Scott, an African American man. Scott had fled after being accused of a crime in nearby Eaglesfield, Indiana, and was captured near Indianapolis and brought to the Clay County jail in Brazil, Indiana.[1] Rumors swirled that a mob might form, but the local Sheriff, James Lankford, paid them no heed. However, the man left in charge of the jail, ex-Sheriff Jacob Baumunk, took the precaution of giving the keys to Sheriff Lankford, who would not be on-site at the jail, after locking up.[2] Sometime between one and three in the morning on Sunday, December 12, a mob of over 100 men, masked, descended on the jail and demanded that Baumunk give them the keys.[1][3] After informing the mob that he did not have the keys, he was told to “retire to his room.”[2]\nAfter Baumunk removed himself, the mob began to attack the jail with sledgehammers and the like in order to reach Scott’s cell. Between three and four in the morning, Scott was removed from his cell by the mob who took him to a nearby oak tree, where he was hanged. Scott’s body remained there until he was discovered by the Clay County Coroner, Dr. George Pell, who transported Scott’s body to the courthouse around seven in the morning.[2] Prior to this, Scott’s hanged body had been viewed by “several thousand” individuals. After his body was transported to the courthouse, it was “exhibited for public inspection” before finally being released to family members near Indianapolis.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_Thomas_Shipp_and_Abram_Smith",
        "title": "Lynching of Thomas Shipp and Abram Smith",
        "date": "",
        "location": "",
        "paragraph": "\nJ. Thomas Shipp and Abraham S. Smith were young African-American men who were murdered in a spectacle lynching by a mob of thousands on August 7, 1930, in Marion, Indiana. They were taken from jail cells, beaten, and hanged from a tree in the county courthouse square. They had been arrested that night as suspects in a robbery, murder and rape case. A third African-American suspect, 16-year-old James Cameron, had also been arrested and narrowly escaped being killed by the mob; an unknown woman and a local sports hero intervened, and he was returned to jail. Cameron later stated that Shipp and Smith had committed the murder but that he had run away before that event.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Tompkins",
        "title": "Lynching of George Tompkins",
        "date": "",
        "location": "",
        "paragraph": "George Tompkins, a young Black man living in Indianapolis, was the victim of a racial terror lynching in 1922. His death was declared a suicide by white authorities, and no further investigation of the death was undertaken by authorities at the time. In March 2022, Tompkins was memorialized by the Indiana Remembrance Coalition and his death certificate was amended to reflect his death by homicide.\nGeorge Tompkins was born in 1902.[2] He migrated to Indianapolis from Frankfort, Kentucky in 1920. Prior to this move, he had resided with his great aunt and great uncle, Fannie and Robert Smith, since he had been placed in their care at nine months old. Upon moving to Indianapolis, Tompkins and his family first lived on Colton Street and eventually moved to Holborn Street, both locations now beneath the current IUPUI campus. Tompkins was employed at the Fairmount Glass Works.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Ward",
        "title": "Lynching of George Ward",
        "date": "",
        "location": "",
        "paragraph": "\nA mob of white Vigo County, Indiana residents lynched George Ward, a black man, on February 26, 1901 in Terre Haute, Indiana, for the suspected murder of a white woman. An example of a spectacle lynching, the event was public in nature and drew a crowd of over 1,000 white participants. Ward was dragged from a jail cell in broad daylight, struck in the back of the head with a sledgehammer, hanged from a bridge, and burned. His toes and the hobnails from his boots were collected as souvenirs. A grand jury was convened but no one was ever charged with the murder of Ward. It is the only known lynching in Vigo County. The lynching was memorialized 120 years later with a historical marker and ceremony.\n"
    },
    {
        "link": "/wiki/Greenwood_Park_Mall_shooting",
        "title": "Greenwood Park Mall shooting",
        "date": "July 17, 2022 5:56 p.m. (EDT)",
        "location": "Greenwood, Indiana, U.S.",
        "paragraph": "\nOn July 17, 2022, a mass shooting occurred at the Greenwood Park Mall in Greenwood, Indiana, United States. The shooting occurred at 5:56 p.m. EDT (UTC−04:00) and lasted less than one minute. Three people were killed and two others were injured in the shooting[1] before the perpetrator, 20-year-old Jonathan Sapirman, was fatally shot by 22-year-old Elisjsha Dicken, a legally armed civilian bystander.[2]\n"
    },
    {
        "link": "/wiki/Hamilton_Avenue_murders",
        "title": "Hamilton Avenue murders",
        "date": "June 1, 2006",
        "location": "Indianapolis, Indiana",
        "paragraph": "\nThe Hamilton Avenue murders is the colloquial name for the mass murder of seven people in a house at 560 North Hamilton Avenue in Indianapolis, Indiana, on June 1, 2006.\n"
    },
    {
        "link": "/wiki/Indianapolis_FedEx_shooting",
        "title": "Indianapolis FedEx shooting",
        "date": "April 15, 2021 (2021-04-15) c. 11:00[1] – c. 11:04 p.m.[2] (UTC)",
        "location": "Indianapolis, Indiana, U.S.",
        "paragraph": "\nOn April 15, 2021, a mass shooting occurred at a FedEx Ground facility in Indianapolis, Indiana, United States. Nine people were killed, including the gunman, 19 year-old former employee Brandon Scott Hole, who committed suicide. Seven others were injured, including four by gunfire.[1][4][5][6] It is the deadliest mass shooting in the history of Indiana.[2]\n"
    },
    {
        "link": "/wiki/Evansville_race_riot",
        "title": "Evansville race riot",
        "date": "July 6 - 10, 1903",
        "location": "Evansville, Indiana37°58′24.4″N 87°34′22.8″W﻿ / ﻿37.973444°N 87.573000°W﻿ / 37.973444; -87.573000Coordinates: 37°58′24.4″N 87°34′22.8″W﻿ / ﻿37.973444°N 87.573000°W﻿ / 37.973444; -87.573000",
        "paragraph": "Indiana National Guard  Evansville Police Department  Vanderburgh County Sheriff's Department\nThe Evansville Race Riot occurred in July 1903 in Evansville, Indiana and was the worst riot in the city's history. The riots occurred after a black man shot and killed a white policeman and ultimately resulted in 12 deaths.[1][2][3]\n"
    },
    {
        "link": "/wiki/Garfield_Park_riot_of_1919",
        "title": "Garfield Park riot of 1919",
        "date": "July 1919",
        "location": "Garfield Park, Indianapolis, United States",
        "paragraph": "The Garfield Park riot of 1919 was a race riot that began in Garfield Park in Indianapolis, Indiana on July 14, 1919. Multiple people, including a seven-year-old girl, were wounded when gunfire broke out.\nAmidst racial tensions during the summer of 1919, a group of white youths in Indianapolis thought that they were being followed by groups of African-Americans. On July 14, 1919, hundreds of white boys 16 to 19 years old converged on Garfield Park. There they used bricks and clubs to beat any black people they came across. When a group of African-Americans took shelter in the house of Nathan Weather, a local black man, the white mob followed them and surrounded the house. Weather fired into the crowd in hopes of dispersing the mob. A seven-year-old onlooker, Charlotte Pieper, received a flesh wound from stray buckshot. Another youth, Paul Karbwitz, 18, was also hit. Police were eventually able to disperse the mob and quell the riot.[1]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Indiana",
        "title": "George Floyd protests in Indiana",
        "date": "May 28, 2020 – July 2020",
        "location": " Indiana, United States",
        "paragraph": "\nThis is a list of George Floyd protests in Indiana, United States. As of July 2020, protests had occurred in at least 25 communities throughout the state.\n"
    },
    {
        "link": "/wiki/Indianapolis_streetcar_strike_of_1913",
        "title": "Indianapolis streetcar strike of 1913",
        "date": "October 31, 1913 – November 7, 1913",
        "location": "Indianapolis, Indiana",
        "paragraph": "\nThe Indianapolis streetcar strike of 1913 and the subsequent police mutiny and riots was a breakdown in public order in Indianapolis, Indiana. The events began as a workers strike by the union employees of the Indianapolis Traction & Terminal Company and their allies on Halloween night, October 31, 1913. The company was responsible for public transportation in Indianapolis, the capital city and transportation hub of the U.S. state of Indiana. The unionization effort was being organized by the Amalgamated Street Railway Employees of America who had successfully enforced strikes in other major United States cities. Company management suppressed the initial attempt by some of its employees to unionize and rejected an offer of mediation by the United States Department of Labor, which led to a rapid rise in tensions, and ultimately the strike. Government response to the strike was politically charged, as the strike began during the week leading up to public elections. The strike effectively shut down mass transit in the city and caused severe interruptions of statewide rail transportation and the 1913 city elections.\n"
    },
    {
        "link": "/wiki/New_Castle_Correctional_Facility",
        "title": "New Castle Correctional Facility",
        "date": "",
        "location": "1000 Van Nuys Road  New Castle, Indiana, U.S.",
        "paragraph": "New Castle Correctional Facility is a privately run (but state-owned) prison located in New Castle, Indiana, United States. It opened in 2002. In September 2005, the state signed a contract with the for-profit GEO Group, Inc. of Boca Raton, Florida, to run the prison. The facility is rated as minimum- to medium-security, but also has a maximum-security psychiatric unit and annex. It is currently the second-largest prison in Indiana, and can hold approximately 3,270 inmates.\nOn Tuesday, April 24, 2007, it was about noon when a disturbance in the prison dining hall occurred. A little after 2:00 p.m., the local New Castle police department responded en masse, as did forces from the Henry County Fire Department and Sheriff's Department. Sheriff's Deputies from adjacent Delaware County, along with elements of the Indiana State Police also responded.\n"
    },
    {
        "link": "/wiki/Lynching_of_John_Tucker",
        "title": "Lynching of John Tucker",
        "date": "July 4, 1845",
        "location": "Indianapolis, Indiana",
        "paragraph": "John Tucker (born around 1800) was the victim of a racial terror lynching that took place on July 4, 1845, in downtown Indianapolis, Indiana. Tucker was a free Black man, a husband and a father, who was working as a farmer at the time of his death. Tucker was attacked and killed by three drunken white men in front of a crowd. Two of the men were arrested for Tucker's murder, but only one was convicted.\nIn his early life, John Tucker was enslaved in Kentucky. Tucker obtained his freedom and relocated to Indianapolis. At the time of his death, he and his wife were the parents of two young children, Mary and William. The family lived \"in a house near the intersection of St. Clair and Delaware Streets\" in downtown Indianapolis. Tucker worked as a farmer for City Postmaster Samuel Henderson.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_James_Dillard",
        "title": "Lynching of James Dillard",
        "date": "",
        "location": "",
        "paragraph": "In November 1902, a white mob from Sullivan and Knox counties lynched James Dillard, a young Black man from Indianapolis. Dillard's death resulted in a lengthy legal battle over Indiana's 1899 anti-lynching law. \nJames Dillard and his mother moved from Tennessee to Indianapolis in 1895.[1] In Indianapolis, Dillard worked a variety of jobs including being a porter at the Columbia Club and at Young’s Billiard Room.[2] At the time of his death, Dillard was in his twenties. He had left Indianapolis in the spring of 1901 and it is unknown why he was in Sullivan County.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Johnson,_Squire_Taylor,_and_Charles_Davis",
        "title": "Lynching of George Johnson, Squire Taylor, and Charles Davis",
        "date": "",
        "location": "",
        "paragraph": "George Johnson, Squire Taylor, and Charles Davis, were three Black men who were killed in a spectacle lynching in 1871 in Charlestown, Indiana. They were memorialized in 2022.\nA white mob lynched George Johnson, Squire Taylor, and Charles Davis, all Black men, in Charlestown, Clark County, Indiana, in 1871.[1] The three men were accused of killing the family of Cyprus Park, a farmer who lived near Henryville, Indiana. A neighbor near the Parks family believed that he was also a target but managed to keep the assailants out of his home. The neighbor believed that the assailants were white. Even so, George Johnson, a Black man, was arrested on suspicion of committing the murders and was tortured until he confessed. He also gave out the names of two other Black men, Squire Taylor, and Charles Davis. These men were then arrested. The trial followed quite quickly. The grand jury declared the men not guilty based on the lack of evidence, but the men remained in custody and were sent to a Charlestown jail.[1]\n"
    },
    {
        "link": "/wiki/Edmund_Kayser",
        "title": "Edmund Kayser",
        "date": "",
        "location": "",
        "paragraph": "Pastor Edmund Kayser of St. James' Evangelical Lutheran Church in Tolleston, Indiana, was assassinated on August 25, 1916, for his pro-German views during World War I.[1]\nWorld War I had started on July 28, 1914, when the Austro-Hungarian Empire declared war on Serbia. By 1916, nearly all of the European nations and empires had entered the war. The United States maintained its neutrality, and some of its sizeable German population supported Imperial Germany and its Axis of Central Powers that was fighting the Entente Powers. In the 1910 census there were 2.3 million German-born immigrants living in the United States and 550 German newspapers in the country.[2] The large number of German-Americans was also a factor in keeping America out of World War I until the fighting had been going on for three years.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_William_Keemer",
        "title": "Lynching of William Keemer",
        "date": "",
        "location": "",
        "paragraph": "William Keemer was the victim of a racial terror spectacle lynching in 1875 in Greenfield, Indiana.[1] Keemer, a Black man, was dragged from his jail cell in Hancock County, Indiana on June 25, 1875 by a white mob from Hancock, Shelby, and Rush counties. Keemer was hung at the Hancock County fairgrounds and over 1,000 people traveled to view the body.[2][3][4] Keemer was arrested on June 24 for an alleged sexual assault against a white women in Carthage, Indiana. No trial was held for the alleged crime and William Keemer remains innocent.[3][5] In 2021 a historical marker commemorating the anti-Black violence committed against Keemer was approved by the Indiana Historical Bureau.[6]\nWilliam Keemer was born in 1849. The location is unknown, but he had a brother, James, who was born in 1850 in Ohio.[4] According to James’ death certificate, their parents were born in Kentucky and his mother’s maiden name was Flood.[7] Keemer's father, James H. Keemer, served in the Civil War from 1865-1866 and was a resident of the Beech Settlement, an early Black rural community, in Carthage, Indiana.[8] William Keemer was also a resident of the Beech Settlement and by the time of his death, the population there was declining.[2] William worked as a carpenter for Charles S. Wiltsie, who was the prosecuting attorney for Marion County, Indiana.[8] In 1875, William was not known to have any children.[6]\n"
    },
    {
        "link": "/wiki/Lynching_in_Posey_County,_Indiana",
        "title": "Lynching in Posey County, Indiana",
        "date": "",
        "location": "",
        "paragraph": "On October 11, 1878, Jim Good, Jeff Hopkins, Ed Warner, William Chambers, and Dan Harris, Sr. were lynched in Posey County, Indiana, near the town of Mount Vernon.[1] These men, who were allegedly connected to the robbery of a brothel, were killed by a white mob who broke into the jail where they were being held. Two other men, Dan Harris, Jr. and John Harris, were also lynched in the days leading up to October 11, in connection with the same alleged offense. This racial terror lynching is the largest reported lynching in Indiana's history.[2]\nOn October 7, 1878, Mount Vernon newspapers reported that a group of Black men had robbed a group of white women working as sex workers at a brothel near Mount Vernon, Indiana in Posey County.[3][4][5][6] Law enforcement officers listed Jim Good, Jeff Hopkins, Ed Warner, William Chambers, John Harris, and Dan Harris, Jr. as suspects, and began to search for them.\n"
    },
    {
        "link": "/wiki/Lynching_of_Joe_Holly,_Bud_Rowland,_and_Jim_Henderson",
        "title": "Lynching of Joe Holly, Bud Rowland, and Jim Henderson",
        "date": "",
        "location": "",
        "paragraph": "Bud Rowland and Jim Henderson, two Black men, were lynched in Rockport, Indiana on December 16, 1900.[1] The following day, Joe Holly was lynched in Boonville, Indiana for the same alleged crime. [2]\nOn December 16, 1900, Bud Rowland and Jim Henderson, two Black men, were arrested for the murder of a white barber, Hollie L. Simmons in Rockport, Indiana. He was reportedly jumped by two men and was bashed across the skull with a nail-covered club.[1] The news of the murder spread through town, and suspects were quickly identified that same night. Of those who were questioned, Henderson and Rowland were arrested in Rockport.\n"
    },
    {
        "link": "/wiki/Posey_County,_Indiana,_lynchings",
        "title": "Posey County, Indiana",
        "date": "",
        "location": "",
        "paragraph": "\nPosey County is the southernmost, southwesternmost, and westernmost county in the U.S. state of Indiana. Its southern border is formed by the Ohio River, and its western border by the Wabash River, a tributary to the Ohio. As of 2010, the population was 25,910.[1] The county seat is Mount Vernon.[2]\n"
    },
    {
        "link": "/wiki/Reno_Gang",
        "title": "Reno Gang",
        "date": "",
        "location": "",
        "paragraph": "The Reno Gang, also known as the Reno Brothers Gang and The Jackson Thieves, were a group of criminals that operated in the Midwestern United States during and just after the American Civil War. Though short-lived, the gang carried out the first three peacetime train robberies in U.S. history. Most of the stolen money was never recovered.\nThe gang was broken up by the lynchings of ten of its members by vigilante mobs in 1868. The murders created an international diplomatic incident with Canada and Great Britain, a general public uproar, and international newspaper coverage. No one was ever identified or prosecuted for the lynchings.\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Scott",
        "title": "Lynching of George Scott",
        "date": "",
        "location": "",
        "paragraph": "In the early hours of December 12, 1880, a white mob in Clay County, Indiana lynched George Scott, an African American man. Scott had fled after being accused of a crime in nearby Eaglesfield, Indiana, and was captured near Indianapolis and brought to the Clay County jail in Brazil, Indiana.[1] Rumors swirled that a mob might form, but the local Sheriff, James Lankford, paid them no heed. However, the man left in charge of the jail, ex-Sheriff Jacob Baumunk, took the precaution of giving the keys to Sheriff Lankford, who would not be on-site at the jail, after locking up.[2] Sometime between one and three in the morning on Sunday, December 12, a mob of over 100 men, masked, descended on the jail and demanded that Baumunk give them the keys.[1][3] After informing the mob that he did not have the keys, he was told to “retire to his room.”[2]\nAfter Baumunk removed himself, the mob began to attack the jail with sledgehammers and the like in order to reach Scott’s cell. Between three and four in the morning, Scott was removed from his cell by the mob who took him to a nearby oak tree, where he was hanged. Scott’s body remained there until he was discovered by the Clay County Coroner, Dr. George Pell, who transported Scott’s body to the courthouse around seven in the morning.[2] Prior to this, Scott’s hanged body had been viewed by “several thousand” individuals. After his body was transported to the courthouse, it was “exhibited for public inspection” before finally being released to family members near Indianapolis.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_Thomas_Shipp_and_Abram_Smith",
        "title": "Lynching of Thomas Shipp and Abram Smith",
        "date": "",
        "location": "",
        "paragraph": "\nJ. Thomas Shipp and Abraham S. Smith were young African-American men who were murdered in a spectacle lynching by a mob of thousands on August 7, 1930, in Marion, Indiana. They were taken from jail cells, beaten, and hanged from a tree in the county courthouse square. They had been arrested that night as suspects in a robbery, murder and rape case. A third African-American suspect, 16-year-old James Cameron, had also been arrested and narrowly escaped being killed by the mob; an unknown woman and a local sports hero intervened, and he was returned to jail. Cameron later stated that Shipp and Smith had committed the murder but that he had run away before that event.[1]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Tompkins",
        "title": "Lynching of George Tompkins",
        "date": "",
        "location": "",
        "paragraph": "George Tompkins, a young Black man living in Indianapolis, was the victim of a racial terror lynching in 1922. His death was declared a suicide by white authorities, and no further investigation of the death was undertaken by authorities at the time. In March 2022, Tompkins was memorialized by the Indiana Remembrance Coalition and his death certificate was amended to reflect his death by homicide.\nGeorge Tompkins was born in 1902.[2] He migrated to Indianapolis from Frankfort, Kentucky in 1920. Prior to this move, he had resided with his great aunt and great uncle, Fannie and Robert Smith, since he had been placed in their care at nine months old. Upon moving to Indianapolis, Tompkins and his family first lived on Colton Street and eventually moved to Holborn Street, both locations now beneath the current IUPUI campus. Tompkins was employed at the Fairmount Glass Works.[3]\n"
    },
    {
        "link": "/wiki/Lynching_of_George_Ward",
        "title": "Lynching of George Ward",
        "date": "",
        "location": "",
        "paragraph": "\nA mob of white Vigo County, Indiana residents lynched George Ward, a black man, on February 26, 1901 in Terre Haute, Indiana, for the suspected murder of a white woman. An example of a spectacle lynching, the event was public in nature and drew a crowd of over 1,000 white participants. Ward was dragged from a jail cell in broad daylight, struck in the back of the head with a sledgehammer, hanged from a bridge, and burned. His toes and the hobnails from his boots were collected as souvenirs. A grand jury was convened but no one was ever charged with the murder of Ward. It is the only known lynching in Vigo County. The lynching was memorialized 120 years later with a historical marker and ceremony.\n"
    },
    {
        "link": "/wiki/Newton_County_John_Does",
        "title": "Newton County John Does",
        "date": "",
        "location": "",
        "paragraph": "The Newton County John Does are two young murder victims whose remains were discovered by mushroom foragers in Lake Village, Newton County, Indiana, on October 18, 1983.[1] Both victims were discovered alongside two other murder victims whose bodies were identified within months of their discovery. All four were victims of the serial killer Larry Eyler.\nNumerous efforts have been made to discover the identity of the Newton County John Does, including forensic facial reconstructions generated by a forensic anthropologist, depicting how each decedent may have appeared in life. The National Center for Missing and Exploited Children has also created detailed composite drawings of the decedents.[2] Furthermore, DNA was extracted from both decedents for genetic testing against the DNA of any individual who may be related to them.[3]\n"
    }
]