[
    {
        "link": "/wiki/Celia_Barqu%C3%ADn_Arozamena",
        "title": "Celia Barquín Arozamena",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nCelia Barquín Arozamena (6 July 1996 – 17 September 2018) was a Spanish amateur golfer. She won the 2018 European Ladies Amateur Championship.\n"
    },
    {
        "link": "/wiki/Terry_DeGeus",
        "title": "1993 Iowa murders",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\n"
    },
    {
        "link": "/wiki/Amber_Duncan",
        "title": "1993 Iowa murders",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\n"
    },
    {
        "link": "/wiki/Kandi_Duncan",
        "title": "1993 Iowa murders",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\n"
    },
    {
        "link": "/wiki/Lori_Duncan",
        "title": "1993 Iowa murders",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\n"
    },
    {
        "link": "/wiki/Jason_Gage",
        "title": "Murder of Jason Gage",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "Waterloo",
        "paragraph": "Jason Gage (1976 – March 11, 2005) was a 29-year-old gay man who was murdered in his Waterloo, Iowa, apartment.[1][2] The murder was compared by the national press to the slaying of Matthew Shepard and prompted a push for citywide laws protecting LGBT people.[2][3][4]\nJason Gage was last seen alive on March 11, 2005, socializing with friends in Waterloo's downtown bars. Sometime that night he went home to his apartment in the Russell-Lamson building. With him was 23-year-old Joseph Lawrence. Gage was originally from Oelwein, Iowa.[5] He'd lived in Chicago and Milwaukee before moving to Waterloo years earlier. He settled downtown, and worked waiting tables in the Italian restaurant of his apartment building. He enrolled at the College of Hair Design in Waterloo, Iowa, in January 2003, and his friends said he dreamed of working in a big city salon.[6]\n"
    },
    {
        "link": "/wiki/Jetseta_Gage",
        "title": "Jetseta Gage",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "Johnson County",
        "paragraph": "Jetseta Marrie Gage (August 25, 1994 – March 24, 2005) was an American child whose kidnapping, rape and murder prompted major changes in sentencing laws for those who commit child sex crimes in Iowa. Roger Bentley, a convicted sex offender and friend of Gage's family, was arrested in connection with 10-year-old Jetseta's death. He was convicted of first-degree murder and first-degree kidnapping on January 31, 2006.[1] On February 24, he was sentenced to two consecutive mandatory sentences of life in prison without parole.[2]\nProsecutors alleged that Bentley took Gage from her home to a run-down trailer in rural Johnson County, Iowa, where he raped and killed her. An AMBER Alert was issued shortly after it was noticed that she was missing. The AMBER Alert program had errors that night. A proper description with name and picture did not appear until hours after she had vanished. Bentley was arrested a day later. Investigators found her body inside a bathroom cabinet inside the trailer.\n"
    },
    {
        "link": "/wiki/Jerry_Harrington",
        "title": "Jerry Harrington",
        "date": "",
        "location": "",
        "state": "Ohio",
        "county": "Harrington",
        "paragraph": "Jeremiah Peter \"Jerry\" Harrington (August 12, 1868 – April 16, 1913) was a professional baseball player whose career spanned six seasons, including four seasons in Major League Baseball (MLB). Harrington played the majority of his games in the majors at catcher; however, he did play first base and third base on occasion. In 189 major league games between the Cincinnati Reds and the Louisville Colonels, Harrington batted .227 with 60 runs, 151 hits, 19 doubles, six triples, three home runs, 73 runs batted in (RBIs), and eight stolen bases.\nHarrington was born in Hamden, Ohio on August 12, 1868. His father was the manager of the Keokuk, Iowa baseball club in 1885.[1] At the age of 16, Jerry Harrington began to play semi-professional baseball with the Bonaparte, Iowa team.[1] Two years later, Harrington began to play with the Creston, Iowa ball club of the Iowa League.[1]\n"
    },
    {
        "link": "/wiki/Chief_Johnson",
        "title": "Chief Johnson",
        "date": "",
        "location": "",
        "state": "",
        "county": "Kansas City Packers",
        "paragraph": "George Howard \"Chief\" Johnson (March 20, 1886 – June 11, 1922) was an American professional baseball pitcher. He played three seasons in Major League Baseball (MLB), from 1913 to 1915, for the Cincinnati Reds of the National League and Kansas City Packers of the Federal League. He surrendered the first home run in the history of Wrigley Field, to Art Wilson on April 23, 1914.[1]\nJohnson was of Ho-Chunk, French and Irish ancestry. He identified as Ho-Chunk and was depicted in the media as a Native American.[2] A 1913 feature by Ripley's Believe It or Not! reported his full name as George Washington Murphy Johnson.[3]\n"
    },
    {
        "link": "/wiki/Mahaska_(Native_American_leader)",
        "title": "Mahaska (Native American leader)",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "Mahaska",
        "paragraph": "Mahaska (archaic Ioway Maxúshga pronounced [mõxuʃꜜkɐ]; contemporary Maxúhga), or White Cloud, (1784–1834) was a chief of the Native American Iowa tribe. His son, also named Mahaska, was better known as Francis White Cloud.\nMahaska was born into the Iowa tribe.  He became chief at an early age after killing several enemy Sioux to avenge his father's death by them.\n"
    },
    {
        "link": "/wiki/Murder_of_Michelle_Martinko",
        "title": "Murder of Michelle Martinko",
        "date": "December 19, 1979 (1979-12-19)",
        "location": "Westdale Mall, Cedar Rapids, Iowa",
        "state": "Iowa",
        "county": "Cedar Rapids",
        "paragraph": "The murder of Michelle Martinko occurred in Cedar Rapids, Iowa, on December 19, 1979. It was a cold case until 2018, when familial DNA identified a suspect 39 years after the crime who was charged, tried and convicted of her murder.[2]\nMartinko, an 18-year-old high school student, was found stabbed to death in her family's car in the parking lot of a local mall, where she had gone to buy a new coat. The murder was closely followed within her community, and the police received more than 200 tips in the weeks following her killing. However, the case gradually grew cold as the investigation stretched on.\n"
    },
    {
        "link": "/wiki/Murders_of_Lee_Rotatori_and_Thomas_Freeman",
        "title": "Murders of Lee Rotatori and Thomas Freeman",
        "date": "c. July 1982 (murder)October 30, 1982 (discovery of body)",
        "location": "Cobden, Illinois, U.S.",
        "state": "Illinois",
        "county": "Cobden",
        "paragraph": "On June 25, 1982, Lee Gunsalus Rotatori, a 32-year old American woman, was sexually assaulted and murdered in her hotel room by Thomas Oscar Freeman in Council Bluffs, Iowa. The murder went unsolved for nearly 40 years, until it was announced by authorities in 2022 that the perpetrator had been identified as Freeman using investigative genetic genealogy.\nAround July 1982, Freeman himself was murdered by an unidentified perpetrator in Cobden, Illinois. His decomposing body was found in a shallow grave around three months after his murder. As of 2022, the murder remains unsolved and the case remains open, and investigators believe the two murders were connected.\n"
    },
    {
        "link": "/wiki/Greg_Nicholson",
        "title": "1993 Iowa murders",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\n"
    },
    {
        "link": "/wiki/Oran_Pape",
        "title": "Oran Pape",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nOran Henry Pape (March 10, 1904 – April 30, 1936) was a member of the Iowa State Patrol in the United States. He is the first member of the Patrol to have been murdered in the line of duty. Prior to joining the Patrol, Pape played professional American football.\n"
    },
    {
        "link": "/wiki/Edward_Arthur_Thomas",
        "title": "Edward Arthur Thomas",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "Parkersburg",
        "paragraph": "Edward Arthur Thomas[1] (July 17, 1950 – June 24, 2009) was an American high school football coach. On June 24, 2009, Thomas was shot and killed in his Parkersburg, Iowa football team's weight room by Mark Becker, one of Thomas' former players.[2] Thomas was airlifted to a Waterloo, Iowa hospital where he was pronounced dead shortly after arrival.[3]\nEd Thomas was born to Authrine and Roy Thomas in 1950.[4] He was born in Oskaloosa, Iowa and raised in What Cheer, Iowa. He played football; his position was quarterback. Thomas was the oldest of 5, having 3 younger sisters and one younger brother. He graduated from Tri-County High School in Thornburg, Iowa in 1968 and obtained degrees from William Penn College and the University of Northern Iowa.[4]\n"
    },
    {
        "link": "/wiki/Murder_of_Mollie_Tibbetts",
        "title": "Murder of Mollie Tibbetts",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "Brooklyn",
        "paragraph": "On July 18, 2018, University of Iowa student Mollie Cecilia Tibbetts disappeared while jogging near her home in Brooklyn, Iowa. A month later, police identified 24-year-old Cristhian Bahena Rivera as a suspect in connection with the disappearance; surveillance footage showed Rivera's car following Tibbetts on her jog. Rivera led police to the body of Tibbetts in a Poweshiek County cornfield on August 21. He was charged with first-degree murder. On May 28, 2021, Rivera was found guilty of first-degree murder.[2] On August 30, 2021, Rivera was sentenced to life in prison without parole.[3]\nRivera's immigration status became a politicized issue after police, the U.S. Citizenship and Immigration Services (USCIS), and U.S. Immigration and Customs Enforcement (ICE) indicated that he had been in the United States illegally. The Trump administration and some Republicans, including Iowa governor Kim Reynolds, argued the murder could have been prevented with more restrictive immigration policies. Tibbetts's family denounced efforts to use Tibbetts's death for political purposes.[4]\n"
    },
    {
        "link": "/wiki/Shao_Tong",
        "title": "Murder of Shao Tong",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "Iowa City",
        "paragraph": "Coordinates: 41°38′07″N 91°29′58″W﻿ / ﻿41.63539°N 91.49937°W﻿ / 41.63539; -91.49937\nOn September 26, 2014, police found a body later identified as 19-year-old Shao Tong (Chinese: 邵童, November 1994 – September 2014),[1] a Chinese undergraduate at Iowa State University (ISU), in the trunk of a car registered in her name parked in an apartment complex on the outskirts of town in Iowa City, Iowa. She had been reported missing nine days earlier.[2] The cause of death was found to be homicide by suffocation.[3]\n"
    },
    {
        "link": "/wiki/Farmers%27_Holiday_Association",
        "title": "Farmers' Holiday Association",
        "date": "",
        "location": "",
        "state": "Iowa",
        "county": "Farmer",
        "paragraph": "The Farmers' Holiday Association was a movement of Midwestern United States farmers who, during the Great Depression, endorsed the withholding of farm products from the market, in essence creating a farmers' holiday from work. The Farmers' Holiday Association was organized in May 1932 by Milo Reno.[1] The group urged farmers to declare a \"holiday\" from farming, with a slogan of \"Stay at Home-Buy Nothing-Sell Nothing\"  and \"Lets call a Farmer's Holiday, a Holiday let's hold.  We'll eat our wheat and ham and eggs, And let them eat their gold\".[2]\nFarmers went to extreme measures to ensure that their wants were carried through. One person was killed when the farmers began to blockade roads, and other farmers rallied to destroy their crops, reducing supply, and raising prices.  The highways into Sioux City and Council Bluffs, Iowa, were blocked by pickets who dumped farm produce on the side of the road.[3] At Le Mars, Iowa some farmers dragged a judge out of his courtroom, placed a noose around his neck, and threatened to hang him unless he stopped approving farm foreclosures. The striking farmers were countered by  sheriffs, militia, and vigilante groups.[1]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Iowa",
        "title": "George Floyd protests in Iowa",
        "date": "May 28, 2020 – June 5, 2020",
        "location": " Iowa, United States",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Iowa, United States.\n"
    },
    {
        "link": "/wiki/Iowa_Cow_War",
        "title": "Iowa Cow War",
        "date": "September 21–25, 1931 (1931-09-21 – 1931-09-25)",
        "location": "Cedar County, Iowa, US",
        "state": "Iowa",
        "county": "Cedar County",
        "paragraph": "\nThe Iowa Cow War of 1931 involved violent disputes over the testing of cows for bovine tuberculosis. After distrustful farmers tried and failed to repeal the testing program, they gathered in numbers to block tests from taking place. The farmers believed that the test might infect cows with tuberculosis or make pregnant cows have spontaneous abortions. They also believed that the testing was unconstitutional. The owner of Muscatine radio station KTNT, Norman G. Baker, spread misinformation which resulted in more farmers protesting testing, sometimes causing violence. The Iowa Cow War came to a conclusion when 31 Iowa National Guard units were deployed to stop the protesting. Two farmers were arrested for their actions during the conflict.\n"
    }
]