[
    {
        "link": "/wiki/1973_Gitchie_Manitou_murders",
        "title": "1973 Gitchie Manitou murders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Manitou",
        "paragraph": "The 1973 Gitchie Manitou murders involved an attack on a group of five teenagers at Gitchie Manitou State Preserve in Lyon County, Iowa. Four of the teenagers were killed and a fifth was kidnapped and raped. Allen, James, and David Fryer were later convicted of the crimes and sentenced to life in prison. The attack took place on November 17, 1973.\nOn the evening of November 17, 1973, five teenagers from Sioux Falls, South Dakota were attacked by a group of three brothers.  Four of the teenagers were killed and one was kidnapped and raped. Those killed were Roger Essem (male, 17), Stewart Baade (male, 18), Dana Baade (male, 14), and Michael Hadrath (male, 15).  Sandra Cheskey (female, 13) was raped, but survived the attack.  Her testimony was instrumental in bringing the perpetrators to justice.[2]\nThe perpetrators of this slaying were Allen Fryer (male, 29), David Fryer (male, 24), and James Fryer (male 21) of Sioux Falls, South Dakota.[3]\n"
    },
    {
        "link": "/wiki/All_Saints_Catholic_Church_(Stuart,_Iowa)",
        "title": "All Saints Catholic Church (Stuart, Iowa)",
        "date": "",
        "year": "",
        "location": "320 N. FremontStuart, Iowa",
        "state": "Iowa",
        "county": "",
        "paragraph": "All Saints Catholic Church is a parish church building in the Diocese of Des Moines. The building is located in Stuart, Iowa, United States.   The parish used the building as its church until a devastating fire severely damaged the structure.  The church was rebuilt and it now  serves as a cultural center called the Historic All Saints/Saints Center for Culture and the Arts.   It is  listed on the National Register of Historic Places, and is a rare example of Neo-Byzantine architecture in the state of Iowa.[2]\nThe Catholic Church in Stuart traces its beginnings to August 1871 when a Father Moniahan from Des Moines came to town for the first time to celebrate Mass.  He would come at irregular intervals and Mass was celebrated in school rooms, Shield's Hall, and in private homes.  At this time the whole state of Iowa was part of the Diocese of Dubuque.\nThe first church was built in 1874 under the direction of the Rev. Edward Gaul.  It was dedicated by the Very Rev. J.F. Brazil from St. Ambrose in Des Moines on the Feast of All Saints, November 1, 1877.  The Rev. James Foley was pastor at the time and he built two additions onto the church as well as the rectory during his 24 years at All Saints.  During that time he was also responsible for parishes in Casey, Adair, Guthrie Center and Greenfield.[3]  The parish became a part of the Diocese of Davenport when it was established in 1881.\n"
    },
    {
        "link": "/wiki/2016_murders_of_Des_Moines_police_officers",
        "title": "2016 murders of Des Moines police officers",
        "date": "November 2, 2016 (2016-11-02) c. 1:06 a.m. – c. 1:09 a.m. (CT)",
        "year": "2016",
        "location": "Urbandale and Des Moines, Iowa, U.S.",
        "state": "Iowa",
        "county": "Des Moines",
        "paragraph": "\nIn the early hours of November 2, 2016,  Des Moines Police Department officer Anthony Beminio and Urbandale Police Department officer Justin Martin were killed in separate \"ambush-style\" shootings in and near Des Moines, Iowa. The perpetrator in both shootings, identified as 46-year-old Scott Michael Greene of Urbandale, Iowa, was apprehended by police hours later. Greene pleaded guilty to two counts of first-degree murder and was sentenced to life without parole on May 20, 2017.[1]\nAccording to a report released in 2016 by the National Law Enforcement Officers Memorial Fund, 50 U.S. police officers were killed by homicide as of late July, representing a significant increase from the 33 officers murdered in 2015. The report also noted an increase of \"ambush killings\" targeting officers, with fourteen incidents recorded. Also in July 2016, there had been two mass shootings targeting police officers in Dallas, Texas, and Baton Rouge, Louisiana, in a ten-day period. Speaking for the Des Moines Police Department after the Des Moines-area shootings, Sergeant Paul Parizek noted, \"There is a clear and present danger to police officers right now.\"[2][3]\n"
    },
    {
        "link": "/wiki/East_High_School_shooting",
        "title": "East High School shooting",
        "date": "March 7, 2022",
        "year": "2022",
        "location": "East High School, Des Moines, Iowa, U.S.",
        "state": "Iowa",
        "county": "Des Moines",
        "paragraph": "On March 7, 2022, after 2:40 pm, a shooting occurred within the vicinity of East High School in Des Moines, Iowa, U.S, right before school was being dismissed for the day. At least 35 gunshots were fired out of at least three vehicles.\nOne 15-year-old boy was killed, and two female students were critically wounded. By the next few hours, six teenage males were arrested, ranging from ages 14 to 17, and charged with one count of first-degree murder and two counts of attempted murder: four charged in adult court, and two in juvenile court.[1][2]\nThe shooting was described by police as having gang overtones, having stemmed from an ongoing violent conflict between two rival Iowa Hispanic gangs.\n"
    },
    {
        "link": "/wiki/Murder_of_Jason_Gage",
        "title": "Murder of Jason Gage",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Waterloo",
        "paragraph": "Jason Gage (1976 – March 11, 2005) was a 29-year-old gay man who was murdered in his Waterloo, Iowa, apartment.[1][2] The murder was compared by the national press to the slaying of Matthew Shepard and prompted a push for citywide laws protecting LGBT people.[2][3][4]\nJason Gage was last seen alive on March 11, 2005, socializing with friends in Waterloo's downtown bars. Sometime that night he went home to his apartment in the Russell-Lamson building. With him was 23-year-old Joseph Lawrence. Gage was originally from Oelwein, Iowa.[5] He'd lived in Chicago and Milwaukee before moving to Waterloo years earlier. He settled downtown, and worked waiting tables in the Italian restaurant of his apartment building. He enrolled at the College of Hair Design in Waterloo, Iowa, in January 2003, and his friends said he dreamed of working in a big city salon.[6]\nLawrence was born in Seaford, Delaware. He was removed from his birth parents after severe abuse and spent several years in foster care before being adopted at age 5. He moved with his adoptive parents to Maryland, New Jersey, and then to Ohio. During his time in Ohio, he decided he no longer wanted to be adopted and moved back into foster care at age 16. From there, he moved to Phoenix, Arizona, and then on to New Mexico. In early 2003, Lawrence moved from Farmington, New Mexico, where he had been an oil worker to Cedar Falls, Iowa, to be with his girlfriend—Elizabeth Hostetler—who was six months pregnant with their child. The couple—who had been together for a year—decided to move to Cedar Falls, because Hostetler had many \"lifelong friends\" in the area who could help with the baby.[7] Hostetler said she introduced Gage and Lawrence about a week before Gage's murder. Hostetler had met Gage through an acquaintance and had known him for about two years.[8]\n"
    },
    {
        "link": "/wiki/Hot_Lotto_fraud_scandal",
        "title": "Hot Lotto fraud scandal",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Belize",
        "paragraph": "\nThe Hot Lotto fraud scandal was a lottery-rigging scandal in the United States. It came to light in 2017, after Eddie Raymond Tipton, the former information security director of the Multi-State Lottery Association (MUSL), confessed to rigging a random number generator that he and two others used in multiple cases of fraud against state lotteries. Tipton was first convicted in October 2015 of rigging a $14.3 million drawing of MUSL's lottery game Hot Lotto. Eddie Tipton ultimately confessed to rigging lottery drawings in Iowa, Colorado, Wisconsin, Kansas and Oklahoma. Also involved in the scheme were his brother and former Texas justice of the peace Tommy Tipton and Texas businessman Robert Rhodes.[1][2] Eddie Tipton was sentenced to 25 years in prison.[1][2]\nA $14.3 million prize for the Hot Lotto draw on December 29, 2010, had been left unclaimed for nearly a year, when attempts were made to claim the prize on behalf of an anonymous, off-shore trust company in Belize. The claim was rejected by the Iowa Lottery because it was made anonymously.[3][4][5][6] A subsequent investigation into the trust and the discovery of surveillance footage from a convenience store that depicted the ticket being purchased, led to the arrest of Eddie Tipton on two counts of fraud for attempting to illegally participate in a lottery game as an employee of the MUSL, and then trying to claim a prize through fraudulent means.[7]\nWhen his trial began on April 13, 2015, evidence was introduced by the prosecutors to support allegations that Tipton had rigged the draw in question by using his privileged access to an MUSL facility to install a rootkit on the computer containing Hot Lotto's random number generator, and then attempting to claim a winning ticket with the rigged numbers anonymously.[8][9] On July 20, 2015, Tipton was found guilty on both counts;[8] he was sentenced to 10 years' imprisonment, pending an appeal.[5]\n"
    },
    {
        "link": "/wiki/Iowa_City_Sueppel_murders",
        "title": "Iowa City Sueppel murders",
        "date": "March 23, 2008 (2008-03-23)",
        "year": "2008",
        "location": "Iowa City, Iowa, U.S.",
        "state": "Iowa",
        "county": "Iowa City",
        "paragraph": "The Iowa City Sueppel murders was a family annihilation perpetrated by Steven Sueppel, a 42-year-old former banker, at his residence in Iowa City, Iowa, USA on Easter Sunday night, March 23, 2008.[1]\nOn Monday morning at 6:31 a.m., Sueppel called 9-1-1 from his mobile phone, requested that police visit his house immediately, and hung up without identifying himself.[1] When police arrived at his house, they found Sueppel's wife Sheryl and their four adopted children—Ethan (age 10), Seth (age 9), Mira (age 5) and Eleanor (age 3) dead of multiple blunt force trauma injuries to their upper torsos and heads.[2] Police recovered the presumed murder weapons—two baseball bats—at the scene of the crime.[1] At 6:36 a.m., five minutes after his 9-1-1 call, Steven Sueppel committed suicide by driving the family minivan into a concrete abutment on Interstate 80 at high speed, causing his vehicle to burst into flames.[3]\nIn February 2008 (one month before the murders), Steven Sueppel was indicted by a federal grand jury on charges of embezzlement and money laundering in connection with $559,040 stolen from his former employer, the Hills Bank and Trust Company of Hills, Iowa, where he had served as a vice president and controller.[1] Sueppel had pleaded not guilty, but had indicated to investigators that he had in fact diverted the funds to a personal account.[1] At the time of the murders, Sueppel was out on bond and awaiting an April 2008 trial.[2]\n"
    },
    {
        "link": "/wiki/Saint_Joseph_the_Worker_Catholic_Church_(Dubuque,_Iowa)",
        "title": "Saint Joseph the Worker Catholic Church (Dubuque, Iowa)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Dubuque",
        "paragraph": "Saint Joseph the Worker Catholic Church is a Catholic parish located in Dubuque, Iowa.  It is part of the Archdiocese of Dubuque.  The parish became the tenth Catholic parish in Dubuque when it was created in 1949 by Archbishop Rohlman.  The current pastor of the parish is Father Jim Goerend.\nPrior to the construction of the first church, the parish offices were located at Mercy Hospital.  Weekend masses were held at Washington Junior High School.  Eventually a parish church was built at the current location at 90 S. Algona, Dubuque.\nIn the late 1960s, a new parish church was built.  This new church building was a departure from the traditional church buildings of the past.  The church was a circular structure where the congregation sat in a semicircle around the altar.  The church is noted for its stained glass windows.\n"
    },
    {
        "link": "/wiki/Maharishi_University_of_Management_stabbing",
        "title": "Maharishi University of Management stabbing",
        "date": "March 1, 2004",
        "year": "2004",
        "location": "Fairfield, Iowa",
        "state": "Iowa",
        "county": "Fairfield",
        "paragraph": "The Maharishi University of Management stabbing occurred on March 1, 2004, when without provocation, a university student Shuvender Sem fatally stabbed a fellow student, Levi Butler, after Sem had attacked another student earlier in the day. The event occurred at Maharishi University of Management (later renamed to Maharishi International University), Fairfield, Iowa, United States, and attracted attention partly due to the university's practice of \"yogic flying,\" which proponents say reduces violence in the surrounding area.[1] Sem was found not guilty due to insanity. A lawsuit against the university that had charged negligence was settled out of court.\nOn March 1, 2004, Shuvender Sem, who had been enrolled at the university for less than two months,[2] stabbed another student in the face with a pen during a class called Teaching for Enlightenment.[1] Told by university staff that he did not require medical attention, the injured student drove himself to the hospital where he received seven stitches.[3] University officials consulted a psychologist and decided that Sem would have to leave the university, but didn't report the incident to police. Sem didn't appear dangerous or agitated and was taken by Joel Wysong, the school's dean of men, to his on-campus apartment until he could take a flight home the next morning.[2] Left unattended, Sem took a paring knife from Wysong's kitchen and went to the university's dining hall.[4] Wysong followed Sem to the dining hall and watched while Sem interacted with other students, but did not take him back into custody. After about ten minutes and without provocation, Sem stabbed another student, freshman Levi Butler, four times in the chest, killing him.[1][5]\nSem, who was \"a diagnosed schizophrenic\", reportedly \"had been off his medication for months\" at the time of the murder.[6] After initially being declared incompetent, Sem was subsequently deemed competent to stand trial.[7][8] The judge ruled Sem not guilty by reason of insanity at the urging of both the defense attorneys and prosecutors.[9] In an April 22, 2010, news article in the Des Moines Register, Michael Taylor, the Des Moines-area psychiatrist who testified on Sem's behalf at his trial, says that the insanity defense was appropriate for this case.[10]\n"
    },
    {
        "link": "/wiki/Maquoketa_Caves_State_Park_familicide",
        "title": "Maquoketa Caves State Park familicide",
        "date": "July 22, 2022 (2022-07-22)  (CDT)",
        "year": "2022",
        "location": "Jackson County, Iowa, U.S",
        "state": "Iowa",
        "county": "Jackson County",
        "paragraph": "\nOn July 22, 2022, three members of the Schmidt family were murdered in Maquoketa Caves State Park.[1] The assailant, identified as 23-year-old Anthony Orlando Sherwin, later committed suicide by gunshot.[2]\nShortly before 6:23 a.m. on July 22, 2022, an assailant murdered three members of the Schmidt family. The father Tyler, 42, was shot multiple times and stabbed to death and the mother Sarah, 42, was stabbed multiple times until she died. The couple's daughter, six-year-old Lula, died from a gunshot wound and strangulation.[3] The couple's nine-year-old son Arlo was the sole survivor of the attack.[4]\n"
    },
    {
        "link": "/wiki/Murder_of_Shao_Tong",
        "title": "Murder of Shao Tong",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Iowa City",
        "paragraph": "Coordinates: 41°38′07″N 91°29′58″W﻿ / ﻿41.63539°N 91.49937°W﻿ / 41.63539; -91.49937\nOn September 26, 2014, police found a body later identified as 19-year-old Shao Tong (Chinese: 邵童, November 1994 – September 2014),[1] a Chinese undergraduate at Iowa State University (ISU), in the trunk of a car registered in her name parked in an apartment complex on the outskirts of town in Iowa City, Iowa. She had been reported missing nine days earlier.[2] The cause of death was found to be homicide by suffocation.[3]\nShao had last been seen on September 7 at a hotel outside Nevada, a small town east of Ames, where ISU is located. She had been spending the weekend there with her boyfriend, Li Xiangnan (Chinese: 李向南), a student at the University of Iowa, located in Iowa City. Her car and body were in the apartment complex he lived in.[4]\n"
    },
    {
        "link": "/wiki/University_of_Iowa_shooting",
        "title": "University of Iowa shooting",
        "date": "November 1, 1991 3:42 – 3:52 p.m. (CST)",
        "year": "1991",
        "location": "Iowa City, Iowa, U.S.",
        "state": "Iowa",
        "county": "Iowa City",
        "paragraph": "The University of Iowa shooting was a mass shooting that occurred in Iowa City, Iowa, on November 1, 1991. Gang Lu, a 28-year-old former graduate student at the University of Iowa, killed three members of the Physics and Astronomy Department faculty, an Associate Vice President for Academic Affairs, and a fellow student, then seriously injured another student working at the university's campus, before committing suicide.\nGang Lu (Chinese: 卢刚; pinyin: Lú Gāng; c. 1962 – November 1, 1991),[1] was a 28-year-old Chinese graduate student at the University of Iowa who had received his doctoral degree in physics and astronomy from the university in May 1991.[2] The 18-year-old Lu began studying physics at Peking University in Beijing, where he passed the CUSPEA exam in 1984 and was admitted to study in the United States, becoming a graduate student at the University of Iowa. As a graduate student, Lu was primarily a loner who was perceived by at least one other graduate student to have a psychological problem if challenged and was reported to have had abusive tantrums.[3][4] Lu was infuriated because his dissertation, titled Study of the \"Critical Ionization Velocity\" Effect by Particle-in-Cell Simulation, did not receive the prestigious D. C. Spriestersbach Dissertation Prize, which included a monetary award of $2,500. The Tiananmen Square protests of 1989 led many Chinese students to become eager to stay in the United States, and Lu believed that winning the prize would have made it easier for him to get a job and not have to return to China. Normally, Lu would have gotten a postdoctoral researcher position, but there was not enough money to support him.[5]\nIn the months prior to the shooting, Lu was still living in Iowa City and wrote five letters explaining the reasons for his planned actions. According to university officials, four of the five letters were written in English and one was written in Chinese, intended to be mailed to news organizations. The letters have never been released to the public.\n"
    },
    {
        "link": "/wiki/Villisca_axe_murders",
        "title": "Villisca axe murders",
        "date": "June 10, 1912, 110 years ago Late night or early morning",
        "year": "1912",
        "location": "Villisca, Iowa, U.S.",
        "state": "Iowa",
        "county": "Villisca",
        "paragraph": "\nCoordinates: 40°55′51″N 94°58′26″W﻿ / ﻿40.9308091°N 94.9739235°W﻿ / 40.9308091; -94.9739235\nThe Villisca axe murders occurred between the evening of June 9, 1912, and the early morning of June 10, 1912, in the town of Villisca, Iowa, United States. The six members of the Moore family and two guests were found bludgeoned in the Moore residence. All eight victims, including six children, had severe head wounds from an axe. A lengthy investigation yielded several suspects, one of whom was tried twice. The first trial ended in a hung jury and the second ended in an acquittal. The crime remains unsolved.\nThe Moore family consisted of parents Josiah B. (aged 43[1]), Sarah (née Montgomery) (39), and their four children: Herman Montgomery (11), Mary Katherine (10), Arthur Boyd (7), and Paul Vernon (5). An affluent family, the Moores were well known and well liked in their community.[2] On June 9, 1912, Mary Katherine Moore invited Ina Mae (8) and Lena Gertrude Stillinger (12) to spend the night at the Moore residence. That evening, the visiting girls and the Moore family attended the Presbyterian church where they participated in the Children's Day Program, which Sarah had coordinated. After the program ended at 9:30 p.m., the Moores and the Stillinger sisters walked to the Moores' house, arriving between 9:45 and 10 p.m.\n"
    },
    {
        "link": "/wiki/Celia_Barqu%C3%ADn_Arozamena",
        "title": "Celia Barquín Arozamena",
        "date": "17 September 2018(2018-09-17) (aged 22)Ames, Iowa, U.S.",
        "year": "2018",
        "location": "",
        "state": "",
        "county": "Puente San Miguel",
        "paragraph": "\nCelia Barquín Arozamena (6 July 1996 – 17 September 2018) was a Spanish amateur golfer. She won the 2018 European Ladies Amateur Championship.\nBarquín was born in Puente San Miguel and educated in Torrelavega and then in Madrid. She spent two years in a residential training programme run by the Spanish Sports Council before moving to the United States,[1] where she was a member of the Iowa State Cyclones women's golf team from 2014 to 2018 and was the Iowa State University Female Athlete of the Year for 2018.[2]\n"
    },
    {
        "link": "/wiki/Terry_DeGeus",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52)USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\n"
    },
    {
        "link": "/wiki/Amber_Duncan",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52)USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\n"
    },
    {
        "link": "/wiki/Kandi_Duncan",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52)USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\n"
    },
    {
        "link": "/wiki/Lori_Duncan",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52)USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\n"
    },
    {
        "link": "/wiki/Jason_Gage",
        "title": "Murder of Jason Gage",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Waterloo",
        "paragraph": "Jason Gage (1976 – March 11, 2005) was a 29-year-old gay man who was murdered in his Waterloo, Iowa, apartment.[1][2] The murder was compared by the national press to the slaying of Matthew Shepard and prompted a push for citywide laws protecting LGBT people.[2][3][4]\nJason Gage was last seen alive on March 11, 2005, socializing with friends in Waterloo's downtown bars. Sometime that night he went home to his apartment in the Russell-Lamson building. With him was 23-year-old Joseph Lawrence. Gage was originally from Oelwein, Iowa.[5] He'd lived in Chicago and Milwaukee before moving to Waterloo years earlier. He settled downtown, and worked waiting tables in the Italian restaurant of his apartment building. He enrolled at the College of Hair Design in Waterloo, Iowa, in January 2003, and his friends said he dreamed of working in a big city salon.[6]\nLawrence was born in Seaford, Delaware. He was removed from his birth parents after severe abuse and spent several years in foster care before being adopted at age 5. He moved with his adoptive parents to Maryland, New Jersey, and then to Ohio. During his time in Ohio, he decided he no longer wanted to be adopted and moved back into foster care at age 16. From there, he moved to Phoenix, Arizona, and then on to New Mexico. In early 2003, Lawrence moved from Farmington, New Mexico, where he had been an oil worker to Cedar Falls, Iowa, to be with his girlfriend—Elizabeth Hostetler—who was six months pregnant with their child. The couple—who had been together for a year—decided to move to Cedar Falls, because Hostetler had many \"lifelong friends\" in the area who could help with the baby.[7] Hostetler said she introduced Gage and Lawrence about a week before Gage's murder. Hostetler had met Gage through an acquaintance and had known him for about two years.[8]\n"
    },
    {
        "link": "/wiki/Jetseta_Gage",
        "title": "Jetseta Gage",
        "date": "March 24, 2005 (aged 10)",
        "year": "2005",
        "location": "",
        "state": "Iowa",
        "county": "Johnson County",
        "paragraph": "Jetseta Marrie Gage (August 25, 1994 – March 24, 2005) was an American child whose kidnapping, rape and murder prompted major changes in sentencing laws for those who commit child sex crimes in Iowa. Roger Bentley, a convicted sex offender and friend of Gage's family, was arrested in connection with 10-year-old Jetseta's death. He was convicted of first-degree murder and first-degree kidnapping on January 31, 2006.[1] On February 24, he was sentenced to two consecutive mandatory sentences of life in prison without parole.[2]\nProsecutors alleged that Bentley took Gage from her home to a run-down trailer in rural Johnson County, Iowa, where he raped and killed her. An AMBER Alert was issued shortly after it was noticed that she was missing. The AMBER Alert program had errors that night. A proper description with name and picture did not appear until hours after she had vanished. Bentley was arrested a day later. Investigators found her body inside a bathroom cabinet inside the trailer.\nBentley's trial was moved to Scott County on the defense's change of venue motion because of extensive pre-trial publicity; local media dubbed the case \"Justice for Jetseta.\" During his trial, prosecutors linked DNA evidence found on Gage's body to Bentley, while the defense (which did not call any witnesses) claimed there were no eyewitnesses to the crime or direct evidence.[3][4] It took just over two hours for the jury to arrive at its guilty verdict.\n"
    },
    {
        "link": "/wiki/Jerry_Harrington",
        "title": "Jerry Harrington",
        "date": "",
        "year": "",
        "location": "",
        "state": "Ohio",
        "county": "Louisville",
        "paragraph": "Jeremiah Peter \"Jerry\" Harrington (August 12, 1868 – April 16, 1913) was a professional baseball player whose career spanned six seasons, including four seasons in Major League Baseball (MLB). Harrington played the majority of his games in the majors at catcher; however, he did play first base and third base on occasion. In 189 major league games between the Cincinnati Reds and the Louisville Colonels, Harrington batted .227 with 60 runs, 151 hits, 19 doubles, six triples, three home runs, 73 runs batted in (RBIs), and eight stolen bases.\nHarrington was born in Hamden, Ohio on August 12, 1868. His father was the manager of the Keokuk, Iowa baseball club in 1885.[1] At the age of 16, Jerry Harrington began to play semi-professional baseball with the Bonaparte, Iowa team.[1] Two years later, Harrington began to play with the Creston, Iowa ball club of the Iowa League.[1]\nIn 1888, Harrington began his professional career in the Central Interstate League. That season, he played for the Danville Browns, the Davenport club, and the Decatur club. Harrington continued to play in the Central Interstate League in 1889 with the Davenport Hawkeyes/Monmouth Browns. Harrington made his major league debut on April 30, 1890 with the Cincinnati Reds. In his first season, he batted .246 with 25 runs, 58 hits, seven doubles, one triple, one home run, 23 RBIs, and four stolen bases in 65 games. Lee Allen, author of The Cincinnati Reds, wrote that Harrington and fellow player Billy Rhines were two top prospects when they joined the Reds, although nearly unknown today.[2] It was also said that Harrington could throw out a baserunner from his knees.[2] In 1891, Harrington's second season with the Reds, he batted .228 with 25 runs, 76 hits, 10 doubles, five triples, two home runs, 41 RBIs, and four stolen bases in 92 games. In David L. Porter's Biographical Dictionary of American Sports: Q–Z, it was noted that Rhines, Harrington and fellow Reds teammate Pete Browning received fines and suspensions because of misbehavior outside of baseball.[3] Harrington played his final season with the Reds in 1892. In 22 games, Harrington batted .213 with six runs, 13 hits, one double, and three RBIs. In 1893, Harrington joined the Louisville Colonels, which would prove to be his final season in professional baseball. With the Colonels, Harrington batted .111 with four runs, four hits, one double, and three RBIs in 10 games.\n"
    },
    {
        "link": "/wiki/Chief_Johnson",
        "title": "Chief Johnson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Ripley",
        "paragraph": "George Howard \"Chief\" Johnson (March 20, 1886 – June 11, 1922) was an American professional baseball pitcher. He played three seasons in Major League Baseball (MLB), from 1913 to 1915, for the Cincinnati Reds of the National League and Kansas City Packers of the Federal League. He surrendered the first home run in the history of Wrigley Field, to Art Wilson on April 23, 1914.[1]\nJohnson was of Ho-Chunk, French and Irish ancestry. He identified as Ho-Chunk and was depicted in the media as a Native American.[2] A 1913 feature by Ripley's Believe It or Not! reported his full name as George Washington Murphy Johnson.[3]\nJohnson was shot to death in Des Moines, Iowa, on June 11, 1922,[4] at the age of 36. He had been in town to host a medicine show and had gotten into an argument during a dice game. The shooter, despite having confessed to police and being identified by witnesses, was eventually acquitted of first degree murder.[2]\n"
    },
    {
        "link": "/wiki/Mahaska_(Native_American_leader)",
        "title": "Mahaska (Native American leader)",
        "date": "1834 (aged 49–50)Nodaway River, Near Massena, Iowa",
        "year": "1834",
        "location": "",
        "state": "Iowa",
        "county": "Ioway",
        "paragraph": "Mahaska (archaic Ioway Maxúshga pronounced [mõxuʃꜜkɐ]; contemporary Maxúhga), or White Cloud, (1784–1834) was a chief of the Native American Iowa tribe. His son, also named Mahaska, was better known as Francis White Cloud.\nMahaska was born into the Iowa tribe.  He became chief at an early age after killing several enemy Sioux to avenge his father's death by them.\nLater Mahaska supposedly killed a French trader in an argument; he was arrested and imprisoned in St. Louis, Missouri.  After he escaped, he led a raid against the Osage.\n"
    },
    {
        "link": "/wiki/Murder_of_Michelle_Martinko",
        "title": "Murder of Michelle Martinko",
        "date": "December 19, 1979 (1979-12-19)",
        "year": "1979",
        "location": "Westdale Mall, Cedar Rapids, Iowa",
        "state": "Iowa",
        "county": "Cedar Rapids",
        "paragraph": "The murder of Michelle Martinko occurred in Cedar Rapids, Iowa, on December 19, 1979. It was a cold case until 2018, when familial DNA identified a suspect 39 years after the crime who was charged, tried and convicted of her murder.[2]\nMartinko, an 18-year-old high school student, was found stabbed to death in her family's car in the parking lot of a local mall, where she had gone to buy a new coat. The murder was closely followed within her community, and the police received more than 200 tips in the weeks following her killing. However, the case gradually grew cold as the investigation stretched on.\nIn 2006, a cold case investigator discovered unidentified blood, presumably belonging to the killer, while he was reviewing case files. A DNA profile was developed from that evidence and entered into the national Combined DNA Index System (CODIS), but no matches were found. In 2017, a company specializing in DNA phenotyping was hired to produce a new approximation of the killer's appearance based solely off the DNA sample. In 2018, the company entered the DNA data from the case into the public genealogy website GEDmatch, where it found a familial DNA match.\n"
    },
    {
        "link": "/wiki/Murders_of_Lee_Rotatori_and_Thomas_Freeman",
        "title": "Murders of Lee Rotatori and Thomas Freeman",
        "date": "c. July 1982 (murder)October 30, 1982 (discovery of body)",
        "year": "1982",
        "location": "Cobden, Illinois, U.S.",
        "state": "Illinois",
        "county": "Cobden",
        "paragraph": "On June 25, 1982, Lee Gunsalus Rotatori, a 32-year old American woman, was sexually assaulted and murdered in her hotel room by Thomas Oscar Freeman in Council Bluffs, Iowa. The murder went unsolved for nearly 40 years, until it was announced by authorities in 2022 that the perpetrator had been identified as Freeman using investigative genetic genealogy.\nAround July 1982, Freeman himself was murdered by an unidentified perpetrator in Cobden, Illinois. His decomposing body was found in a shallow grave around three months after his murder. As of 2022, the murder remains unsolved and the case remains open, and investigators believe the two murders were connected.\nLee Rotatori was a 32-year-old American woman from Nunica, Michigan who had recently relocated to Council Bluffs to work at the nearby Jennie Edmundson Hospital in June 1982. She was new to the area and did not have permanent housing, so she stayed at the Best Western Frontier Motor Lodge hotel for several nights.[1]\n"
    },
    {
        "link": "/wiki/Greg_Nicholson",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52)USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\n"
    },
    {
        "link": "/wiki/Oran_Pape",
        "title": "Oran Pape",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nOran Henry Pape (March 10, 1904 – April 30, 1936) was a member of the Iowa State Patrol in the United States. He is the first member of the Patrol to have been murdered in the line of duty. Prior to joining the Patrol, Pape played professional American football.\nPape played high school football at Dubuque Senior High School, where he was part of the 1924 state championship football team. He then played college football at the University of Iowa. Following college, he played in the National Football League for the Green Bay Packers, the Minneapolis Red Jackets, the Providence Steam Roller, the Boston Braves, and the Staten Island Stapletons. Pape was a member of the 1930 Green Bay Packers NFL Championship team. Pape left the NFL in 1934, and returned to Iowa.\n"
    },
    {
        "link": "/wiki/Edward_Arthur_Thomas",
        "title": "Edward Arthur Thomas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Parkersburg",
        "paragraph": "Edward Arthur Thomas[1] (July 17, 1950 – June 24, 2009) was an American high school football coach. On June 24, 2009, Thomas was shot and killed in his Parkersburg, Iowa football team's weight room by Mark Becker, one of Thomas' former players.[2] Thomas was airlifted to a Waterloo, Iowa hospital where he was pronounced dead shortly after arrival.[3]\nEd Thomas was born to Authrine and Roy Thomas in 1950.[4] He was born in Oskaloosa, Iowa and raised in What Cheer, Iowa. He played football; his position was quarterback. Thomas was the oldest of 5, having 3 younger sisters and one younger brother. He graduated from Tri-County High School in Thornburg, Iowa in 1968 and obtained degrees from William Penn College and the University of Northern Iowa.[4]\nThomas coached for 37 years in the \"IAHSAA\" (Iowa High School Athletic Association) football program; winning two state titles and a total of 292 games.[5]  He is credited with having coached four NFL players, which include Aaron Kampman, Brad Meester, Jared DeVries, and Casey Wiegmann. In 2005, Thomas won the prestigious NFL High School Coach of the Year award.[6] Landon Schrage was signed in 2006 as a long snapper for the Baltimore Ravens, making him the 5th player under Coach Thomas to reach the NFL.\n"
    },
    {
        "link": "/wiki/Murder_of_Mollie_Tibbetts",
        "title": "Murder of Mollie Tibbetts",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Brooklyn",
        "paragraph": "On July 18, 2018, University of Iowa student Mollie Cecilia Tibbetts disappeared while jogging near her home in Brooklyn, Iowa. A month later, police identified 24-year-old Cristhian Bahena Rivera as a suspect in connection with the disappearance; surveillance footage showed Rivera's car following Tibbetts on her jog. Rivera led police to the body of Tibbetts in a Poweshiek County cornfield on August 21. He was charged with first-degree murder. On May 28, 2021, Rivera was found guilty of first-degree murder.[2] On August 30, 2021, Rivera was sentenced to life in prison without parole.[3]\nRivera's immigration status became a politicized issue after police, the U.S. Citizenship and Immigration Services (USCIS), and U.S. Immigration and Customs Enforcement (ICE) indicated that he had been in the United States illegally. The Trump administration and some Republicans, including Iowa governor Kim Reynolds, argued the murder could have been prevented with more restrictive immigration policies. Tibbetts's family denounced efforts to use Tibbetts's death for political purposes.[4]\nMollie Cecilia Tibbetts was born on May 8, 1998, in San Francisco, California, to Rob Tibbetts and Laura Tibbetts. When she was in the second grade, her parents divorced, and she moved to Iowa with her mother and two siblings.[5] Her father kept a close relationship with the children, and he last saw Mollie at his wedding in June 2018.[6][7] At the time of her disappearance, she was a resident of Brooklyn, Iowa, a small town about 70 miles (110 km) east of Des Moines, and a psychology major at the University of Iowa.[8] She worked at a children's day camp at Grinnell Regional Medical Center and was preparing for her sophomore year in college when she disappeared.[5][9]\n"
    },
    {
        "link": "/wiki/Shao_Tong",
        "title": "Murder of Shao Tong",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Iowa City",
        "paragraph": "Coordinates: 41°38′07″N 91°29′58″W﻿ / ﻿41.63539°N 91.49937°W﻿ / 41.63539; -91.49937\nOn September 26, 2014, police found a body later identified as 19-year-old Shao Tong (Chinese: 邵童, November 1994 – September 2014),[1] a Chinese undergraduate at Iowa State University (ISU), in the trunk of a car registered in her name parked in an apartment complex on the outskirts of town in Iowa City, Iowa. She had been reported missing nine days earlier.[2] The cause of death was found to be homicide by suffocation.[3]\nShao had last been seen on September 7 at a hotel outside Nevada, a small town east of Ames, where ISU is located. She had been spending the weekend there with her boyfriend, Li Xiangnan (Chinese: 李向南), a student at the University of Iowa, located in Iowa City. Her car and body were in the apartment complex he lived in.[4]\n"
    },
    {
        "link": "/wiki/Farmers%27_Holiday_Association",
        "title": "Farmers' Holiday Association",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "county": "Sioux City",
        "paragraph": "The Farmers' Holiday Association was a movement of Midwestern United States farmers who, during the Great Depression, endorsed the withholding of farm products from the market, in essence creating a farmers' holiday from work. The Farmers' Holiday Association was organized in May 1932 by Milo Reno.[1] The group urged farmers to declare a \"holiday\" from farming, with a slogan of \"Stay at Home-Buy Nothing-Sell Nothing\"  and \"Lets call a Farmer's Holiday, a Holiday let's hold.  We'll eat our wheat and ham and eggs, And let them eat their gold\".[2]\nFarmers went to extreme measures to ensure that their wants were carried through. One person was killed when the farmers began to blockade roads, and other farmers rallied to destroy their crops, reducing supply, and raising prices.  The highways into Sioux City and Council Bluffs, Iowa, were blocked by pickets who dumped farm produce on the side of the road.[3] At Le Mars, Iowa some farmers dragged a judge out of his courtroom, placed a noose around his neck, and threatened to hang him unless he stopped approving farm foreclosures. The striking farmers were countered by  sheriffs, militia, and vigilante groups.[1]\nFarmers' Holiday Association activity subsided by 1934.[1]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Iowa",
        "title": "George Floyd protests in Iowa",
        "date": "May 28, 2020 – June 5, 2020",
        "year": "2020",
        "location": " Iowa, United States",
        "state": "Iowa",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Iowa, United States.\nRoughly 300 people gathered the evening of May 30 to march around Ames' City Hall.[1]\n"
    },
    {
        "link": "/wiki/Iowa_Cow_War",
        "title": "Iowa Cow War",
        "date": "September 21–25, 1931 (1931-09-21 – 1931-09-25)",
        "year": "1931",
        "location": "Cedar County, Iowa, US",
        "state": "Iowa",
        "county": "Cedar County",
        "paragraph": "\nThe Iowa Cow War of 1931 involved violent disputes over the testing of cows for bovine tuberculosis. After distrustful farmers tried and failed to repeal the testing program, they gathered in numbers to block tests from taking place. The farmers believed that the test might infect cows with tuberculosis or make pregnant cows have spontaneous abortions. They also believed that the testing was unconstitutional. The owner of Muscatine radio station KTNT, Norman G. Baker, spread misinformation which resulted in more farmers protesting testing, sometimes causing violence. The Iowa Cow War came to a conclusion when 31 Iowa National Guard units were deployed to stop the protesting. Two farmers were arrested for their actions during the conflict.\nBovine tuberculosis was an issue for Iowans prior to the eradication of the disease starting in 1929. In 1894, an Iowa veterinarian said that tuberculosis was the main issue that his office faced. People often did not understand the danger of tuberculosis in cows due to the long period of incubation and its effects. Many respected medical professionals thought that cows were unable to transmit the disease to people, including Robert Koch, who completed early research on tuberculosis.[1] The State of Iowa required the tests to reduce the frequency with which dairy cattle with tuberculosis would contaminate the milk supply and cause milk-drinking people to contract the disease.[2] The program was financed by a property tax levy of up to 3 mills.[2] In 1929, the Iowa State Legislature passed a law stating that all cows, whether used for dairy or meat, had to be tested for bovine tuberculosis. Iowa farmers, who did not trust the tests, were opposed to the law. The farmers believed that the test might infect cows with tuberculosis or make pregnant cows have spontaneous abortions. They also thought that the test was against the United States Constitution, but this was dismissed by the Iowa Supreme Court in 1930.[3]\n"
    }
]