[
    {
        "link": "/wiki/Capital_punishment_in_Iowa",
        "title": "Capital punishment in Iowa",
        "date": "",
        "year": "new 1834",
        "location": "",
        "state": "Iowa",
        "place": "",
        "county": "",
        "paragraph": "\nCapital punishment has been abolished in Iowa since 1965. Forty-five men were executed by hanging in Iowa between 1834 and 1963 for crimes including murder, rape, and robbery.[1]\nThe first time that Iowa abolished the death penalty was in 1872, as a result of anti-death sentiment in the state, much due to Quaker, Unitarian and Universalist religious sentiment. By contrast, Presbyterians and Congregationalists advocated the retention of capital punishment, on biblical grounds. Anti-death penalty sentiment had been present in Iowa from its beginnings – first territorial Governor of Iowa Territory, Robert Lucas, at his first message to the Iowa Territorial Assembly in November 1838, advocated that capital punishment should be abolished. However, despite his advocacy, the Assembly passed legislation providing the death penalty for murder, to replace the existing legislation inherited from the Territory of Michigan providing for the same.[2]\nIn 1846, the Chief Justice of the Iowa Territorial Supreme Court, Charles Mason, founded the Iowa Anti-Capital Punishment and Prison Discipline Society, which campaigned for the death penalty to be abolished. The Society supported a bill in 1847 to replace mandatory capital punishment for murder with discretionary (giving the jury the choice between death and life imprisonment); the bill passed the Senate but failed in the House. In 1851, both the House and Senate initially passed a new Criminal Code abolishing the death penalty; however, the intervention of a Presbyterian minister, Rev. Silas H. Hazzard, convinced the House to change its mind and reject the abolition, and after some disagreement the Senate relented and accepted the House's version of the Criminal Code with the death penalty still included. The Iowa Anti-Capital Punishment Society disbanded in 1851.[2]\nThe 1872 abolition was triggered by the case of George Stanley, who had been convicted of murder and sentenced to hang; Catholics and Quakers lobbied Governor Cyrus C. Carpenter to grant clemency. Carpenter expressed personal opposition to the death penalty, but said that it would be improper for him to grant clemency based on his personal feelings. Four days before Stanley's scheduled execution, both houses of the Iowa State Legislature passed resolutions requesting clemency, on the grounds that they planned to legislate the abolition of the death penalty; the Governor responded to this with a reprieve of execution. Following this, legislation to abolish the death penalty was passed by the House and presented to the Senate; in the Senate, it encountered difficulty, and was rejected twice before finally being passed.[2]\nHowever, subsequent to the abolition there was an increasing incidence of lynching, which was widely blamed on the abolition, and led to its reinstatement in 1878.[3][4] Iowa was the first ever state to reinstate the death penalty having previously abolished it.[2]\nThe last execution to take place in Iowa was on March 15, 1963, at Iowa State Penitentiary, when Victor Harry Feguer was hanged for murder and kidnapping; however, Feguer's execution was under federal law; Feguer's execution was the last federal execution until Timothy McVeigh's in 2001.[5] The last person to be executed in Iowa under Iowa state law was Charles Kelley on September 6, 1962.\nIowa abolished the death penalty for a second time in 1965, with a bill signed by Governor Harold Hughes.[6] Since then, there have been repeated attempts to reinstate the death penalty, but none have managed to pass both houses of the Iowa State Legislature.\nThen-Governor Terry Branstad made reinstatement of the death penalty a central focus of his 1994 re-election campaign; however, despite successfully being re-elected, he was unable to implement this policy due to opposition from Democrats in the Iowa State Senate.[7]\nIn 2006, a Des Moines Register poll found 66% of Iowa adults favored reinstating the death penalty, while 29% opposed it.[8]\n",
        "type": [
            "murder",
            "sexual assault",
            "robbery",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/University_of_Iowa_shooting",
        "title": "University of Iowa shooting",
        "date": "November 1, 1991 3:42 – 3:52 p.m. (CST)",
        "year": "1991",
        "location": "Iowa City, Iowa, U.S.",
        "state": "Iowa",
        "place": "Iowa City",
        "county": "Johnson County",
        "paragraph": "The University of Iowa shooting was a mass shooting that occurred in Iowa City, Iowa, on November 1, 1991. Gang Lu, a 28-year-old former graduate student at the University of Iowa, killed three members of the Physics and Astronomy Department faculty, an Associate Vice President for Academic Affairs, and a fellow student, then seriously injured another student working at the university's campus, before committing suicide.\nGang Lu (Chinese: 卢刚; pinyin: Lú Gāng; c. 1962 – November 1, 1991),[1] was a 28-year-old Chinese graduate student at the University of Iowa who had received his doctoral degree in physics and astronomy from the university in May 1991.[2] The 18-year-old Lu began studying physics at Peking University in Beijing, where he passed the CUSPEA exam in 1984 and was admitted to study in the United States, becoming a graduate student at the University of Iowa. As a graduate student, Lu was primarily a loner who was perceived by at least one other graduate student to have a psychological problem if challenged and was reported to have had abusive tantrums.[3][4] Lu was infuriated because his dissertation, titled Study of the \"Critical Ionization Velocity\" Effect by Particle-in-Cell Simulation, did not receive the prestigious D. C. Spriestersbach Dissertation Prize, which included a monetary award of $2,500. The Tiananmen Square protests of 1989 led many Chinese students to become eager to stay in the United States, and Lu believed that winning the prize would have made it easier for him to get a job and not have to return to China. Normally, Lu would have gotten a postdoctoral researcher position, but there was not enough money to support him.[5]\nIn the months prior to the shooting, Lu was still living in Iowa City and wrote five letters explaining the reasons for his planned actions. According to university officials, four of the five letters were written in English and one was written in Chinese, intended to be mailed to news organizations. The letters have never been released to the public.\nHowever, Edwin Chen's book Deadly Scholarship includes a statement by Lu, written in imprecise English, intended to be read after his attack and suicide, which Laura Hamlett characterized as a manifesto; and, in translation, a letter by Lu to his sister.\nOn Friday, November 1, 1991, Gang Lu attended a meeting for the theoretical space plasma physics research group in a conference room on the third floor of Van Allen Hall at the university's campus. A few minutes after the meeting began, Lu shot three attendees of the meeting with a .38 Special revolver, then proceeded to the second floor to shoot the chairman of the department in his office.[4] Those who were shot in Van Allen Hall were:\nAfter the shootings at Van Allen Hall, Lu walked three blocks to Jessup Hall to the office of T. Anne Cleary, an associate vice president for Academic Affairs and grievance officer at the university, and shot her in the head. Lu had filed several grievances about not being nominated for the Spriestersbach prize. Cleary died the following day at the University of Iowa Hospital. Lu then shot Miya Rodolfo-Sioson, a 23-year-old student temporary employee in the Office of Academic Affairs, for unknown reasons. Rodolfo-Sioson survived but was left paralyzed from the neck down, and died from inflammatory breast cancer on December 3, 2008.[8] Lu had intended to kill university president Hunter Rawlings III, but he was attending the Iowa/Ohio State football game in Columbus, Ohio, at the time. Gang Lu was found in room 203 of Jessup Hall with a self-inflicted gunshot wound to the head. Lu died shortly after police arrived.\nWriter Jo Ann Beard wrote an acclaimed personal essay based in part on the killings. Her essay, entitled \"The Fourth State of Matter\", was originally published in The New Yorker. It appeared in the 1997 edition of Best American Essays. The essay was later included in her collection of personal essays, The Boys of My Youth. Beard worked as an editor for a physics journal at the university and was a colleague of the victims. She had been close friends with Goertz.\nLoosely based on Gang Lu's story, Chinese director Chen Shi-zheng made a feature film, Dark Matter, starring Liu Ye and Meryl Streep. However, the story in Dark Matter has substantial differences in plot and character motivation.  The film won the Alfred P. Sloan Prize at the Sundance Film Festival in 2007.[9]\nThe educational series Discovering Psychology, \"Cultural Psychology\" (episode 26, updated edition) discusses Gang Lu (at the 3:50 minute mark) [10]\n",
        "type": [
            "murder",
            "shooting",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Donald_Piper_(murderer)",
        "title": "Donald Piper (murderer)",
        "date": "",
        "year": "new 1993",
        "location": "",
        "state": "Iowa",
        "place": "Des Moines",
        "county": "Polk County",
        "paragraph": "Donald Arthur Piper (born May 11, 1961) is an American murderer and suspected serial killer convicted of killing two women in hotels around West Des Moines and Clive, Iowa in 1993 and 1997, but is considered a suspect in four other killings. For his confirmed crimes, Piper was convicted and sentenced to two life terms.\nDonald Arthur Piper was born on May 11, 1961 in West Des Moines, Iowa. Little is known of his personal background, aside from the fact that he apparently suffered from frequent headaches as a teenager.[1] In 1979, he started working as a maintenance engineer for a Hyatt hotel in Des Moines. In 1984, he was transferred to work in Denver, Colorado for two years before eventually returning to Des Moines, where he worked for several other hotels in the following years.[2]\nPiper had no criminal record up until 1993, when a maid from a Holiday Inn he worked at, filed a sexual harassment lawsuit against him. In the lawsuit, Morris claimed that he incessantly stalked, wrote love letters and fondled her, and on one occasion even locked her in a cleaning closet in an attempt to force her into having sex.[2] In addition to this, she claimed that other employees were afraid of him due to his bad temper, and that he even went so far as to change the lock of the room when the pair had sex, which she described as being very violent and rough. Piper himself denied the accusations and claimed that it was consensual, only admitting to the fact that he had indeed cheated on his wife. The matter was eventually settled out of court for an undisclosed amount of money.[2]\nOn August 23, 1993, the body of 36-year-old Patricia Lange was found in room 732 of a Holiday Inn in West Des Moines, Iowa, by an employee who worked there. She had been tied up, and evidently strangled with some sort of ligature.[3] At the time of her death, Lange had just recently returned to her native Iowa from Denver, Colorado and started a job as a database administrator for Northwest Mortgages, Inc.[4] As she was a known as an academically gifted woman with no known enemies, the killing came as a shock to everyone who knew her. Despite seizing her loaned car and gathering various items from the crime scene, the investigators were unable to identify a potential suspect in the case.[5] In response to this, her employers and the owners of the Holiday Inn offered a $50,000 reward for any information that could lead to an arrest.[6]\nFour years later, on September 4, 1997, 21-year-old Zurijeta Sakanovic was found stabbed to death at a Budgetel Inn in Clive. Sakanovic, who had recently immigrated to the States with her family from Teslić, Bosnia and Herzegovina, worked as a maid at the hotel along with other refugees fleeing persecution in their native country.[7] Like with Lange before her, there were no immediate suspects in Sakanovic's killing, and the case went cold after some time.[7] Due to the shock they experienced over their daughter's murder, the Sakanovic family decided to leave the United States and return to Bosnia.[8]\nIn mid-January 2000, police started centering their attention on Piper, as he worked as a mechanical engineer in the aforementioned hotels and thus had keys for every room in the building.[9] Before any charges were brought against him, he agreed to be interviewed by The Des Moines Register, in which he complained that the police surveillance was ruining his family life and had cost him his job due to their practises. This sentiment was echoed by his lawyer, Alfredo Parrish, who claimed that the officers' conduct was \"outrageous.\"[10]\nA few days after this interview, Piper was officially charged with Lange's murder. Upon learning this, he surrendered himself at the local police station, accompanied by his lawyer.[11] After his arrest, he was held at Polk County Jail on a $500,000 bond.[12] He was eventually brought to trial for her murder, but it eventually resulted in a mistrial due to the fact that the prosecution mishandling evidence and failing to disclose the fact that they had DNA swab evidence that they previously claimed had been destroyed, according to Parrish.[13] Due to this, the trial was rescheduled for January 2001.[14]\nThis initial date was pushed to April 2001, as Piper had to undergo drug therapy in February and was considered temporarily incompetent to stand trial.[1] After regaining competence, he was put on trial and eventually convicted of Lange's murder, for which he received the mandatory sentence of life imprisonment without parole.[15] The following year, he was tried for Sakanovic's murder, and due to the overwhelming amount of evidence linking him to the case, he was again found guilty and given a second life term without parole.[16] At the sentencing phase, Sakanovic's sister-in-law Emsuda made a statement in court proclaiming that their family despised him and wished for his suffering in prison, to which Piper did not reply.[17]\nAfter his conviction, Piper was transferred to serve his sentence at the Iowa State Penitentiary in Fort Madison. In 2009, he filed an appeal to the Polk County Court, claiming ineffective assistance of counsel. This claim was rejected by Justice Joel Novak, who claimed that his lawyers were professionals and made none of the mistakes that he claimed they had made in his appeal.[18] As of May 2022, Piper is still incarcerated at Iowa State Penitentiary.\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/2016_murders_of_Des_Moines_police_officers",
        "title": "2016 murders of Des Moines police officers",
        "date": "November 2, 2016 (2016-11-02) c. 1:06 a.m. – c. 1:09 a.m. (CT)",
        "year": "2016",
        "location": "Urbandale and Des Moines, Iowa, U.S.",
        "state": "Iowa",
        "place": "Des Moines",
        "county": "Polk County",
        "paragraph": "\nIn the early hours of November 2, 2016,  Des Moines Police Department officer Anthony Beminio and Urbandale Police Department officer Justin Martin were killed in separate \"ambush-style\" shootings in and near Des Moines, Iowa. The perpetrator in both shootings, identified as 46-year-old Scott Michael Greene of Urbandale, Iowa, was apprehended by police hours later. Greene pleaded guilty to two counts of first-degree murder and was sentenced to life without parole on May 20, 2017.[1]\nAccording to a report released in 2016 by the National Law Enforcement Officers Memorial Fund, 50 U.S. police officers were killed by homicide as of late July, representing a significant increase from the 33 officers murdered in 2015. The report also noted an increase of \"ambush killings\" targeting officers, with fourteen incidents recorded. Also in July 2016, there had been two mass shootings targeting police officers in Dallas, Texas, and Baton Rouge, Louisiana, in a ten-day period. Speaking for the Des Moines Police Department after the Des Moines-area shootings, Sergeant Paul Parizek noted, \"There is a clear and present danger to police officers right now.\"[2][3]\nOn November 2, 2016, Justin Martin, an Urbandale police officer, was killed shortly after 1:00 a.m. in Urbandale, located about 7.5 miles (12.1 km) northwest of Des Moines. Officers responding to a 1:06 report of shots being fired found him dead in his patrol car. About 20 minutes later, Sergeant Anthony Beminio, a Des Moines police officer, was found shot in his vehicle at a nearby intersection, about 2 miles (3.2 km) from the first scene. Beminio was taken to the Iowa Methodist Medical Center, where he died, according to Sergeant Parizek.[4][5][6] Security footage of Beminio's death, time-stamped at about 1:09, depicted him being fired upon by a man who had driven a truck beside Beminio's vehicle.[7]\nThe two slain officers were identified as:\nScott Michael Greene, 46, was identified by police as the sole suspect[12] in both shootings through \"a series of leads and investigative tips\", including a vehicle description provided by a witness. He was a resident of Urbandale.[4][9][13]\nLess than two hours after his identification, the Dallas County Sheriff's Office and the Iowa State Patrol apprehended Greene at 9:15 a.m. According to police, he was found walking unarmed down G Trail at 320th Way, a gravel road in Wiscotta, located south of Redfield and some 35 miles (56 km) west of the shootings.[14][15] He had flagged down an Iowa Department of Natural Resources officer and asked him to call 9-1-1. He was transported to a hospital after he complained of a preexisting health problem.[2][3][8][11][16][17]\nGreene had three children from two relationships and was an employee at a furniture store from June 2006 to August 2013.[18][19] Also, for three separate times in recent years, he had been a part-time worker at two local Ace Hardware stores.[20]\nIn October 2016, he was hired by a small construction business in Ankeny that specialized in fences, even though he had no experience building fences. He had told the company that he \"was pretty desperate\" for a job and that he needed to support his teenage daughter. The company sent him home after three days \"because he was not taking directions and wasn't working\", and though it gave him the chance to return to work under a different crew, Greene quit instead. Afterwards, he posted a video on YouTube of a worker driving a truck, and claimed, in a written message below the video, that the company fired him after he reported unsafe driving.[11][21]\n",
        "type": [
            "murder",
            "shooting",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Killing_of_Autumn_Steele",
        "title": "Killing of Autumn Steele",
        "date": "January 6, 2015 (2015-01-06)",
        "year": "2015",
        "location": "104 S. Garfield Avenue, Burlington, Iowa, U.S.",
        "state": "Iowa",
        "place": "Burlington",
        "county": "Des Moines County",
        "paragraph": "\nOn January 6, 2015, Autumn Steele, a 34-year-old woman, was fatally shot at her home in Burlington, Iowa by police officer, Jesse Hill, during a response to a domestic disturbance call.  In June 2018, a civil lawsuit was settled between the City of Burlington and the Steele family over her death.\nOn January 6, 2015, Officer Jesse Hill was dispatched to the Steele home in response to a domestic-disturbance call.  Police said when Hill arrived, Autumn was screaming at and attacking her husband Gabriel (who was holding their young child).[1] Hill said the family dog bit him as he was trying to protect the husband and child. He said he tried shooting the dog twice, but he slipped. One of his bullets hit Autumn Steele in her torso; she later died of her injuries.[2] A neighbor told a local newspaper the officer was trying to break up the Steele's argument and was startled by the couple's dog.  The Steeles' German Shepherd was confiscated by the police under a search warrant and was placed in the city's dog pound for observation. The dog was later deemed \"not vicious\" and returned. Officer Hill was treated for at least one dog bite.[2]\nOn February 27, 2015, Des Moines County Attorney Amy Beavers provided a 7-page letter to the Iowa Department of Criminal Investigations stating that she would not prosecute Hill under manslaughter charges. The Associated Press reported that Beavers said her decision was supported by body camera evidence, witness statements, and reports from the Iowa Division of Criminal Investigation. Hill had to make an instantaneous decision as the threat was occurring, Beavers said. Adam J. Klein, an attorney who represents Steele's 7-year-old son, said in a news release that Beavers' statement made it appear she reached her \"determination by simply ignoring Iowa law\".[3]\nIn June 2015, Iowa Senator Chuck Grassley requested Nicholas Klinefeldt, the U.S. attorney for the Southern District of Iowa, to consider a federal investigation in the shooting. A spokesperson from the office neither confirmed nor denied the existence of the ongoing investigation into the matter.[4]\nIn December 2015, the Steele family and transparency-advocacy groups pushed for all body-camera footage related to the incident to be released, including by pursuing legal action.[5][6] That same month, bomb threats were made to Burlington City Council members, which police said were linked to the shooting. However, investigative records to the threats were never disclosed and the perpetrator involved has yet to be arrested.[7]\nIn 2016, Des Moines County Attorney Beavers was found by the Iowa Public Information Board to have violated the Open Records Law after giving conflicting statements of accounts. She agreed to settle with the board to pay a $200 fine in exchange in not having to admit guilt.[8]\nOn November 16, 2016, a lawsuit was filed by the family of Steele against the City of Burlington and Officer Hill in response to the shooting.[9]\nAttorneys representing the City of Burlington and the Burlington Police Department filed an appeal to dismiss the open records violation case against them in January 2017. Administrative Law Judge Karen Doland dismissed the appeal exclaiming that the case has merit and should be ruled. The hearing was going to be held on April 19 but was postponed. Instead, another pretrial conference would be held that day[10] It was determined from the pretrial conference that the hearing will be set on August 29.[11] However, several claims were dismissed in the lawsuit due to U.S District Judge James E. Gritzner granting approval for City of Burlington's attorneys but denied dropping the suit entirely.[12]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    {
        "link": "/wiki/Celia_Barqu%C3%ADn_Arozamena",
        "title": "Celia Barquín Arozamena",
        "date": "17 September 2018(2018-09-17) (aged 22) Ames, Iowa, U.S.",
        "year": "2018",
        "location": "",
        "state": "Iowa",
        "place": "Ames",
        "county": "Story County",
        "paragraph": "\nCelia Barquín Arozamena (6 July 1996 – 17 September 2018) was a Spanish amateur golfer. She won the 2018 European Ladies Amateur Championship.\nBarquín was born in Puente San Miguel and educated in Torrelavega and then in Madrid. She spent two years in a residential training programme run by the Spanish Sports Council before moving to the United States,[1] where she was a member of the Iowa State Cyclones women's golf team from 2014 to 2018 and was the Iowa State University Female Athlete of the Year for 2018.[2]\nShe played for Spain at the 2015 and 2016 European Ladies' Team Championship, where the team finished third and second respectively.[3] She won the 2018 European Ladies Amateur Championship held at the Penati Golf Resort in Slovakia, finishing a stroke ahead of Esther Henseleit.[4][5] In the third round, she set a course record of 63.[3] She qualified for the 2018 U.S. Women's Open, where she missed the cut. In 2018, she reached Stage II of the LPGA Q-School, which is to be played in mid-October.[3]\nBarquín was in her final year of a degree in civil engineering after completing her eligibility for the university golf team with the 2017–2018 season.[2] On 17 September 2018 at 10:24 a.m., the Ames Police Department were called and discovered her dead body at the Coldwater Golf Links in Ames, Iowa.[6] Collin Richards, a 22-year-old homeless man who had been living in an encampment near the golf course, was charged with her murder. An acquaintance said Richards had told him that he had \"an urge to rape and kill a woman\" according to The New York Times.[2][3][7] He pled guilty to first degree murder and was sentenced on 23 August 2019 to life in prison.[8][9]\nBarquín, the most accomplished women's golfer in Iowa State University history, was honored on Saturday, 22 September 2018, at Jack Trice Stadium in Ames, Iowa. At 10:50 a.m. CDT (UTC−05:00), a video tribute and a moment of silence in honor of her occurred before the Iowa State vs. Akron football game. Fans wore her favorite color, yellow. Proceeds from the sale of yellow T-shirts with her initials, CBA, on the front went to the \"Remembering Celia Memorial Fund\". Additionally, in her honor, both the Iowa State and the Akron Zips football teams wore her initials, CBA, as a decal on their helmets and the Iowa State University Cyclone Football Varsity Marching Band formed a CBA during their routine. Posthumously, Barquín will receive a civil engineering diploma from Iowa State University.[7][10][11][12]\nPrior to her death, Barquín was to receive the Iowa State female student-athlete of the year award at Jack Trice Stadium on 22 September 2018.[13][14]\nDuring the 2018 Ryder Cup, all players, both the United States and the European Union, wore yellow ribbons with her name, Celia, on them in her honor at Le Golf National.[15][16]\nThe Remembering Celia Memorial Fund was established for the family of Barquín. All money collected will be used to honor her memory and directed to her family.[11][17]\n",
        "type": [
            "murder",
            "sexual assault"
        ]
    },
    {
        "link": "/wiki/List_of_people_executed_in_Iowa",
        "title": "List of people executed in Iowa",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "place": "",
        "county": "",
        "paragraph": "\n\n \nThe following is a list of people executed by the U.S. state of Iowa from 1834 to 1963.\nCapital punishment was abolished in Iowa in 1965.[1] 45 people were executed in Iowa from 1834-1963, all by hanging.[2] In 2020, a man from Iowa, Dustin Lee Honken, was federally executed at USP Terre Haute by lethal injection.[3]\n",
        "type": []
    },
    {
        "link": "/wiki/Buck_Barrow",
        "title": "Buck Barrow",
        "date": "July 29, 1933(1933-07-29) (aged 28) Perry, Iowa, US",
        "year": "1933",
        "location": "",
        "state": "Iowa",
        "place": "Perry",
        "county": "Dallas County",
        "paragraph": "Marvin Ivan \"Buck\" Barrow (March 14, 1905 – July 29, 1933) was a member of the Barrow Gang. He was the older brother of the gang's leader, Clyde Barrow. He and his wife, Blanche, were wounded in a gun battle with police four months after they joined up with Bonnie and Clyde. Buck died of his injuries soon afterward.\nMarvin Ivan \"Buck\" Barrow was born in Jones Prairie, Marion County, Texas, the third child of Henry and Cumie Barrow. An aunt, watching the little boy \"running around acting like a horse,\" gave him the nickname Buck.[1] He ceased attending school around age 8 or 9 and enjoyed fishing and hunting instead.\nIn the early 1920s the older Barrow children left the family farm one by one, to marry and start careers in Dallas. At 18 or 19 Buck too went to Dallas, ostensibly to work for his brother repairing cars, but he quickly became part of the West Dallas petty-criminal underworld. His sister Marie, barely school age when she and her parents moved to the West Dallas campground, remembered watching him put spurs on roosters for cockfighting, and his pitbull, which tore off the back of her dress.[2] He married twice and divorced twice during this time, and had three children by those marriages.[3] Just before Christmas 1926 Buck, 23, and Clyde, 17, were arrested with a truck full of stolen turkeys they intended to sell for the holidays. Buck took the rap for himself and his brother and went to jail for a week, but the turkey adventure was an ironic joke, as by now Buck was making ends meet by stealing automobiles in cities all over Texas and selling them for a comfortable $100 or so to fences out of state.\nOn November 11, 1929, Barrow met Blanche Caldwell in an unincorporated part of Dallas County called West Dallas. They fell in love almost immediately.\nOn November 29, 1929, several days after meeting Blanche, Barrow was shot and captured following a burglary in Denton, Texas. He was tried, convicted, and sentenced to four years in the Texas State Prison System. On March 8, 1930, however, Barrow escaped from the Ferguson Prison Farm near Midway, Texas. He simply walked out of the prison, stole a guard's car, and drove to his parents' place in West Dallas where Blanche was living.\nIn interviews with author/historian John Neal Phillips, Blanche was frank about the fact that she not only knew of Buck's escape but that she hid with him and actually staged robberies with him.  The notion that Blanche did not know until later that Buck was an escaped convict was fabricated by the Barrow family and Blanche herself as a means of convincing Missouri State authorities to reduce her prison sentence following her capture in July 1933.\nOn July 3, 1931, Blanche and Buck were married in Oklahoma. Blanche was not interested in pursuing a criminal career. She and other members of the Barrow family convinced Buck to turn himself into Texas prison authorities and complete his sentence. Two days after Christmas 1931 his mother and his wife drove him to the gate of Huntsville penitentiary, where he told surprised prison officials that he had escaped almost two years before and needed to resume his sentence.  They welcomed him in.\nDuring his two years at Huntsville Buck sent repentant letters home, written for him by fellow prisoners. Before he had served two years of his six-year sentence he was abruptly pardoned, partly as part of Texas governor Ma Ferguson's plan to decrease prison crowding and partly due to the lobbying efforts of his wife and his mother.\nUpon his release, on March 22, 1933, Buck Barrow, in the company of Blanche, joined his younger brother Clyde, Bonnie Parker, and W. D. Jones in Joplin, Missouri where he participated in several armed robberies.\n",
        "type": [
            "shooting",
            "robbery"
        ]
    },
    {
        "link": "/wiki/Jetseta_Gage",
        "title": "Jetseta Gage",
        "date": "March 24, 2005 (aged 10)",
        "year": "2005",
        "location": "",
        "state": "Iowa",
        "place": "Johnson County",
        "county": "Johnson County",
        "paragraph": "Jetseta Marrie Gage (August 25, 1994 – March 24, 2005) was an American child whose kidnapping, rape and murder prompted major changes in sentencing laws for those who commit child sex crimes in Iowa. Roger Bentley, a convicted sex offender and friend of Gage's family, was arrested in connection with 10-year-old Jetseta's death. He was convicted of first-degree murder and first-degree kidnapping on January 31, 2006.[1] On February 24, he was sentenced to two consecutive mandatory sentences of life in prison without parole.[2]\nProsecutors alleged that Bentley took Gage from her home to a run-down trailer in rural Johnson County, Iowa, where he raped and killed her. An AMBER Alert was issued shortly after it was noticed that she was missing. The AMBER Alert program had errors that night. A proper description with name and picture did not appear until hours after she had vanished. Bentley was arrested a day later. Investigators found her body inside a bathroom cabinet inside the trailer.\nBentley's trial was moved to Scott County on the defense's change of venue motion because of extensive pre-trial publicity; local media dubbed the case \"Justice for Jetseta.\" During his trial, prosecutors linked DNA evidence found on Gage's body to Bentley, while the defense (which did not call any witnesses) claimed there were no eyewitnesses to the crime or direct evidence.[3][4] It took just over two hours for the jury to arrive at its guilty verdict.\nBentley's brother, 34-year-old James Bentley, was indicted in November 2004 on felony sexual abuse charges after authorities alleged he sexually abused Gage between 2002 and 2004. The Bentley brothers were not strangers to the family. Gage's mother had dated both men and allowed the brothers contact with her children. James Bentley was found guilty of second-degree sexual abuse at the Clarke County courthouse in Osceola, Iowa, on August 1, 2008.[5] On March 1, 2007, a federal judge in Cedar Rapids found James Bentley guilty of six counts of child pornography and sexual exploitation charges in a separate trial. Bentley was accused of taking explicit photos of Gage and another infant girl in late 2003 and transporting those photos with him to Arkansas shortly afterwards.[6] He was sentenced to life in prison without parole on June 12, 2007.[7]\nWriters and broadcasters affiliated with the Associated Press named the Jetseta Gage murder as Iowa's top news story of 2005.[8]\nIn 2005, the Iowa General Assembly passed a bill extending prison sentences and strengthening supervision of sex offenders – through methods such as electronic monitoring – upon their release from prison.\nAlso, numerous local governments throughout the state moved swiftly to enact stricter residency restrictions for sex offenders. Like a number of other states, Iowa already had a moratorium barring those on the sex offender registry from living within 2,000 feet (610 m) of a school or state-registered day care center, and local officials proposed expanding the buffer zone to such child-oriented places as libraries, parks and swimming pools.[9] While some cities and county governments passed such ordinances, other governments – such as the city of Davenport and Scott County – were cool to the proposal and ultimately did not enact the tighter restrictions.[10][11]\nCritics contended that the stricter residency proposals had several flaws, most notably:\nIn January 2006, 45 members of the Iowa Senate – 23 Democrats and 22 Republicans – co-sponsored a bill increasing the penalties for those convicted of certain sex crimes, including lascivious acts with a child and sexual exploitation of a minor. Under the proposal, a first-time offender would face a mandatory minimum 25-year prison sentence upon conviction.[12]\n",
        "type": [
            "murder",
            "sexual assault",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/Murder_of_Shao_Tong",
        "title": "Murder of Shao Tong",
        "date": "",
        "year": "new 2015",
        "location": "",
        "state": "Iowa",
        "place": "Iowa City",
        "county": "Johnson County",
        "paragraph": "Coordinates: 41°38′07″N 91°29′58″W﻿ / ﻿41.63539°N 91.49937°W﻿ / 41.63539; -91.49937\nOn September 26, 2014, police found a body later identified as 19-year-old Shao Tong (Chinese: 邵童, November 1994 – September 2014),[1] a Chinese undergraduate at Iowa State University (ISU), in the trunk of a car registered in her name parked in an apartment complex on the outskirts of town in Iowa City, Iowa. She had been reported missing nine days earlier.[2] The cause of death was found to be homicide by suffocation.[3]\nShao had last been seen on September 7 at a hotel outside Nevada, a small town east of Ames, where ISU is located. She had been spending the weekend there with her boyfriend, Li Xiangnan (Chinese: 李向南), a student at the University of Iowa, located in Iowa City. Her car and body were in the apartment complex he lived in.[4]\nLi was not present. Police believe that after abruptly checking out of the hotel the following morning, he had used her phone to text her friends that she was going to be away for a while and that Li had to return to China for a family emergency. While there was no evidence of Shao's purported travel, Li had flown back to Beijing, but beyond that point his whereabouts were unknown.\nEarly in 2015, authorities in Johnson County charged Li with first-degree murder and obtained an arrest warrant. Chinese Internet users began circulating pictures of Li, who remained at large. After Chinese detectives traveled to Iowa to visit the crime scene and review evidence, they too charged Li with intentional murder under Chinese law, which allows the prosecution of any Chinese citizen for a crime even if it occurred abroad. He surrendered to police in his native Wenzhou in May. The case was prosecuted there, since not only is there no extradition treaty between China and the United States, China does not extradite its own citizens.[5] In March 2016, he pleaded guilty; three months later, he was given a life sentence, which could be reduced to a prison term of no less than 13 years.[6][7]\nShao was born in the coastal Chinese city of Dalian in 1994, the only child of a family typical of China's emerging middle class. Her father was a civil servant who worked in food safety inspection; her mother a homemaker. She attended Dalian Yuming High School [zh], and aspired to become a biologist.[1]\nYuming students routinely perform well on China's National Higher Education Entrance Examination or gaokao, and in the Olympic Competition, which offers winners admission to college without having to take the gaokao. In the late 2000s, Shao and her then boyfriend entered the competition. He won and attended a prestigious university in southern China; she did not.[1]\nShe decided to study in the U.S. instead, which she was able to do because her parents had saved over US$100,000 toward her education.[8] In 2011 she went to Beijing to take a preparatory course for the Test of English as a Foreign Language. There she met Li Xiangnan, three years her senior, from Wenzhou. Shao's mother says he developed a crush on her daughter, which was not unusual—many other young men had shown such an interest in her daughter. She met him once when he came to Dalian, and recalls him as shy. Although he seemed to be from a rich background, she and her husband did not think he was right for their daughter.[1]\nShao was accepted at Iowa State University (ISU), in Ames, where she majored in chemical engineering in 2012, a choice that pleased her father since not many women enter that field.[8] Li \"chased [her] from China to the U.S,\" an acquaintance said, transferring from Rochester Institute of Technology to the University of Iowa in Iowa City, 140 miles (230 km) away,[8] where he studied business.[1] At Iowa State, friends, mostly fellow Chinese students, recalled her as being very outgoing, tutoring students in Chinese and dancing at parties. She also distinguished herself for her ability to solve Rubik's cube quickly. Although engineering was not her favorite subject, she maintained a grade point average of 3.75.[1]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/All_Saints_Catholic_Church_(Stuart,_Iowa)",
        "title": "All Saints Catholic Church (Stuart, Iowa)",
        "date": "",
        "year": "",
        "location": "320 N. FremontStuart, Iowa",
        "state": "Iowa",
        "place": "Stuart",
        "county": "Adair County",
        "paragraph": "All Saints Catholic Church is a parish church building in the Diocese of Des Moines. The building is located in Stuart, Iowa, United States.   The parish used the building as its church until a devastating fire severely damaged the structure.  The church was rebuilt and it now  serves as a cultural center called the Historic All Saints/Saints Center for Culture and the Arts.   It is  listed on the National Register of Historic Places, and is a rare example of Neo-Byzantine architecture in the state of Iowa.[2]\nThe Catholic Church in Stuart traces its beginnings to August 1871 when a Father Moniahan from Des Moines came to town for the first time to celebrate Mass.  He would come at irregular intervals and Mass was celebrated in school rooms, Shield's Hall, and in private homes.  At this time the whole state of Iowa was part of the Diocese of Dubuque.\nThe first church was built in 1874 under the direction of the Rev. Edward Gaul.  It was dedicated by the Very Rev. J.F. Brazil from St. Ambrose in Des Moines on the Feast of All Saints, November 1, 1877.  The Rev. James Foley was pastor at the time and he built two additions onto the church as well as the rectory during his 24 years at All Saints.  During that time he was also responsible for parishes in Casey, Adair, Guthrie Center and Greenfield.[3]  The parish became a part of the Diocese of Davenport when it was established in 1881.\nOn October 12, 1902, the Rev. M.S. McNamara became pastor.  It was during his pastorate that plans for a new church were developed and executed.  Maginnis and Walsh were responsible for designing the church.  The cornerstone was laid in September 1908 and it was completed in 1910. It was built of blue Bedford limestone in a combination of Byzantine Revival and Romanesque Revival styles.  The building measures 70 feet (21 m) wide, 120 feet (37 m) long and 110 feet (34 m) high.  It has a seating capacity of 600.[4]  The interior is under an 90-foot (27 m) high dome that contains 16 windows.  The dome was covered in copper.  The church was decorated with Italian marble, rare woods, hand painted frescos, gold gilding, and statuary.[5]    The windows were from the Franz Mayer & Co. of Munich, Germany.   The church was built for $65,000.[4]\nBishop James Davis of Davenport dedicated the church at a Pontifical High Mass.[6]  Bishop James J. Keane of Cheyenne, Wyoming, preached the sermon.  The following year the parish became part of the Diocese of Des Moines when it was established in 1911 on the same day that Bishop Keane was named Archbishop of Dubuque.\nOn August 22, 1995 Charles Willard of Des Moines drove to Stuart and poured gasoline in various places in the church and set it on fire.  Fire departments from 20 area communities in a 50-mile (80 km) radius of Stuart fought the fire.  While the exterior walls remained standing the rest of the building lay in ruins.  A small chapel in the back suffered minor damage.  Willard had mailed letters to two bishops and a Des Moines television station before he set the fire taking responsibility based on his hatred of the Catholic Church.  He even held a news conference before his arrest.  He was convicted of arson and a hate crime.[5]\nThe parish, under the leadership of the Rev. Dan Clarke, and the diocese decided that to rebuild the church would be too expensive.  Instead they decided to build a new facility on 95 acres (380,000 m2) of land purchased from the Bill and Marlene Wilson family for $475,000.  The new church, designed by the RDG Planning & Design of Omaha, has seating for 400 people and a parking lot for 175 cars.  The cost for the new church was $2.5 million.[7]   Bishop Joseph Charron, C.Pp.S. laid the cornerstone for the new church on August 31, 1997.\nIn September 1997 the damaged historic church building and property were sold to a group named the Project Restore Foundation for $7,200.  They had hoped to rehabilitate the building in three years for a community cultural center [8] at an estimated cost of around $3.5 million.[9]  The architects for the restoration project were Kirk Blunck and Jeff Wagner of HLKB in Des Moines  and construction was done by  Koester in Grimes.[10]   Plans called for the exterior of the old church to look similar to the way it looked before the fire, The interior would have a modern appearance with exposed stone and brick on the walls. The dome would be rebuilt with the original stone, which had been numbered and saved. The original copper on the dome melted so it was replaced with new copper sheeting.[2]\nSeveral grants helped with the restoration effort.  In 2000 the State Historical Society of Iowa Board of Trustees approved a grant for $60,000 towards the project.[11]  In 2007 Project Restore received a $545,000 grant from Vision Iowa, a state program that provides money for major tourism attractions.[2]  That same year 63% of the citizens of Stuart voted to accept a $1.7 million bond referendum to rebuild the church.[12]  Another $232,000 (as of 2007) in private donations was also raised,[2]\n",
        "type": [
            "arson"
        ]
    },
    {
        "link": "/wiki/Jerry_Harrington",
        "title": "Jerry Harrington",
        "date": "",
        "year": "new 1891",
        "location": "",
        "state": "Iowa",
        "place": "Keokuk",
        "county": "Keokuk County",
        "paragraph": "Jeremiah Peter \"Jerry\" Harrington (August 12, 1868 – April 16, 1913) was a professional baseball player whose career spanned six seasons, including four seasons in Major League Baseball (MLB). Harrington played the majority of his games in the majors at catcher; however, he did play first base and third base on occasion. In 189 major league games between the Cincinnati Reds and the Louisville Colonels, Harrington batted .227 with 60 runs, 151 hits, 19 doubles, six triples, three home runs, 73 runs batted in (RBIs), and eight stolen bases.\nHarrington was born in Hamden, Ohio on August 12, 1868. His father was the manager of the Keokuk, Iowa baseball club in 1885.[1] At the age of 16, Jerry Harrington began to play semi-professional baseball with the Bonaparte, Iowa team.[1] Two years later, Harrington began to play with the Creston, Iowa ball club of the Iowa League.[1]\nIn 1888, Harrington began his professional career in the Central Interstate League. That season, he played for the Danville Browns, the Davenport club, and the Decatur club. Harrington continued to play in the Central Interstate League in 1889 with the Davenport Hawkeyes/Monmouth Browns. Harrington made his major league debut on April 30, 1890 with the Cincinnati Reds. In his first season, he batted .246 with 25 runs, 58 hits, seven doubles, one triple, one home run, 23 RBIs, and four stolen bases in 65 games. Lee Allen, author of The Cincinnati Reds, wrote that Harrington and fellow player Billy Rhines were two top prospects when they joined the Reds, although nearly unknown today.[2] It was also said that Harrington could throw out a baserunner from his knees.[2] In 1891, Harrington's second season with the Reds, he batted .228 with 25 runs, 76 hits, 10 doubles, five triples, two home runs, 41 RBIs, and four stolen bases in 92 games. In David L. Porter's Biographical Dictionary of American Sports: Q–Z, it was noted that Rhines, Harrington and fellow Reds teammate Pete Browning received fines and suspensions because of misbehavior outside of baseball.[3] Harrington played his final season with the Reds in 1892. In 22 games, Harrington batted .213 with six runs, 13 hits, one double, and three RBIs. In 1893, Harrington joined the Louisville Colonels, which would prove to be his final season in professional baseball. With the Colonels, Harrington batted .111 with four runs, four hits, one double, and three RBIs in 10 games.\nAfter his professional baseball career was over, Harrington resided in Keokuk, Iowa.[2] There, Harrington became the assistant chief of police.[2] In 1913, Harrington was struck in the head with a beer bottle by Tom Merrit, described in Lee Allen's book The Cincinnati Reds as a \"thug.\"[2] Harrington died on August 16, 1913 at the age of 45 and was buried at Oakland Cemetery in Keokuk, Iowa.\n",
        "type": [
            "robbery"
        ]
    },
    {
        "link": "/wiki/Edward_Arthur_Thomas",
        "title": "Edward Arthur Thomas",
        "date": "",
        "year": "new 2009",
        "location": "",
        "state": "Iowa",
        "place": "Parkersburg",
        "county": "Butler County",
        "paragraph": "Edward Arthur Thomas[1] (July 17, 1950 – June 24, 2009) was an American high school football coach. On June 24, 2009, Thomas was shot and killed in his Parkersburg, Iowa football team's weight room by Mark Becker, one of Thomas' former players.[2] Thomas was airlifted to a Waterloo, Iowa hospital where he was pronounced dead shortly after arrival.[3]\nEd Thomas was born to Authrine and Roy Thomas in 1950.[4] He was born in Oskaloosa, Iowa and raised in What Cheer, Iowa. He played football; his position was quarterback. Thomas was the oldest of 5, having 3 younger sisters and one younger brother. He graduated from Tri-County High School in Thornburg, Iowa in 1968 and obtained degrees from William Penn College and the University of Northern Iowa.[4]\nThomas coached for 37 years in the \"IAHSAA\" (Iowa High School Athletic Association) football program; winning two state titles and a total of 292 games.[5]  He is credited with having coached four NFL players, which include Aaron Kampman, Brad Meester, Jared DeVries, and Casey Wiegmann. In 2005, Thomas won the prestigious NFL High School Coach of the Year award.[6] Landon Schrage was signed in 2006 as a long snapper for the Baltimore Ravens, making him the 5th player under Coach Thomas to reach the NFL.\nEd Thomas was murdered on June 24, 2009, by Mark Becker, a mentally ill former player who had been released from a Waterloo Hospital less than 24 hours prior to the shooting. Thomas was in a room with 20 football and volleyball players, many of whom testified at the trial of Mark Becker. Ed Thomas was shot 6 or 7 times according to the medical examiner. He also suffered blunt force injuries to his head, chest and legs, which were caused by being stomped on after being shot.[citation needed]\nThe night of his death, 2,500 mourners gathered for a candlelight vigil. He was featured on the July 6, 2009 cover of Sports Illustrated. On August 28, 2009, the national cable network, ESPN, televised his high school's first football game of the year in memory of Coach Thomas.[7]\nOn March 2, 2010, a Butler County jury convicted Becker of first-degree murder in connection with Thomas' death. Following a trial that had started February 12 in Allison, the jury received the case on Wednesday, February 24; the jury had reached two stalemates prior to arriving at their verdict. Testimony in the trial focused on Becker's mental state at the time of the shooting. On April 14, 2010, Becker received a life sentence for his conviction of first-degree murder.[8]\nMembers of Thomas' family have approached the Iowa Legislature to consider legislation requiring hospital personnel to notify law enforcement before releasing a psychiatric patient facing criminal charges. On March 24, 2010, the Ed Thomas Bill was passed.[9]\nThomas was posthumously awarded the Arthur Ashe Courage Award at the 2010 ESPY Awards.[10] On August 16, 2011, Zondervan released The Sacred Acre: The Ed Thomas Story, a book authored by the Thomas family and Mark Tabb; that tells the story of Thomas' role in the town's recovery after the 2008 tornado, and the details of his murder.[11]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    {
        "link": "/wiki/Oran_Pape",
        "title": "Oran Pape",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "place": "Dubuque",
        "county": "Dubuque County",
        "paragraph": "\nOran Henry Pape (March 10, 1904 – April 30, 1936) was a member of the Iowa State Patrol in the United States. He is the first member of the Patrol to have been murdered in the line of duty. Prior to joining the Patrol, Pape played professional American football.\nPape played high school football at Dubuque Senior High School, where he was part of the 1924 state championship football team. He then played college football at the University of Iowa. Following college, he played in the National Football League for the Green Bay Packers, the Minneapolis Red Jackets, the Providence Steam Roller, the Boston Braves, and the Staten Island Stapletons. Pape was a member of the 1930 Green Bay Packers NFL Championship team. Pape left the NFL in 1934, and returned to Iowa.\nPape attended the State Police Academy at Camp Dodge. He was appointed to the newly formed Iowa Highway Patrol (later Iowa State Patrol) in August 1935, one of the first men to become an officer in the Patrol. On April 28, 1936, Pape was patrolling U.S. Highway 61 near Muscatine, Iowa.  He noticed a car that had been reported stolen. After pulling the car over, Pape approached the car. The driver, Roscoe Barton, pointed his gun at Pape and ordered him into his car. Barton drove away with Pape as his hostage. A short while later, Pape saw an opportunity to overpower Barton, and the two began struggling. During the struggle, Barton was shot in the head, and Pape was shot in the abdomen.\nBoth men were taken to Hershey Hospital in Muscatine. Barton died from his injuries soon after arriving at the hospital. Pape was treated for his gunshot wound, however his condition eventually took a turn for the worse. Doctors were unable to transfuse blood into him because of his collapsed veins. Pape died at 2:40pm on April 30. He was buried at Linwood Cemetery in Dubuque. His badge number 40 was retired from service.[1]\nPape's murder is one of the main reasons the Patrol began the practice of \"cross drawing\" guns. In this practice, officers wear their guns opposite their strong arm. In theory, an officer would be able to hold on to a person with their strong arm and be able to draw their weapon at the same time. This practice is no longer used, with troopers now carrying their sidearms on their strong side.[citation needed] The I-80 bridges over the Cedar River in Cedar County, Iowa are named in his honor (Trooper Oran Pape Memorial Bridge).\n",
        "type": [
            "murder",
            "shooting",
            "robbery"
        ]
    },
    {
        "link": "/wiki/Wattie_Holm",
        "title": "Wattie Holm",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "place": "Peterson",
        "county": "Clay County",
        "paragraph": "Roscoe Albert Holm (December 28, 1901 – May 19, 1950) was a Major League Baseball player. Holm played for the St. Louis Cardinals for seven seasons between 1924 and 1932, missing the 1930 and 1931 seasons. Holm was a member of the Cardinals first World Series in 1926. He batted and threw right-handed. Holm suffered from mental illness later in life; nearly two decades after leaving professional baseball, he killed his wife shortly before killing himself.\nHolm was born in Peterson, Iowa, and as a child he moved with his family to Alton, Iowa. Holm received his nickname, \"Wattie\", when he was young.[1] Holm's father encouraged him to pursue dental school. attended the University of Iowa for a year before leaving to pursue a baseball career.\nHolm married the former Ella Powell in Spencer, Iowa, in 1923. She was a schoolteacher.[2] They had a son named Robert and a daughter named Margaret.\nHolm made his major league debut with the St. Louis Cardinals in 1924, after playing minor league baseball at Syracuse the season before. He spent much of his career back and forth between the major leagues and the minor leagues, but he stayed in the major leagues between 1926 and 1929. His best season came in 1927, when Holm had a .286 batting average and drove in 66 runs while playing 110 games for St. Louis.\nIn the fall of 1929, the Cardinals advised Holm to have surgery on his tonsils and nose. He refused at the time, but underwent the procedure in the spring of 1930, causing a delay in his preparation for the 1930 season.[3] He played for the Houston Buffaloes in 1930 and the Rochester Red Wings in 1931.\nHolm split 1932, his last year in professional baseball, between the Cardinals, the Red Wings and the Columbus Red Birds.\nIn 436 games over seven seasons, Holm recorded a .275 batting average (410-for-1493) with 207 runs, 6 home runs and 174 RBI. He posted a career .955 fielding percentage. In two World Series (1926 and 1928), he hit .136 (3-for-22) with 2 RBI.\nIn the early 1940s, Holm was running a gas station in Storm Lake, Iowa, and managing a semipro baseball team, the Storm Lake White Caps. In 1942, he trained as a machinist to support the defense effort in World War II.[4] Later, he lived in Lake View, Iowa, and ran a factory that manufactured baseball bats.[5]\nHolm was turned down for a managing job with a local baseball team in early 1950 because of concerns about his mental health. He had been depressed since suffering a series of business failures. Holm also had a family history of mental illness, as his brother Marcel had committed suicide.[6]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    {
        "link": "/wiki/Farmers%27_Holiday_Association",
        "title": "Farmers' Holiday Association",
        "date": "",
        "year": "",
        "location": "",
        "state": "Iowa",
        "place": "Sioux City",
        "county": "Woodbury County",
        "paragraph": "The Farmers' Holiday Association was a movement of Midwestern United States farmers who, during the Great Depression, endorsed the withholding of farm products from the market, in essence creating a farmers' holiday from work. The Farmers' Holiday Association was organized in May 1932 by Milo Reno.[1] The group urged farmers to declare a \"holiday\" from farming, with a slogan of \"Stay at Home-Buy Nothing-Sell Nothing\"  and \"Lets call a Farmer's Holiday, a Holiday let's hold.  We'll eat our wheat and ham and eggs, And let them eat their gold\".[2]\nFarmers went to extreme measures to ensure that their wants were carried through. One person was killed when the farmers began to blockade roads, and other farmers rallied to destroy their crops, reducing supply, and raising prices.  The highways into Sioux City and Council Bluffs, Iowa, were blocked by pickets who dumped farm produce on the side of the road.[3] At Le Mars, Iowa some farmers dragged a judge out of his courtroom, placed a noose around his neck, and threatened to hang him unless he stopped approving farm foreclosures. The striking farmers were countered by  sheriffs, militia, and vigilante groups.[1]\nFarmers' Holiday Association activity subsided by 1934.[1]\n\nThis article about an agricultural organization is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder",
            "riot"
        ]
    },
    {
        "link": "/wiki/Chief_Johnson",
        "title": "Chief Johnson",
        "date": "",
        "year": "new 1913",
        "location": "",
        "state": "Iowa",
        "place": "Des Moines",
        "county": "Polk County",
        "paragraph": "George Howard \"Chief\" Johnson (March 20, 1886 – June 11, 1922) was an American professional baseball pitcher. He played three seasons in Major League Baseball (MLB), from 1913 to 1915, for the Cincinnati Reds of the National League and Kansas City Packers of the Federal League. He surrendered the first home run in the history of Wrigley Field, to Art Wilson on April 23, 1914.[1]\nJohnson was of Ho-Chunk, French and Irish ancestry. He identified as Ho-Chunk and was depicted in the media as a Native American.[2] A 1913 feature by Ripley's Believe It or Not! reported his full name as George Washington Murphy Johnson.[3]\nJohnson was shot to death in Des Moines, Iowa, on June 11, 1922,[4] at the age of 36. He had been in town to host a medicine show and had gotten into an argument during a dice game. The shooter, despite having confessed to police and being identified by witnesses, was eventually acquitted of first degree murder.[2]\n\nThis biographical article relating to an American baseball pitcher born in the 1880s is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder",
            "shooting"
        ]
    },
    {
        "link": "/wiki/Terry_DeGeus",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "place": "Terre Haute",
        "county": "Decatur County",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\nAlthough Iowa abolished capital punishment in 1965, the crime was a federal case since it involved a continuing criminal enterprise. Honken was sentenced to death and executed by the federal government on July 17, 2020,[4] the first defendant from Iowa to be executed since 1963.[3] Johnson was also sentenced to death, the first woman sentenced to death by a United States federal jury since the 1950s, but the sentence was overturned in 2012,[5] and she was resentenced to life without parole in 2014.\nHonken grew up in Britt, Iowa.[3] His father, Jim Honken, was an alcoholic schemer who was allegedly neglectful. Honken reported in his pre-sentence investigation that his father struck him numerous times during his childhood, although he denied that his father was physically abusive and maintained that the emotional turmoil in his early life mostly stemmed from his father's alcoholism. Jim once convinced his son to steal and copy a key to a bank. Jim committed two bank robberies before getting caught and sent to federal prison. Honken's parents divorced when he was nine. Honken had a healthy relationship with his stepfather.[6]\n\nHonken had a notably healthy relationship with his mother, who he described as perfect. Federal court appeals later described their relationship while dismissing claims that there was substantial mitigation in his upbringing:The movant's mother provided a stable, nurturing and loving environment, never abandoned him, did not fail to provide any sort of safe space or comfort to him, never neglected him, never failed to calm him or tell him that things were going to be okay, acted as a loving caretaker and facilitated the movant's attachment to her by making herself available to him.[6]Honken, who was proficient in math, science, and writing, earned a scholarship to North Iowa Area Community College in 1991. He later said that he had initially planned to become a pharmaceutical lawyer.[7]\nDuring Honken's capital murder trial, his mitigation expert, Lisa Rickert, wrote to his lawyers that not only had she struggled to find any possible mitigation, what she discovered only further cast Honken in a negative light.[8]\n",
        "type": [
            "murder",
            "robbery",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Lori_Duncan",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "place": "Terre Haute",
        "county": "Decatur County",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\nAlthough Iowa abolished capital punishment in 1965, the crime was a federal case since it involved a continuing criminal enterprise. Honken was sentenced to death and executed by the federal government on July 17, 2020,[4] the first defendant from Iowa to be executed since 1963.[3] Johnson was also sentenced to death, the first woman sentenced to death by a United States federal jury since the 1950s, but the sentence was overturned in 2012,[5] and she was resentenced to life without parole in 2014.\nHonken grew up in Britt, Iowa.[3] His father, Jim Honken, was an alcoholic schemer who was allegedly neglectful. Honken reported in his pre-sentence investigation that his father struck him numerous times during his childhood, although he denied that his father was physically abusive and maintained that the emotional turmoil in his early life mostly stemmed from his father's alcoholism. Jim once convinced his son to steal and copy a key to a bank. Jim committed two bank robberies before getting caught and sent to federal prison. Honken's parents divorced when he was nine. Honken had a healthy relationship with his stepfather.[6]\n\nHonken had a notably healthy relationship with his mother, who he described as perfect. Federal court appeals later described their relationship while dismissing claims that there was substantial mitigation in his upbringing:The movant's mother provided a stable, nurturing and loving environment, never abandoned him, did not fail to provide any sort of safe space or comfort to him, never neglected him, never failed to calm him or tell him that things were going to be okay, acted as a loving caretaker and facilitated the movant's attachment to her by making herself available to him.[6]Honken, who was proficient in math, science, and writing, earned a scholarship to North Iowa Area Community College in 1991. He later said that he had initially planned to become a pharmaceutical lawyer.[7]\nDuring Honken's capital murder trial, his mitigation expert, Lisa Rickert, wrote to his lawyers that not only had she struggled to find any possible mitigation, what she discovered only further cast Honken in a negative light.[8]\n",
        "type": [
            "murder",
            "robbery",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Hot_Lotto_fraud_scandal",
        "title": "Hot Lotto fraud scandal",
        "date": "",
        "year": "new 2015",
        "location": "",
        "state": "Iowa",
        "place": "Des Moines",
        "county": "Polk County",
        "paragraph": "\nThe Hot Lotto fraud scandal was a lottery-rigging scandal in the United States. It came to light in 2017, after Eddie Raymond Tipton, the former information security director of the Multi-State Lottery Association (MUSL), confessed to rigging a random number generator that he and two others used in multiple cases of fraud against state lotteries. Tipton was first convicted in October 2015 of rigging a $14.3 million drawing of MUSL's lottery game Hot Lotto. Eddie Tipton ultimately confessed to rigging lottery drawings in Iowa, Colorado, Wisconsin, Kansas and Oklahoma. Also involved in the scheme were his brother and former Texas justice of the peace Tommy Tipton and Texas businessman Robert Rhodes.[1][2] Eddie Tipton was sentenced to 25 years in prison.[1][2]\nA $14.3 million prize for the Hot Lotto draw on December 29, 2010, had been left unclaimed for nearly a year, when attempts were made to claim the prize on behalf of an anonymous, off-shore trust company in Belize. The claim was rejected by the Iowa Lottery because it was made anonymously.[3][4][5][6] A subsequent investigation into the trust and the discovery of surveillance footage from a convenience store that depicted the ticket being purchased, led to the arrest of Eddie Tipton on two counts of fraud for attempting to illegally participate in a lottery game as an employee of the MUSL, and then trying to claim a prize through fraudulent means.[7]\nWhen his trial began on April 13, 2015, evidence was introduced by the prosecutors to support allegations that Tipton had rigged the draw in question by using his privileged access to an MUSL facility to install a rootkit on the computer containing Hot Lotto's random number generator, and then attempting to claim a winning ticket with the rigged numbers anonymously.[8][9] On July 20, 2015, Tipton was found guilty on both counts;[8] he was sentenced to 10 years' imprisonment, pending an appeal.[5]\nEddie Tipton and his brother Tommy Boyd Tipton were subsequently accused of rigging other lottery drawings, dating back as far as 2005.[10][11] Based on forensic examination of the random number generator that had been used in a 2007 Wisconsin lottery incident, investigators discovered that Eddie Tipton programmed a lottery random number generator to produce special results if the lottery numbers were drawn on certain days of the year.[11][12][13]\nThe Iowa Lottery and MUSL were also sued by a winner of a Hot Lotto drawing that occurred following the rigged draw, seeking to have his winnings retroactively increased because the jackpot had been illegitimately reset by Tipton's rigged win.[14][15]\nHot Lotto held its final drawing on October 28, 2017;[16] the game was replaced by Lotto America in November 2017.\nThe December 29, 2010, drawing of the multi-state lottery game Hot Lotto featured an advertised top prize of US$16.5 million.[17] On November 9, 2011, Philip Johnston, a resident of Quebec City, Canada,[3] phoned the Iowa Lottery to claim a ticket that had won the jackpot; stating he was too sick to claim the prize in person, he provided a 15-digit code that verified the winning ticket. However, Johnson's prize claim was turned down when he was unable to answer questions that verified he was the owner of the ticket.[18] On December 6, Johnston phoned again, stating the ticket was actually owned by an anonymous individual who was being represented by a Belize-based shell company, Hexham Investments Trust. However, Iowa Lottery rules forbid anonymous prize claims, so the claim was turned down.[18]\nOn December 29, 2011, less than two hours before the expiration of a one-year deadline for prize claims, representatives of a Des Moines law firm presented the winning ticket at the Iowa Lottery headquarters, signed on behalf of Hexham Investments and New York City-based attorney Crawford Shaw. However, Hexham was misspelled on the ticket as \"Hexam\", and the claim was, once again, turned down.[18] On January 12, 2012, Shaw met with Iowa Lottery officials in person to try claiming the prize, but was turned down yet again after he refused to identify the owners of the trust. Shaw withdrew his claims over the prize afterward, and the prize money was returned to Hot Lotto's member lotteries in February 2011.[3][4]\nIn an interview with Iowa's Division of Criminal Investigation, Johnston (who was listed as Hexham's president) explained that Robert Rhodes and Robert Sonfield of Sugar Land, Texas, with whom Johnston had professional relations, had asked him to assist in anonymously claiming the prize.[3] The Daily Beast reported that Rhodes and Sonfield were, according to an anonymous source, in active litigation over a pump and dump scam, and that Rhodes, Sonfield, and Johnston had also had past business relationships.[18]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Kandi_Duncan",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "place": "Terre Haute",
        "county": "Decatur County",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\nAlthough Iowa abolished capital punishment in 1965, the crime was a federal case since it involved a continuing criminal enterprise. Honken was sentenced to death and executed by the federal government on July 17, 2020,[4] the first defendant from Iowa to be executed since 1963.[3] Johnson was also sentenced to death, the first woman sentenced to death by a United States federal jury since the 1950s, but the sentence was overturned in 2012,[5] and she was resentenced to life without parole in 2014.\nHonken grew up in Britt, Iowa.[3] His father, Jim Honken, was an alcoholic schemer who was allegedly neglectful. Honken reported in his pre-sentence investigation that his father struck him numerous times during his childhood, although he denied that his father was physically abusive and maintained that the emotional turmoil in his early life mostly stemmed from his father's alcoholism. Jim once convinced his son to steal and copy a key to a bank. Jim committed two bank robberies before getting caught and sent to federal prison. Honken's parents divorced when he was nine. Honken had a healthy relationship with his stepfather.[6]\n\nHonken had a notably healthy relationship with his mother, who he described as perfect. Federal court appeals later described their relationship while dismissing claims that there was substantial mitigation in his upbringing:The movant's mother provided a stable, nurturing and loving environment, never abandoned him, did not fail to provide any sort of safe space or comfort to him, never neglected him, never failed to calm him or tell him that things were going to be okay, acted as a loving caretaker and facilitated the movant's attachment to her by making herself available to him.[6]Honken, who was proficient in math, science, and writing, earned a scholarship to North Iowa Area Community College in 1991. He later said that he had initially planned to become a pharmaceutical lawyer.[7]\nDuring Honken's capital murder trial, his mitigation expert, Lisa Rickert, wrote to his lawyers that not only had she struggled to find any possible mitigation, what she discovered only further cast Honken in a negative light.[8]\n",
        "type": [
            "murder",
            "robbery",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/East_High_School_shooting",
        "title": "East High School shooting",
        "date": "March 7, 2022",
        "year": "2022",
        "location": "East High School, Des Moines, Iowa, U.S.",
        "state": "Iowa",
        "place": "Des Moines",
        "county": "Polk County",
        "paragraph": "On March 7, 2022, after 2:40 pm, a shooting occurred within the vicinity of East High School in Des Moines, Iowa, U.S, right before school was being dismissed for the day. At least 35 gunshots were fired out of at least three vehicles.\nOne 15-year-old boy was killed, and two female students were critically wounded. By the next few hours, six teenage males were arrested, ranging from ages 14 to 17, and charged with one count of first-degree murder and two counts of attempted murder: four charged in adult court, and two in juvenile court.[1][2]\nThe shooting was described by police as having gang overtones, having stemmed from an ongoing violent conflict between two rival Iowa Hispanic gangs.\nAround 2:40 p.m., neighborhood camera footage captured the shooting. Footage showed a group of five teenagers gathering near a curb when three vehicles passed by. The vehicles suddenly returned, with the occupants inside firing multiple shots at the group. Multiple 911 calls were then made at approximately 2:50 p.m.[3]\nInvestigators recovered about 20 spent shell casings at the shooting site and found another 15 in the vehicles that the Des Moines Police Department said were used in the shooting.[4]\nThe Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) of Kansas City arrived on the scene and provided assistance in the investigation. Other agencies assisting with the investigation included: the Iowa State Patrol (ISP), the Polk County Sheriff's Office, the FBI, and the Des Moines Public Schools Department of Public Safety.[5] Multiple search warrants were executed, and six guns were recovered.[6] By March 30, several teenagers were arrested in connection with the shooting.[7] In September one of the teens pled guilty to second-degree murder as part of a plea bargain.[8][9]\nThe victim killed was Jose David Lopez, a 15-year-old non-student of the school. He was a student of another Des Moines high school who was visiting the campus. Police say he was the intended target of the shooting, with the two female victims not intended targets, aged 16 and 18. The two female victims were both shot in the head and critically injured, and were students at the school.[10] In a late March 2022 article by 12NewsNow, an 18-year-old victim (Kemery Ortega) hit in the head with a bullet was making a recovery, and was planning on leaving the hospital soon. She however still may have fragments or much of the bullet still lodged in her skull. The other girl wounded was also still critically injured as of late March but was on the mend.[11]\nU.S. President Joe Biden released a statement regarding the shooting and the greater violence issue in American society.[12]\n\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    {
        "link": "/wiki/Murder_of_Jason_Gage",
        "title": "Murder of Jason Gage",
        "date": "",
        "year": "new 2005",
        "location": "",
        "state": "Iowa",
        "place": "Chicago",
        "county": "Johnson County",
        "paragraph": "Jason Gage (1976 – March 11, 2005) was a 29-year-old gay man who was murdered in his Waterloo, Iowa, apartment.[1][2] The murder was compared by the national press to the slaying of Matthew Shepard and prompted a push for citywide laws protecting LGBT people.[2][3][4]\nJason Gage was last seen alive on March 11, 2005, socializing with friends in Waterloo's downtown bars. Sometime that night he went home to his apartment in the Russell-Lamson building. With him was 23-year-old Joseph Lawrence. Gage was originally from Oelwein, Iowa.[5] He'd lived in Chicago and Milwaukee before moving to Waterloo years earlier. He settled downtown, and worked waiting tables in the Italian restaurant of his apartment building. He enrolled at the College of Hair Design in Waterloo, Iowa, in January 2003, and his friends said he dreamed of working in a big city salon.[6]\nLawrence was born in Seaford, Delaware. He was removed from his birth parents after severe abuse and spent several years in foster care before being adopted at age 5. He moved with his adoptive parents to Maryland, New Jersey, and then to Ohio. During his time in Ohio, he decided he no longer wanted to be adopted and moved back into foster care at age 16. From there, he moved to Phoenix, Arizona, and then on to New Mexico. In early 2003, Lawrence moved from Farmington, New Mexico, where he had been an oil worker to Cedar Falls, Iowa, to be with his girlfriend—Elizabeth Hostetler—who was six months pregnant with their child. The couple—who had been together for a year—decided to move to Cedar Falls, because Hostetler had many \"lifelong friends\" in the area who could help with the baby.[7] Hostetler said she introduced Gage and Lawrence about a week before Gage's murder. Hostetler had met Gage through an acquaintance and had known him for about two years.[8]\nWitnesses said Gage and Lawrence were together the night Gage was killed. They were seen at Kings & Queens, the local gay club, before heading to an after hours party at The Times Bar. The two left at some point and headed back to Gage's apartment. According to Hostetler, Gage told Lawrence that he could wait for a ride at his apartment two blocks away from The Times Bar. A female friend and roommate of Hostetler's said Lawrence called late Friday or early Saturday asking for a ride home from downtown, because he \"didn't like the hospitality of the place,\" and needed a ride or he was going to \"end up in jail\".[8] An investigator said he received a call from a man who had been asked to give Lawrence a ride home from a downtown club. Lawrence never showed up for the ride, and the man said he later heard from Hostetler that Lawrence had beaten up Gage.[9]\nIn the early hours of March 12, phone records show Lawrence sent several text messages to friends in Iowa and New Mexico via his cell phone. \"I just killed a guy I think,\" one read. A second sent to Michael Bailey in New Mexico flashed \"U need to call me soon.\"[10] A phone conversation between Bailey and Lawrence, in which Lawrence said \"some guy\" tried to \"hit on him real bad\" and described \"a fight that got way out of hand,\" indicated that Lawrence may not have known Gage was dead.[11]\nAt 11:00 p.m. on March 14, 2005, Gage's body was found in his bed when police entered his apartment, after friends expressed their concern that Gage did not show up at work on Monday and had not been seen for three days.[12] Gage had been bludgeoned in the head with a bottle and stabbed in the neck with a shard of glass.[13][14] Hours later, 23-year-old Joseph Lawrence of Cedar Falls was arrested and charged with Gage's murder. Police said Lawrence admitted he had fought with Gage, hit him with a bottle, and stabbed him in the neck with a piece of glass.[15] An autopsy revealed that Gage died from severe head injuries. Gage's body lacked any defensive wounds that would suggest he had warded off an attack.[16] When police entered Gage's apartment, two glasses were out, suggesting that Gage and Lawrence had been drinking and watching television.[17]\nLawrence gave a videotaped statement at the Waterloo police station after plain-clothes police officer went to the home he shared with Hostetler and asked him to come in for questioning. In a police affidavit, Lawrence acknowledged hitting Gage twice with a bottle and stabbing him with a piece of glass.[9] Hostetler, Lawrence's fiancée, offered a motive when she said Lawrence told her Gage had made sexual advances.[18] Hostetler said that Lawrence had gay friends, hung out with gay people, and did not have \"violent tendencies.\" She said that Gage must have made physical advances, the incident would never have happened had Lawrence not been drunk. \"This was not a hate crime,\" Hostetler said.[8]\nThe Iowa Code does not have a law defining murder based on racial or sexual bias as hate crime. Murder, regardless of motive, is punishable by life in prison without parole. Another state law mentioned in Lawrence's case, titled \"violation of individual rights,\" prohibits assaults, vandalism and trespass for reasons of race, color, religion, ancestry, national origin, political affiliation, sex, sexual orientation, age, or disability.[19] In trial information formally charging Lawrence with murder, the prosecutor included a theory that Lawrence killed Gage while committing the crime of assault in violation of individual rights.[20]\nFollowing Gage's death, the Waterloo Human Rights Commission asked the City Council to add sexual orientation protections to the city's human rights ordinance, permissible under Iowa state law. Waterloo Mayor Tim Hurley joined the commission in condemning Gage's murder, in a press conference outside the commission's offices, but said he had not formed an opinion on the addition of sexual orientation to the city's human rights ordinance.[21] Gage's friends held candlelight vigils outside his apartment building, and his family and classmates held a memorial outside of the beauty school. His wake in Oelwein was attended by hundreds, and his funeral drew a crowd too large for the funeral home where it was held. Friends and community members started a scholarship in Gage's name, and sold T-shirts and buttons with his image to raise money. Three area churches took up collections for Gage.[6] A benefit to raise money for the scholarship fund was held at the city convention center and attracted numerous attendees. It also attracted protesters from the Westboro Baptist Church in Topeka, Kansas. About 20 Westboro members picketed six area churches and stood outside the convention center carrying signs and shouting that Gage was in hell.[22] They were then joined by a second group, Consuming Fire Campus Ministries, led by Matt Bourgault.[23]\n",
        "type": [
            "murder",
            "arson",
            "assault"
        ]
    },
    {
        "link": "/wiki/Iowa_Cow_War",
        "title": "Iowa Cow War",
        "date": "September 21–25, 1931 (1931-09-21 – 1931-09-25)",
        "year": "1931",
        "location": "Cedar County, Iowa, US",
        "state": "Iowa",
        "place": "Tipton",
        "county": "Cedar County",
        "paragraph": "\nThe Iowa Cow War of 1931 involved violent disputes over the testing of cows for bovine tuberculosis. After distrustful farmers tried and failed to repeal the testing program, they gathered in numbers to block tests from taking place. The farmers believed that the test might infect cows with tuberculosis or make pregnant cows have spontaneous abortions. They also believed that the testing was unconstitutional. The owner of Muscatine radio station KTNT, Norman G. Baker, spread misinformation which resulted in more farmers protesting testing, sometimes causing violence. The Iowa Cow War came to a conclusion when 31 Iowa National Guard units were deployed to stop the protesting. Two farmers were arrested for their actions during the conflict.\nBovine tuberculosis was an issue for Iowans prior to the eradication of the disease starting in 1929. In 1894, an Iowa veterinarian said that tuberculosis was the main issue that his office faced. People often did not understand the danger of tuberculosis in cows due to the long period of incubation and its effects. Many respected medical professionals thought that cows were unable to transmit the disease to people, including Robert Koch, who completed early research on tuberculosis.[1] The State of Iowa required the tests to reduce the frequency with which dairy cattle with tuberculosis would contaminate the milk supply and cause milk-drinking people to contract the disease.[2] The program was financed by a property tax levy of up to 3 mills.[2] In 1929, the Iowa State Legislature passed a law stating that all cows, whether used for dairy or meat, had to be tested for bovine tuberculosis. Iowa farmers, who did not trust the tests, were opposed to the law. The farmers believed that the test might infect cows with tuberculosis or make pregnant cows have spontaneous abortions. They also thought that the test was against the United States Constitution, but this was dismissed by the Iowa Supreme Court in 1930.[3]\nVeterinarians, who were approved by the State of Iowa, injected an antigen under the base of the cows' tails. After 72 hours, the veterinarians would see if the cows had any reactions to the antigen, such as swelling. Cows that reacted to the antigen were slaughtered and the farmers were paid an indemnity. The farmers did not receive the market share of their cows after they were slaughtered with the slaughter value being subtracted from the appraised value.[1] Farmers asserted that the test lowered milk quality and the cows' release of milk.[2]\nIn relation to the testing, Muscatine KTNT radio station owner Norman G. Baker spread misinformation in southeastern Iowa about medical professionals, Iowa politicians, farming magazines, and Iowa universities. Baker's words caused farmers to rebel in Cedar County.[1] In February 1931, two years after the adoption of the testing law, 1,000 farmers traveled by train from Tipton, Iowa, to the Iowa State Capitol in Des Moines. On arrival, they demanded that the Iowa Legislature make the tests optional. After the Legislature refused to do so, the farmers decided to act on their own.[2]\nOn March 9, 1931, over 500 people protested south of Tipton at a farm owned by E. C. Mitchell, who previously worked with four other farmers to resist the testing of their cows. Iowa veterinarians and 20 nearby police officers were at farmer William C. Butterbrodt's farm to test his cows for tuberculosis, northeast of Tipton. Almost 1,000 protestors traveled to Butterbrodt's farm to block tests from being performed, although no acts of violence occurred.[1] Another meeting was held at the Iowa State Capitol on March 19, 1931, with more than 1,500 people attending. Iowa Governor Dan Turner kept the mandatory testing in place. Veterinarian Peter Malcolm was forced off of E. C. Mitchell's farm in Cedar County on April 10, 1931, to review the tests of five cows. 75 protestors confronted Malcolm and several officials, resulting in Iowa agent Earl Gaughenbaugh telling the farmers to leave. After a cow was identified as having tuberculosis, Mitchell had two protestors throw Malcolm off the land. Assistant Attorney General Oral Swift was pushed against a barbed wire fence. Mitchell said that he only allowed the testing to lead to \"lead them on\".[1] Newspaper reporters were unable to write stories about the Mitchell farm incident due to protestors and The Des Moines Register and Tribune took photographs from the air that showed automobiles that were parked to prevent their cows from being tested. Malcolm's tests on Mitchell's farm were going to expire soon and Turner met with some protesters in Iowa City. The National Guard was deployed to Cedar Rapids on the morning of Malcolm reviewing the test results, but they were sent home shortly after on the same day. The final step of testing succeeded without any issues and one bull had a reaction. The 15 farmers that met with Turner in Iowa City had an assembly at Butterbrodt's farm on April 14, 1931. Turner said that only the farmers' elected representative could change the testing law. Smaller conflicts continued to happen with veterinarians being forced from farms.[1]\nThe Cow War happened during the fall of 1931, with most of it taking place in Cedar County, Iowa. On September 21, 1931, when state officials left the courthouse at noon, protestors followed them to Jacob W. Lenker's farm.[3] 300 or 400 farmers went to Lenker's with crudely made weapons to attack 63 or 65 officers and two veterinarians. The farmers threw mud and rocks at the officers, while also swinging clubs and slashing the officers' tires.[2][4] The farmers also had pitchforks. Tear gas was used against the farmers, but there was not much effect. Malcolm's tires were punctured, his gas line was slashed, and they put mud in his radiator.[3] The chief of the Iowa Division of Criminal Investigation, James Risdon, told Iowa Governor Dan Turner about the situation being \"out of control\".[4] The next day, Turner started martial law and had 31 Iowa National Guard units travel to Tipton and their base was at the Tipton fairgrounds.[2][3]  It cost over $1,000 to send in troops.[5] People heard yells of \"Here comes the Army!\" and \"You farmers better run!\" when the troops jumped from the rail cars.[4] Business owners were worried that farmers would boycott them for not wanting to participate.[4]\nSoldiers and veterinarians traveled around Cedar County to test cows for tuberculosis. Machine guns were placed facing country roads, sentries patrolled the area, and armed outposts were built. The farmers gave up for the most part due to the soldiers. 50 veterinarians, all working in pairs, gave the injection to 5,000 cattle per day for a week while being protected. A small amount of the tested cows were infected.[2] The veterinarians saw no cows on Lenker's farm due to him selling his 21 cattle to farmer Harry Duffy in Muscatine County. The sale caused issues for Lenker since he was not allowed to interfere with the process or move his cattle.[2] The last of the soldiers left on November 25, 1931.[5] Lenker was charged for contempt of court. Lenker was also charged for conspiracy along with farmer Paul Moore. They were sentenced to up to three-year terms in the Fort Madison, Iowa, penitentiary. Lenker and Moore were paroled 40 days later.[2]\n",
        "type": [
            "shooting",
            "riot"
        ]
    },
    {
        "link": "/wiki/Jason_Gage",
        "title": "Murder of Jason Gage",
        "date": "",
        "year": "new 2005",
        "location": "",
        "state": "Iowa",
        "place": "Chicago",
        "county": "Johnson County",
        "paragraph": "Jason Gage (1976 – March 11, 2005) was a 29-year-old gay man who was murdered in his Waterloo, Iowa, apartment.[1][2] The murder was compared by the national press to the slaying of Matthew Shepard and prompted a push for citywide laws protecting LGBT people.[2][3][4]\nJason Gage was last seen alive on March 11, 2005, socializing with friends in Waterloo's downtown bars. Sometime that night he went home to his apartment in the Russell-Lamson building. With him was 23-year-old Joseph Lawrence. Gage was originally from Oelwein, Iowa.[5] He'd lived in Chicago and Milwaukee before moving to Waterloo years earlier. He settled downtown, and worked waiting tables in the Italian restaurant of his apartment building. He enrolled at the College of Hair Design in Waterloo, Iowa, in January 2003, and his friends said he dreamed of working in a big city salon.[6]\nLawrence was born in Seaford, Delaware. He was removed from his birth parents after severe abuse and spent several years in foster care before being adopted at age 5. He moved with his adoptive parents to Maryland, New Jersey, and then to Ohio. During his time in Ohio, he decided he no longer wanted to be adopted and moved back into foster care at age 16. From there, he moved to Phoenix, Arizona, and then on to New Mexico. In early 2003, Lawrence moved from Farmington, New Mexico, where he had been an oil worker to Cedar Falls, Iowa, to be with his girlfriend—Elizabeth Hostetler—who was six months pregnant with their child. The couple—who had been together for a year—decided to move to Cedar Falls, because Hostetler had many \"lifelong friends\" in the area who could help with the baby.[7] Hostetler said she introduced Gage and Lawrence about a week before Gage's murder. Hostetler had met Gage through an acquaintance and had known him for about two years.[8]\nWitnesses said Gage and Lawrence were together the night Gage was killed. They were seen at Kings & Queens, the local gay club, before heading to an after hours party at The Times Bar. The two left at some point and headed back to Gage's apartment. According to Hostetler, Gage told Lawrence that he could wait for a ride at his apartment two blocks away from The Times Bar. A female friend and roommate of Hostetler's said Lawrence called late Friday or early Saturday asking for a ride home from downtown, because he \"didn't like the hospitality of the place,\" and needed a ride or he was going to \"end up in jail\".[8] An investigator said he received a call from a man who had been asked to give Lawrence a ride home from a downtown club. Lawrence never showed up for the ride, and the man said he later heard from Hostetler that Lawrence had beaten up Gage.[9]\nIn the early hours of March 12, phone records show Lawrence sent several text messages to friends in Iowa and New Mexico via his cell phone. \"I just killed a guy I think,\" one read. A second sent to Michael Bailey in New Mexico flashed \"U need to call me soon.\"[10] A phone conversation between Bailey and Lawrence, in which Lawrence said \"some guy\" tried to \"hit on him real bad\" and described \"a fight that got way out of hand,\" indicated that Lawrence may not have known Gage was dead.[11]\nAt 11:00 p.m. on March 14, 2005, Gage's body was found in his bed when police entered his apartment, after friends expressed their concern that Gage did not show up at work on Monday and had not been seen for three days.[12] Gage had been bludgeoned in the head with a bottle and stabbed in the neck with a shard of glass.[13][14] Hours later, 23-year-old Joseph Lawrence of Cedar Falls was arrested and charged with Gage's murder. Police said Lawrence admitted he had fought with Gage, hit him with a bottle, and stabbed him in the neck with a piece of glass.[15] An autopsy revealed that Gage died from severe head injuries. Gage's body lacked any defensive wounds that would suggest he had warded off an attack.[16] When police entered Gage's apartment, two glasses were out, suggesting that Gage and Lawrence had been drinking and watching television.[17]\nLawrence gave a videotaped statement at the Waterloo police station after plain-clothes police officer went to the home he shared with Hostetler and asked him to come in for questioning. In a police affidavit, Lawrence acknowledged hitting Gage twice with a bottle and stabbing him with a piece of glass.[9] Hostetler, Lawrence's fiancée, offered a motive when she said Lawrence told her Gage had made sexual advances.[18] Hostetler said that Lawrence had gay friends, hung out with gay people, and did not have \"violent tendencies.\" She said that Gage must have made physical advances, the incident would never have happened had Lawrence not been drunk. \"This was not a hate crime,\" Hostetler said.[8]\nThe Iowa Code does not have a law defining murder based on racial or sexual bias as hate crime. Murder, regardless of motive, is punishable by life in prison without parole. Another state law mentioned in Lawrence's case, titled \"violation of individual rights,\" prohibits assaults, vandalism and trespass for reasons of race, color, religion, ancestry, national origin, political affiliation, sex, sexual orientation, age, or disability.[19] In trial information formally charging Lawrence with murder, the prosecutor included a theory that Lawrence killed Gage while committing the crime of assault in violation of individual rights.[20]\nFollowing Gage's death, the Waterloo Human Rights Commission asked the City Council to add sexual orientation protections to the city's human rights ordinance, permissible under Iowa state law. Waterloo Mayor Tim Hurley joined the commission in condemning Gage's murder, in a press conference outside the commission's offices, but said he had not formed an opinion on the addition of sexual orientation to the city's human rights ordinance.[21] Gage's friends held candlelight vigils outside his apartment building, and his family and classmates held a memorial outside of the beauty school. His wake in Oelwein was attended by hundreds, and his funeral drew a crowd too large for the funeral home where it was held. Friends and community members started a scholarship in Gage's name, and sold T-shirts and buttons with his image to raise money. Three area churches took up collections for Gage.[6] A benefit to raise money for the scholarship fund was held at the city convention center and attracted numerous attendees. It also attracted protesters from the Westboro Baptist Church in Topeka, Kansas. About 20 Westboro members picketed six area churches and stood outside the convention center carrying signs and shouting that Gage was in hell.[22] They were then joined by a second group, Consuming Fire Campus Ministries, led by Matt Bourgault.[23]\n",
        "type": [
            "murder",
            "arson",
            "assault"
        ]
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Iowa",
        "title": "George Floyd protests in Iowa",
        "date": "May 28, 2020 – June 5, 2020",
        "year": "2020",
        "location": " Iowa, United States",
        "state": "Iowa",
        "place": "Ames",
        "county": "Story County",
        "paragraph": "\nThis is a list of George Floyd protests in Iowa, United States.\nRoughly 300 people gathered the evening of May 30 to march around Ames' City Hall.[1]\nProtesters gathered at the Linn County Courthouse on May 29, 2020.[2]\nMay 30: More than 500 people in LaClaire Park to protest.[3] Rocks were thrown during part of the protest.[4] May 31: Dozens of shots were fired all over the city. At midnight, a 22-year-old female protester was shot in the back and died. A police officer injured in a drive-by shooting was recovering and in \"good spirits.\"[5][6] On June 1, at around 3:00 a.m., three Davenport police officers were ambushed by gunfire while on patrol. Two of the officers were injured while the third returned fire.[7]\nAbout 200 people gathered on Water Street on the afternoon of May 31 to protest.[8]\nHundreds of protesters clashed with police outside of the city's police headquarters on May 29. Some protesters threw bottles, rocks, bricks, and fire crackers at officers and windows were smashed at nearby buildings in the city's East Village neighborhood. Tear gas and pepper spray were used.[9] A protest and march on May 30 spilled to Iowa State Capitol steps and the city's Court Avenue entertainment district, where windows were broken at the Polk County Courthouse and several businesses were vandalized.[10]\nAbout 100 protesters lay on the ground to honor George Floyd in Jackson Park on June 1. Speakers included the President of the Dubuque chapter of the NAACP and a woman who sued the city for injuring her with a Taser in 2019.[11]\nHundreds protested the afternoon of May 30 at the Pentacrest on the University of Iowa campus. Streets were blocked to allow protesters to maintain social distance due to the COVID-19 pandemic.[12]\n",
        "type": [
            "shooting",
            "riot"
        ]
    },
    {
        "link": "/wiki/Charlie_Dexter",
        "title": "Charlie Dexter",
        "date": "",
        "year": "new 1934",
        "location": "",
        "state": "Iowa",
        "place": "Chicago",
        "county": "Johnson County",
        "paragraph": "Charles Dana Dexter (June 15, 1876 – June 9, 1934) was a Major League Baseball outfielder from 1896 to 1903.\nDexter's career in baseball started in 1889, with the Evansville Cooks, a semiprofessional ball club. He played with them until 1894 when he decided to attend University of the South. He also played for the Louisville Colonels, Boston Braves, and Chicago Cubs organizations.[1]\nOn December 30, 1903 Charlie Dexter and fellow player John Franklin Houseman were in a box watching a show at the Iroquois Theatre in Chicago when the Iroquois Theatre fire broke out; they were credited with breaking down a locked door and rescuing a number of people.[2]\nIn 1905, he reportedly stabbed Milwaukee Brewers first baseman Quait Bateman in the chest while he was drunk. Dexter was taken to jail. Bateman decided to not press charges as he believed it was an accident and Dexter was released the next morning.[3][4]\nIn 1934, Dexter shot himself to death in Cedar Rapids, Iowa.[5]\n\nThis biographical article relating to an American baseball outfielder born in the 1870s is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "shooting"
        ]
    },
    {
        "link": "/wiki/1973_Gitchie_Manitou_murders",
        "title": "1973 Gitchie Manitou murders",
        "date": "",
        "year": "1973",
        "location": "",
        "state": "Iowa",
        "place": "Manitou",
        "county": "Johnson County",
        "paragraph": "The 1973 Gitchie Manitou murders involved an attack on a group of five teenagers at Gitchie Manitou State Preserve in Lyon County, Iowa. Four of the teenagers were killed and a fifth was kidnapped and raped. Allen, James, and David Fryer were later convicted of the crimes and sentenced to life in prison. The attack took place on November 17, 1973.\nOn the evening of November 17, 1973, five teenagers from Sioux Falls, South Dakota were attacked by a group of three brothers.  Four of the teenagers were killed and one was kidnapped and raped. Those killed were Roger Essem (male, 17), Stewart Baade (male, 18), Dana Baade (male, 14), and Michael Hadrath (male, 15).  Sandra Cheskey (female, 13) was raped, but survived the attack.  Her testimony was instrumental in bringing the perpetrators to justice.[2]\nThe perpetrators of this slaying were Allen Fryer (male, 29), David Fryer (male, 24), and James Fryer (male 21) of Sioux Falls, South Dakota.[3]\nThe Fryer brothers were in Gitchie Manitou State Preserve looking for illumination to poach deer and happened upon the victims sitting around a campfire, singing.  David Fryer was sent to spy on the group and reported back to his brothers that the teenagers had marijuana.  The brothers conferred and decided to take the victims' marijuana by impersonating narcotics officers.  Testimony at the trial indicated that the Fryers apparently thought narcotics agents were allowed to indiscriminately kill drug users.\nAfter getting shotguns from their truck, Allen, James, and David Fryer positioned themselves on a ridge overlooking the victims and opened fire.  Roger Essem was killed immediately and Stewart Baade fell wounded.  At this point, the remaining teenagers took cover in the trees.\nThe Fryers ordered the teenagers to come out of the trees, so Michael Hadrath and Sandra Cheskey emerged together and asked the Fryers who they thought they were.  Allen Fryer then shot Hadrath in the arm and said that they were police officers.  Hadrath and Cheskey fell to the ground, but were forced to get up by Allen Fryer who said they were playing dead.\nAllen and David Fryer forced Dana Baade, Michael Hadrath, and Sandra Cheskey along a trail away from the campfire. Sandra Cheskey was tied up and placed in the victims' van.  During this time, Stewart Baade was also brought back to the van from where he had been wounded.\nAllen Fryer then drove away in the van with Sandra Cheskey, leaving Stewart Baade, Dana Baade, and Michael Hadrath standing near the road with James and David Fryer.  After Allen left, James and David Fryer killed the three teenagers with shotguns.[4] The bodies were discovered the next day by a couple from Sioux Falls, SD who drove to the park while trying out their new car. Roger Essems' body wasn't discovered until the following day because it was left lying by the campfire, the site of the first encounter.\nAllen Fryer told Sandra Cheskey that he was a police officer while they drove around, that he was \"The Boss\", and that the other two would do as he instructed them.  After a short time, James and David Fryer met them on the road in the pickup.  Allen and Sandy got into the truck, and the group drove to a farm.  At this point, James Fryer raped Sandra Cheskey. Early the next morning, Allen filled the vehicle's tank with gasoline from a large red fuel tank then drove Cheskey home, still under the pretense of being a police officer, saying that Sandra was \"too young to get busted\".[5]\n",
        "type": [
            "murder",
            "shooting",
            "sexual assault",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/Amber_Duncan",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "place": "Terre Haute",
        "county": "Decatur County",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\nAlthough Iowa abolished capital punishment in 1965, the crime was a federal case since it involved a continuing criminal enterprise. Honken was sentenced to death and executed by the federal government on July 17, 2020,[4] the first defendant from Iowa to be executed since 1963.[3] Johnson was also sentenced to death, the first woman sentenced to death by a United States federal jury since the 1950s, but the sentence was overturned in 2012,[5] and she was resentenced to life without parole in 2014.\nHonken grew up in Britt, Iowa.[3] His father, Jim Honken, was an alcoholic schemer who was allegedly neglectful. Honken reported in his pre-sentence investigation that his father struck him numerous times during his childhood, although he denied that his father was physically abusive and maintained that the emotional turmoil in his early life mostly stemmed from his father's alcoholism. Jim once convinced his son to steal and copy a key to a bank. Jim committed two bank robberies before getting caught and sent to federal prison. Honken's parents divorced when he was nine. Honken had a healthy relationship with his stepfather.[6]\n\nHonken had a notably healthy relationship with his mother, who he described as perfect. Federal court appeals later described their relationship while dismissing claims that there was substantial mitigation in his upbringing:The movant's mother provided a stable, nurturing and loving environment, never abandoned him, did not fail to provide any sort of safe space or comfort to him, never neglected him, never failed to calm him or tell him that things were going to be okay, acted as a loving caretaker and facilitated the movant's attachment to her by making herself available to him.[6]Honken, who was proficient in math, science, and writing, earned a scholarship to North Iowa Area Community College in 1991. He later said that he had initially planned to become a pharmaceutical lawyer.[7]\nDuring Honken's capital murder trial, his mitigation expert, Lisa Rickert, wrote to his lawyers that not only had she struggled to find any possible mitigation, what she discovered only further cast Honken in a negative light.[8]\n",
        "type": [
            "murder",
            "robbery",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Saint_Joseph_the_Worker_Catholic_Church_(Dubuque,_Iowa)",
        "title": "Saint Joseph the Worker Catholic Church (Dubuque, Iowa)",
        "date": "",
        "year": "new 2003",
        "location": "",
        "state": "Iowa",
        "place": "Dubuque",
        "county": "Dubuque County",
        "paragraph": "Saint Joseph the Worker Catholic Church is a Catholic parish located in Dubuque, Iowa.  It is part of the Archdiocese of Dubuque.  The parish became the tenth Catholic parish in Dubuque when it was created in 1949 by Archbishop Rohlman.  The current pastor of the parish is Father Jim Goerend.\nPrior to the construction of the first church, the parish offices were located at Mercy Hospital.  Weekend masses were held at Washington Junior High School.  Eventually a parish church was built at the current location at 90 S. Algona, Dubuque.\nIn the late 1960s, a new parish church was built.  This new church building was a departure from the traditional church buildings of the past.  The church was a circular structure where the congregation sat in a semicircle around the altar.  The church is noted for its stained glass windows.\nOriginally, the parish was named Saint Joseph's Church.  There was another Saint Joseph's parish about three miles away, in Key West, Iowa.  At times, one of the two parishes would receive mail intended for the other parish.  In order to distinguish between the two parishes, the name was changed to St. Joseph the Worker parish in the 1990s. The parish is one of the larger parishes in Dubuque, mainly because of its location near the west end of the city.\nThe church was vandalized and damaged by arson in 2003.  Anti-religious graffiti was found on the walls, as was a number of beer cans.  A fire was found to have been burning on the main altar.  The church sustained about $100,000 worth of damage.  The next day, the pastor removed the Eucharist from the building.  The building was then cleaned and repaired by a company that specialized in repairing and cleaning fire damaged buildings.  A nearby Methodist church that had moved to a new facility donated their old church building while cleaning and repairs were being done.  A young man whose family belonged to the parish had eventually confessed to the crime, he had committed it after a night of drinking and drug use.\nCoordinates: 42°29′28″N 90°41′33″W﻿ / ﻿42.4911°N 90.6926°W﻿ / 42.4911; -90.6926\n",
        "type": [
            "arson"
        ]
    },
    {
        "link": "/wiki/Gayno_Smith",
        "title": "Gayno Smith",
        "date": "May 16, 2005(2005-05-16) (aged 67) University of Iowa Hospitals and Clinics, Iowa City, Iowa, U.S.",
        "year": "2005",
        "location": "",
        "state": "Iowa",
        "place": "Clinics",
        "county": "Johnson County",
        "paragraph": "Gayno Gilbert Smith (January 23, 1938 – May 16, 2005)[1] was an American mass murderer and serial killer who killed six of his family members in Iowa between 1961 and 1962.\nBefore the murders, Smith had been living in Denver, but due to problems there had come to Martinsburg, Iowa to live with his stepmother. When he had problems with her as well, he moved to the home of his uncle Andrew.[2]\nOn May 27, 1962,[3] Smith murdered Andrew McBeth, 51,[4] and Dora McBeth, 41,[4] and their three children: Amos and Anna McBeth, 19, and Donna Jean Kellogg, 17. Smith, then 24, a nephew of the elder McBeths', confessed to the crime. He also confessed to having murdered his stepmother, Juanita Smith, who had been missing for several months, in 1961.[5]\nThe McBeth family lived in rural Iowa, about four miles north of Martinsburg, and Gayno Smith had been living with them at the time. Another daughter, Patsy Lou, 15, was wounded by Smith but escaped in the night and ran to a nearby farm for help. Kellogg's six-month-old baby, Perry, was in a crib and left unharmed.[5]\nOn the night of the murders, the McBeth children – Amos, Anna, and Donna Jean – had driven to Brighton, Iowa for a dance and Donna Jean, as was her custom, had left her infant in the care of her parents. \"Smith remained at the dance a short time, then disappeared until midnight, according to court records. He came back to pick up the group after the dance ended. Thunder, lightning and heavy rain began as the five went to a truck stop for food. When they returned to their farmhouse, the lights were out.\"[2]\nThe children found flashlights and made their way around the house to investigate. Donna and Amos found the murdered bodies of their parents in the garage, where they'd been dragged. They tried to call for help but discovered the lines had been cut.[2]\n\"Suddenly, Smith appeared before them with a flashlight and a gun. He shot Amos in the face, then Donna. He shot Patsy in the shoulder. Though badly wounded, Amos pleaded for his life but was shot again. Patsy escaped to another room where she found her older sister, Anna, already dead.\n\"Smith chased her to a ditch in the countryside. She played cat and mouse through the ditches, crawling and crouching to escape his roving flashlight through the early morning hours. She finally reached a nearby farmhouse, where she called her uncle, Firman McBeth.\"[2]\nSmith went into hiding but was found four days later in a barn near Lake Wapello. After being arrested, he confessed both to the McBeth murders in Martinsburg and also to the murder of his stepmother, Juanita Smith, the previous October in Hedrick, Iowa. At the time, Iowa still had capital punishment, and prosecutors wanted Smith hanged. Facing an almost certain death sentence if he went to trial, Smith pleaded guilty to six counts of murder, leaving his fate up to the judge.\n",
        "type": [
            "murder",
            "shooting",
            "kidnapping",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Murder_of_Mollie_Tibbetts",
        "title": "Murder of Mollie Tibbetts",
        "date": "",
        "year": "new 2018",
        "location": "",
        "state": "Iowa",
        "place": "Brooklyn",
        "county": "Poweshiek County",
        "paragraph": "On July 18, 2018, University of Iowa student Mollie Cecilia Tibbetts disappeared while jogging near her home in Brooklyn, Iowa. A month later, police identified 24-year-old Cristhian Bahena Rivera as a suspect in connection with the disappearance; surveillance footage showed Rivera's car following Tibbetts on her jog. Rivera led police to the body of Tibbetts in a Poweshiek County cornfield on August 21. He was charged with first-degree murder. On May 28, 2021, Rivera was found guilty of first-degree murder.[2] On August 30, 2021, Rivera was sentenced to life in prison without parole.[3]\nRivera's immigration status became a politicized issue after police, the U.S. Citizenship and Immigration Services (USCIS), and U.S. Immigration and Customs Enforcement (ICE) indicated that he had been in the United States illegally. The Trump administration and some Republicans, including Iowa governor Kim Reynolds, argued the murder could have been prevented with more restrictive immigration policies. Tibbetts's family denounced efforts to use Tibbetts's death for political purposes.[4]\nMollie Cecilia Tibbetts was born on May 8, 1998, in San Francisco, California, to Rob Tibbetts and Laura Tibbetts. When she was in the second grade, her parents divorced, and she moved to Iowa with her mother and two siblings.[5] Her father kept a close relationship with the children, and he last saw Mollie at his wedding in June 2018.[6][7] At the time of her disappearance, she was a resident of Brooklyn, Iowa, a small town about 70 miles (110 km) east of Des Moines, and a psychology major at the University of Iowa.[8] She worked at a children's day camp at Grinnell Regional Medical Center and was preparing for her sophomore year in college when she disappeared.[5][9]\nOn July 18, 2018, Tibbetts, a former cross country runner, left the home of her boyfriend in Brooklyn for an evening jog.[5][8] She was last seen at approximately 7:30 p.m. CDT and was reported missing by her family when she did not show up for work the following day.[10] According to police, her last confirmed communication was with her boyfriend of three years, shortly before leaving for her jog.[5] Her boyfriend was out of town for work in Dubuque, Iowa, over 130 miles (210 km) away.[11] He told investigators he received a Snapchat message from her later in the evening that appeared to show her indoors.[8]\nOver the next several weeks, police in multiple states investigated hundreds of leads in the case,[12] including an unconfirmed sighting at a truck stop in Kearney, Missouri[10] (later confirmed to have been false),[12] but were not able to locate Tibbetts. They received over 2,300 tips[13] and conducted over 500 interviews during the course of the investigation.[14] As she was known to always wear her Fitbit activity tracker, police attempted to use its data to help find her.[15]\nAbout four weeks after Tibbetts' disappearance, police said that the search had been refocused to several specific areas in and around Brooklyn, including her boyfriend's home, a truck stop, a car wash, and two area farms.[16] Prior to the discovery of Tibbetts' body, monetary rewards for information leading to closure in the case had reached over $366,000, surpassing the previous record reward amount raised by the local Crime Stoppers branch.[17] As the money was to be used as a reward on the condition of her safe return, Crime Stoppers announced that the money would be returned to those who requested it, or dispersed to the general Crime Stoppers fund and/or to the Tibbetts family.[18]\nOn August 21, police in Iowa announced that a body had been found in Poweshiek County,[19] where Tibbetts' hometown of Brooklyn is located; the body was identified as Tibbetts' in an autopsy that was conducted two days later by the Iowa State Medical Examiner.[20] They had been led to the site by 24-year-old suspect Cristhian Bahena Rivera.[19][21]\nOn August 23, the Iowa State Medical Examiner performed an autopsy and recorded the cause of death as \"multiple sharp force injuries\" and the manner as homicide.[20][21]\nCristhian Bahena Rivera, aged 24 at the time of the crime, lived and worked in the rural Poweshiek County area where Tibbetts vanished.[22][23] Originally from El Guayabillo, Guerrero, Mexico,[24] he arrived illegally in the United States at age 17 and had lived in the area for several years.[25] He had worked at another farm before coming to Yarrabee Farms near Brooklyn, Iowa, in August 2014.[25] Rivera self-identified and received his paychecks under the name John Budd.[26][27]\n",
        "type": [
            "murder",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/Charles_Brown_and_Charles_Kelley",
        "title": "Charles Brown and Charles Kelley",
        "date": "February 18, 1961 – February 22, 1961",
        "year": "1961",
        "location": "",
        "state": "Iowa",
        "place": "Omaha",
        "county": "Pottawattamie County",
        "paragraph": "Charles Noel Brown (June 21, 1933 – July 24, 1962)[1] and Charles Edwin Kelley (February 17, 1941 – September 6, 1962)[2] were American spree killers who killed three people and wounded three others in a five-day, three-state rampage in February 1961. The duo, who said they shot the victims to avoid leaving witnesses, were labeled the \"Mad Dog Killers\". Sentenced to death for a murder committed in Iowa, Brown and Kelley became the second-to-last and last people executed in the state, respectively. Iowa abolished capital punishment in 1965.\nAccording to Brown's mother, sister, and uncle, he had a rough life and dropped out of school after 8th grade to help his family. His father was a frequently absent alcoholic.[3]\nIn 1956, Kelley was diagnosed with epilepsy after becoming dizzy and falling down. During his murder trial, he testified that he stopped taking medication after about a year. When he was 17, Kelley volunteered for the Marines with his father's permission, but was discharged 17 days later after suffering from a gran mal seizure.\nBrown, an ex-con who had served prison time for forgery, met Kelley as they were working together as parking lot attendants. The two soon became drinking buddies. After Kelley robbed a gas station armed with a screwdriver, Brown used the money to buy two handguns.\nOn February 18, 1961, Brown and Kelley robbed a gas station in Minnesota. They shot the attendant, 17-year-old James Peterson, three times. Two of the shots hit Peterson in the head, and the third likely would've hit him in the heart, but was deflected by a button on his work uniform. Peterson went into a coma, emerged from it a few days later long enough to talk to police, and then went into unconsciousness once more. He would remain in critical condition for more than a month, but survived. Peterson died from complications from his injuries in 2007.\nOn February 20, Brown and Kelley shot and killed 52-year-old Howard Trowbridge while robbing his tavern in Minneapolis, Minnesota. They also shot the bartender, 30-year-old George Koch, six times. He survived his injuries. They then took a bus to Nebraska.\nThe next day, the duo killed 60-year-old Harry Goldberg during a liquor store robbery in Omaha. Brown later said \"I took this old man into the rear room, and I told him to turn around. He didn't do as I asked, so I shot him with my gun.\"\nThe two then took a taxi to Council Bluffs, Iowa, where they planned to steal a car and make their getaway. Brown and Kelley carjacked 54-year-old Alvin Koerhsen and ordered him to drive at gunpoint. After driving several blocks, they had him pull over. The two then shot Koerhsen seven times and dumped him onto the street.[4] He died from his injuries two days later. After failing to turn the car back on, the two were forced to move on foot. About 20 minutes later, they went to a parking lot, where they saw Kenneth Vencel was getting into his car. When they threatened him, he ran away. Brown and Kelley shot Vencel three times, once in the stomach and twice in the back. He survived his injuries. The two then drove north. However, they only drove about 25 miles before the car broke down in Missouri Valley.[3][5][6]\nKelley and Brown took a bus en route to Kansas City, Missouri. However, they drew the suspicion of a ticket manager in Iowa, who contacted the police. The two were promptly arrested in Council Bluffs.\n",
        "type": [
            "murder",
            "shooting",
            "robbery"
        ]
    },
    {
        "link": "/wiki/Iowa_City_Sueppel_murders",
        "title": "Iowa City Sueppel murders",
        "date": "March 23, 2008 (2008-03-23)",
        "year": "2008",
        "location": "Iowa City, Iowa, U.S.",
        "state": "Iowa",
        "place": "Iowa City",
        "county": "Johnson County",
        "paragraph": "The Iowa City Sueppel murders was a family annihilation perpetrated by Steven Sueppel, a 42-year-old former banker, at his residence in Iowa City, Iowa, USA on Easter Sunday night, March 23, 2008.[1]\nOn Monday morning at 6:31 a.m., Sueppel called 9-1-1 from his mobile phone, requested that police visit his house immediately, and hung up without identifying himself.[1] When police arrived at his house, they found Sueppel's wife Sheryl and their four adopted children—Ethan (age 10), Seth (age 9), Mira (age 5) and Eleanor (age 3) dead of multiple blunt force trauma injuries to their upper torsos and heads.[2] Police recovered the presumed murder weapons—two baseball bats—at the scene of the crime.[1] At 6:36 a.m., five minutes after his 9-1-1 call, Steven Sueppel committed suicide by driving the family minivan into a concrete abutment on Interstate 80 at high speed, causing his vehicle to burst into flames.[3]\nIn February 2008 (one month before the murders), Steven Sueppel was indicted by a federal grand jury on charges of embezzlement and money laundering in connection with $559,040 stolen from his former employer, the Hills Bank and Trust Company of Hills, Iowa, where he had served as a vice president and controller.[1] Sueppel had pleaded not guilty, but had indicated to investigators that he had in fact diverted the funds to a personal account.[1] At the time of the murders, Sueppel was out on bond and awaiting an April 2008 trial.[2]\nStarting at about 11:30 p.m. on the evening of the murders, Sueppel left a series of apologetic voicemail messages for former co-workers and relatives.[4] He also left a handwritten note in his own kitchen; in it, he wrote that he had killed his wife and children.[4]\nOn March 29, 2008, St. Mary's Church in Iowa City, where the Sueppel family had attended services the day before the familicide, held a Catholic funeral mass for all six members of the Sueppel family.[5] The church's decision to grant Steven Sueppel, a presumed multiple murderer, a Catholic funeral generated controversy among Iowa City-area Catholics and Catholic scholars.[6]\nSunday a.m.: The Sueppel family attends Easter Mass at St. Mary's Catholic Church. Steven's and Sheryl's parents are also at the Mass and later said they did not notice anything unusual about anyone's behavior.\nSunday, 8:00 p.m.: A family friend stops by at the Sueppels' home and visits with Steven. The friend saw one of the children, but noted nothing unusual.\nSunday, 11:30 p.m.: Steven Sueppel leaves a message for his father and brother at their law firm. In the message he states that his family is in heaven. It is believed that his wife had been killed by now, although the children were likely still alive.\nSunday, 11:30 p.m.—Monday 3:45 a.m.: At some point, according to a letter Steven wrote, he allegedly gathers his four children into the family van which was parked in the garage and tries to kill the children and himself by carbon monoxide poisoning. When this doesn't work, Steven ushers the children back into the house and bludgeons them to death. The three oldest children were found in their bedrooms. Eleanor, the youngest was found downstairs in the toy room.\n",
        "type": [
            "murder",
            "robbery",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Shawn_Bentler",
        "title": "Shawn Bentler",
        "date": "",
        "year": "new 2006",
        "location": "",
        "state": "Iowa",
        "place": "Bonaparte",
        "county": "Van Buren County",
        "paragraph": "Shawn Bentler is a convicted mass murderer from Bonaparte, Iowa. On October 14th 2006, 22 year old Bentler murdered his father Michael, 53, his mother Sandra, 47, and his three younger sisters; Sheena, 17, Shelby, 15, and Shayne, 14.\nIt was claimed that the motive was so he could inherit his family's fortune. He was consequently sentenced to four concurrent life sentences and a consecutive life sentence.[1]\n",
        "type": [
            "murder",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Murders_of_Lee_Rotatori_and_Thomas_Freeman",
        "title": "Murders of Lee Rotatori and Thomas Freeman",
        "date": "c. July 1982 (murder) October 30, 1982 (discovery of body)",
        "year": "1982",
        "location": "Cobden, Illinois, U.S.",
        "state": "Iowa",
        "place": "Council Bluffs",
        "county": "Pottawattamie County",
        "paragraph": "On June 25, 1982, Lee Gunsalus Rotatori, a 32-year old American woman, was sexually assaulted and murdered in her hotel room by Thomas Oscar Freeman in Council Bluffs, Iowa. The murder went unsolved for nearly 40 years, until it was announced by authorities in 2022 that the perpetrator had been identified as Freeman using investigative genetic genealogy.\nAround July 1982, Freeman himself was murdered by an unidentified perpetrator in Cobden, Illinois. His decomposing body was found in a shallow grave around three months after his murder. As of 2022, the murder remains unsolved and the case remains open, and investigators believe the two murders were connected.\nLee Rotatori was a 32-year-old American woman from Nunica, Michigan who had recently relocated to Council Bluffs to work at the nearby Jennie Edmundson Hospital in June 1982. She was new to the area and did not have permanent housing, so she stayed at the Best Western Frontier Motor Lodge hotel for several nights.[1]\nOn the morning of June 25, 1982, Rotatori's boss called the hotel because she had not appeared for her first formal day of work. When employees went to check on her room, they found her murdered and turned over the scene to investigators. They found that she had been murdered by a single stab wound to the heart, and that she had been sexually assaulted. There were no formal suspects for decades.[1][2]\nAn Omaha World-Herald article dated July 4, 1982, published 10 days after Rotatori's body was discovered, reported then-Sergeant Larry Williams as saying, \"the killer could have been five feet away or a thousand miles away.\" In an attempt to find answers, her employer and other local organizations put up rewards for thousands of dollars, but with no success. As a result, a cold case with no suspects or answers began and no suspects were revealed for decades.[1]\nIn 2019, authorities submitted DNA evidence to Parabon NanoLabs in an attempt to identify a suspect. They additionally were assisted by volunteer genealogist and Elizabethtown College student, Eric Schubert. In February 2021, Thomas Oscar Freeman was found to be the apparent owner of DNA found at the crime scene. Freeman's daughter agreed to give a DNA sample, which confirmed him as the perpetrator of the murder. [1][3]\nIn 2022, it was announced by authorities that the perpetrator had been identified as Freeman. It was also revealed that Freeman himself was the victim of a murder around July 1982. His decomposing body was discovered on October 30, 1982. It was determined that his body has sustained multiple gunshot wounds before being thrown into a shallow grave. Investigators believe the two murders were connected. [1][2][3][4][5][6]\nLee Rotatori's husband, Gerald \"Jerry\" Stanley Nemke, was initially looked at as a person of interest in Rotatori's murder, but was quickly ruled out as authorities determined he had a solid alibi.\nJerry Nemke had a past criminal record. On April 29, 1960 in Chicago, Illinois, at the age of 17, he bludgeoned a 16-year old waitress, Marilyn Duncan, to death with a brick. He was tried and convicted of murder and was  sentenced to death. His conviction was later overturned on appeal, with the Supreme Court of Illinois ruling that Nemke's preliminary hearing was not conducted fairly. He was convicted once again on retrial, and was instead sentenced to 75 years in prison. He was released early on parole at some point during his sentence.[7]\n",
        "type": [
            "murder",
            "shooting",
            "assault"
        ]
    },
    {
        "link": "/wiki/Kristina_Fetters",
        "title": "Kristina Fetters",
        "date": "",
        "year": "new 1994",
        "location": "",
        "state": "Iowa",
        "place": "Des Moines",
        "county": "Polk County",
        "paragraph": "Kristina Joy Fetters (February 5, 1980 - July 27, 2014) was an Iowa woman who was convicted of the murder of her 73-year-old great-aunt, Arlene Klehm, on October 25, 1994, when she was 14 years old.[1] At age 15, Fetters became the youngest woman in Iowa sentenced to life in prison without parole on December 18, 1995. Following the 2012 Supreme Court decision of Miller v. Alabama, which declared mandatory life sentences for juvenile offenders to be unconstitutional, Fetters became the first inmate in Iowa to be re-sentenced in November 2013.[2] The following month, she was recommended for compassionate parole due to a prognosis of inoperable stage-four breast cancer, and she was released to a hospice care center in Des Moines, Iowa in December 2013.[3] She succumbed to her cancer in July 2014, at age 34.[4]\nIn January 1994, Kristina Fetters was sent to Orchard Place, an unlocked facility in Des Moines for children with behavioral or mental health problems, and she was put on Prozac. On October 25, 1994, the morning of the murder, Fetters and her roommate, Jeanie Fox, escaped from the facility and hitchhiked to her great-aunt Arlene Klehm's home in northern Polk County, Iowa.[5] Allegedly, Fetters had previously discussed with other girls at Orchard Place about her plan to rob and kill her great-aunt. When Fetters and Fox arrived at Klehm's home, the young girls waited for visitors to leave before entering the home. Once inside the home, Fetters reportedly struck Klehm on the head with a frying pan, then attempted to slit Klehm's throat before stabbing her in the back with a paring knife. The two girls attempted to rob the house, but after being unable to find the keys to the safe or Klehm's truck, they left the scene. After police were called to the house, they discovered the murder, and Kristina Fetters was arrested that night and confessed to the crime.\nFetters was ultimately charged with first-degree murder and her case was transferred from the juvenile court to district court, and she was tried as an adult.[6] She pleaded insanity, arguing that she did not understand the full consequences of her actions, but a prosecution psychologist argued she carefully planned the killing.[1] This was corroborated by the testimony of three residents of Orchard Place, including Jeanie Fox. After a day of deliberation, a Polk County jury convicted Kristina Fetters of first-degree murder.[5] On December 18, 1995, she received the mandatory sentence of life in prison without parole under Iowa state law.[2]\nFetters served her sentence at the Iowa Correctional Institution for Women in Mitchellville, Iowa.[3] She filed appeals of her conviction, but they were denied.[6] In 2008, Fetters' attorneys filed a petition challenging her life sentence, arguing cruel and unusual punishment that was in violation of the Constitution and Iowa state law. In 2010, the case Graham v. Florida noted that key differences between children and adults must be considered in sentencing, citing brain research studies have shown that teenagers' brains continue to develop into their early twenties.[1] Two years later, the case Miller v. Alabama banned mandatory life sentences without parole for juveniles. In 2013, as Fetters was preparing for a new sentencing hearing, she became gravely ill and was diagnosed with inoperable breast cancer.[2]\nIn November 2013, Kristina Fetters was re-sentenced by a Polk County judge to life in prison with the possibility of parole. The judge also recommended that Fetters be immediately paroled due to her illness.[5] In December 2013, the Iowa Parole Board voted to release Fetters on hospice-only parole. She became the first juvenile who was convicted of murder and sentenced to life in prison who was released.[3] After seven months in hospice care, Fetters succumbed to her cancer on July 27, 2014; she died at age 34.[1]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Maharishi_University_of_Management_stabbing",
        "title": "Maharishi University of Management stabbing",
        "date": "March 1, 2004",
        "year": "2004",
        "location": "Fairfield, Iowa",
        "state": "Iowa",
        "place": "Fairfield",
        "county": "Jefferson County",
        "paragraph": "The Maharishi University of Management stabbing occurred on March 1, 2004, when without provocation, a university student Shuvender Sem fatally stabbed a fellow student, Levi Butler, after Sem had attacked another student earlier in the day. The event occurred at Maharishi University of Management (later renamed to Maharishi International University), Fairfield, Iowa, United States, and attracted attention partly due to the university's practice of \"yogic flying,\" which proponents say reduces violence in the surrounding area.[1] Sem was found not guilty due to insanity. A lawsuit against the university that had charged negligence was settled out of court.\nOn March 1, 2004, Shuvender Sem, who had been enrolled at the university for less than two months,[2] stabbed another student in the face with a pen during a class called Teaching for Enlightenment.[1] Told by university staff that he did not require medical attention, the injured student drove himself to the hospital where he received seven stitches.[3] University officials consulted a psychologist and decided that Sem would have to leave the university, but didn't report the incident to police. Sem didn't appear dangerous or agitated and was taken by Joel Wysong, the school's dean of men, to his on-campus apartment until he could take a flight home the next morning.[2] Left unattended, Sem took a paring knife from Wysong's kitchen and went to the university's dining hall.[4] Wysong followed Sem to the dining hall and watched while Sem interacted with other students, but did not take him back into custody. After about ten minutes and without provocation, Sem stabbed another student, freshman Levi Butler, four times in the chest, killing him.[1][5]\nSem, who was \"a diagnosed schizophrenic\", reportedly \"had been off his medication for months\" at the time of the murder.[6] After initially being declared incompetent, Sem was subsequently deemed competent to stand trial.[7][8] The judge ruled Sem not guilty by reason of insanity at the urging of both the defense attorneys and prosecutors.[9] In an April 22, 2010, news article in the Des Moines Register, Michael Taylor, the Des Moines-area psychiatrist who testified on Sem's behalf at his trial, says that the insanity defense was appropriate for this case.[10]\nThe university places an emphasis on reducing crime.\nCrime prevention is one of the seven founding goals of the University: \"To solve the age-old problem of crime and all behavior that brings unhappiness to the family of man.\" All students and administrators practice the Transcendental Meditation and TM-Sidhi programs which are designed to help eliminate criminal tendencies and behavior at their root cause.[11]College crime and campus security are significant issues in the United States, with 2,500 rapes and 3,000 aggravated assaults occurring at U.S. colleges every year.[12] A 2007 USA Today analysis of this incident and more than one hundred other killings that occurred on U.S. college campuses between 1991 and 2007 reported that flawed college security was to blame in at least 15 of these killings.[12] The USA Today report noted that more and more colleges in the U.S. have accepted students with mental disorders, and that many of these students discontinued their medication, causing serious problems.[12] Questioning campus officials' and professors' expertise in handling such students, the report cited University of South Florida criminologist Max Bromley as saying, \"The people who might see those behaviors first have the least background in how to deal with it.\"[12]\nOn March 29, 2010, a district judge in Jefferson County told Sem he could leave the psychiatric hospital in Independence, Iowa, and return to his home in Pennsylvania. Psychiatrist Michael Taylor recommended that Sem live at home with his parents while he went back to college and stated that Sem's paranoid schizophrenia was \"completely controlled\" by the drug \"Abilify\".[10]\nAccording to journalist Antony Barnett, the attacks at the Maharishi University of Management led critics to question claims that advanced meditation techniques could end violence.[1] The university said that this was the first incident of its kind on their campus, which they say is the most crime-free campus in the country, and that it was not their role to bring criminal charges against students.[1] Craig Pearson, executive vice-president, reported that the Maharishi had said of the incident that \"this is an aspect of the violence we see throughout society\", including the violence that the U.S. perpetrates in other countries.\nBarnett also reported that critics alleged, without providing evidence, that other incidents had been \"hushed up\", and that negative publicity was strenuously avoided.[1] In response to the accusation of a cover-up, Bill Goldstein, the university's legal counsel, was quoted as saying, \"In my 22 years as legal counsel the issue of image is never considered with regard to reporting incidents on campus. The university reports incidents to the police every week for their action and has always done so.\"[1]\n",
        "type": [
            "murder",
            "sexual assault",
            "arson",
            "assault"
        ]
    },
    {
        "link": "/wiki/Mahaska_(Native_American_leader)",
        "title": "Mahaska (Native American leader)",
        "date": "1834 (aged 49–50) Nodaway River, Near Massena, Iowa",
        "year": "1834",
        "location": "",
        "state": "Iowa",
        "place": "Mahaska",
        "county": "Mahaska County",
        "paragraph": "Mahaska (archaic Ioway Maxúshga pronounced [mõxuʃꜜkɐ]; contemporary Maxúhga), or White Cloud, (1784–1834) was a chief of the Native American Iowa tribe. His son, also named Mahaska, was better known as Francis White Cloud.\nMahaska was born into the Iowa tribe.  He became chief at an early age after killing several enemy Sioux to avenge his father's death by them.\nLater Mahaska supposedly killed a French trader in an argument; he was arrested and imprisoned in St. Louis, Missouri.  After he escaped, he led a raid against the Osage.\nAfterward, he decided that his father's death was finally avenged.  Mahaska lay down his arms and adopted the lifestyle of the European-American settlers, building a log home and farming. He refused to let his braves avenge the death of an Iowa chief named Crane at the hands of Omaha Indians in 1833.  When several Iowa killed six Omaha warriors, Mahaska assisted in their arrest.\nThe next year one of the Iowa escaped from Fort Leavenworth and killed Mahaska by shooting him in the back as he sat by his campfire. He was buried along the Nodaway River in Edna Township, Cass County, Iowa.  Mahaska became a symbol to settlers of the virtues of his native lifestyle, and of the possibility of peace between natives and settlers.[3][4]\nSculptor Sherry Edmundson Fry's earliest public commission was a bronze statue of Mahaska. Recently restored, it still stands on its pedestal in the courthouse square of Oskaloosa, which is the governmental seat of Mahaska County, Iowa, in the southeastern section of the state. At the right of the base is the artist's signature \"S.E. Fry, 1907\".\nWhen he accepted the Mahaska commission in 1906, Fry was living in Paris. He returned to Iowa the following summer to make preparatory drawings of Meskwaki at the nearby Settlement at Tama, Iowa, and to collect Indian artifacts and other reference materials. Returning to Paris, he began on a clay scale model, which he first showed at the Paris Salon in 1907. A year later, he exhibited the final full-sized sculpture, for which he was awarded the Rome Prize. Soon after, it was shipped to the U.S., and arrived in Oskaloosa by railroad. The formal dedication of the statue, which was attended by \"a crowd of 12,000 rain-soaked spectators\", was held on May 12, 1909.[3][5]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    {
        "link": "/wiki/Greg_Nicholson",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "place": "Terre Haute",
        "county": "Decatur County",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\nAlthough Iowa abolished capital punishment in 1965, the crime was a federal case since it involved a continuing criminal enterprise. Honken was sentenced to death and executed by the federal government on July 17, 2020,[4] the first defendant from Iowa to be executed since 1963.[3] Johnson was also sentenced to death, the first woman sentenced to death by a United States federal jury since the 1950s, but the sentence was overturned in 2012,[5] and she was resentenced to life without parole in 2014.\nHonken grew up in Britt, Iowa.[3] His father, Jim Honken, was an alcoholic schemer who was allegedly neglectful. Honken reported in his pre-sentence investigation that his father struck him numerous times during his childhood, although he denied that his father was physically abusive and maintained that the emotional turmoil in his early life mostly stemmed from his father's alcoholism. Jim once convinced his son to steal and copy a key to a bank. Jim committed two bank robberies before getting caught and sent to federal prison. Honken's parents divorced when he was nine. Honken had a healthy relationship with his stepfather.[6]\n\nHonken had a notably healthy relationship with his mother, who he described as perfect. Federal court appeals later described their relationship while dismissing claims that there was substantial mitigation in his upbringing:The movant's mother provided a stable, nurturing and loving environment, never abandoned him, did not fail to provide any sort of safe space or comfort to him, never neglected him, never failed to calm him or tell him that things were going to be okay, acted as a loving caretaker and facilitated the movant's attachment to her by making herself available to him.[6]Honken, who was proficient in math, science, and writing, earned a scholarship to North Iowa Area Community College in 1991. He later said that he had initially planned to become a pharmaceutical lawyer.[7]\nDuring Honken's capital murder trial, his mitigation expert, Lisa Rickert, wrote to his lawyers that not only had she struggled to find any possible mitigation, what she discovered only further cast Honken in a negative light.[8]\n",
        "type": [
            "murder",
            "robbery",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Shao_Tong",
        "title": "Murder of Shao Tong",
        "date": "",
        "year": "new 2015",
        "location": "",
        "state": "Iowa",
        "place": "Iowa City",
        "county": "Johnson County",
        "paragraph": "Coordinates: 41°38′07″N 91°29′58″W﻿ / ﻿41.63539°N 91.49937°W﻿ / 41.63539; -91.49937\nOn September 26, 2014, police found a body later identified as 19-year-old Shao Tong (Chinese: 邵童, November 1994 – September 2014),[1] a Chinese undergraduate at Iowa State University (ISU), in the trunk of a car registered in her name parked in an apartment complex on the outskirts of town in Iowa City, Iowa. She had been reported missing nine days earlier.[2] The cause of death was found to be homicide by suffocation.[3]\nShao had last been seen on September 7 at a hotel outside Nevada, a small town east of Ames, where ISU is located. She had been spending the weekend there with her boyfriend, Li Xiangnan (Chinese: 李向南), a student at the University of Iowa, located in Iowa City. Her car and body were in the apartment complex he lived in.[4]\nLi was not present. Police believe that after abruptly checking out of the hotel the following morning, he had used her phone to text her friends that she was going to be away for a while and that Li had to return to China for a family emergency. While there was no evidence of Shao's purported travel, Li had flown back to Beijing, but beyond that point his whereabouts were unknown.\nEarly in 2015, authorities in Johnson County charged Li with first-degree murder and obtained an arrest warrant. Chinese Internet users began circulating pictures of Li, who remained at large. After Chinese detectives traveled to Iowa to visit the crime scene and review evidence, they too charged Li with intentional murder under Chinese law, which allows the prosecution of any Chinese citizen for a crime even if it occurred abroad. He surrendered to police in his native Wenzhou in May. The case was prosecuted there, since not only is there no extradition treaty between China and the United States, China does not extradite its own citizens.[5] In March 2016, he pleaded guilty; three months later, he was given a life sentence, which could be reduced to a prison term of no less than 13 years.[6][7]\nShao was born in the coastal Chinese city of Dalian in 1994, the only child of a family typical of China's emerging middle class. Her father was a civil servant who worked in food safety inspection; her mother a homemaker. She attended Dalian Yuming High School [zh], and aspired to become a biologist.[1]\nYuming students routinely perform well on China's National Higher Education Entrance Examination or gaokao, and in the Olympic Competition, which offers winners admission to college without having to take the gaokao. In the late 2000s, Shao and her then boyfriend entered the competition. He won and attended a prestigious university in southern China; she did not.[1]\nShe decided to study in the U.S. instead, which she was able to do because her parents had saved over US$100,000 toward her education.[8] In 2011 she went to Beijing to take a preparatory course for the Test of English as a Foreign Language. There she met Li Xiangnan, three years her senior, from Wenzhou. Shao's mother says he developed a crush on her daughter, which was not unusual—many other young men had shown such an interest in her daughter. She met him once when he came to Dalian, and recalls him as shy. Although he seemed to be from a rich background, she and her husband did not think he was right for their daughter.[1]\nShao was accepted at Iowa State University (ISU), in Ames, where she majored in chemical engineering in 2012, a choice that pleased her father since not many women enter that field.[8] Li \"chased [her] from China to the U.S,\" an acquaintance said, transferring from Rochester Institute of Technology to the University of Iowa in Iowa City, 140 miles (230 km) away,[8] where he studied business.[1] At Iowa State, friends, mostly fellow Chinese students, recalled her as being very outgoing, tutoring students in Chinese and dancing at parties. She also distinguished herself for her ability to solve Rubik's cube quickly. Although engineering was not her favorite subject, she maintained a grade point average of 3.75.[1]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Murder_of_Michelle_Martinko",
        "title": "Murder of Michelle Martinko",
        "date": "December 19, 1979 (1979-12-19)",
        "year": "1979",
        "location": "Westdale Mall, Cedar Rapids, Iowa",
        "state": "Iowa",
        "place": "Cedar Rapids",
        "county": "Linn County",
        "paragraph": "The murder of Michelle Martinko occurred in Cedar Rapids, Iowa, on December 19, 1979. It was a cold case until 2018, when familial DNA identified a suspect 39 years after the crime who was charged, tried and convicted of her murder.[2]\nMartinko, an 18-year-old high school student, was found stabbed to death in her family's car in the parking lot of a local mall, where she had gone to buy a new coat. The murder was closely followed within her community, and the police received more than 200 tips in the weeks following her killing. However, the case gradually grew cold as the investigation stretched on.\nIn 2006, a cold case investigator discovered unidentified blood, presumably belonging to the killer, while he was reviewing case files. A DNA profile was developed from that evidence and entered into the national Combined DNA Index System (CODIS), but no matches were found. In 2017, a company specializing in DNA phenotyping was hired to produce a new approximation of the killer's appearance based solely off the DNA sample. In 2018, the company entered the DNA data from the case into the public genealogy website GEDmatch, where it found a familial DNA match.\nIn October 2018, DNA was covertly collected from an Iowa man, Jerry Lynn Burns, and was found to match the sample discovered on Martinko's clothing.[2][3][4]  Burns was arrested and, on February 24, 2020, was found guilty of first-degree murder in the death of Martinko. On August 7, 2020, Burns was sentenced to life in prison without parole.[1][5][6]\nMichelle Marie Martinko (October 6, 1961 – December 19, 1979) was born in Cedar Rapids, Iowa.[7] Martinko was the younger of two daughters of Albert F. Martinko and Janet Martinko (née Zillig).[8][9] She attended Cedar Rapids Kennedy High School, where she was an above average student and well regarded by school officials.[10][11] She was also a talented performer, joined the twirling squad as a sophomore, and performed in choirs and theater productions.[2] She did not have many close girlfriends or confidantes, which was speculated to be caused by jealousy from other students over her beauty and stylish clothes[11] or conflict over a boy she had dated.[12] Martinko, who was a senior in high school when she was killed, had plans to attend Iowa State University to study interior design.[2]\nJerry Lynn Burns (born December 23, 1953[13]) was 25 years old when he killed Michelle Martinko in December 1979. He grew up in Manchester, Iowa, and graduated from West Delaware High School in 1972. He lived in Manchester at the time of his arrest in 2020 and owned a powder coating business in the city. He had worked for John Deere and co-owned a truck stop. Burns had previously been married to Patricia Burns, who died in 2008 from suicide.[14] Burns's cousin, Brian Burns, went missing on December 19, 2013 and has not been found. Although Burns's arrest in the Martinko case raised questions about the two incidents, police do not believe Burns was involved in either one.[15]\nOn the evening of December 19, 1979, Martinko attended a banquet for the Kennedy Concert Choir at the Sheraton Inn in Cedar Rapids.[10] She wore a black jersey dress and black scarf, black tights and heels, and a waist-length white and brown rabbit fur jacket, and she carried a brown leather purse.[9] After the event, she asked her friend and twirling squad teammate if she wanted to join her on a shopping trip to the Westdale Mall, which had recently opened, and where Martinko worked. Her friend declined and so Martinko went alone carrying $180 and intending to purchase a new winter coat.[2] Once there, she perused the stores and spoke with friends and other people she knew who worked there.[9] She was last seen at 8 or 9 p.m. outside of a jewelry store in the mall.[2][16] At 2 a.m., since Martinko had still not returned home, her father reported her missing. He began to search for her, as did the police. At 4 a.m., police found the Martinko family's tan and green 1972 Buick Electra in the northeast corner of the mall parking lot by a JCPenney.[9] Martinko was found inside collapsed over the passenger seat and stabbed to death.[2]\nMartinko had been stabbed 29 times in her face, neck, and chest.[2][5] Her hands bore defensive wounds, which police said to indicate that she had fought back against her killer.[2] Police determined from the lack of blood outside the car that Martinko had been killed while in the car, and the medical examiner later estimated she had died between 8 and 10 p.m.[17] The murder weapon was \"sharp-pointed\" but not definitively a knife, and the medical examiner could not determine its size.[9] The killer left no fingerprints, which led police to believe they had worn gloves.[2] A police spokesman said that \"everyone's instinct is to say it was a guy\", but they were not sure of the sex of the killer.[16] Based on cash found in Martinko's purse, police concluded that she had not been robbed.[9] She was fully dressed, and the medical examiner determined she had not been sexually assaulted.[10] Police considered the killing to be \"personal in nature\" based on the number and location of stab wounds.[9][2]\nPolice had few leads and appealed to the public for tips.[10] A police spokesman estimated that in the week after Martinko's murder, more than 200 people responded to the detectives' appeals in the news for information concerning the case. Police interviewed numerous people, and several were cleared of suspicion through use of a polygraph. A juvenile found carrying a knife was interviewed and ruled out in her murder, as was a shopping center employee who had told police that he enjoyed following women and ogling store mannequins. Rumors began to circulate about the crime. Some thought that Martinko had received harassing phone calls before her death, but police stated that they did not think so.[16] Another rumor emerged that a second stabbing had happened in the following days and that police were keeping it secret, which police denied.[18]\n",
        "type": [
            "murder",
            "assault"
        ]
    },
    {
        "link": "/wiki/Roger_Bentley",
        "title": "Jetseta Gage",
        "date": "March 24, 2005 (aged 10)",
        "year": "2005",
        "location": "",
        "state": "Iowa",
        "place": "Johnson County",
        "county": "Johnson County",
        "paragraph": "Jetseta Marrie Gage (August 25, 1994 – March 24, 2005) was an American child whose kidnapping, rape and murder prompted major changes in sentencing laws for those who commit child sex crimes in Iowa. Roger Bentley, a convicted sex offender and friend of Gage's family, was arrested in connection with 10-year-old Jetseta's death. He was convicted of first-degree murder and first-degree kidnapping on January 31, 2006.[1] On February 24, he was sentenced to two consecutive mandatory sentences of life in prison without parole.[2]\nProsecutors alleged that Bentley took Gage from her home to a run-down trailer in rural Johnson County, Iowa, where he raped and killed her. An AMBER Alert was issued shortly after it was noticed that she was missing. The AMBER Alert program had errors that night. A proper description with name and picture did not appear until hours after she had vanished. Bentley was arrested a day later. Investigators found her body inside a bathroom cabinet inside the trailer.\nBentley's trial was moved to Scott County on the defense's change of venue motion because of extensive pre-trial publicity; local media dubbed the case \"Justice for Jetseta.\" During his trial, prosecutors linked DNA evidence found on Gage's body to Bentley, while the defense (which did not call any witnesses) claimed there were no eyewitnesses to the crime or direct evidence.[3][4] It took just over two hours for the jury to arrive at its guilty verdict.\nBentley's brother, 34-year-old James Bentley, was indicted in November 2004 on felony sexual abuse charges after authorities alleged he sexually abused Gage between 2002 and 2004. The Bentley brothers were not strangers to the family. Gage's mother had dated both men and allowed the brothers contact with her children. James Bentley was found guilty of second-degree sexual abuse at the Clarke County courthouse in Osceola, Iowa, on August 1, 2008.[5] On March 1, 2007, a federal judge in Cedar Rapids found James Bentley guilty of six counts of child pornography and sexual exploitation charges in a separate trial. Bentley was accused of taking explicit photos of Gage and another infant girl in late 2003 and transporting those photos with him to Arkansas shortly afterwards.[6] He was sentenced to life in prison without parole on June 12, 2007.[7]\nWriters and broadcasters affiliated with the Associated Press named the Jetseta Gage murder as Iowa's top news story of 2005.[8]\nIn 2005, the Iowa General Assembly passed a bill extending prison sentences and strengthening supervision of sex offenders – through methods such as electronic monitoring – upon their release from prison.\nAlso, numerous local governments throughout the state moved swiftly to enact stricter residency restrictions for sex offenders. Like a number of other states, Iowa already had a moratorium barring those on the sex offender registry from living within 2,000 feet (610 m) of a school or state-registered day care center, and local officials proposed expanding the buffer zone to such child-oriented places as libraries, parks and swimming pools.[9] While some cities and county governments passed such ordinances, other governments – such as the city of Davenport and Scott County – were cool to the proposal and ultimately did not enact the tighter restrictions.[10][11]\nCritics contended that the stricter residency proposals had several flaws, most notably:\nIn January 2006, 45 members of the Iowa Senate – 23 Democrats and 22 Republicans – co-sponsored a bill increasing the penalties for those convicted of certain sex crimes, including lascivious acts with a child and sexual exploitation of a minor. Under the proposal, a first-time offender would face a mandatory minimum 25-year prison sentence upon conviction.[12]\n",
        "type": [
            "murder",
            "sexual assault",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/Joseph_Lawrence_(murderer)",
        "title": "Murder of Jason Gage",
        "date": "",
        "year": "new 2005",
        "location": "",
        "state": "Iowa",
        "place": "Chicago",
        "county": "Johnson County",
        "paragraph": "Jason Gage (1976 – March 11, 2005) was a 29-year-old gay man who was murdered in his Waterloo, Iowa, apartment.[1][2] The murder was compared by the national press to the slaying of Matthew Shepard and prompted a push for citywide laws protecting LGBT people.[2][3][4]\nJason Gage was last seen alive on March 11, 2005, socializing with friends in Waterloo's downtown bars. Sometime that night he went home to his apartment in the Russell-Lamson building. With him was 23-year-old Joseph Lawrence. Gage was originally from Oelwein, Iowa.[5] He'd lived in Chicago and Milwaukee before moving to Waterloo years earlier. He settled downtown, and worked waiting tables in the Italian restaurant of his apartment building. He enrolled at the College of Hair Design in Waterloo, Iowa, in January 2003, and his friends said he dreamed of working in a big city salon.[6]\nLawrence was born in Seaford, Delaware. He was removed from his birth parents after severe abuse and spent several years in foster care before being adopted at age 5. He moved with his adoptive parents to Maryland, New Jersey, and then to Ohio. During his time in Ohio, he decided he no longer wanted to be adopted and moved back into foster care at age 16. From there, he moved to Phoenix, Arizona, and then on to New Mexico. In early 2003, Lawrence moved from Farmington, New Mexico, where he had been an oil worker to Cedar Falls, Iowa, to be with his girlfriend—Elizabeth Hostetler—who was six months pregnant with their child. The couple—who had been together for a year—decided to move to Cedar Falls, because Hostetler had many \"lifelong friends\" in the area who could help with the baby.[7] Hostetler said she introduced Gage and Lawrence about a week before Gage's murder. Hostetler had met Gage through an acquaintance and had known him for about two years.[8]\nWitnesses said Gage and Lawrence were together the night Gage was killed. They were seen at Kings & Queens, the local gay club, before heading to an after hours party at The Times Bar. The two left at some point and headed back to Gage's apartment. According to Hostetler, Gage told Lawrence that he could wait for a ride at his apartment two blocks away from The Times Bar. A female friend and roommate of Hostetler's said Lawrence called late Friday or early Saturday asking for a ride home from downtown, because he \"didn't like the hospitality of the place,\" and needed a ride or he was going to \"end up in jail\".[8] An investigator said he received a call from a man who had been asked to give Lawrence a ride home from a downtown club. Lawrence never showed up for the ride, and the man said he later heard from Hostetler that Lawrence had beaten up Gage.[9]\nIn the early hours of March 12, phone records show Lawrence sent several text messages to friends in Iowa and New Mexico via his cell phone. \"I just killed a guy I think,\" one read. A second sent to Michael Bailey in New Mexico flashed \"U need to call me soon.\"[10] A phone conversation between Bailey and Lawrence, in which Lawrence said \"some guy\" tried to \"hit on him real bad\" and described \"a fight that got way out of hand,\" indicated that Lawrence may not have known Gage was dead.[11]\nAt 11:00 p.m. on March 14, 2005, Gage's body was found in his bed when police entered his apartment, after friends expressed their concern that Gage did not show up at work on Monday and had not been seen for three days.[12] Gage had been bludgeoned in the head with a bottle and stabbed in the neck with a shard of glass.[13][14] Hours later, 23-year-old Joseph Lawrence of Cedar Falls was arrested and charged with Gage's murder. Police said Lawrence admitted he had fought with Gage, hit him with a bottle, and stabbed him in the neck with a piece of glass.[15] An autopsy revealed that Gage died from severe head injuries. Gage's body lacked any defensive wounds that would suggest he had warded off an attack.[16] When police entered Gage's apartment, two glasses were out, suggesting that Gage and Lawrence had been drinking and watching television.[17]\nLawrence gave a videotaped statement at the Waterloo police station after plain-clothes police officer went to the home he shared with Hostetler and asked him to come in for questioning. In a police affidavit, Lawrence acknowledged hitting Gage twice with a bottle and stabbing him with a piece of glass.[9] Hostetler, Lawrence's fiancée, offered a motive when she said Lawrence told her Gage had made sexual advances.[18] Hostetler said that Lawrence had gay friends, hung out with gay people, and did not have \"violent tendencies.\" She said that Gage must have made physical advances, the incident would never have happened had Lawrence not been drunk. \"This was not a hate crime,\" Hostetler said.[8]\nThe Iowa Code does not have a law defining murder based on racial or sexual bias as hate crime. Murder, regardless of motive, is punishable by life in prison without parole. Another state law mentioned in Lawrence's case, titled \"violation of individual rights,\" prohibits assaults, vandalism and trespass for reasons of race, color, religion, ancestry, national origin, political affiliation, sex, sexual orientation, age, or disability.[19] In trial information formally charging Lawrence with murder, the prosecutor included a theory that Lawrence killed Gage while committing the crime of assault in violation of individual rights.[20]\nFollowing Gage's death, the Waterloo Human Rights Commission asked the City Council to add sexual orientation protections to the city's human rights ordinance, permissible under Iowa state law. Waterloo Mayor Tim Hurley joined the commission in condemning Gage's murder, in a press conference outside the commission's offices, but said he had not formed an opinion on the addition of sexual orientation to the city's human rights ordinance.[21] Gage's friends held candlelight vigils outside his apartment building, and his family and classmates held a memorial outside of the beauty school. His wake in Oelwein was attended by hundreds, and his funeral drew a crowd too large for the funeral home where it was held. Friends and community members started a scholarship in Gage's name, and sold T-shirts and buttons with his image to raise money. Three area churches took up collections for Gage.[6] A benefit to raise money for the scholarship fund was held at the city convention center and attracted numerous attendees. It also attracted protesters from the Westboro Baptist Church in Topeka, Kansas. About 20 Westboro members picketed six area churches and stood outside the convention center carrying signs and shouting that Gage was in hell.[22] They were then joined by a second group, Consuming Fire Campus Ministries, led by Matt Bourgault.[23]\n",
        "type": [
            "murder",
            "arson",
            "assault"
        ]
    },
    {
        "link": "/wiki/Gang_Lu",
        "title": "University of Iowa shooting",
        "date": "November 1, 1991 3:42 – 3:52 p.m. (CST)",
        "year": "1991",
        "location": "Iowa City, Iowa, U.S.",
        "state": "Iowa",
        "place": "Iowa City",
        "county": "Johnson County",
        "paragraph": "The University of Iowa shooting was a mass shooting that occurred in Iowa City, Iowa, on November 1, 1991. Gang Lu, a 28-year-old former graduate student at the University of Iowa, killed three members of the Physics and Astronomy Department faculty, an Associate Vice President for Academic Affairs, and a fellow student, then seriously injured another student working at the university's campus, before committing suicide.\nGang Lu (Chinese: 卢刚; pinyin: Lú Gāng; c. 1962 – November 1, 1991),[1] was a 28-year-old Chinese graduate student at the University of Iowa who had received his doctoral degree in physics and astronomy from the university in May 1991.[2] The 18-year-old Lu began studying physics at Peking University in Beijing, where he passed the CUSPEA exam in 1984 and was admitted to study in the United States, becoming a graduate student at the University of Iowa. As a graduate student, Lu was primarily a loner who was perceived by at least one other graduate student to have a psychological problem if challenged and was reported to have had abusive tantrums.[3][4] Lu was infuriated because his dissertation, titled Study of the \"Critical Ionization Velocity\" Effect by Particle-in-Cell Simulation, did not receive the prestigious D. C. Spriestersbach Dissertation Prize, which included a monetary award of $2,500. The Tiananmen Square protests of 1989 led many Chinese students to become eager to stay in the United States, and Lu believed that winning the prize would have made it easier for him to get a job and not have to return to China. Normally, Lu would have gotten a postdoctoral researcher position, but there was not enough money to support him.[5]\nIn the months prior to the shooting, Lu was still living in Iowa City and wrote five letters explaining the reasons for his planned actions. According to university officials, four of the five letters were written in English and one was written in Chinese, intended to be mailed to news organizations. The letters have never been released to the public.\nHowever, Edwin Chen's book Deadly Scholarship includes a statement by Lu, written in imprecise English, intended to be read after his attack and suicide, which Laura Hamlett characterized as a manifesto; and, in translation, a letter by Lu to his sister.\nOn Friday, November 1, 1991, Gang Lu attended a meeting for the theoretical space plasma physics research group in a conference room on the third floor of Van Allen Hall at the university's campus. A few minutes after the meeting began, Lu shot three attendees of the meeting with a .38 Special revolver, then proceeded to the second floor to shoot the chairman of the department in his office.[4] Those who were shot in Van Allen Hall were:\nAfter the shootings at Van Allen Hall, Lu walked three blocks to Jessup Hall to the office of T. Anne Cleary, an associate vice president for Academic Affairs and grievance officer at the university, and shot her in the head. Lu had filed several grievances about not being nominated for the Spriestersbach prize. Cleary died the following day at the University of Iowa Hospital. Lu then shot Miya Rodolfo-Sioson, a 23-year-old student temporary employee in the Office of Academic Affairs, for unknown reasons. Rodolfo-Sioson survived but was left paralyzed from the neck down, and died from inflammatory breast cancer on December 3, 2008.[8] Lu had intended to kill university president Hunter Rawlings III, but he was attending the Iowa/Ohio State football game in Columbus, Ohio, at the time. Gang Lu was found in room 203 of Jessup Hall with a self-inflicted gunshot wound to the head. Lu died shortly after police arrived.\nWriter Jo Ann Beard wrote an acclaimed personal essay based in part on the killings. Her essay, entitled \"The Fourth State of Matter\", was originally published in The New Yorker. It appeared in the 1997 edition of Best American Essays. The essay was later included in her collection of personal essays, The Boys of My Youth. Beard worked as an editor for a physics journal at the university and was a colleague of the victims. She had been close friends with Goertz.\nLoosely based on Gang Lu's story, Chinese director Chen Shi-zheng made a feature film, Dark Matter, starring Liu Ye and Meryl Streep. However, the story in Dark Matter has substantial differences in plot and character motivation.  The film won the Alfred P. Sloan Prize at the Sundance Film Festival in 2007.[9]\nThe educational series Discovering Psychology, \"Cultural Psychology\" (episode 26, updated edition) discusses Gang Lu (at the 3:50 minute mark) [10]\n",
        "type": [
            "murder",
            "shooting",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/1993_Iowa_murders",
        "title": "1993 Iowa murders",
        "date": "July 17, 2020(2020-07-17) (aged 52) USP Terre Haute, Terre Haute, Indiana, U.S.",
        "year": "2020",
        "location": "",
        "state": "Iowa",
        "place": "Terre Haute",
        "county": "Decatur County",
        "paragraph": "\nDustin Lee Honken (March 22, 1968 – July 17, 2020)[1] and Angela Jane Johnson (born January 17, 1964)[2] are American mass murderers convicted of the 1993 murders of five people in Iowa.\nThe victims were related to a drug trial against Honken. Honken was involved in the manufacturing of methamphetamine, and one of his dealers was set to testify against him, so Honken and Johnson murdered him along with his girlfriend and her two young daughters.[3] A few months later, the fifth victim, also a former dealer, was murdered.[3]\nAlthough Iowa abolished capital punishment in 1965, the crime was a federal case since it involved a continuing criminal enterprise. Honken was sentenced to death and executed by the federal government on July 17, 2020,[4] the first defendant from Iowa to be executed since 1963.[3] Johnson was also sentenced to death, the first woman sentenced to death by a United States federal jury since the 1950s, but the sentence was overturned in 2012,[5] and she was resentenced to life without parole in 2014.\nHonken grew up in Britt, Iowa.[3] His father, Jim Honken, was an alcoholic schemer who was allegedly neglectful. Honken reported in his pre-sentence investigation that his father struck him numerous times during his childhood, although he denied that his father was physically abusive and maintained that the emotional turmoil in his early life mostly stemmed from his father's alcoholism. Jim once convinced his son to steal and copy a key to a bank. Jim committed two bank robberies before getting caught and sent to federal prison. Honken's parents divorced when he was nine. Honken had a healthy relationship with his stepfather.[6]\n\nHonken had a notably healthy relationship with his mother, who he described as perfect. Federal court appeals later described their relationship while dismissing claims that there was substantial mitigation in his upbringing:The movant's mother provided a stable, nurturing and loving environment, never abandoned him, did not fail to provide any sort of safe space or comfort to him, never neglected him, never failed to calm him or tell him that things were going to be okay, acted as a loving caretaker and facilitated the movant's attachment to her by making herself available to him.[6]Honken, who was proficient in math, science, and writing, earned a scholarship to North Iowa Area Community College in 1991. He later said that he had initially planned to become a pharmaceutical lawyer.[7]\nDuring Honken's capital murder trial, his mitigation expert, Lisa Rickert, wrote to his lawyers that not only had she struggled to find any possible mitigation, what she discovered only further cast Honken in a negative light.[8]\n",
        "type": [
            "murder",
            "robbery",
            "mass murder"
        ]
    },
    {
        "link": "/wiki/Villisca_axe_murders",
        "title": "Villisca axe murders",
        "date": "June 10, 1912, 110 years ago Late night or early morning",
        "year": "1912",
        "location": "Villisca, Iowa, U.S.",
        "state": "Iowa",
        "place": "Villisca",
        "county": "Montgomery County",
        "paragraph": "\nCoordinates: 40°55′51″N 94°58′26″W﻿ / ﻿40.9308091°N 94.9739235°W﻿ / 40.9308091; -94.9739235\nThe Villisca axe murders occurred between the evening of June 9, 1912, and the early morning of June 10, 1912, in the town of Villisca, Iowa, United States. The six members of the Moore family and two guests were found bludgeoned in the Moore residence. All eight victims, including six children, had severe head wounds from an axe. A lengthy investigation yielded several suspects, one of whom was tried twice. The first trial ended in a hung jury and the second ended in an acquittal. The crime remains unsolved.\nThe Moore family consisted of parents Josiah B. (aged 43[1]), Sarah (née Montgomery) (39), and their four children: Herman Montgomery (11), Mary Katherine (10), Arthur Boyd (7), and Paul Vernon (5). An affluent family, the Moores were well known and well liked in their community.[2] On June 9, 1912, Mary Katherine Moore invited Ina Mae (8) and Lena Gertrude Stillinger (12) to spend the night at the Moore residence. That evening, the visiting girls and the Moore family attended the Presbyterian church where they participated in the Children's Day Program, which Sarah had coordinated. After the program ended at 9:30 p.m., the Moores and the Stillinger sisters walked to the Moores' house, arriving between 9:45 and 10 p.m.\nAt 7 A.M. the next day, June 10, Mary Peckham, the Moores' neighbor, became concerned after she noticed that the family had not come out to do their morning chores. Peckham knocked on the Moores' door. When nobody answered, she tried to open the door and discovered that it was locked. Peckham let the Moores' chickens out and called Ross Moore, Josiah's brother. Like Peckham, Moore received no response when he knocked on the door and shouted. Ross unlocked the front door with his copy of the house key. While Peckham stood on the porch, Ross went into the parlor and opened the guest bedroom door, where he found Ina and Lena Stillinger's bodies on the bed. Moore immediately told Peckham to call Henry \"Hank\" Horton, Villisca's primary peace officer, who arrived shortly thereafter. Horton's search of the house revealed that the entire Moore family and the two Stillinger girls had been bludgeoned to death. The murder weapon, an axe belonging to Josiah, was found in the guest room where the Stillinger sisters were found.\nDoctors concluded that the murders had taken place between midnight and 5 a.m.[3] Two spent cigarettes in the attic suggested that the killer or killers patiently waited (according to the official tour, there were no cigarettes found) \nin the attic until the Moore family and the Stillinger guests were asleep. The killer(s) began in the master bedroom, where Josiah and Sarah Moore were sleeping. Josiah received more blows from the axe than any other victim; his face had been cut to such an extent that his eyes were missing. The ceiling in his room also had a gouge mark from when the murderer lifted the axe to murder him[4]\nThe killer or killers used the blade of the axe on Josiah while using the blunt end on the rest of the victims. Herman, Mary Katherine, Arthur, and Paul were next bludgeoned in the head in the same manner as their parents. Afterwards, the murderer returned to the master bedroom to inflict more blows on the elder Moores, knocking over a shoe that had filled with blood, before moving downstairs to the guest bedroom and killing Ina and Lena. Seemingly afterwards, a 4lb slab of bacon was taken out of the icebox and laid next to the axe. Investigators also found untouched food and bloody water during the search. \nInvestigators believed that all of the victims except for Lena Stillinger had been asleep when murdered. They thought that she was awake and tried to fight back, as she was found lying crosswise on the bed, and with a defensive wound on her arm. Lena's nightgown was pushed up to her waist and she was wearing no undergarments, leading to law enforcement speculation that the killer(s) sexually molested her or attempted to do so.\nOver time, many possible suspects emerged, including Reverend George Kelly, Frank F. Jones, William Mansfield, Loving Mitchell, Paul Mueller and Henry Lee Moore (no relation). Kelly was tried twice for the murder. The first trial ended in a hung jury, while the second ended in an acquittal. Other suspects in the investigation were also exonerated.[5]\nEvery transient and otherwise unaccounted-for stranger was a suspect in the murders, Andrew Sawyer was one of those people. He was interrogated but not charged. He also was obsessed with the murders and slept fully clothed as if he was ready to make a clean getaway and he also slept with an axe by his bed.\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Maquoketa_Caves_State_Park_familicide",
        "title": "Maquoketa Caves State Park familicide",
        "date": "July 22, 2022 (2022-07-22)  (CDT)",
        "year": "2022",
        "location": "Jackson County, Iowa, U.S",
        "state": "Iowa",
        "place": "Jackson County",
        "county": "Jackson County",
        "paragraph": "\nOn July 22, 2022, three members of the Schmidt family were murdered in Maquoketa Caves State Park.[1] The assailant, identified as 23-year-old Anthony Orlando Sherwin, later committed suicide by gunshot.[2]\nShortly before 6:23 a.m. on July 22, 2022, an assailant murdered three members of the Schmidt family. The father Tyler, 42, was shot multiple times and stabbed to death and the mother Sarah, 42, was stabbed multiple times until she died. The couple's daughter, six-year-old Lula, died from a gunshot wound and strangulation.[3] The couple's nine-year-old son Arlo was the sole survivor of the attack.[4]\nAuthorities received a phone call notifying them of the triple homicide at about 6:23 a.m.[5] After arriving at the scene and discovering the victims, they temporarily closed the park to investigate. After evacuating the campgrounds, police learned that the only registered camper that was unaccounted for was Anthony Orlando Sherwin, 23, a resident from La Vista, Nebraska. At the time, they did not know whether he was the perpetrator or another victim, but did know that he was armed.[2]\nAt 11:00 a.m., Sherwin's body was found by a plane used by law enforcement to search for him.[2] Sherwin had died from a self-inflicted gunshot wound west of the campground and was shortly identified by law enforcement as a suspect in the case.[6]\nThe motive for the shooting is still unknown. There is no known connection between the Schmidt family and Sherwin, and authorities believe that the shooting was a random attack.[7]\nOn August 4, the Iowa Department of Public Safety released the autopsy reports. The causes of death include a combination of gunshot wounds, multiple sharp force injuries, and strangulation. The report concluded, \"However, the known facts and circumstances, and all evidence collected to this point, substantiate Sherwin was the perpetrator of the homicides and acted alone.\"[8]\"\nCamp Shalom, a Christian summer camp about a mile and a half away from where the shooting took place, was safely evacuated at 9:15 a.m.[2]\nShortly after the incident, the surviving parents of the alleged shooter disputed the allegations against their son, who had no criminal record. “We think (Anthony) might have sensed trouble and grabbed the gun for safety,” Cecilia Sherwin said. “We refuse to believe the news. We are deeply saddened as he had so much to live for and gave us no indication that anything was wrong.” A young boy ran up to the Sherwins’ campsite yelling for help and told her that a man wearing black had shot his family, she said. Cecilia Sherwin said her son was wearing green, not black, and no black clothing was found in the area.[9]\n",
        "type": [
            "murder",
            "shooting"
        ]
    }
]