{
    "0": {
        "link": "/wiki/Quindaro_Townsite",
        "title": "Quindaro Townsite",
        "date": "",
        "year": "",
        "location": "Kansas City, KS",
        "state": "Kansas",
        "place": "Kansas City",
        "county": "Wyandotte County",
        "paragraph": "Quindaro Townsite is a former settlement, then ghost town, and now an archaeological district. It is around North 27th Street and the Missouri Pacific Railroad tracks in Kansas City, Kansas. It was placed on the National Register of Historic Places on May 22, 2002.\nIt was settled by abolitionists in late 1856, with construction starting in 1857. The boomtown population peaked at 600, rapidly settled by migrants. They were aided by the New England Emigrant Aid Company, who were trying to help secure Kansas as a free territory.[2]  One of several villages hugging the narrow bank of the Missouri River under the bluffs, the town was a free state port-of-entry for abolitionist forces of Kansas. It was established as part of the resistance to stop the westward spread of slavery. Quindaro's people also aided escaped slaves from Missouri and connected them with the Underground Railroad.\nAfter Kansas was established as a free state, there was less unique need for the port and the growth slowed in the commercial district.  At the same time the economy in Kansas suffered from over-speculation.\n",
        "type": []
    },
    "1": {
        "link": "/wiki/Thomas_J._Smith",
        "title": "Thomas J. Smith",
        "date": "November 2, 1870 (aged 40) Abilene, Kansas",
        "year": "1870",
        "location": "",
        "state": "Kansas",
        "place": "Abilene",
        "county": "Dickinson County",
        "paragraph": "\nThomas James Smith, also known as Tom \"Bear River\" Smith, (June 12, 1830 – November 2, 1870) was a lawman in the American Old West and briefly marshal of cattle town Abilene, Kansas. He was killed and nearly decapitated in the line of duty.\nLittle is known of Smith's youth, though he was well known as a tough man and had been a professional middleweight boxer. Originally from New York City, where he worked as a police officer, he also served as a lawman in a few small towns in Wyoming, including Bear River, as well as in Kit Carson, Colorado, prior to his move to Kansas. While working as a police officer in New York City in 1868, Smith was involved in the accidental killing of a 14-year-old boy, after which he resigned and began working for Union Pacific Railroad in Nebraska.\n",
        "type": [
            "murder",
            "arson",
            "killing"
        ]
    },
    "2": {
        "link": "/wiki/Edward_Daniels",
        "title": "Edward Daniels",
        "date": "April 19, 1916(1916-04-19) (aged 88) Fairfax County, Virginia[1]",
        "year": "1916",
        "location": "",
        "state": "Kansas",
        "place": "Fairfax County",
        "county": "Wyandotte County",
        "paragraph": "Edward Dwight Daniels (1828–1916) was a geologist, abolitionist, and Civil War soldier. Born in Boston, Massachusetts, he moved to Wisconsin at age 21 to pursue a career as a geologist and academic.[1] He became the first state geologist of Wisconsin in 1853. Daniels taught at Ripon College and Carroll College.\nDaniels was a fervent abolitionist who became involved in the escape of fugitive slave Joshua Glover in 1854, as well as the plot to free abolitionist activist Sherman Booth from federal prison in 1860.  He was a part of the ill-fated \"Free-Stater\" expedition led by Jim Lane into Kansas in 1856, part of the Bleeding Kansas events.\nDaniels was quick to respond to the opening of hostilities between the states, organizing the 1st Wisconsin Volunteer Cavalry Regiment in 1861.  He served as the commanding officer of this unit from 1861 to 1863.  The 1st Wisconsin was initially stationed in Missouri, but Daniels led successful raids into Arkansas.  However, his actions were unauthorized and called into question by his commanders, leading to Daniels' resignation in 1863.\n",
        "type": []
    },
    "3": {
        "link": "/wiki/Hesston_shooting",
        "title": "Hesston shooting",
        "date": "February 25, 2016 c. 4:57 p.m. – 5:23 p.m. (CST)",
        "year": "2016",
        "location": "Hesston and Newton, Kansas, U.S.",
        "state": "Kansas",
        "place": "Newton",
        "county": "Harvey County",
        "paragraph": "\nOn February 25, 2016, three people were killed and fourteen others injured in a series of shootings in Newton and Hesston, Kansas, including in and outside an Excel Industries building.[1][2] The shooter, identified as Excel employee Cedric Larry Ford, was then killed by a responding police officer.[3][4]\nThe shootings began at around 4:57 p.m. at a street intersection in Newton, where Ford shot at two vehicles in a drive-by shooting. The first motorist suffered a non-fatal gunshot wound to the shoulder, while the second motorist escaped unscathed after a bullet pierced the car's windshield. He then drove down Old U.S. Route 81[5] and fired at oncoming traffic. His vehicle and another one crashed in a nearby ditch, after which he got out, shot and injured the other driver in the leg, and stole that victim's vehicle. According to conversations with law officials, they believe the shootings in Newton were to distract officials of what was about to happen at Excel Industries.[6]\n",
        "type": [
            "murder",
            "mass shooting",
            "shooting"
        ]
    },
    "4": {
        "link": "/wiki/Pottawatomie_massacre",
        "title": "Pottawatomie massacre",
        "date": "May 23–24, 1856",
        "year": "1856",
        "location": "Franklin County, Kansas",
        "state": "Kansas",
        "place": "Franklin County",
        "county": "Franklin County",
        "paragraph": "\nThe Pottawatomie massacre occurred on the night of May 24–25, 1856, in the Kansas Territory. In reaction to the sacking of Lawrence by pro-slavery forces on May 21, and the telegraphed news of the severe attack on May 22 on Massachusetts Senator Charles Sumner, for speaking out against slavery in Kansas (\"The Crime Against Kansas\"), John Brown and a band of abolitionist settlers—some of them members of the Pottawatomie Rifles—made a violent reply. Just north of Pottawatomie Creek, in Franklin County, they killed five pro-slavery settlers in front of their families. This soon became the most famous of the many violent episodes of the \"Bleeding Kansas\" period, during which a state-level civil war in the Kansas Territory was described as a \"tragic prelude\" to the American Civil War which soon followed. \"Bleeding Kansas\" involved conflicts between pro- and anti-slavery settlers over whether the Kansas Territory would enter the Union as a slave state or a free state. It is also John Brown's most questionable act, both to his friends and his enemies. In the words of abolitionist Frederick Douglass, it was \"a terrible remedy for a terrible malady.\"[1]: 371 \nJohn Brown was particularly affected by the sacking of Lawrence, in which the Douglas County Sheriff Samuel Jones on May 21 led a posse that destroyed the presses and type of the Kansas Free State and the Herald of Freedom, Kansas's two abolitionist newspapers, the fortified Free State Hotel, and the house of Charles Robinson. He was the free-state militia commander-in-chief and leader of the \"free state\" government, established in opposition to the \"bogus\" pro-slavery territorial government, based in Lecompton.\n",
        "type": []
    },
    "5": {
        "link": "/wiki/Thomas_Ewing_Jr.",
        "title": "Thomas Ewing Jr.",
        "date": "January 21, 1896(1896-01-21) (aged 66) New York City, New York, U.S.",
        "year": "1896",
        "location": "",
        "state": "Kansas",
        "place": "Ewing",
        "county": "Wyandotte County",
        "paragraph": "Thomas Ewing Jr. (August 7, 1829 – January 21, 1896) was an attorney, the first chief justice of Kansas and leading free state advocate, Union Army general during the American Civil War, and two-term United States Congressman from Ohio, 1877–1881.[1]  He narrowly lost the 1879 campaign for Ohio Governor.\nEwing was born in Lancaster, Ohio. His father, Thomas Ewing Sr., was a very successful lawyer and Whig politician at the national level. Although Ewing Sr. was an Irish Protestant, his wife, Maria Wills Boyle, converted the family to Catholicism. The younger Ewing was a foster brother of William Tecumseh Sherman and became his brother-in-law when Sherman married Ewing's sister, Eleanor \"Ellen\" Ewing Sherman. Two other brothers were also Civil War generals—Charles Ewing and Hugh Boyle Ewing. Thomas Ewing Jr.'s relationship with Sherman was close throughout their lives.\nThomas Ewing Jr. began his education at Brown University in Providence, Rhode Island. He left Brown University to become private secretary to President Zachary Taylor from 1849 to 1850 (concurrent with his father's term in Taylor's Cabinet). He then studied and practiced law from 1852 to 1856 in Cincinnati, Ohio. He graduated from Cincinnati Law School in 1855.[2]\n",
        "type": []
    },
    "6": {
        "link": "/wiki/Thaddeus_Hyatt",
        "title": "Thaddeus Hyatt",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nThaddeus Hyatt (July 21, 1816 – July 25, 1901) was an American abolitionist and inventor. In his opposition to slavery, Hyatt organized the efforts of abolitionists in Kansas to have the territory admitted to the Union as a free-state and campaigned for the federal government to aid Kansans afflicted by drought. Hyatt befriended John Brown and provided Brown with financial support; following the raid on Harpers Ferry, Hyatt was investigated by a committee of the United States Senate.[1][2] When Hyatt refused to comply with a Congressional subpoena and cooperate with the Senate investigation, the Senate voted to jail the recalcitrant abolitionist.[1][3] As an inventor, Hyatt was a wealthy man, profiting from his invention of iron-and-glass vault covers for admitting sunlight to spaces below sidewalks and pavements.[4] Hyatt also innovated and patented several designs for reinforced concrete floors.[5][6]\nBorn in Rahway, New Jersey,[2] Thaddeus Hyatt became actively involved in the abolitionist movement after Congress passed the Kansas-Nebraska Act in 1854.[1] The law, which mandated that the question of legalizing slavery in Kansas be settled by the territory's voters, sparked a race between pro-slavery and anti-slavery factions to move to Kansas and tip the ballot boxes. Opposing settlers violently clashed in what became known as Bleeding Kansas. In 1854, several state-level committees were formed to provide aid to anti-slavery settlers in Kansas, including the New York Kansas League, of which Thaddeus Hyatt was president. Along with well-known abolitionists such as Andrew Reeder, Gerrit Smith, and Eli Thayer, Hyatt organized the National Kansas Committee in July 1856 and was elected president of the organization.[7] The National Kansas Committee purportedly collected around $100,000  to sponsor two thousand new settlers. Of this amount, around $10,000 was spent on weaponry.[8] Although the organization was active from July 1856 onward, the entire committee formally convened only once, in January 1857. Among the items delivered to settlers were one hundred tons of seeds, the cost of which Hyatt underwrote. By mid-1857, the National Committee had dispersed its supplies and depleted its funds, and the activities of the organization wound down.[9]\n",
        "type": []
    },
    "7": {
        "link": "/wiki/Aurelius_O._Carpenter",
        "title": "Aurelius O. Carpenter",
        "date": "1919 (aged 82–83) United States",
        "year": "1919",
        "location": "",
        "state": "Kansas",
        "place": "Windham County",
        "county": "Johnson County",
        "paragraph": "A. O. Carpenter (born Aurelius O. Carpenter) (1836-1919[2]) was an American photographer, writer and abolitionist. He was one of the earliest photographers in early American California, photographing Mendocino County, California. He was the son of Clarina I. H. Nichols and the father of Grace Carpenter Hudson and Grant Carpenter. Prior to moving to California, he was active in the abolitionist movement, fighting with John Brown in the Battle of Black Jack.\nAurelius Carpenter was born in 1836 in Vermont. His mother was Clarina I. H. Nichols. As a teenager, he had an apprenticeship at the Windham County Democrat, the newspaper owned by his stepfather, George Nichols.[1]\nIn 1854 (or 1855[3]), Carpenter, his mother, and his brother, Chapin, left Vermont to Kansas to support abolitionist activities.[1] Carpenter joined abolitionist John Brown on June 2, 1856, fighting in the Battle of Black Jack.[1]\n",
        "type": []
    },
    "8": {
        "link": "/wiki/Battle_of_Osawatomie",
        "title": "Battle of Osawatomie",
        "date": "August 30, 1856 (1856-08-30)",
        "year": "1856",
        "location": "Osawatomie, Kansas",
        "state": "Kansas",
        "place": "Osawatomie",
        "county": "Miami County",
        "paragraph": "\nThe Battle of Osawatomie was an armed engagement that occurred on August 30, 1856, when 250–400 pro-slavery Border ruffians, led by John W. Reid, attacked the town of Osawatomie, Kansas, which had been settled largely by anti-slavery Free-Staters. Reid was intent on destroying the Free-State settlement and then moving on to Topeka and Lawrence to do more of the same. Abolitionist John Brown first learned of the raiders when they shot his son Frederick. With just 40 or so men, Brown tried to defend the town against the pro-slavery partisans, but ultimately was forced to withdraw; five Free-Staters were killed in the battle, and the town of Osawatomie was subsequently looted and burned by Reid's men. The battle was one of a series of violent clashes between abolitionists and pro-slavery partisans in Kansas and Missouri during the Bleeding Kansas era.\nThe passing of the Kansas–Nebraska Act in 1854 began the period called \"Bleeding Kansas\". Whether the new Kansas Territory would be slave or free was left up to popular sovereignty, counter to the prohibitions of the Missouri Compromise of 1820. An immediate rush of migrants on both sides of the issue rushed in to settle and to determine the fate of the new territory. Almost immediately, tensions erupted into a full-blown border war waged mostly between civilians known as \"Free-Staters\", mostly from New England and other northeast states, and pro-slavery \"Border ruffians\" from Missouri.\n",
        "type": [
            "riot"
        ]
    },
    "9": {
        "link": "/wiki/Tragic_Prelude",
        "title": "Tragic Prelude",
        "date": "",
        "year": "",
        "location": "Kansas State Capitol, Topeka, Kansas",
        "state": "Kansas",
        "place": "Capitol",
        "county": "Shawnee County",
        "paragraph": "Tragic Prelude is a mural painted by Kansan John Steuart Curry for the Kansas State Capitol building in Topeka, Kansas. It is located on the east side of the second floor rotunda. On the north wall it depicts abolitionist Kansan John Brown with a Bible in one hand, on which the Greek letters alpha and omega of Apocalypse 1:8 can be seen. In his other hand he holds a rifle, referred to as a  \"Beecher's Bible\". He is in front of Union and Confederate soldiers, living and dead, with a tornado and a prairie fire approaching. Emigrants with covered wagons travel from east to west.\nThe \"tragic prelude\" is the Bleeding Kansas period of 1854–1860, seen as a prelude to or dress rehearsal for the Civil War, a period of which John Brown was at the center, preventing Kansas from being made a slave state. The term \"tragic prelude\" for this period of Kansas history is attributed by Curry to his champion, the newspaper editor William Allen White.\nHowever, the mural has other figures in addition to Brown, as it turns a corner and continues on another wall, making it difficult to photograph in its entirety. The three figures are rarely discussed as part of the work. Chronologically from right to left are the Franciscan missionary Fray Juan de Padilla and the conquistador Coronado, the first Europeans to visit the land that became Kansas, followed by a plainsman, who has just killed a buffalo.\n",
        "type": []
    },
    "10": {
        "link": "/wiki/Marc_Sappington",
        "title": "Marc Sappington",
        "date": "March 16-April 10, 2001",
        "year": "2001",
        "location": "",
        "state": "Kansas",
        "place": "Kansas City",
        "county": "Wyandotte County",
        "paragraph": "Marc Vincent Sappington (born February 9, 1978) is an American spree killer and cannibal convicted of murdering four acquaintances in March and April 2001 in Kansas City, Kansas.[1][2] He gained notoriety for eating part of the leg of one of his victims, Alton \"Fred\" Brown.[3]\nLawyers for Sappington blamed the four-day killing spree on a history of schizophrenia and daily use of the hallucinogenic drug PCP. Sappington himself claimed that voices in his head told him to eat flesh and blood or he would die.[1]\nSappington was convicted on June 23, 2004, of murdering Terry T. Green, 25, Michael Weaver Jr., 22, and Alton \"Fred\" Brown Jr., 16 in April 2001.[1]\nSappington was convicted on December 10, 2004, of an attempted aggravated robbery and murder of David Mashak at his auto dealership in March 2001.[2] Sappington's conviction was affirmed by the Kansas Supreme Court on November 2, 2007.[4]\n",
        "type": [
            "murder",
            "robbery",
            "robber",
            "killing"
        ]
    },
    "11": {
        "link": "/wiki/Edward_J._Adams",
        "title": "Edward J. Adams",
        "date": "November 22, 1921(1921-11-22) (aged 33–34) Wichita, Kansas, U.S.",
        "year": "1921",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "Edward James Adams (1887 – November 22, 1921) was a notorious American criminal and spree killer in the Midwest.[1] He murdered seven people–including three policemen—over a period of around 14 months, and wounded at least a dozen others. At age 34, Adams was surrounded and then killed by police in Wichita, Kansas.[2]\nEdward James \"Eddie\" Adams was born in 1887 on a farm in Hutchinson, Kansas, as William Joseph Wallace. His father died when he was young, and his mother remarried. He had a strong disdain for his stepfather, as well as for physical labor. He learned the barber trade and moved to Wichita in the early 20th century. There, he met John Callahan, and quickly became involved in bootlegging, petty robberies, and car theft.\nAdams was handsome and charismatic, and attracted many women and hangers-on. His wife left him after growing weary of his illegal activities and infidelities.\n",
        "type": [
            "murder",
            "robberies",
            "theft",
            "robber"
        ]
    },
    "12": {
        "link": "/wiki/Thomas_Johnson_(Kansas_politician)",
        "title": "Thomas Johnson (Kansas politician)",
        "date": "January 2, 1865(1865-01-02) (aged 62) Missouri, U.S.",
        "year": "1865",
        "location": "",
        "state": "Kansas",
        "place": "Shawnee",
        "county": "Shawnee County",
        "paragraph": "Thomas Johnson (July 11, 1802 – January 2, 1865) was an American missionary in Kansas who founded the Shawnee Methodist Mission in 1830. It was intended to serve and convert the Shawnee, several hundred of whom had been relocated to Kansas Indian Territory from east of the Mississippi River.[1]\nJohnson was a Kansas slave holder and sided strongly with the pro-slavery group during a period known as Bleeding Kansas. Residents on either side of the slavery question recruited newcomers and fought violently prior to voting as to whether slavery would be allowed in the territory. Johnson was elected as a member of the Kansas territorial legislature, which temporarily designated Shawnee Mission as the state capital from 1855 to 1856. Johnson was pro-Southern in sympathy but signed a Unionist pledge at the time of the American Civil War. [1]\nJohnson County, Kansas is named for him.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "13": {
        "link": "/wiki/Kidnapping_of_Bobby_Greenlease",
        "title": "Kidnapping of Bobby Greenlease",
        "date": "September 28, 1953",
        "year": "1953",
        "location": "",
        "state": "Kansas",
        "place": "Kansas City",
        "county": "Wyandotte County",
        "paragraph": "\nRobert Cosgrove Greenlease Jr. (February 3, 1947 – September 28, 1953) was a six-year-old from Kansas City, Missouri, United States, who was the victim of a kidnapping and homicide on September 28, 1953. His father, Robert Cosgrove Greenlease Sr., was a multi-millionaire auto dealer, and the demanded ransom payment was the largest in American history at the time.\nGreenlease Jr.'s kidnappers, Carl Hall and Bonnie Heady, had no intention of returning him to his family, the child having been murdered before the ransom demand was even issued.[1] Both perpetrators were sentenced to death and executed in Missouri's gas chamber in December 1953. Heady was the third woman ever to be executed by U.S. federal authorities.[2]\n",
        "type": [
            "murder",
            "kidnapping"
        ]
    },
    "14": {
        "link": "/wiki/Kelsey_Smith_(murder_victim)",
        "title": "Murder of Kelsey Smith",
        "date": "June 2, 2007(2007-06-02) (aged 18) Longview Lake, Missouri",
        "year": "2007",
        "location": "",
        "state": "Kansas",
        "place": "Overland Park",
        "county": "Johnson County",
        "paragraph": "Kelsey Ann Smith (May 3, 1989 – June 2, 2007) was an Overland Park, Kansas teenager who disappeared on June 2, 2007 and was murdered that evening. The story was featured in the international media, including on America's Most Wanted,[2] before her body was found near a lake in Missouri on June 6, 2007.[3]\nSmith was last seen at 7:07 p.m. CST on June 2, 2007 in the parking lot of a Target store at 97th and Quivira, behind the Oak Park Mall in Overland Park, Kansas. Police, other authorities and the national media launched an extensive publicity campaign and search for Smith.\nSurveillance video from Target showed Smith purchasing a present for her boyfriend to celebrate six months together. Her last call had been to her mother from the store. She then left the store before she disappeared.[1] Approximately four hours later, her car, a 1987 Buick Regal, was found abandoned outside of Macy's in the parking lot of Oak Park Mall across the street.[1] Her purse, wallet and the items that she had bought were left in the car.[4]\n",
        "type": [
            "murder"
        ]
    },
    "15": {
        "link": "/wiki/Henry_Clay_Pate",
        "title": "Henry Clay Pate",
        "date": "",
        "year": "new 1848",
        "location": "",
        "state": "Kansas",
        "place": "Bedford County",
        "county": "Sedgwick County",
        "paragraph": "Henry Clay Pate (21 April 1833–11 May 1864) was an American writer, newspaper publisher and soldier. A strong advocate of slavery, he was a border ruffian in the \"Bleeding Kansas\" unrest. He is best known for his conflict with, and capture by, the abolitionist John Brown.\nPate was born in Bedford County, Virginia, in 1833 to Edmund Pate (a veteran of the War of 1812) and his wife Sarah. He began his studies at the University of Virginia in 1848, but left two years later without completing a degree. After leaving the university, he lived for a time in Cincinnati, where he worked as a writer, before moving to Kansas.[1]\nKansas in the 1850s was wracked by violent confrontations between pro-slavery and abolitionist factions. Pate was firmly in the former camp. He published the Westport Border Star, a pro-slavery newspaper, and became Justice of the Peace of Kaw Township, Jackson County, Missouri, in 1855.[2] Pate was part of the sacking of Lawrence and, either during or shortly before, was commissioned as a Deputy United States Marshal.[3] On hearing news of John Brown's actions at the Pottawatomie Massacre, Pate set out with a band of thirty men to hunt Brown down.[4] During the hunt for Brown, two of his sons (Jason and John Junior) were captured (either by Pate or another marshal), charged with murder, and thrown in irons.[4][3]\n",
        "type": [
            "murder"
        ]
    },
    "16": {
        "link": "/wiki/Battle_of_the_Spurs_(Kansas)",
        "title": "Battle of the Spurs (Kansas)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Holton",
        "county": "Jackson County",
        "paragraph": "The so-called Battle of the Spurs took place about 7 miles (11 km) north of Holton, Kansas, near Netawaka, Kansas, on January 31, 1859. Abolitionist John Brown, together with J. H. Kagi and Aaron Dwight Stevens, was escorting a group of 11 escaped slaves from the slave state of Missouri to freedom in Iowa. At Straight Creek they faced a posse of U.S. marshals and others, who hoped to earn the $3,000 reward posted for Brown's capture. Brown, who \"inspired terror in his enemies\",[1]\nfaced a posse of 45 while his party only consisted of 21, including women and children. Brown led his party straight ahead, and the posse turned and ran in panic. Not a shot was fired nor a rifle raised.[2] \"Free-Staters labeled the confrontation the 'Battle of the Spurs,' in mocking reference to the proslavery posse fleeing on horseback.\"[1] There is a historical marker.[3]\n",
        "type": []
    },
    "17": {
        "link": "/wiki/Marais_des_Cygnes_massacre",
        "title": "Marais des Cygnes massacre",
        "date": "",
        "year": "new 1863",
        "location": "",
        "state": "Kansas",
        "place": "Bates County",
        "county": "Butler County",
        "paragraph": "The Marais des Cygnes massacre (/ˌmɛər də ˈziːn, - ˈsiːn, ˈmɛər də ziːn/,[1][2] also /məˌriː də ˈsiːn, məˌreɪ də ˈseɪn/)[citation needed] is considered the last significant act of violence in Bleeding Kansas prior to the outbreak of the American Civil War. On May 19, 1858, approximately 30 men led by Charles Hamilton, a Georgia native and proslavery leader, crossed into the Kansas Territory from Missouri. They arrived at Trading Post, Kansas in the morning and then headed back to Missouri. Along the way they captured 11 Free-Staters, none of whom were armed and, it is said, none of whom had participated in the ongoing violence. Most of the men knew Hamilton and apparently did not realize he meant them harm. These prisoners were led into a defile, where Hamilton ordered his men to shoot, firing the first and last bullet himself. Five men were killed and five severely wounded. Only one Free-Stater escaped injury.[3]\nHamilton and his gang returned to Missouri. Only one man was ever prosecuted for the crime. William Griffith of Bates County, Missouri, was arrested in the spring of 1863 and was kept until October 30th of that year. Charles Hamilton returned to Georgia, where he died in 1880.\nThe incident horrified the U.S. and inspired John Greenleaf Whittier to write a poem on the murders, \"Le Marais du Cygne\", which appeared in the September 1858 The Atlantic Monthly.[4]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "18": {
        "link": "/wiki/Louis_Carpenter_(judge)",
        "title": "Louis Carpenter (judge)",
        "date": "21 August 1863(1863-08-21) (aged 33) Lawrence, Douglas County, Kansas",
        "year": "1863",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "Louis Carpenter (1829, New York – 1863, Kansas) was a Judge in Douglas County, Kansas and was the highest ranking civic member of the town of Lawrence to be murdered by Quantrill's raiders during the Lawrence Massacre.\nLouis Carpenter was a lawyer,[1] and was a Deputy Clerk of Douglas County, Kansas by June 14, 1859.[2]  In late 1860 or early 1861, he became Probate Judge of Douglas County, the first case bearing his name as judge being recorded on February 26, 1861, and on September 29, 1862, he was chosen by the Union Party as their candidate for the office of Attorney General of Kansas.[3] He was enumerated in the 1860 federal census of the Kansas Territory as age 29, born in the state of New York.\nJudge Carpenter was one of the 185-200 men and boys killed in the Lawrence Massacre on August 21, 1863.[4]  He was murdered in his home at 943 New Hampshire Street in Lawrence by members of Quantrill’s Raiders.[4][5]  A detailed account of Judge Carpenter's life and murder in Kansas, and a photograph of him, are posted at the Douglas County Law Library website.[3]\n",
        "type": [
            "murder"
        ]
    },
    "19": {
        "link": "/wiki/Henry_T._Titus",
        "title": "Henry T. Titus",
        "date": "August 7, 1881(1881-08-07) (aged 58) [1]Titusville, Florida[1]",
        "year": "1881",
        "location": "",
        "state": "Kansas",
        "place": "Cuba",
        "county": "Republic County",
        "paragraph": "Henry Theodore Titus (February 13, 1823 – August 7, 1881) was a pioneer, soldier of fortune, and the founder of Titusville, Florida. His military adventurism included expeditions to Cuba and Nicaragua, fighting on the side of pro-slavery forces in the Kansas Territory, and blockade running during the Civil War. Never commissioned, Titus retained the honorary title of Colonel.\nTitus was born in Trenton, New Jersey on February 13, 1823.[2] He was the first of nine children of Theodore Titus, and Catharine Flick Howell.[3] He was raised in Wilkes Barre, Pennsylvania. He was enrolled for some time at the United States Military Academy at West Point, but did not graduate. In 1845, he was a postal inspector in Philadelphia.\nTitus was a leader of the Narciso López expedition, an unauthorized military venture that invaded Cuba in 1850-1851.\n",
        "type": []
    },
    "20": {
        "link": "/wiki/Dora_Hand",
        "title": "Dora Hand",
        "date": "October 4, 1878 (aged approximately 34) Dodge City, Kansas, USA",
        "year": "1878",
        "location": "",
        "state": "Kansas",
        "place": "Dodge City",
        "county": "Ford County",
        "paragraph": "\nDora Hand (c. 1844 – October 4, 1878), aged c. 34, was an American dance hall singer and actress in Dodge City, Kansas, who was mistakenly shot to death from ambush by a young suitor who was acquitted of criminal charges in the case. Hand was also linked romantically with James H. \"Dog\" Kelley, the mayor of Dodge City from 1867 to 1871.[1]\nClaire Trevor played Hand in the 1943 film The Woman of the Town, which depicts a fictional romance with Bat Masterson.\n",
        "type": []
    },
    "21": {
        "link": "/wiki/Grat_Dalton",
        "title": "Grat Dalton",
        "date": "October 5, 1892(1892-10-05) (aged 31) Coffeyville, Kansas, United States",
        "year": "1892",
        "location": "",
        "state": "Kansas",
        "place": "Coffeyville",
        "county": "Montgomery County",
        "paragraph": "Gratton Hanley \"Grat\" Dalton (March 30, 1861 – October 5, 1892) was an American outlaw in the American Old West.  He was one of three brothers in the Dalton Gang, led by his younger brother Bob Dalton. Both brothers were killed during a shootout in an ill-fated raid on two banks in Coffeyville, Kansas. Their brother Emmett Dalton survived to be convicted and imprisoned for fourteen years.\nTheir older brother Frank Dalton served as a Deputy US Marshal. By all accounts the strongest of the brothers, he always kept his brothers in line. Grat and his younger brothers idolized Frank. On Nov 27, 1887 Frank and another deputy marshal, Jim Cole, went across the river from their base at Fort Smith to arrest three whiskey bootleggers. As they approached the camp, the bootleggers began to shoot at them. After Dalton shot and killed two, his gun jammed, and he was killed by the remaining bootlegger. His deputy abandoned him after being shot. Frank Dalton is buried in Coffeyville, Kansas.\nAfter Frank's death, brothers Grat and Bob took over his job as Deputy U.S. Marshal at Fort Smith, Arkansas. Bob soon hired Emmett under him to guard prisoners. After Bob killed a man in the line of duty, which he claimed was in self defense, he began to drink heavily and become restless.\n",
        "type": []
    },
    "22": {
        "link": "/wiki/Pawnee,_Kansas",
        "title": "Pawnee, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Pawnee",
        "county": "Pawnee County",
        "paragraph": "Pawnee is a ghost town in Geary County, Kansas, United States,[1] which briefly served as the first official capital of the Kansas Territory in 1855.  Pawnee was the territorial capital for exactly five days – the legislature met there from July 2 to July 6 – before legislators voted to move the capital to Shawnee Mission, which is located in present-day Fairway.  It may be the shortest-lived capital of any U.S. state or territory (Colorado City also served as the capital of the newly established Colorado Territory for five days in 1862 but was not federally recognized).\nFor many millennia, the Great Plains of North America was inhabited by nomadic Native Americans.  From the 16th century to 18th century, the Kingdom of France claimed ownership of large parts of North America.  In 1762, after the French and Indian War, France secretly ceded New France to Spain, per the Treaty of Fontainebleau.  In 1802, Spain returned most of the land to France.  In 1803, most of the land for modern day Kansas was acquired by the United States from France as part of the 828,000 square mile Louisiana Purchase for 2.83 cents per acre.  In 1854, the Kansas Territory was organized.\nPawnee, named after a native tribe that had inhabited its land,[2] was located on the far western frontier of Kansas Territory, between the new settlement of Manhattan, Kansas, and the U.S. Army post at Fort Riley.  Pawnee was first laid out in 1854.[3] Fort Riley's commander, Colonel William R. Montgomery, authorized the acquisition by the Pawnee Town Association investors of 400 acres believed to be part of the military reservation.[4] In December 1854 or January 1855, the site was selected as capital by recently-commissioned first Territorial Governor Andrew Reeder, after his delayed arrival from Pennsylvania.[5] Governor Reeder had an economic stake in the site, since he was one of the investors and a new landowner in the settlement,[4] and he was not disappointed: Within six weeks of his announcement, hundreds of people arrived in the town.[6]  It quickly sprouted new homes, stores, and hotels,[7][8] and he soon built a 2-story log cabin there that became known as the \"Governor's Mansion\".[6]\n",
        "type": []
    },
    "23": {
        "link": "/wiki/Charles_L._Robinson",
        "title": "Charles L. Robinson",
        "date": "August 17, 1894(1894-08-17) (aged 76) Lawrence, Kansas, U.S.",
        "year": "1894",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "\nCharles Lawrence Robinson (July 21, 1818 – August 17, 1894) was an American politician who served in the California State Assembly from 1851-52, and later as the first Governor of Kansas from 1861 until 1863.  He was also the first governor of a US state to be impeached by a state legislature, although he was found not guilty during subsequent State Senate impeachment trial and was not removed from office. After his time as governor he served in the Kansas Senate from 1873 to 1881. To date, he is the only governor of Kansas to be impeached.\nRobinson was educated at Hadley and Amherst academies, and at Amherst College. He studied medicine in Woodstock, Vermont, and later in Pittsfield, Massachusetts, where he earned his medical degree at the Berkshire Medical College in 1843.  He practiced medicine in Belchertown,  Springfield, and Fitchburg.[1][2]\n",
        "type": []
    },
    "24": {
        "link": "/wiki/Constitutions_of_Kansas",
        "title": "Constitutions of Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lecompton",
        "county": "Douglas County",
        "paragraph": "\nUnder U.S. law, a state requires a constitution. A main order of business for Territorial Kansas was the creation of a constitution, under which Kansas would become a state. Whether it would be a slave state or a free state, allowing or prohibiting slavery, was a national issue, because it would affect voting in the polarized U.S. Senate. Because of  tensions over slavery, four quite different constitutions of Kansas were drafted.\nThe Topeka Constitutional Convention met in opposition to the first territorial legislature, from which free-staters had been excluded, and that they called \"bogus\".  It adopted the Topeka Constitution on December 15, 1855, which was approved territory-wide on January 15, 1856. Under this constitution, free Blacks were excluded from Kansas; the \"Black exclusion\" was voted on separately, but it passed. The constitution was sent to Congress and approved by the House on July 2, 1856, but, opposed by President Pierce, failed in the Senate by two (Southern) votes.\nThe Territorial Legislature met in Lecompton in September 1856 to prepare a rival document. The  LeCompton Constitution explicitly allowed slavery, the subject of an entire article (Article 7). It was approved in a rigged election in December 1857, but it was overwhelmingly defeated in a second vote in January 1858 by a majority of voters in the Kansas Territory.\n",
        "type": []
    },
    "25": {
        "link": "/wiki/Lansing_Correctional_Facility",
        "title": "Lansing Correctional Facility",
        "date": "",
        "year": "",
        "location": "Lansing, Kansas",
        "state": "Kansas",
        "place": "Lansing",
        "county": "Leavenworth County",
        "paragraph": "Lansing Correctional Facility (LCF) is a state prison operated by the Kansas Department of Corrections. LCF is located in Lansing, Kansas, in Leavenworth County. LCF, along with the Federal Bureau of Prison's United States Penitentiary, Leavenworth, the United States Army Corrections Command's United States Disciplinary Barracks, and Midwest Joint Regional Correctional Facility in Fort Leavenworth are the four major prisons that give the Leavenworth area its reputation as a corrections center.\nThe facility was originally known as the Kansas State Penitentiary (KSP) and was built by prison labor in the 1860s. The name was changed to Lansing Correctional Facility in 1990. Construction of the cell houses was completed in 1867.  The facility began housing Kansas inmates felons in July 1868 and housed felons from Oklahoma from 1889 to 1909.\nThe prison stopped admitting prisoners temporarily in the spring of 1896 and January 1900 as a result of the spread of smallpox in Kansas.\n",
        "type": []
    },
    "26": {
        "link": "/wiki/George_Loyd",
        "title": "George Loyd",
        "date": "December 17, 1892(1892-12-17) (aged 48–49) Fort Riley, Kansas, US",
        "year": "1892",
        "location": "",
        "state": "Kansas",
        "place": "Fort Riley",
        "county": "Riley County",
        "paragraph": "\nGeorge Loyd (1843 – December 17, 1892), whose last name was occasionally spelled \"Lloyd,\" was a United States Army soldier. He fought in the Battle of the Little Big Horn and in the Battle of Wounded Knee, now called the Wounded Knee Massacre, receiving the Medal of Honor for his actions in the latter.\nGeorge Loyd was born in County Tyrone, Ireland in 1843. He immigrated to the U.S.[when?]\n",
        "type": []
    },
    "27": {
        "link": "/wiki/Origins_of_the_American_Civil_War",
        "title": "Origins of the American Civil War",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\n\nHistorians who debate the origins of the American Civil War today agree that the preservation of slavery in the United States was the principal aim of the 11 Southern states (seven states before the onset of the war and four states after the onset) which declared their secession from the United States (the Union) and united to form the Confederate States (known as the \"Confederacy\"). However, while historians in the 21st century agree on the centrality of the conflict over slavery—it was not just \"a cause\" of the war but \"the cause\"[1]—they disagree sharply on which aspects of this conflict (ideological, economic, political, or social) were most important, and on the North’s reasons for refusing to let them go.[2] Proponents of the pseudo-historical Lost Cause ideology have denied that slavery was the principal cause of the secession, a view which has been disproven by the overwhelming historical evidence against it. \n",
        "type": []
    },
    "28": {
        "link": "/wiki/First_Territorial_Capitol_of_Kansas",
        "title": "First Territorial Capitol of Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Pawnee",
        "county": "Pawnee County",
        "paragraph": "The First Territorial Capitol of Kansas (officially named First Territorial Capitol State Historic Site) is the sole remaining building of the ghost town of Pawnee, Kansas.  The city served as the capital of the Kansas Territory for five days before it was moved to present day Fairway, Kansas, and the town became part of neighboring Fort Riley. The building was the meeting place for the first elected Territorial Legislature in 1855. After falling into disrepair, the structure was restored in 1928 and today it serves as a history museum operated by the Kansas Historical Society and supported through The Partners of the First Territorial Capitol.\nThe capitol is located in the Kaw valley of northeastern Kansas, 100 yards (91 m) north of the Kansas River. It first sat along the eastern border of Fort Riley, but today is within the boundaries of the base. A 2.8-acre (1.1 ha) site on which the building stands was provided to the Kansas Historical Society through a revocable license from the War Department in 1928.[2] It is separated from the river by a grove of trees, and Union Pacific Railroad lines run parallel to the building close to its north side.\nConstruction began with about thirty workers under the direction of Warren Beckworth[3] and was essentially completed in 1855. The building's foundation is roughly 40 by 80 feet (12 by 24 m), and it is two stories tall. Each floor is identically arranged for an assembly hall, with support columns down the center, and a stairway connecting the floors on the south side.[3] Its foundation and walls are made of native limestone. A stone chimney is at each short side, with bricked exteriors. Its ceilings are exposed structural timbers. Doors are of wood with cut-stone thresholds, and window sills are also cut stone. Hanging lanterns for lighting were probably used.[3] During its 1927 restoration, wood timbers were used that were chipped to make them look hand-cut. 2-inch (51 mm) planks were used for the floors and set with iron nails. Hand-forged hardware attached doors and windows. The roof was shingled with 3-foot (0.91 m) tiles split to resemble shakes.[4]\n",
        "type": []
    },
    "29": {
        "link": "/wiki/Homestead_Act_of_1860",
        "title": "Homestead Act of 1860",
        "date": "",
        "year": "1860",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nThe Homestead Act of 1860 in the United States would have made land available for 25 cents per acre. This act was passed by the United States Congress, but was ultimately vetoed by President James Buchanan.[1]\nThis was at a time where Northerners believed that the federal government should give 160-acre (0.65 km2; 0.25 sq mi) plots of vacant Western land to pioneers for free. People went to the West to start new lives and wanted cheap land.\n",
        "type": []
    },
    "30": {
        "link": "/wiki/Battle_of_Black_Jack",
        "title": "Battle of Black Jack",
        "date": "June 2, 1856; 166 years ago (1856-06-02)",
        "year": "1856",
        "location": "near Baldwin City, Kansas",
        "state": "Kansas",
        "place": "Baldwin City",
        "county": "Douglas County",
        "paragraph": "The Battle of Black Jack took place on June 2, 1856, when antislavery forces, led by the noted abolitionist John Brown, attacked the encampment of Henry C. Pate near Baldwin City, Kansas. The battle is cited as one incident of \"Bleeding Kansas\" and a contributing factor leading up to the American Civil War of 1861 to 1865.\nIn 1854, the U.S. Congress had passed the Kansas-Nebraska Act which stipulated that the residents of these territories would decide whether they wished to enter the Union as a slave or free state. This doctrine became known as popular sovereignty. Organized groups from the North sent thousands of abolitionist supporters to Kansas in an attempt to tip the balance in favor of free state advocates, to counter settlement from proslavery supporters from Missouri. As a result, pro- and antislavery groups had frequent clashes culminating in the Battle of Black Jack.\nOn May 21, 1856, Henry Clay Pate participated with a posse of 750 proslavery forces in the sacking of Lawrence, which destroyed the Free State Hotel, two abolitionist newspaper offices and their printing presses. They also looted throughout the village. The next day, Congressman Preston Brooks from South Carolina physically attacked Senator Charles Sumner of Massachusetts in the Senate chambers with a cane. He continued hitting after the senator was bleeding and unconscious. Three days later, a band of men, led by John Brown and comrade Captain Shore, executed five proslavery men with broadswords at Pottawatomie Creek. Brown's men let Jerome Glanville and James Harris return home to the cabin of Harris. This incident became known as the Pottawatomie massacre. Following the massacre, three antislavery men were taken prisoner, including two of John Brown's sons.\n",
        "type": [
            "riot"
        ]
    },
    "31": {
        "link": "/wiki/Benjamin_Franklin_Stringfellow_(1816%E2%80%931891)",
        "title": "Benjamin Franklin Stringfellow (1816–1891)",
        "date": "",
        "year": "1816",
        "location": "",
        "state": "Kansas",
        "place": "Atchison",
        "county": "Atchison County",
        "paragraph": "Benjamin Franklin Stringfellow (September 3, 1816 – April 26, 1891) was a pro-slavery border ruffian in Kansas, when the slavery issue was put to a local vote in 1855 under the Popular Sovereignty provision.\nAs a General in the Missouri Militia, and former Attorney General of that state, Stringfellow openly defied the law by declaring that Missourians were free to vote in Kansas territory, and attacked abolitionist patrols in what became known as Bleeding Kansas. When the vote went against him, he turned his attention to developing the Atchison, Topeka and Santa Fe Railroad.\nStringfellow was the youngest of the ten children born to Robert Stringfellow (a veteran of the War of 1812 and merchant at Raccoon Ford on the Rapidan River and farmer in Culpeper County, Virginia), and Mary Plunkett (daughter of an early industrialist in Orange County, Virginia).[1] John H. Stringfellow was his brother. Educated in Fredericksburg, Virginia, he then attended the University of Virginia and was admitted to practice law in Louisville, Kentucky in 1837.\n",
        "type": []
    },
    "32": {
        "link": "/wiki/El_Dorado_Correctional_Facility",
        "title": "El Dorado Correctional Facility",
        "date": "",
        "year": "",
        "location": "1737 SE US Highway 54  El Dorado, Kansas",
        "state": "Kansas",
        "place": "El Dorado",
        "county": "Butler County",
        "paragraph": "The El Dorado Correctional Facility (abbreviated EDCF), is a maximum security prison located in Prospect Township, Butler County, Kansas east of El Dorado, United States.\nEDCF is the location of the Kansas Department of Corrections (KDOC) Reception and Diagnostic Unit (RDU), which processes every male inmate when they are received into custody. RDU helps determine the inmate's custody level, mental health classification, and educational program needs before he is assigned to a facility.\nEDCF has two general population cellhouses and one medium security dormitory. EDCF is administratively linked to two minimum security units, formerly \"honor camps\", one in El Dorado and one in Toronto, Kansas. In 2009, the announcement was made that the state would be closing both minimum security units, due to budget constraints. As of 2015, medium and minimum security units in Oswego were administratively part of EDCF.\n",
        "type": []
    },
    "33": {
        "link": "/wiki/Bushwhacker",
        "title": "Bushwhacker",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "Bushwhacking was a form of guerrilla warfare common during the American Revolutionary War, War of 1812, American Civil War and other conflicts in which there were large areas of contested land and few governmental resources to control these tracts. This was particularly prevalent in rural areas during the Civil War where there were sharp divisions between those favoring the Union and Confederacy in the conflict. The perpetrators of the attacks were called bushwhackers. The term \"bushwhacking\" is still in use today to describe ambushes done with the aim of attrition.[1]\nBushwhackers were generally part of the irregular military forces on both sides. While bushwhackers conducted well-organized raids against the military, the most dire of the attacks involved ambushes of individuals and house raids in rural areas. In the countryside, the actions were particularly inflammatory since they frequently amounted to fighting between neighbors, often to settle personal accounts. Since the attackers were non-uniformed, the government response was complicated by trying to decide whether they were legitimate military attacks or criminal actions.\nThe term \"bushwhacker\" came into wide use during the American Civil War (1861–1865).[2] It became particularly associated with the pro-Confederate secessionist guerrillas of Missouri, where such warfare was most intense. Guerrilla warfare also wracked Kentucky, Tennessee, northern Georgia, Arkansas, and western Virginia (including the new state of West Virginia), among other locations.[3][4][5]\n",
        "type": []
    },
    "34": {
        "link": "/wiki/Caleb_S._Pratt",
        "title": "Caleb S. Pratt",
        "date": "(1861-08-10) August 10, 1861",
        "year": "1861",
        "location": "",
        "state": "Kansas",
        "place": "Pratt County",
        "county": "Pratt County",
        "paragraph": "Caleb S. Pratt was a primary person involved in Bleeding Kansas. He testified before the Committee of Elections regarding the Troubles in Kansas, 1856 specific to voting irregularities in the Election of March 30, 1855 Lawrence, Kansas.[1]\nOn August 10, 1861, he was killed at the Battle of Wilson's Creek.\nPratt County, Kansas and the town of Pratt, Kansas are named in his honor.\n",
        "type": []
    },
    "35": {
        "link": "/wiki/Richard_Hickock",
        "title": "Richard Hickock",
        "date": "November 15, 1959",
        "year": "1959",
        "location": "",
        "state": "Kansas",
        "place": "Holcomb",
        "county": "Finney County",
        "paragraph": "\nRichard Eugene Hickock (June 6, 1931 – April 14, 1965) was one of two ex-convicts convicted of murdering four members of the Clutter family in Holcomb, Kansas on November 15, 1959, a crime made famous by Truman Capote in his 1966 non-fiction novel In Cold Blood. Along with Perry Edward Smith, Hickock took part in the burglary and multiple murder at the Clutter family farmhouse.\nRichard Hickock was born on June 6, 1931[1] in Kansas City, Kansas to farmworker parents, Walter Sr. and Eunice Hickock. He was one of several siblings, including a younger brother named Walter Jr. According to Walter Jr., their parents provided them with a good upbringing, but they were strict; he said of them, \"I'm not sure if they were loving in the way you'd usually say a family is loving.\"[2] In 1947, the Hickock family relocated to the small east Kansas town of Edgerton. Hickock was a popular student and an athlete at Olathe High School. After finishing high school, Hickock had wanted to attend college, but his family lacked the means to finance his post-secondary education. Hickock went to work as a mechanic instead.\n",
        "type": [
            "murder",
            "mass murder",
            "burglary"
        ]
    },
    "36": {
        "link": "/wiki/James_K._Edsall",
        "title": "James K. Edsall",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Windham",
        "county": "Johnson County",
        "paragraph": "James Kirtland Edsall (May 10, 1831 – June 19, 1892) was an American lawyer and politician.\nBorn in Windham, Greene County, New York, Edsall studied law and was admitted to the New York bar in 1852. He practiced law in Plattsburgh, New York, Milwaukee, Wisconsin, and St. Paul, Minnesota. In 1854, Edsall moved to Leavenworth, Kansas Territory and practiced law; he served in the Kansas Constitutional Convention during the Bleeding Kansas conflict and was part of the Topeka Free Soil group. In 1857, Edsall moved to Dixon, Illinois and continued to practice law. In 1864, he was elected mayor of Dixon. In 1871, Edsall served in the Illinois State Senate and was a Republican. From 1873 to 1881, Edsall served as Illinois Attorney General. In 1878, he moved to Chicago, Illinois and continue to practice law after he left office in 1881. Edsall died of heart failure at his home in Chicago, Illinois. His son was Samuel Cook Edsall who served as bishop of the Episcopal Diocese of Minnesota.[1][2][3]\n\n",
        "type": []
    },
    "37": {
        "link": "/wiki/Martin_Priest",
        "title": "Martin Priest",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lansing",
        "county": "Leavenworth County",
        "paragraph": "Martin Dean \"Marty\" Priest (born 1957) is an American murderer and suspected serial killer. Convicted of murdering a young girl and a man in both Missouri and Kansas, Priest is also suspected, but acquitted, in another three murders dating from 1980 to 1985. He is currently serving two life sentences at the Lansing Correctional Facility in Lansing, Kansas.[1]\nOn June 15, 1980, the body of 12-year-old Tonya Lea Lewis, a student at Nevada Middle School, was found floating on a farm pond about 11 miles south of the city by two men who had gone fishing. According to the Vernon County Sheriff Department, she had died about two days prior.[2] Initially, the cause of death couldn't be determined and no obvious signs of wounds could be located after the autopsy, but the authorities nevertheless treated the case as a suspected homicide.[3] Almost a month later, 22-year-old local Martin Priest was arrested for the death, now determined to be a drowning, remaining in custody with a $250,000 bond.\nAt the time, Priest was part of a painting crew and was working in the Lewis household when he overheard a conversation between Tonya and a friend, Kelly Schumacher, who wanted to go to the municipal pool. He excused himself before his boss with a supposed job interview, but instead went to see Tonya, allegedly making arrangements for the two of them to play basketball later. After Lewis failed to return home, her mother, Shirley, questioned Martin about the disappearance, but he explained that after he left their supposed game, he went home and stayed there all night.[1]\n",
        "type": [
            "murder",
            "theft"
        ]
    },
    "38": {
        "link": "/wiki/Samuel_Newitt_Wood",
        "title": "Samuel Newitt Wood",
        "date": "June 23, 1891 (1891-06-24) (aged 65) Hugoton, Kansas",
        "year": "1891",
        "location": "",
        "state": "Kansas",
        "place": "Hugoton",
        "county": "Stevens County",
        "paragraph": "\nSamuel Newitt Wood (December 30, 1825 – June 23, 1891) was an American attorney, politician, newspaper publisher-editor, and Free State advocate in Kansas. Wood, who was also an early supporter of Women's Suffrage, was assassinated in 1891 in a bitter fight over the naming of a new county seat in the state's southeastern corner.\nA native of Ohio, Wood settled in Kansas in 1854 following its establishment as a U.S. territory. He represented Chase, Morris, and Madison[1] counties in the Kansas Territorial Legislature in 1860 and 1861. Wood was subsequently elected to the first Kansas State Senate in 1861, the year the state was admitted into the Union, and completed another term as State Senator in 1867. He was also a member of the Kansas House of Representatives in 1864, 1866, 1876, and 1877, serving as speaker during his final term.[2] In the 1850s and 1860s, Wood owned and operated several newspapers and was editor of several other Kansas papers in the 1870s and 1880s.[3]\n",
        "type": []
    },
    "39": {
        "link": "/wiki/New_England_Emigrant_Aid_Company",
        "title": "New England Emigrant Aid Company",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Boston",
        "county": "Wyandotte County",
        "paragraph": "The New England Emigrant Aid Company[n 1] (originally the Massachusetts Emigrant Aid Company[4]) was a transportation company founded in Boston, Massachusetts[5] by activist Eli Thayer in the wake of the Kansas–Nebraska Act, which allowed the population of Kansas Territory to choose whether slavery would be legal. The Company's ultimate purpose was to transport anti-slavery immigrants into the Kansas Territory. The Company believed that if enough anti-slavery immigrants settled en masse in the newly-opened territory, they would be able to shift the balance of political power in the territory, which in turn would lead to Kansas becoming a free state (rather than a slave state) when it eventually joined the United States.[6][page needed] The New England Emigrant Aid Company is noted less for its direct impact than for the psychological impact it had on pro-slavery and anti-slavery elements. Thayer's prediction that the Company would eventually be able to send 20,000 immigrants a year never came to fruition, but it spurred Border Ruffians from nearby Missouri, where slavery was legal, to move to Kansas to ensure its admission to the Union as a slave state. That, in turn, further galvanized Free-Staters and enemies of Slave Power.\nThayer's intention was to capitalize on anti-slavery sentiment in the Northern United States and to send settlers to Kansas to purchase land and build houses, shops, and mills. They could then sell the land at a significant profit and send the proceeds back to Thayer and his investors. At the behest of several investors, who found the notion of profiting from the anti-slavery cause distasteful, the company's model was shifted to that of a benevolent society, and it was renamed the New England Emigrant Aid Company in 1855. While the company achieved neither a profit nor a significant impact on the population of Kansas, it played an important role in the events that would later be termed Bleeding Kansas.\nThe Company was formed in the midst of the sectional crisis that preceded the American Civil War. To the Northern United States, the concept of popular sovereignty, which stated that the population of each new U.S. state should be allowed to decide if it allowed slavery, was an attempt by Southerners to gain power. When the Kansas–Nebraska Act threatened to extend popular sovereignty into the new Kansas Territory, Eli Thayer, a second-term Congressman from Massachusetts, hatched the idea of an Emigrant Aid Company in the winter of 1853–1854. His primary partners in the venture were Alexander H. Bullock and Edward Everett Hale, and together, they set Thayer's plans in motion on March 5, 1854.[7] Thayer announced the Company at a rally against the impending passage of the Kansas–Nebraska Act in Worcester on March 11. Shortly thereafter, the Company's charter was approved by the Massachusetts Legislature for up to $5,000,000 in capital.[8][9]\n",
        "type": []
    },
    "40": {
        "link": "/wiki/List_of_people_executed_in_Kansas",
        "title": "List of people executed in Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "\nThis is a list of people executed in Kansas.\nNo one has been executed by the state of Kansas since 1965, although capital punishment is legal there. Historically, 58 people have been executed in the area now occupied by the state. Many of these were federal executions of soldiers and POWs, often at the United States Disciplinary Barracks in Leavenworth.  Fourteen German POWs were executed at Leavenworth in 1945.\n",
        "type": []
    },
    "41": {
        "link": "/wiki/James_Henry_Lane_(Union_general)",
        "title": "James Henry Lane (Union general)",
        "date": "July 11, 1866(1866-07-11) (aged 52) Leavenworth, Kansas",
        "year": "1866",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "James Henry Lane (June 22, 1814 – July 11, 1866) was a partisan militia leader during the Bleeding Kansas period that immediately preceded the American Civil War. During the war itself, Lane served as a United States Senator and as a general for the Union. Although reelected as a Senator in 1865, Lane committed suicide the next year.\nThe son of Amos Lane, Lane was born in Lawrenceburg, Indiana,[1] where he practiced law when he was admitted to the state bar during 1840. During the Mexican–American War, he successively commanded the 3rd and 5th Indiana Regiments. He was a U.S. congressman from Indiana (1853–1855) where he voted for the Kansas–Nebraska Act.\nHe relocated to the Kansas Territory during 1855. Remaining a Democrat for a time, he eventually became involved with the antislavery movement in Kansas, and joined the Republican party. He was often termed the commander of the Free State Army (\"The Red Legs\" or Jayhawkers), a major Free Soil militant group. In 1855 he was the president of the convention that drafted the anti-slavery Topeka Constitution.\n",
        "type": []
    },
    "42": {
        "link": "/wiki/Sacking_of_Lawrence",
        "title": "Sacking of Lawrence",
        "date": "May 21, 1856",
        "year": "1856",
        "location": "Douglas County, Kansas",
        "state": "Kansas",
        "place": "Douglas County",
        "county": "Douglas County",
        "paragraph": "\nProslavery victory\nThe sacking of Lawrence occurred on May 21, 1856, when pro-slavery settlers, led by Douglas County Sheriff Samuel J. Jones, attacked and ransacked Lawrence, Kansas, a town which had been founded by anti-slavery settlers from Massachusetts who were hoping to make Kansas a free state. The incident fueled the irregular conflict in Kansas Territory that later became known as Bleeding Kansas.\n",
        "type": [
            "riot"
        ]
    },
    "43": {
        "link": "/wiki/James_G._Birney",
        "title": "James G. Birney",
        "date": "November 18, 1857(1857-11-18) (aged 65) Perth Amboy, New Jersey, U.S.",
        "year": "1857",
        "location": "",
        "state": "Kansas",
        "place": "Danville",
        "county": "Harper County",
        "paragraph": "\nJames Gillespie Birney (February 4, 1792 – November 18, 1857)[1] was an American abolitionist, politician, and attorney born in Danville, Kentucky. He changed from being a planter and slave owner to abolitionism, publishing the abolitionist weekly The Philanthropist. He twice served as the presidential nominee for the anti-slavery Liberty Party.\nBirney pursued a legal career in Danville after graduating from the College of New Jersey and studying under Alexander J. Dallas. He volunteered for the campaigns of Henry Clay, served on the town council, and became a Freemason. In 1816, he won election to the Kentucky House of Representatives as a member of the Democratic-Republican Party. In 1818, he established a cotton plantation in Madison County, Alabama, and he won election to the Alabama House of Representatives the following year. Birney eventually sold the plantation and established a legal practice in Huntsville, Alabama, becoming one of the most successful lawyers in the region.\n",
        "type": []
    },
    "44": {
        "link": "/wiki/James_Montgomery_(colonel)",
        "title": "James Montgomery (colonel)",
        "date": "December 6, 1871 (1871-12-07) (aged 56) Linn County, Kansas",
        "year": "1871",
        "location": "",
        "state": "Kansas",
        "place": "Linn County",
        "county": "Linn County",
        "paragraph": "James Montgomery (December 22, 1814 – December 6, 1871) was a Jayhawker during the Bleeding Kansas era and a controversial Union colonel during the American Civil War.  Montgomery was a staunch supporter of abolitionist principles and individual liberty and used extreme measures against pro-slavery populations.\nJames Montgomery was born to James and Mary Baldwin Montgomery in Austinburg, Ashtabula County, Ohio, on December 22, 1814.[2]  He migrated to Kentucky in 1837 with his parents and eventually taught school there.  He married, but his first wife died shortly after the wedding, so he married again to Clarinda Evans.[3]  They moved to Pike County, Missouri, in 1852, and then to Jackson County and finally Bates County while awaiting the organization of Kansas for settlement.\nIn 1854 Montgomery purchased land near present-day Mound City, Kansas, where he became a leader of local Free-state men and was a fervent abolitionist.[4][5] In 1857 he organized and commanded a \"Self-Protective Company\", using it to order pro-slavery settlers out of the region.  Conflict with other pro-slavery elements led territorial governor James W. Denver to dispatch U.S. Army soldiers in to restore order.  Montgomery at times cooperated with the abolitionist John Brown and considered a raid to rescue Brown after his capture in Virginia, but snow in Pennsylvania upset his plan.[6]\n",
        "type": []
    },
    "45": {
        "link": "/wiki/Brandon_Brown_(American_football)",
        "title": "Murder of Brandon Brown",
        "date": "September 22, 2012(2012-09-22) (aged 26) Wichita, Kansas",
        "year": "2012",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "Brandon Brown (June 13, 1986 – September 22, 2012[1]) was a college football athlete for the Tabor College Bluejays in Hillsboro, Kansas.  Brown was a defensive lineman from Sacramento, California[2] and was found beaten and unresponsive on a street in nearby McPherson, Kansas early Sunday morning, September 16, 2012.[3]  He later died from his injuries at a Wichita hospital on September 22.[4]\nBrown transferred to Tabor from a community college in California as a redshirt Junior for the team.[5][6]\nOn October 4, 2012, the Kansas Collegiate Athletic Conference and presidents of McPherson and Tabor agreed to cancel their game scheduled for October 20, 2012.[7]  The game was cancelled in light of the ongoing investigation into the murder of Tabor football player Brandon Brown.[8]  Two former players from the nearby McPherson College Bulldogs football team have been charged with the murder:  Alton Franklin[9] and Dequinte Oshea Flournoy.[10]  Both were on the football roster at McPherson for the previous year, and Franklin was listed as a sophomore linebacker at the beginning of the 2012 season.  He was dismissed from the team before the incident and Flournoy was also no longer a member of the team.[11]\n",
        "type": [
            "murder"
        ]
    },
    "46": {
        "link": "/wiki/William_Quantrill",
        "title": "William Quantrill",
        "date": "June 6, 1865(1865-06-06) (aged 27) Louisville, Kentucky",
        "year": "1865",
        "location": "",
        "state": "Kansas",
        "place": "Louisville",
        "county": "Pottawatomie County",
        "paragraph": "\nWilliam Clarke Quantrill (July 31, 1837 – June 6, 1865) was a Confederate guerrilla leader during the American Civil War.\nHaving endured a tempestuous childhood before later becoming a schoolteacher, Quantrill joined a group of bandits who roamed the Missouri and Kansas countryside to apprehend escaped slaves. Later, the group became Confederate soldiers, who were referred to as \"Quantrill's Raiders\". It was a pro-Confederate partisan ranger outfit that was best known for its often brutal guerrilla tactics. Also notable is that the group included the young Jesse James and his older brother Frank James.\n",
        "type": []
    },
    "47": {
        "link": "/wiki/William_Frederick_Milton_Arny",
        "title": "William Frederick Milton Arny",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Georgetown",
        "county": "Riley County",
        "paragraph": "William Frederick Milton Arny (May 9, 1813 – September 18, 1881) was an Indian agent for the United States, who served as Secretary of New Mexico Territory in 1862–1867.\nArny was born on May 9, 1813, in Georgetown, Maryland, the son of Joseph Arny from Krummenau, St. Gallen, Switzerland, a confectioner, and his first wife, Elizabeth Hyde, who was from England.[1]\nHe was educated in the public schools and gained employment at the Bethany College, at Bethany, Virginia. He was for several years secretary of Bethany College, when the celebrated preacher, Alexander Campbell was its president.[2] In 1850 Arny removed to McLean County, Illinois after a rift developed between Campbell and him.[1]\n",
        "type": []
    },
    "48": {
        "link": "/wiki/Aggieville",
        "title": "Aggieville",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Manhattan",
        "county": "Riley County",
        "paragraph": "\nAggieville is a community of six square blocks in Manhattan, Kansas, consisting of bars, restaurants, and shops oriented around university culture. Its nightlife scene peaks surrounding Kansas State games.\nBefore 1898, students at the Kansas State Agricultural College (now Kansas State University) had to purchase their textbooks downtown, which, in the age before the automobile, was inconvenient due to distance and often, mud-soaked roads.  The college decided to build a student bookstore and dining facility closer to campus, but it was shut down in June 1899 after a political upheaval in the college's Board of Regents.  That September, a group of students started the Student Co-Operative Association and bought the bookstore.[1][2]\n",
        "type": []
    },
    "49": {
        "link": "/wiki/James_W._Denver",
        "title": "James W. Denver",
        "date": "August 9, 1892(1892-08-09) (aged 74) Washington, D.C., U.S.",
        "year": "1892",
        "location": "",
        "state": "Kansas",
        "place": "Denver",
        "county": "Butler County",
        "paragraph": "\nJames William \"Jim\" Denver (October 23, 1817 – August 9, 1892) was an American politician, soldier and lawyer. He served in the California state government, as an officer in the United States Army in two wars, and as a Democratic member of the United States House of Representatives from California. He served as secretary and Governor of the Kansas Territory during the struggle over whether or not Kansas would be open to slavery. The city of Denver, Colorado, is named after him.\nJames W. Denver was born near Winchester, Virginia. He attended public schools and moved to Ohio with his parents in 1830, settling near Wilmington. In 1841 he taught school in Missouri, and in 1844 he graduated from the law school of the University of Cincinnati. He was admitted to the bar and practiced law near Xenia, Ohio. He moved to Platte City, Missouri, in 1845, where he continued his law practice and acting career.\n",
        "type": []
    },
    "50": {
        "link": "/wiki/Francis_Nemechek",
        "title": "Francis Nemechek",
        "date": "",
        "year": "new 1974",
        "location": "",
        "state": "Kansas",
        "place": "Trego County",
        "county": "Trego County",
        "paragraph": "Francis Donald Nemechek (born June 29, 1950) is an American serial killer who murdered four women and a young boy in Kansas's Trego and Ellis counties between December 1974 and August 1976. He admitted to committing the murders, along with raping some of his victims, but pled not guilty due to claims of insanity. He was found guilty in 1977 and sentenced to life imprisonment. He has been denied parole four times.[1][2]\nBorn on June 29, 1950, Francis Donald Nemechek was the second of three children born to parents George and Nathalie.[3] Little is known about his upbringing, other than he grew up in Trego County and played football in high school.[4] After high school Nemechek enrolled at Goodland Area Vocational-Technical school, where he was described as a top student. Upon completing the school Nemechek applied for a job as a traveling service mechanic, for which he was granted work for.[4] Nemechek later got married, and fathered one son. After some time, the two filed for divorce. He eventually got a new job as a truck driver which his father helped him obtain.[4] Nemechek would continue to live with his parents up until his arrest.[5] Family members would tell the press that mentioning Nemechek's ex-wife would throw him into rage.[4]\nOn December 13, 1974, Nemechek was driving his pickup truck along Interstate 70 near Ogallah when he noticed a red Toyota driving along the same road, which held 19-year-old Diane Lovette, her friend 21-year-old Cheryl Young, and Cheryl's 3-year-old son Guy William Young, all of Fort Madison, Iowa.[6] Brandishing his handgun, Nemechek shot out one of the tires of the Toyota, consequently causing the car to spiral onto the side of the road. Nemechek then parked his truck and ran to the front of the women's vehicle and abducted all three at gunpoint.[6] He drove the trio to a farmhouse owned by an acquaintance named Joseph Faulkner in Graham County, where he shot both Lovette and Young to death, and left Guy unharmed.[7] However, due to the snow and freezing temperatures, Guy would succumb from hypothermia.[6] Later that same day, Cheryl Young's vehicle was found abandoned. A month later, two trappers found the body of Guy Young, and responding officers found the bodies of Cheryl Young and Diane Lovette inside the farmhouse.[8] The killings quickly drew a lot of attention, and in the months it sat unsolved, the case was nicknamed the \"Lovette-Young case\".[9]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "51": {
        "link": "/wiki/Garden_City,_Kansas_bombing_plot",
        "title": "Garden City, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Garden City",
        "county": "Finney County",
        "paragraph": "\nGarden City is a city in, and the county seat of, Finney County, Kansas, United States.[2]  As of the 2020 census, the population of the city was 28,151.[4][5]  The city is home to Garden City Community College and the Lee Richardson Zoo, the largest zoological park in western Kansas.\nIn February 1878, James R. Fulton, William D. Fulton and W.D.'s son, L.W. Fulton, arrived at the present site of Garden City.[6]\n",
        "type": []
    },
    "52": {
        "link": "/wiki/Beecher_Bible_and_Rifle_Church",
        "title": "Beecher Bible and Rifle Church",
        "date": "",
        "year": "",
        "location": "SE corner of Chapel and Elm Sts., Wabaunsee, Kansas",
        "state": "Kansas",
        "place": "Wabaunsee",
        "county": "Wabaunsee County",
        "paragraph": "Beecher Bible and Rifle Church is a historic church at the southeastern corner of Chapel and Elm Streets in Wabaunsee, Kansas. The church is named after Rev. Henry Ward Beecher, a financial backer for the town who helped smuggle rifles past pro-slavery forces in crates marked Beecher's Bibles.\nThe town of Wabaunsee was founded in 1855 by a group of about 70 New England emigrants from New Haven, Connecticut who established the Connecticut Kansas Colony, alternatively called the New Haven Colony or the Beecher Rifle Colony.  The settlers were inspired by a sermon given by well-known abolitionist Henry Ward Beecher and Beecher gave money to help supply rifles for the men to defend themselves.  The rifles were smuggled through pro-slavery areas in crates marked \"Beecher's Bibles,\" and consequently the rifles themselves became known as Beecher's Bibles. Wabaunsee was staunchly anti-slavery and became part of the Underground Railroad in late 1856 and helped Lawrence after Quantrill's Raid.[2]\nIn 1862 the Beecher Bible and Rifle Church was completed after four years of construction. The church was built of local limestone by church member Robert Banks, with contrasting stone accents. The overall style is described as Plains Vernacular. The structure  is crowned by a gable roof and a wood bell tower. A central brick chimney vents wood stoves on the perimeter of the church, connecting to the chimney via metal stovepipes. The church is entered through a vestibule that provides access to the choir loft stairs. The main space was divided down the center into men's and women's sides.[2][3]\n",
        "type": []
    },
    "53": {
        "link": "/wiki/Lecompton_Constitution",
        "title": "Lecompton Constitution",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lecompton",
        "county": "Douglas County",
        "paragraph": "The Lecompton Constitution (1858) was the second of four proposed constitutions for the state of Kansas. Named for the city of Lecompton where it was drafted, it was strongly pro-slavery. It never went into effect.\nThe Lecompton Constitution was drafted by pro-slavery advocates and included provisions to protect slaveholding in the state and to exclude free people of color from its bill of rights. Slavery was the subject of Article 7, which protected the right to slave \"property\", and prevented the legislature from emancipating slaves without their owners' consent, and without full compensation to their owners. It was initially approved in a rigged election in December 1857, but overwhelmingly defeated in a second vote in January 1858 by a majority of voters in the Kansas Territory.[1] The rejection of the Lecompton Constitution, and the subsequent admittance of Kansas to the Union as a free state, highlighted the irregular and fraudulent voting practices that had marked earlier efforts by bushwhackers and border ruffians to create a state constitution in Kansas that allowed slavery.\nThe Lecompton Constitution was preceded by the Topeka Constitution and was followed by the Leavenworth and Wyandotte Constitutions, with the Wyandotte becoming the Kansas state constitution.[2] The document was written in response to the anti-slavery position of the 1855 Topeka Constitution of James H. Lane and other free-state advocates.[2] The territorial legislature—which, because of widespread electoral fraud consisted, mostly of slave owners—met at the designated capital of Lecompton in September 1857 to produce a rival document.[2] Free-state supporters, who comprised a large majority of actual settlers, boycotted the vote. President James Buchanan's appointee as territorial governor of Kansas, Robert J. Walker, although a strong defender of slavery, opposed the blatant injustice of the Constitution and resigned rather than implement it.[3] This new constitution enshrined slavery in the proposed state and protected the rights of slaveholders. In addition, the constitution provided for a referendum that allowed voters the choice of allowing more slaves to enter the territory.\n",
        "type": []
    },
    "54": {
        "link": "/wiki/Felony_murder_rule_in_Kansas",
        "title": "Felony murder rule in Kansas",
        "date": "",
        "year": "new 1988",
        "location": "",
        "state": "Kansas",
        "place": "Kan.",
        "county": "Sedgwick County",
        "paragraph": "In the state of Kansas, the common law felony murder rule has been codified in K.S.A. 21-3401. The statute defines first degree murder as, among other things, homicide in the commission of, attempt to commit, or escape from an inherently dangerous felony. Inherently dangerous felonies are defined in K.S.A. 21-3436 and include armed robbery, arson, and aggravated burglary.[1] A felony murder conviction in Kansas carries a mandatory life sentence without the possibility of parole for 25 years.\nIn the case State v. Hoang, 243 Kan. 40 (1988), the Supreme Court of Kansas held that the accidental death of a co-felon during the commission of arson could support a felony murder conviction.[2]\nIn the case State v. Sophophone, 270 Kan. 703 (2001), the Supreme Court of Kansas held that a felony murder conviction could not be supported if the co-felon was killed by lawful attempts at apprehension by a police officer.[3]\n",
        "type": [
            "murder",
            "arson",
            "burglary",
            "robbery",
            "robber"
        ]
    },
    "55": {
        "link": "/wiki/George_Tiller",
        "title": "George Tiller",
        "date": "May 31, 2009(2009-05-31) (aged 67) Wichita, Kansas, U.S.",
        "year": "2009",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nGeorge Richard Tiller (August 8, 1941 – May 31, 2009)[3] was an American physician from Wichita, Kansas. He gained national attention as the medical director of Women's Health Care Services, which was one of only three abortion clinics nationwide at the time which provided late termination of pregnancy.[4]\nDuring his tenure with the center, which began in 1975 and continued the medical practice of his father, Tiller was frequently targeted with protest and violence by anti-abortion groups and individuals. His clinic was firebombed in 1986. In 1993 Tiller was shot in both arms by anti-abortion extremist Shelley Shannon; she was sentenced to 23 years in prison and was released in 2018. On May 31, 2009, Tiller was fatally shot in the side of the head by anti-abortion extremist Scott Roeder while Tiller served as an usher during the Sunday morning service at his church in Wichita. Roeder was convicted of murder on January 29, 2010, and sentenced to life imprisonment.\n",
        "type": [
            "murder"
        ]
    },
    "56": {
        "link": "/wiki/David_Rice_Atchison",
        "title": "David Rice Atchison",
        "date": "January 26, 1886(1886-01-26) (aged 78) Gower, Missouri, U.S.",
        "year": "1886",
        "location": "",
        "state": "Kansas",
        "place": "Gower",
        "county": "Douglas County",
        "paragraph": "\nAmerican Civil War\nDavid Rice Atchison (August 11, 1807 – January 26, 1886) was a mid-19th century Democratic[1] United States Senator from Missouri.[1] He served as President pro tempore of the United States Senate for six years.[2] Atchison served as a major general in the Missouri State Militia in 1838 during Missouri's Mormon War and as a Confederate brigadier general during the American Civil War under Major General Sterling Price in the Missouri Home Guard. He is best known for the claim that for 24 hours—Sunday, March 4, 1849 through noon on Monday—he may have been Acting President of the United States. This belief, however, is dismissed by nearly all scholars.[2][3]\n",
        "type": []
    },
    "57": {
        "link": "/wiki/Charles_T._Carpenter",
        "title": "Charles T. Carpenter",
        "date": "February 22, 1945(1945-02-22) (aged 86) Montgomery County, Kansas",
        "year": "1945",
        "location": "",
        "state": "Kansas",
        "place": "Montgomery County",
        "county": "Montgomery County",
        "paragraph": "Charles Thomas Carpenter, born December 9, 1858 in Bedford County, Tennessee, died February 22, 1945 at Montgomery County, Kansas, was a pioneer banker who was taken hostage by the Dalton Gang in their last raid, October 5, 1892, in Coffeyville, Kansas.[1][2][3]\nCarpenter was a son of Samuel and Sarah (Montgomery) Carpenter, of Palmetto, Tennessee.[4]  He was schooled in a private institution at Palmetto, and attended the State University at Bloomington, Indiana, where he was a member of Phi Kappa Phi and graduated in 1876 with a Bachelor of Arts degree.[5]\nAfter graduation, he moved to Kansas to join his parents at Oswego, Kansas, where he first worked for his father, and then served two years as cashier of Condon Bank. In 1886, he moved to Coffeyville as a partner in the Condon Bank office established at Coffeyville that year.  He was also senior partner in the Charles T. Carpenter Insurance Agency, the largest agency in Montgomery County, Kansas. He served as president of the Coffeyville Board of Education and trustee of the Montgomery County High School at Independence, Kansas.\n",
        "type": []
    },
    "58": {
        "link": "/wiki/Fairway,_Kansas",
        "title": "Fairway, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Fairway",
        "county": "Johnson County",
        "paragraph": "\nFairway is a city in Johnson County, Kansas, United States,[1] and is included in the Kansas City Metropolitan Area census designation and the Shawnee Mission postal services designation.  As of the 2020 census, the population of the city was 4,170.[3]\nIn the 1820s, the federal government reserved this area for use by the Shawnee people, who had ceded their lands east of the Mississippi River to the United States. In 1839 Methodists established the Shawnee Methodist Mission here to operate a school for the Shawnee and try to convert them to Christianity. Later it was named the Shawnee Indian Manual Labor School and also accepted Native American boarding students. \n",
        "type": []
    },
    "59": {
        "link": "/wiki/James_Lammers",
        "title": "James Lammers",
        "date": "December 12, 1950",
        "year": "1950",
        "location": "",
        "state": "Kansas",
        "place": "Troy",
        "county": "Doniphan County",
        "paragraph": "James Bernard Lammers (July 16, 1924 – January 5, 1952)[1] was an American mass murderer who murdered his pregnant wife and three children. On December 12, 1950, he strangled his wife, who was about seven months pregnant, to death, then set their trailer on fire, resulting in their children dying. James was convicted of two counts of first degree murder, sentenced to death, and executed in 1952.[2][3][4]\nThe family had moved into a trailer in Troy eight weeks before the murders after James found work as a bulldozer operator there. However, six weeks later, he was fired.\nOn the early of morning of December 13, 1950, the Lammers' family trailer was discovered on fire. Neighbors tried to help, but were unable to extinguish the blaze. The bodies of 23-year-old Geneva Orr Lammers, 3-year-old Laura Mae Lammers, 2-year-old Melva Jean Lammers, and nine-month-old LaVern Francis Lammers were found. The children were sleeping during the fire, and had died from carbon monoxide poisoning.[5]\n",
        "type": [
            "murder",
            "mass murder"
        ]
    },
    "60": {
        "link": "/wiki/John_Brown_(abolitionist)",
        "title": "John Brown (abolitionist)",
        "date": "December 2, 1859(1859-12-02) (aged 59) Charles Town, Virginia (now West Virginia) , U.S.",
        "year": "1859",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nJohn Brown (May 9, 1800 – December 2, 1859) was an American abolitionist leader. First reaching national prominence for his radical abolitionism and fighting in Bleeding Kansas, he was eventually captured and executed for a failed incitement of a slave rebellion at Harpers Ferry preceding the American Civil War.\nAn evangelical Christian of strong religious convictions, Brown was profoundly influenced by the Puritan faith of his upbringing.[1][2][3] He believed that he was \"an instrument of God\",[4]: 248  raised up to strike the \"death blow\" to American slavery, a \"sacred obligation\".[3][4]: 189 [5][6] Brown was the leading exponent of violence in the American abolitionist movement,[7]: 426  believing it was necessary to end American slavery after decades of peaceful efforts had failed.[4][5][8] Brown said repeatedly that in working to free the enslaved, he was following Christian ethics, including the Golden Rule,[9][10] as well as the U.S. Declaration of Independence, which states that \"all men are created equal\".[11][12][13][14]: 721 [15] He stated repeatedly that in his view, these two principles \"meant the same thing\".[16][17][18]\n",
        "type": []
    },
    "61": {
        "link": "/wiki/Richard_Cordley",
        "title": "Richard Cordley",
        "date": "July 11, 1904(1904-07-11) (aged 74) Lawrence, Kansas",
        "year": "1904",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "Richard Cordley (September 6, 1829 – July 11, 1904) was a Protestant minister and abolitionist associated with the Jayhawkers of Kansas. Known primarily as the  pastor of Plymouth Congregational Church in Lawrence, Kansas in the 19th and early 20th century, Cordley was an early settler of Lawrence and a survivor of both the Sacking of Lawrence and the Lawrence Massacre in 1863. Cordley wrote about the history of Lawrence and the state of Kansas later in his lifetime and was also the recipient of the first degree awarded by the University of Kansas.\nCordley was born on September 6, 1829, in Nottingham, England. He later immigrated to Livingston County, Michigan, with his family when he was four.[1] He began attending public school when he was about nine, although he had been taught how to read by his \"cultivated\" mother prior to his attending a formal school.[2] He earned degrees from the University of Michigan (B.A. 1854) and the Andover Theological Seminary (M.A. 1857).[1][3][4] In 1874, he also was awarded an honorary Doctor of Divinity degree from the University of Kansas—making him the recipient of the first degree bestowed by the then-fledgling KU.[5][1][6][7]\nIn 1857, he became the pastor of Plymouth Congregational Church in Lawrence, Kansas, a position that he held until 1875. From that later year until 1884, he served in Flint, Michigan, and Emporia, Kansas. Then, in 1884, he returned to Lawrence and resumed his role as the pastor at Plymouth Congregational Church. He died on July 11, 1904,[1][3] and was buried in Oak Hill Cemetery in Lawrence.[8]\n",
        "type": []
    },
    "62": {
        "link": "/wiki/Norman_Lee_(musician)",
        "title": "Norman Lee (musician)",
        "date": "December 6, 1978 (aged 57) Wichita, Kansas, U.S.",
        "year": "1978",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "Norman Lee (March 21, 1921 – December 6, 1978) was an American songwriter, jazz clarinetist, and big band singer of the 1950s to 1970s.[1]\nBorn Norman Uehle in Danville, Iowa, Lee was raised in nearby Correctionville, Iowa. His mother, Alice Lee, was also a musician.[2]\nLee is best known for his collaboration with Lawrence Welk. Lee co-authored several songs, including \"Champagne Polka\", with Welk.[3] Lee also led his own group, the Norman Lee Orchestra, in Kansas. Lee also toured the United States with the Eddy Howard Orchestra and later took over the group after Howard's death.\n",
        "type": [
            "murder"
        ]
    },
    "63": {
        "link": "/wiki/Wakarusa_War",
        "title": "Wakarusa War",
        "date": "November–December 1855",
        "year": "1855",
        "location": "Douglas County, Kansas",
        "state": "Kansas",
        "place": "Douglas County",
        "county": "Douglas County",
        "paragraph": "The Wakarusa War was an armed standoff that took place in the Kansas Territory during November and December 1855. It is often cited by historians as the first instance of violence during the \"Bleeding Kansas\" conflict between anti-slavery and pro-slavery factions in the region.\nThe incident took place in Douglas County, centered on the Wakarusa River Valley and the town of Lawrence, where the opposing militias confronted each other for the first time. At the behest of Territorial Governor Wilson Shannon, the two sides eventually agreed to a truce, but it was short-lived, and widespread violence resumed the following spring.\nWhile pro- and anti-slavery settlers had been antagonistic towards one another for some time, the genesis of the Wakarusa War in particular dates to November 21, 1855, when a pro-slavery settler named Franklin Coleman shot a Free-Stater named Charles Dow nine times in the back, killing him. The murder was the culmination of a long-simmering feud between the two, as for some time they had argued about a land claim near Hickory Point, located about 14 miles (23 km) south of Lawrence.[1] According to the Border War Encyclopedia, \"Politics had not motivated Coleman to kill Dow, but the murder marked the genesis of the violent political divisions that characterized Kansas for the next 10 years.\"[2]\n",
        "type": [
            "murder",
            "riot",
            "killing"
        ]
    },
    "64": {
        "link": "/wiki/Henry_Ward_Beecher",
        "title": "Henry Ward Beecher",
        "date": "March 8, 1887(1887-03-08) (aged 73) Queens, New York, US",
        "year": "1887",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nHenry Ward Beecher (June 24, 1813 – March 8, 1887) was an American Congregationalist clergyman, social reformer, and speaker, known for his support of the abolition of slavery, his emphasis on God's love, and his 1875 adultery trial. His rhetorical focus on Christ's love has influenced mainstream Christianity to this day.[citation needed]\nBeecher was the son of Lyman Beecher, a Calvinist minister who became one of the best-known evangelists of his era. Several of his brothers and sisters became well-known educators and activists, most notably Harriet Beecher Stowe, who achieved worldwide fame with her abolitionist novel Uncle Tom's Cabin. Henry Ward Beecher graduated from Amherst College in 1834 and Lane Theological Seminary in 1837 before serving as a minister in Indianapolis and Lawrenceburg, Indiana.\n",
        "type": []
    },
    "65": {
        "link": "/wiki/August_Bondi",
        "title": "August Bondi",
        "date": "September 30, 1907(1907-09-30) (aged 74) St. Louis, Missouri, United States",
        "year": "1907",
        "location": "",
        "state": "Kansas",
        "place": "St. Louis",
        "county": "Washington County",
        "paragraph": "August Bondi[2] (Jewish name Anshl) (July 21, 1833, Vienna, Austria – September 30, 1907, St. Louis, Missouri, United States) was an Austrian-American Jew involved in the Border War (Bleeding Kansas) and later the American Civil War. In Kansas, he was a part of the Pottawatomie Rifles and fought alongside abolitionists John Brown and James Lane.[3][4][5]\nAugust Bondi was born July 21, 1833, in Vienna, Austria. The Bondis, Jewish European refugees, fled the Austrian Empire after the failed revolutions of 1848 and settled in St. Louis, Missouri. August Bondi moved to the Pottawatomie Creek valley in Franklin County, Kansas in 1855 with his business partner, Jacob Benjamin and began homesteading. The Bondi and Benjamin homesteads were near the forks of Mosquito Creek northwest of Dutch Henry's Crossing (Lane, Kansas).[4]\nSome sources claim that, as Free Soilers who hated slavery, their farm was attacked and burned by \"Border Ruffians\" (pro-slavers), and that a neighboring farmer, John Brown, rushed to their aide with his sons. However, Bondi recounts in his autobiography that he first met Brown's sons when their herd of Devon cattle wandered onto his farm, and he first met John Brown while traveling to elect a delegate to the 1855 Free State Constitutional Convention.[4] The Brown family did help to evict a pro-slavery squatter from Bondi's claim while he was in St. Louis in January 1856, and Bondi's farm was burned while he was away guarding pro-slavery prisoners captured during the Battle of Black Jack in June 1856.[4]\n",
        "type": []
    },
    "66": {
        "link": "/wiki/Silas_Soule",
        "title": "Silas Soule",
        "date": "April 23, 1865(1865-04-23) (aged 26) Denver, Colorado Territory, United States (murder by gunshot wound)",
        "year": "1865",
        "location": "",
        "state": "Kansas",
        "place": "Denver",
        "county": "Butler County",
        "paragraph": "Indian Wars\nSilas Stillman Soule (/ˈsoʊl/ [sole])[1] (July 26, 1838 – April 23, 1865) was an American abolitionist, Kansas Territory Jayhawker, whose family aligned themselves with John Brown and Walt Whitman. Later, during the American Civil War, he joined the Colorado volunteers, rising to the rank of captain in the Union Army. Soule was in command of Company D, 1st Colorado Cavalry, which was present at Sand Creek on November 29, 1864, when he refused an order to join the Sand Creek massacre. During the subsequent inquiry, Soule testified against the massacre's commanding officer, John Chivington. Soon afterwards Soule was murdered, possibly in retaliation; dying at 26, Soule is honored as having led a heroic life of \"moral courage\" at great personal risk to himself.[2]\nDescended from Mayflower passenger George Soule[2], Silas Soule was born into a family of abolitionists in Bath, Maine. He was raised in Maine and Massachusetts and, in 1854, his family became part of the newly formed New England Emigrant Aid Company, an organization whose goal was to help settle the Kansas Territory and bring it into the Union as a free state. His father and brother arrived in Kansas, near Lawrence (of which the Soule family was one of the founding families), in November 1854. The teenage Silas, his mother and two sisters came the following summer.\n",
        "type": [
            "murder"
        ]
    },
    "67": {
        "link": "/wiki/Joseph_O._Shelby",
        "title": "Joseph O. Shelby",
        "date": "February 13, 1897 (aged 66) Bates County, Missouri, U.S.",
        "year": "1897",
        "location": "",
        "state": "Kansas",
        "place": "Bates County",
        "county": "Butler County",
        "paragraph": "\nJoseph Orville \"J.O.\" Shelby (December 12, 1830 – February 13, 1897) was a senior officer of the Confederate States Army who commanded cavalry in the Trans-Mississippi Theater of the American Civil War.\nJoseph Orville Shelby was born in Lexington, Kentucky, to one of the state's wealthiest and most influential families. He lost his father at age five and was raised by a stepfather, Benjamin Gratz, who was a member of wealthy Lexington elite. Shelby attended Transylvania University and was a rope manufacturer until 1852. He then moved to Waverly, Missouri, where he engaged in steamboating on the Missouri River. He also ran a hemp plantation, a ropeworks, and a sawmill.[1] These business ventures made Shelby one of the wealthiest men in the state of Missouri.[2]\n",
        "type": []
    },
    "68": {
        "link": "/wiki/Bob_Dalton",
        "title": "Bob Dalton",
        "date": "October 5, 1892(1892-10-05) (aged 23) Coffeyville, Kansas, United States",
        "year": "1892",
        "location": "",
        "state": "Kansas",
        "place": "Coffeyville",
        "county": "Montgomery County",
        "paragraph": "Robert Rennick Dalton (May 13, 1869 – October 5, 1892), better known as Bob Dalton, was an American outlaw in the American Old West.  Beginning in 1891, he led the Dalton Gang, whose varying members included three of his brothers. They were known for robbing banks, stagecoaches and trains, primarily in Kansas and Oklahoma Territory, quickly attracting pursuit by lawmen.\nOn October 5, 1892 the gang attempted to rob two banks the same day in Coffeyville, Kansas, hoping to gain enough loot to leave the country. Attacked by civilians and law enforcement officers, Bob and Grat Dalton, Bill Power, and Richard L. \"Dick\" Broadwell were all killed. Younger brother Emmett Dalton was severely wounded, but survived. He was tried and convicted, and served 14 years in prison before being pardoned. Bill Dalton was not part of this heist.\nBorn in 1869 in Cass County, Missouri, Bob was one of nine sons of Lewis Dalton, from Kentucky and Jackson County, Missouri, and his wife Adeline Lee (née Younger). They also had three daughters. His siblings were:\n",
        "type": [
            "robber"
        ]
    },
    "69": {
        "link": "/wiki/John_Henry_Kagi",
        "title": "John Henry Kagi",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "John Henry Kagi, also spelled John Henri Kagi (March 15, 1835 – October 17, 1859), was an American attorney, abolitionist, and second in command to John Brown in Brown's failed raid on Harper's Ferry. He bore the title of \"Secretary of War\" in Brown's \"provisional government.\" At age 24, Kagi was killed during the raid.[1] He had previously been active in fighting on the abolitionist side in 1856 in \"Bleeding Kansas\". He was an excellent debater and speaker.[2]\nJohn Henry Kagi was born in Bristolville, Ohio, in 1835, the second child of blacksmith Abraham Neff Kagy (as spelled on his gravestone) and Anna Fansler, who were of Swiss descent. John Henry Kagi adopted the Swiss spelling of the family name.\nThough largely self-taught, he was the best educated of Brown's raiders. He was a stenographer, at the time a useful skill for a reporter. He was Associate Editor of the Topeka Tribune and the Kansas correspondent of the New York Post[3] and the abolitionist National Era;[4] his contributions are signed \"K.\"[5] He was the  \"western correspondant\" of the New York Tribune, and writings of his are found in several other newspapers.[6]\n",
        "type": []
    },
    "70": {
        "link": "/wiki/Quantrill%27s_Raiders",
        "title": "Quantrill's Raiders",
        "date": "",
        "year": "new 1863",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "Quantrill's Raiders were the best-known of the pro-Confederate partisan guerrillas (also known as \"bushwhackers\") who fought in the American Civil War. Their leader was William Quantrill and they included Jesse James and his brother Frank.\nEarly in the war Missouri and Kansas were nominally under Union government control and became subject to widespread violence as groups of Confederate bushwhackers and anti-slavery Jayhawkers competed for control. The town of Lawrence, Kansas, a center of anti-slavery sentiment, had outlawed Quantrill's men and jailed some of their young women. In August 1863, Quantrill led an attack on the town, killing more than 180 civilians, supposedly in retaliation for the casualties caused when the women's jail collapsed.\nThe Confederate government, which had granted Quantrill a field commission under the Partisan Ranger Act, was outraged and withdrew support for such irregular forces. By 1864 Quantrill had lost control of the group, which split up into small bands. Some, including Quantrill, were killed in various engagements. Others lived on to hold reunions many years later, when the name Quantrill's Raiders began to be used. The James brothers formed their own gang and conducted robberies for years as a continuing insurgency in the region.\n",
        "type": [
            "robberies",
            "robber",
            "killing"
        ]
    },
    "71": {
        "link": "/wiki/Herman_Hill_riot",
        "title": "Herman Hill riot",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "The 1979 Easter Sunday Herman Hill riot in Wichita, Kansas, United States – a confrontation between 500 law-enforcement personnel (from Wichita and surrounding jurisdictions) and the 3,500 attendees at a rock concert in Herman Hill Park – was one of the largest riots in the history of Wichita, drawing national attention and creating political and legal controversy.[1][2]\nThe event resulted in over 50 injuries, to more than two dozen police officers and dozens of civilians, and over 80 arrests. Tear gas was used and firearms were discharged. The event triggered extensive local, state and national attention, including investigations by authorities at all those levels, and raised major questions about the conduct of law enforcement in the Wichita area.[1][2]\nThe Herman Hill riot was a riot that took place in Wichita, Kansas, between the audience at a local rock concert in Herman Hill Park and the police on April 15, 1979 (Easter Sunday). Reports[which?] stated that 53 people were injured during the riot.\n",
        "type": [
            "riot"
        ]
    },
    "72": {
        "link": "/wiki/Operation_Rescue_(Kansas)",
        "title": "Operation Rescue (Kansas)",
        "date": "",
        "year": "",
        "location": "Wichita, Kansas, United States",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nOperation Rescue (formerly Operation Rescue West or California Operation Rescue), the operating name of Youth Ministries Inc., is an anti-abortion organization in the United States.[1] The organization originated in California and is now based in Kansas.\nOperation Rescue West was founded by Operation Rescue's tactical director, Jeff White, as a branch of Randall Terry's original Operation Rescue organization. Under White, Operation Rescue West maintained its focus on abortion. White aborted leadership in 1999 following an $880,000 judgment against Operation Rescue for harassment and intimidation of Planned Parenthood staff and its leadership to Troy Newman. In 2002, Newman moved the headquarters to Wichita, Kansas,[2] to focus its efforts on late-term abortion provider George Tiller, who was assassinated in 2009. Their headquarters is located in a former abortion clinic which closed due to harassment by Operation Rescue and was purchased by Newman through a front group.[3]\n",
        "type": []
    },
    "73": {
        "link": "/wiki/Lawrence,_Kansas",
        "title": "Lawrence, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "\nLawrence is the county seat of Douglas County, Kansas, United States,[4] and the sixth-largest city in the state. It is in the northeastern sector of the state, astride Interstate 70, between the Kansas and Wakarusa Rivers. As of the 2020 census, the population of the city was 94,934.[9][10]  Lawrence is a college town and the home to both the University of Kansas and Haskell Indian Nations University.\nLawrence was founded by the New England Emigrant Aid Company (NEEAC) and was named for Amos A. Lawrence, an abolitionist from Massachusetts, who offered financial aid and support for the settlement.[12] Lawrence was central to the \"Bleeding Kansas\" period (1854–1861), and the site of the Wakarusa War (1855) and the Sacking of Lawrence (1856). During the American Civil War it was also the site of the Lawrence massacre (1863).\n",
        "type": []
    },
    "74": {
        "link": "/wiki/Nathaniel_Lyon",
        "title": "Nathaniel Lyon",
        "date": "August 10, 1861(1861-08-10) (aged 43) Battlefield, Missouri",
        "year": "1861",
        "location": "",
        "state": "Kansas",
        "place": "Battlefield",
        "county": "Douglas County",
        "paragraph": "Mexican–American War\nIndian Wars\nBleeding Kansas\n",
        "type": []
    },
    "75": {
        "link": "/wiki/Free-Stater_(Kansas)",
        "title": "Free-Stater (Kansas)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Holton",
        "county": "Jackson County",
        "paragraph": "Free-Staters was the name given to settlers in Kansas Territory during the \"Bleeding Kansas\" period in the 1850s who opposed the expansion of slavery. The name derives from the term \"free state\", that is, a U.S. state without slavery. Many of the \"free-staters\" joined the Jayhawkers in their fight against slavery and to make Kansas a free state.\nMany Free-Staters were abolitionists from New England, in part because there was an organized emigration of settlers to Kansas Territory arranged by the New England Emigrant Aid Company beginning in 1854.  Other Free-Staters were abolitionists who came to Kansas Territory from Ohio, Iowa, and other midwestern states.  Holton, Kansas was named for the Milwaukee, Wisconsin free-stater Edward Dwight Holton.[1]\nWhat united the Free-Staters was a desire to defeat the southern, pro-slavery settlers in Kansas Territory on the question of whether Kansas would be admitted to the Union as a slave state. (The Kansas–Nebraska Act of 1854 had left the question open to the settlers in the territory.)[2][3] Bastions for the free-state movement in Kansas included major towns and cities like Lawrence, Eudora, Baldwin City, Osawatomie, Ozawkie, Burlingame, Mound City and Topeka, among others.[4][5]\nAs time passed and the violence in Bleeding Kansas escalated, the Free-State movement became more popular. In 1858, the Free-Staters proposed a second constitution, the Leavenworth Constitution, which banned slavery and also would have given the right to vote to black men, though this constitution also failed because the US Senate did not ratify it.[6][7] Kansas became a state January 29, 1861 after a free state constitution (from a conference in Wyandotte in 1859) was adopted.[7] The Confederate States of America seceded in the next month and Jefferson Davis was sworn in as their president February 18, 1861.\n",
        "type": []
    },
    "76": {
        "link": "/wiki/Samuel_Walker_(soldier)",
        "title": "Samuel Walker (soldier)",
        "date": "February 6, 1893(1893-02-06) (aged 70) Lawrence, Kansas",
        "year": "1893",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "American Civil War\nAmerican Indian Wars\nSamuel Walker (October 19, 1822 – February 6, 1893) was an American soldier, lawman and politician who settled in Lawrence, Kansas and served as an officer during Bleeding Kansas and the American Civil War.\n",
        "type": []
    },
    "77": {
        "link": "/wiki/Robert_S._Kelley",
        "title": "Robert S. Kelley",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Newport",
        "county": "Reno County",
        "paragraph": "For a list of other people named Robert Kelley see Robert Kelley (disambiguation)\nRobert S. Kelley was a pro-slavery advocate during the Kansas-Missouri border war, a state senator in Kansas during the government formed under the Lecompton Constitution, and served as the fifth U.S. marshal of the Montana Territory.[1]\nKelley was born in Fredericksburg, Virginia, January 11, 1831. At the age of ten years he was sent to Newport, New Hampshire, to attend a preparatory school before entering Dartmouth College. Disliking the rigid discipline enforced at the preparatory school, he ran away. He had no money nor acquaintance in New Hampshire, but managed to reach Lowell, Massachusetts, where he went to work on the Advertiser.  Knowing that if discovered by his parents he would be obliged to return to the preparatory school, he did not communicate with them for a period of five years, during which time he remained steadily at his post at the Advertiser, learning all the details of the printing business. When he learned that his family had moved to Missouri, he joined them there in 1848, and for four years was employed as salesman in a mercantile house.\nIn 1852 Kelley started a Democratic newspaper at Liberty, Missouri, called the Democratic Platform, and continued its publication until the passage of the Kansas-Nebraska Act, when he discontinued the Platform and established a pro-slavery paper in Atchison, Kansas, called the Squatter Sovereign. Dr. J. H. Stringfellow joined Kelley in this venture as partner and associate editor. This was in 1855, during the intense excitement attending the settlement of Kansas and Nebraska. The paper was the leading organ of the Democratic party in Kansas, and was strongly pro-Southern and pro-slavery. Concerning his experience at the time, Kelley said: \"There was no such thing as concession at the time. We were all extremists, whether advocating or opposing slavery. During my editorial life I was in constant strife with political opponents.\"\n",
        "type": []
    },
    "78": {
        "link": "/wiki/Lawrence_Berry_Washington",
        "title": "Lawrence Berry Washington",
        "date": "September 21, 1856(1856-09-21) (aged 44) Missouri River near Rocheport, Missouri, United States",
        "year": "1856",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nLawrence Berry Washington (November 26, 1811 – September 21, 1856) was an American lawyer, military officer, author, Forty-niner, border ruffian, and a member of the Washington family. Washington was born on his family's Cedar Lawn plantation near Charles Town, Virginia (present-day West Virginia) and was the eldest of 13 children. He practiced law, then served as a second lieutenant in the Virginia Volunteers during the Mexican–American War. During his service in the war, Washington reportedly wore the sword of his great-granduncle George Washington.\nFollowing the Mexican–American War, Washington traveled to California in 1849 as a Forty-niner in the California Gold Rush and authored the novel, A Tale to be Told Some Fifty Years Hence. Washington then relocated east to Missouri in the 1850s, where he remained for a few years and fought as a Border Ruffian during the Bleeding Kansas confrontations over slavery along the border between Kansas Territory and Missouri. While under the command of Captain Henry Clay Pate, Washington was present at the June 1856 Free-Stater attack known as Battle of Black Jack, where he sustained minor injuries. Washington died by drowning after falling overboard from a steamboat on the Missouri River in September 1856. His family's descendants claim Washington was murdered by Jayhawkers.\n",
        "type": [
            "murder"
        ]
    },
    "79": {
        "link": "/wiki/Centropolis,_Kansas",
        "title": "Centropolis, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Franklin County",
        "county": "Franklin County",
        "paragraph": "Centropolis is an unincorporated community in Franklin County, Kansas, United States.[1]  As of the 2020 census, the population of the community and nearby areas was 100.[2]  It is located about 11 miles northwest of Ottawa.  In the 1850s, Centropolis had the distinction of briefly vying for territorial capital of Kansas.\nThe area was first settled by Perry Fuller in 1855 who established a store in order to trade with the nearby Ottawa Indians. His store prospered and in 1856 he established the Centropolis Town Company and began selling lots.[3]  The community name is a portmanteau of central and metropolis. A missionary newspaper published by Jotham Meeker for the Ottawa Baptist Mission was the first newspaper in Franklin County. The first commercial newspaper in the County, the Kansas Leader, was founded in 1857[citation needed]. Not only did Fuller expect his new town to become county seat but also the territorial capital of Kansas and eventually state capital.[4]\nJust a couple miles east of Centropolis, St. Bernard was established and the Territorial Legislature made St. Bernard the Franklin County seat[5] but despite having the county seat, St. Bernard did not grow and post office was closed and renamed Minneola.\n",
        "type": []
    },
    "80": {
        "link": "/wiki/Topeka,_Kansas",
        "title": "Topeka, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Topeka",
        "county": "Shawnee County",
        "paragraph": "Topeka (/təˈpiːkə/ tə-PEE-kə;[9][10] Kansa: tó ppí kʼé; Iowa-Oto: Dópikˀe or Dópiúkˀe[11]) is the capital city of the U.S. state of Kansas and the seat of Shawnee County.[1]  It is along the Kansas River in the central part of Shawnee County, in northeast Kansas, in the Central United States.  As of the 2020 census, the population of the city was 126,587.[5][6]  The Topeka metropolitan statistical area, which includes Shawnee, Jackson, Jefferson, Osage, and Wabaunsee Counties, had a population of 233,870 in the 2010 census.\nThe name \"Topeka\" is a Kansa-Osage word that means \"place where we dig potatoes\",[12] or \"a good place to dig potatoes\".[13] As a placename, Topeka was first recorded in 1826 as the Kansa name for what is now called the Kansas River. Topeka's founders chose the name in 1855 because it \"was novel, of Indian origin, and euphonious of sound.\"[14][15]  Mixed-blood Kansa Native American, Joseph James, called Jojim, is credited with suggesting Topeka's name.[16] The city, laid out in 1854, was one of the Free-State towns founded by Eastern antislavery men immediately after the passage of the Kansas–Nebraska Bill. In 1857, Topeka was chartered as a city.\nThe city is well known for the landmark U.S. Supreme Court case Brown v. Board of Education of Topeka, which overturned Plessy vs. Ferguson and declared racial segregation in public schools to be unconstitutional.[17]\n",
        "type": []
    },
    "81": {
        "link": "/wiki/Clutter_family_murders",
        "title": "Clutter family murders",
        "date": "November 15, 1959 (1959-11-15)",
        "year": "1959",
        "location": "Holcomb, Kansas, United States",
        "state": "Kansas",
        "place": "Holcomb",
        "county": "Finney County",
        "paragraph": "\nIn the early morning hours of November 15, 1959, four members of the Clutter family – Herb Clutter, his wife Bonnie, and their teenage children Nancy and Kenyon – were murdered in their rural home, just outside the small farming community of Holcomb, Kansas. Two ex-convicts, Perry Smith and Richard Hickock, were found guilty of the murders and sentenced to death. Smith and Hickock were executed by the state of Kansas on the same day, April 14, 1965. The murders were detailed by Truman Capote in his 1966 non-fiction novel In Cold Blood.[1][2]\nHerbert \"Herb\" Clutter was a prosperous farmer in western Kansas. His two elder daughters, Eveanna and Beverly, had moved out and started their adult lives. His two younger children, Nancy (age 16) and Kenyon (age 15), were high school students. Clutter's wife Bonnie had reportedly been incapacitated by clinical depression and physical ailments since the births of her children, although this was later disputed.[3] Both Nancy and Kenyon Clutter attended Holcomb High School.[4][5]\n",
        "type": [
            "murder",
            "mass murder"
        ]
    },
    "82": {
        "link": "/wiki/Mount_Oread",
        "title": "Mount Oread",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "Mount Oread /ˈɔːri.æd/ is a hill in Lawrence, Kansas upon which the University of Kansas, and parts of the city of Lawrence, Kansas are located.[1] It sits on the water divide between the Kansas River and the Wakarusa River rivers.  It was named after the long defunct Oread Institute in Worcester, Massachusetts, where many of the settlers of Lawrence moved from prior to the American Civil War.  The hill was originally called Hogback Ridge by many Lawrence residents until the Oread name was adopted in 1864, two years after the university was founded.[2]\nFor settlers going westward by wagon train on the Oregon Trail, \"The Hill\", as Mount Oread is now commonly referred to by Kansans, was the next big topographical challenge after crossing the Wakarusa River, which is today located two miles south of the city of Lawrence.\nJames Lane and Governor Charles Robinson erected a fort on the hill in the 1850s, during the Bleeding Kansas conflict in order to protect Lawrence. A 1857 Harper's Weekly report deemed the fort to be valueless as a military work. Governor Robinson's first home in Lawrence would be built on the hill, which was burned down on May 21st, 1855 by pro-slavery border ruffians.[3]\n",
        "type": []
    },
    "83": {
        "link": "/wiki/The_Stubbs",
        "title": "The Stubbs",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "The Stubbs (founded as the Kansas Rifles No. 1) were a Free-Stater militia group active in Kansas, United States during the Bleeding Kansas era. They fought in the Battle of Franklin and the capture of Fort Saunders. Along with their duties as a military defense force, the Stubbs also operated as a policing force, arresting criminals. The Stubbs had a membership of 60 on their absorption into the Union Army.\nThe Stubbs also took on the title of the Oread Guards after the Oread Institute donated waterproof coats.[1][2]\nFounded as the Kansas Rifles No. 1 on 16 April 1855, the Lawrence-based militia consisted of two companies each approximately 50 soldiers in size. Armed with Sharps rifles and Colt revolvers, the militia was organized for the purpose of defending Free State voters and to defend Lawrence from pro-slavery forces. To accomplish this, they drilled daily.[3] They were officially granted a charter and reorganized as the Stubbs on 9 February 1858,[4] a nickname they had accrued because of some members' short stature.[3]\n",
        "type": []
    },
    "84": {
        "link": "/wiki/The_Kelly_Family_(serial_killers)",
        "title": "The Kelly Family (serial killers)",
        "date": "January 4 1888South Texas, United States",
        "year": "1888",
        "location": "",
        "state": "Kansas",
        "place": "Beaver",
        "county": "Barton County",
        "paragraph": "The Kelly Family was a family of serial killers who operated near a Kansas town called Oak City between August and December 1887. The family consisted of William Kelly (55); his wife Kate; his son Bill, also called 'Billy' (20) and daughter, Kit (18). Originally from Pennsylvania, the family is believed to have murdered 11 wealthy travelers, akin to the Bloody Benders a decade earlier.[1]\nVigilantes hunted down and killed the fleeing family in order to make an example of them. William confessed to all of the family's crimes before being hanged from a tree.[1]\nAccording to 55-year-old William Kelly's confession, he and his family moved from the Pennsylvania mountains to Kansas in 1869. They moved around to different places along the southern border until eventually settling in No Man's Land, around 25 miles away from Beaver, Oklahoma. Initially dealing with cattle, the Kellys soon opened a tavern, where they housed fellow cattlers and travelers.[1] Although illiterate, they were regarded as an ordinary working family, with nobody harboring any suspicion towards them.[2]\n",
        "type": [
            "murder"
        ]
    },
    "85": {
        "link": "/wiki/Kansas_State_Guard",
        "title": "Kansas State Guard",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "The Kansas State Guard was the official state defense force of the state of Kansas during each of the world wars. The unit was first created during World War I, and was later reactivated during World War II. When the Kansas National Guard was federalized and deployed during each of the world wars, the state of Kansas was forced to raise and maintain its own military force in order to protect against saboteurs, quell riots, and perform other duties which would normally fall to the National Guard. Unlike the National Guard, which could be federalized and deployed abroad, the State Guard was funded and equipped solely by the state and as such was immune to deployment. The Kansas State Guard is authorized under Kansas law.[1] In 2007, the Kansas Legislature considered a bill which would create a modern Kansas State Defense Force.[2] The bill did not pass.\nPrior to the Militia Act of 1903, which reorganized state militias into the National Guard of the United States, each state maintained its own militia, which could be used to supplement the full-time military in times of war.\nAfter Kansas was opened for settlement in 1854, conflict broke out between pro-slavery and anti-slavery factions. The first official militia of Kansas was created to pursue a band of men, who had broken an anti-slavery suspect out of a pro-slavery sheriff's custody into the town of Lawrence, Kansas. The sheriff informed the governor that the town of Lawrence, by refusing to turn over the suspects, was in a state of insurrection. The militia, however, was largely composed of men from Missouri from the pro-slavery faction. Anti-slavery activists, fearing the Missourians would use this government order as an excuse to destroy the largely anti-slavery town, formed their own militias and fortified the town. What would become known as the Wakarusa War, the bloodless siege ended when the governor arrived and a treaty between the factions was negotiated, and the Missouri militia was disbanded and returned home.[3]\n",
        "type": [
            "riot"
        ]
    },
    "86": {
        "link": "/wiki/Caning_of_Charles_Sumner",
        "title": "Caning of Charles Sumner",
        "date": "May 22, 1856; 166 years ago (1856-05-22)",
        "year": "1856",
        "location": "United States Senate chamber, United States Capitol, Washington, D.C.",
        "state": "Kansas",
        "place": "Capitol",
        "county": "Shawnee County",
        "paragraph": "The Caning of Charles Sumner, or the Brooks–Sumner Affair, occurred on May 22, 1856, in the United States Senate chamber, when Representative Preston Brooks, a pro-slavery Democrat from South Carolina, used a walking cane to attack Senator Charles Sumner, an abolitionist Republican from Massachusetts. The attack was in retaliation for a speech given by Sumner two days earlier in which he fiercely criticized slaveholders, including pro-slavery South Carolina Senator Andrew Butler, a relative of Brooks. The beating nearly killed Sumner and contributed significantly to the country's polarization over the issue of slavery. It has been considered symbolic of the \"breakdown of reasoned discourse\"[1] and the use of violence that eventually led to the Civil War.\nAlthough Sumner was unable to return to the Senate until December 1859,[2] the Massachusetts legislature refused to replace him, leaving his empty desk in the Senate as a public reminder of the attack.\nIn 1856, during the \"Bleeding Kansas\" crisis, Sumner denounced the Kansas–Nebraska Act in his \"Crime against Kansas\" speech, delivered on May 19 and May 20. The long speech argued for the immediate admission of Kansas as a free state and went on to denounce the \"Slave Power\"—the political arm of the slave owners:\n",
        "type": []
    },
    "87": {
        "link": "/wiki/Border_ruffian",
        "title": "Border ruffian",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nBorder ruffians were proslavery raiders, crossing from the slave state of Missouri into the Kansas Territory, to help ensure Kansas entered the Union as a slave state. They were a key part of the violent period called Bleeding Kansas, that peaked from 1854 to 1858. Their crimes included fraudulent voting (falsely saying they were residents of Kansas), interference with elections, and raiding, intimidating, and destroying property of \"Free-State\" (anti-slavery) settlers. Some took pride in their criminal reputation. Many became pro-Confederate guerrillas, or bushwhackers.\nThe 1913 edition of Webster's Dictionary reflects the 19th century understanding of the word wikt:ruffian as a \"scoundrel, rascal, or unprincipled, deceitful, brutal and unreliable person\".\n",
        "type": []
    },
    "88": {
        "link": "/wiki/Watson_Brown_(abolitionist)",
        "title": "Watson Brown (abolitionist)",
        "date": "",
        "year": "new 1856",
        "location": "",
        "state": "Kansas",
        "place": "North Elba",
        "county": "Wyandotte County",
        "paragraph": "Watson Brown (October 7, 1835 – October 19, 1859) was a son of the abolitionist John Brown and his second wife Mary Day Brown, born in Franklin Mills, Ohio (today Kent, Ohio).[1] He was married to Isabell \"Belle\" Thompson Brown,[2] and they had a son Frederick W., who died of diphtheria at age 4, and is buried in North Elba.\nWatson was the one Brown boy who did not go to Kansas In the 1850s, part of his father's efforts to prevent Kansas from becoming a slave state. In 1856 he wrote his mother from Iowa.[3]\nHe participated in his father's famous raid on Harpers Ferry, Virginia (since 1863, West Virginia), sending letters to his wife Belle from the Kennedy farmhouse.[4]: 542–543, 549  He was killed during the fighting. The circumstances were that he emerged from the engine house at 10 AM on Monday the 17th, carrying a white flag, but was immediately shot, not by a soldier but by a townsperson. At 3 PM he was still able to fight. Lying on the ground and with no medical treatment, he lived on in great agony, his father preventing him from killing himself to end the pain,[5] until about 3 AM on Wednesday the 19th, according to \nEdwin Coppock.[6][7] According to his father, \"our poor Watson lingered until Wednesday about noon of the 19th of October.\"[8]\n",
        "type": [
            "killing"
        ]
    },
    "89": {
        "link": "/wiki/Frazier_Glenn_Miller_Jr.",
        "title": "Frazier Glenn Miller Jr.",
        "date": "April 13, 2014",
        "year": "2014",
        "location": "",
        "state": "Kansas",
        "place": "Overland Park",
        "county": "Johnson County",
        "paragraph": "\nFrazier Glenn Miller Jr. (November 23, 1940 – May 3, 2021), commonly known as Glenn Miller or Frazier Glenn Cross,[2] was an American domestic terrorist[3] and leader of the defunct North Carolina-based White Patriot Party (formerly known as the Carolina Knights of the Ku Klux Klan). Convicted of murder as well as criminal charges related to weapons, and the violation of an injunction against paramilitary activity, Miller was a perennial candidate for public office.[4] He was an advocate of white nationalism, white separatism, racist Odinism,[5] and antisemitism.[6]\nOn April 13, 2014, Miller was arrested following the Overland Park Jewish Community Center shooting in Overland Park, Kansas.[7] Johnson County prosecutors initially charged him with one count of capital murder and one count of first-degree murder.[8] On October 17, 2014, the separate charge for first-degree murder was dismissed and all three deaths were included in a single capital murder count. Miller was also charged with three counts of attempted first-degree murder for allegedly shooting at three other people. On December 18, 2014, he was found competent to stand trial, and prosecutors announced they were seeking the death penalty against him.[9]\n",
        "type": [
            "murder",
            "shooting",
            "terrorist",
            "riot"
        ]
    },
    "90": {
        "link": "/wiki/John_Brown_Museum_(Osawatomie,_Kansas)",
        "title": "John Brown Museum (Osawatomie, Kansas)",
        "date": "",
        "year": "new 1808",
        "location": "John Brown Memorial Park, Osawatomie, Kansas",
        "state": "Kansas",
        "place": "Osawatomie",
        "county": "Miami County",
        "paragraph": "The John Brown Museum, also known as the John Brown Museum State Historic Site and John Brown Cabin, is located in Osawatomie, Kansas.  The site is operated by the Kansas Historical Society, and includes the log cabin of Reverend Samuel Adair and his wife, Florella, who was the half-sister of the abolitionist John Brown. Brown lived in the cabin during the twenty months he spent in Kansas and conducted many of his abolitionist activities from there.[2][3] The museum's displays tell the story of John Brown, the Adairs and local abolitionists, and include the original cabin, Adair family furnishings and belongings, and Civil War artifacts.\nWhen Kansas Territory was established in 1854, newspapers in the North encouraged settlement in the area to ensure that the new state would be free. The land also offered promise to families—the opportunity to cultivate fertile land, enjoy the peaceful countryside, and protect the territory from the spread of slavery.\nSamuel and Florella Brown Adair held such a dream. Florella's father, Owen Brown, was also the father of the abolitionist John Brown. Owen, a strict Calvinist, was a trustee at Oberlin College. John Brown's mother, Ruth Mills Brown, died in 1808, and Owen married Sally Root around 1811. Their children included Florella.\n",
        "type": [
            "new murder"
        ]
    },
    "91": {
        "link": "/wiki/Andrew_Thomas_Finch",
        "title": "2017 Wichita swatting",
        "date": "December 28, 2017 (2017-12-28)",
        "year": "2017",
        "location": "Wichita, Kansas, United States",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nViner\nOn December 28, 2017, a fatal swatting incident occurred in Wichita, Kansas, United States. During an online dispute between Casey Viner and Shane Gaskill, regarding the video game Call of Duty: WWII, Viner threatened to have Gaskill swatted. Gaskill responded by giving him a false address for his residence, one that was occupied by an uninvolved person, Andrew Finch. Viner then asked Tyler Barriss to make the required fraudulent call to initiate the swatting. Wichita Police responded to the address, and as Finch was exiting his house, police officer Justin Rapp fatally shot him.\n",
        "type": [
            "killing"
        ]
    },
    "92": {
        "link": "/wiki/Ed_Masterson",
        "title": "Ed Masterson",
        "date": "April 9, 1878(1878-04-09) (aged 25) Dodge City, Ford County, Kansas, USA",
        "year": "1878",
        "location": "",
        "state": "Kansas",
        "place": "Dodge City",
        "county": "Ford County",
        "paragraph": "Edward John \"Ed\" Masterson (September 22, 1852 – April 9, 1878) was a lawman and the oldest brother of the American West gunfighters Bat Masterson and James Masterson.\nOf Irish descent, Edward John Masterson was born in Henryville in Canada East. In the early 1850s, his family moved to the area about Wichita, Kansas.\nPrior to beginning his lawman career, he and his two brothers worked as buffalo hunters. During his service as deputy marshal and then marshal of Dodge City, Kansas, Ed Masterson was shot twice. The first incident occurred in November 1877, when he was shot in the breast by Bob Shaw in the Lone Star Dance Hall. Although his right arm was paralyzed, Ed switched his gun to his left hand and shot Shaw in the arm and leg. After Masterson's recovery, he replaced Larry Deger as the town marshal. It is commonly believed that he replaced lawman Wyatt Earp, but it was actually Deger. On March 15, 1878, Masterson assisted his brother Bat Masterson, who was the Ford County sheriff at that time, and lawman Charlie Bassett in the capture of two train robbery suspects.[1]\n",
        "type": [
            "robber",
            "robbery"
        ]
    },
    "93": {
        "link": "/wiki/Harold_R._Fatzer",
        "title": "Harold R. Fatzer",
        "date": "",
        "year": "new 1934",
        "location": "",
        "state": "Kansas",
        "place": "Fellsburg",
        "county": "Edwards County",
        "paragraph": "Harold R. Fatzer (August 3, 1913 – September 30, 1989) was an American jurist. He was a justice of the Kansas Supreme Court from March 1, 1956, to September 1, 1971, then served as chief justice from September 1, 1971, to September 19, 1977.[1][2][3] When he retired he was succeeded as chief justice by Alfred G. Schroeder and Kay McFarland was appointed to fill the remaining place.[4]\nHe was born in Fellsburg, Kansas, to John R. and Rella Shannon Fatzer, and had a sister, Helen.[5] He achieved his law degree in 1933 from Washburn University School of Law[5] He was named assistant state attourney general in May 1943, then volunteered for the United States Army in September of that year and served in World War II until November 1945.[5] He was married March 21, 1934 to Frances Schwaup, and they had a son John R. Fatzer.[5]\nHe died by shooting himself in the head, and was found on September 30, 1989, in his Topeka home. He left no note, but was thought to have been depressed over health issues, having heart disease and suspected lung malignancy.[5][6][1]\n",
        "type": [
            "shooting"
        ]
    },
    "94": {
        "link": "/wiki/Topeka_Constitution",
        "title": "Topeka Constitution",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Topeka",
        "county": "Shawnee County",
        "paragraph": "The Topeka Constitutional Convention met from October 23 to November 11, 1855 in Topeka, Kansas Territory, in a building afterwards called Constitution Hall. It drafted the Topeka Constitution, which banned slavery in Kansas, though it would also have prevented free Blacks from living in Kansas. The convention was organized by Free-Staters to counter the pro-slavery Territorial Legislature elected March 5, 1855, in polling tainted significantly by electoral fraud and the intimidation of Free State voters.\nThe Topeka Constitution marked the first effort to form a Kansas governmental structure and define its basis in law. Free-State delegates passed the constitution on December 15, 1855. The -wide election for officers and approval of the constitution on January 15, 1856, was boycotted by most pro-slavery men. Among those elected was Charles L. Robinson as governor. The constitution was forwarded to Washington with a plea to the U.S. Congress for admitting Kansas as a free state, under this constitution. President Pierce, anxious to placate Southerners and keep them in the Union, condemned the document. It was presented in the Senate by Senator Lewis Cass of Michigan and in the House by Representative Daniel of Indiana. It passed the House by two votes on July 2, but was held in committee by the Senate. On July 8, Senator Stephen A. Douglas took up the Topeka Constitution in a bill counter to Senator Cass, which threw the issue back upon the people of Kansas in accordance with the provisions of the Kansas-Nebraska Act.\nFollowing the model of Oregon, citizens of the 2nd Territorial District petitioned the 1855 Free State convention to incorporate a \"black exclusion\" clause in the Topeka Constitution. This would have prevented not only the enslaved, but also free African Americans from residing in the state. It was rejected by convention president James H. Lane and others, who allowed the issue to be voted on separately in the January 1856 referendum; the results favored exclusion.\n",
        "type": []
    },
    "95": {
        "link": "/wiki/Constitution_Hall_(Topeka,_Kansas)",
        "title": "Constitution Hall (Topeka, Kansas)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Topeka",
        "county": "Shawnee County",
        "paragraph": "Constitution Hall, in Topeka, Kansas, is a significant building in the history of Kansas Territory and the state of Kansas.  The two-story native stone building, with basement, was begun by Loring and John Farnsworth in the spring of 1855. By summer, the Topeka Town Association had agreed to complete the building in exchange for holding the Topeka Constitutional Convention there in the fall. From October 23 to November 11, 1855, the Topeka Constitutional Convention met in the building and produced the antislavery Topeka Constitution.\nThe proposed Topeka Constitution would have brought Kansas into the Union as a free state. The United States House of Representatives approved this constitution in July 1856, but the Southern-dominated Senate failed to fully consider the document. Parts of the Topeka Constitution were incorporated in the Constitution of Kansas (the Wyandotte Constitution) drafted in 1859.[1][2][3]\nConstitution Hall became the Free State, Kansas Territorial era capitol. The Topeka Legislature that occupied the building drew the wrath of Southerners in Congress.  On July 4, 1856, President Franklin Pierce allowed federal troops led by Col. Edwin V. Sumner to disperse the Topeka Legislature. [4][5]\n",
        "type": []
    },
    "96": {
        "link": "/wiki/Camp_Sacket",
        "title": "Camp Sacket",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lecompton",
        "county": "Douglas County",
        "paragraph": "Camp Sacket, sometimes spelled Camp Sackett, was a field post southeast of Lecompton, Kansas, that moved a number of times for various reasons. It was established probably in May 1856 or possibly a bit earlier. It was named for Capt. Delos B. Sackett (or Sacket), who was stationed there during part of the post's existence. Sacket served in the American Civil War and was with the U.S. Army until 1881, when he retired as a brigadier general.[1]\nDuring much of its existence, Camp Sacket was near a high hill that was used as a lookout post. At least five officers stationed at the camp became well known in the upcoming Civil War. They were Maj. John Sedgwick, Lieut. J.E.B. Stuart, Lieut. Col. Joseph E. Johnston, Col. Edwin V. Sumner and Lieut. Col. Philip St. George Cooke.[2]\nCamp Sacket was established to provide some aid to the government of Kansas Territory, in Lecompton. This government was the legal government, but was sympathetic to the southern cause in Kansas. Charles L. Robinson was the governor of the government loyal to the northern (free-state) cause. Robinson's government was not recognized by the Federal government. The troops at Camp Sacket were supplied by Fort Leavenworth and did their best to maintain a neutral stance between the two sides. Both sides accused the Army of favoring the opposing side.[3]\n",
        "type": []
    },
    "97": {
        "link": "/wiki/Charles_W._Dow",
        "title": "Charles W. Dow",
        "date": "",
        "year": "new 1855",
        "location": "",
        "state": "Kansas",
        "place": "Douglas County",
        "county": "Douglas County",
        "paragraph": "Charles W. Dow (died November 21, 1855)[n 1] was an early settler of the Kansas Territory who became the first American settler killed in Kansas after being shot by Franklin Coleman in 1855, an event which historians often consider the beginning of the violence of Bleeding Kansas.\nCharles Dow along with his father Ladd, came to Kansas in 1855 from Ohio and settled in the Hickory Point (now Stony Point) area of Douglas County. Dow, a free stater, was shot by Franklin Coleman over a land dispute and was killed immediately.[1][2][3] Coleman initially blamed Jacob Branson, a friend of Dow's, for the killing. Dow was initially buried on his land but was later moved to Baldwin City's Oakwood Cemetery along with his father who was originally buried in Stony Point Cemetery.[4]\nThe shooting of Dow triggered a series of confrontations that later led to the Sacking of Lawrence, the Wakarusa War, the Pottawatomie massacre, and the Battle of Black Jack. Coleman was one of the men taken captive during the Battle of Black Jack in 1856 and was linked to another killing of a Free-Stater that year.[5] The Dow Cemetery was used until 1873, when Stony Point Cemetery was founded, and is estimated to contain 75 burials. The cemetery is nearly lost now but a sign erected by the local Santa Fe Trail Historical Society marks the location.\n",
        "type": [
            "shooting",
            "killing"
        ]
    },
    "98": {
        "link": "/wiki/New_Georgia%27s_fort",
        "title": "New Georgia's fort",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Miami County",
        "county": "Miami County",
        "paragraph": "Coordinates: 38°30′18″N 94°51′14″W﻿ / ﻿38.5050°N 94.8538°W﻿ / 38.5050; -94.8538\nNew Georgia's Fort was located in Miami County, Kansas, southeast of Osawatomie. During the partisan warfare in Kansas Territory in 1856 commonly known as Bleeding Kansas, a colony of Southerners, possibly all Georgians, established New Georgia. This colony was located on the Marias des Cygnes River. A blockhouse fort was constructed there and entrenchments were begun but the fort destroyed before the entrenchments could be completed. Northern settlers in the area claimed settlers at New Georgia harassed them. In reality, some settlers from both the North and South had groups who caused trouble with their neighbors.[1]\nAugust Bondi and Dr. Rufus Gilpatrick spied on New Georgia during two trips taken in July and August 1856. During August the Free-State Northerners decided to take action against four Southern strongholds in the area to help put an end to the pro-slavery cause in Kansas. Southern partisans wanted Kansas admitted to the Union as a slave state. From period sources, it is not completely clear how a Free-State group of men took possession of New Georgia's fort. It is known of the four forts taken, New Georgia was the first to fall.[2][3][4][5]\n",
        "type": []
    },
    "99": {
        "link": "/wiki/John_H._Stringfellow",
        "title": "John H. Stringfellow",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Atchison",
        "county": "Atchison County",
        "paragraph": "John H. Stringfellow (November 14, 1819 – July 24, 1905) was an early physician of Kansas, one of the founders of Atchison, and speaker of the house in the first territorial legislature, the pro-slavery Bogus Legislature. He was born in Culpeper County, Virginia, son of Robert Stringfellow, a farmer, veteran of the War of 1812, merchant at Raccoon Ford on the Rapidan River, and Mary Plunkett, daughter of an early industrialist in Orange County, Virginia.[1] Benjamin Franklin Stringfellow was his younger brother. He was educated at Caroline Academy, Va., Columbia University, and graduated from the medical department of the University of Pennsylvania in 1845. Soon after that he located at Carrollton, Missouri, where he married Ophelia J. Simmons, niece of Louisiana Governor John Bel Edwards.\nDuring the cholera epidemic of 1849, when every boat coming up the river unloaded cholera patients, he converted a large warehouse into a hospital and devoted three months to caring for them. In 1852 he removed to Platte City. Upon the organization of Kansas Territory in 1854 he crossed the Missouri River, selected a claim, and in connection with some friends formed a town company which laid out the town of Atchison. In 1854 he brought his family and lived in Atchison until 1858. He was the founder and editor of the pro-slavery Squatter Sovereign, the first newspaper in Atchison, and was commissioned colonel of the Third regiment of the territorial militia by Gov. Shannon. He was called to Virginia by the death of his father in 1858 and was detained there until after the opening of the Civil War. He entered the Confederate service as captain of a Virginia company, but was at once detailed as surgeon and acted in that capacity only. In 1871 he returned to Atchison and remained there until 1876. He then moved to St. Joseph, Missouri, where he died on July 24, 1905.[2]\n",
        "type": []
    },
    "100": {
        "link": "/wiki/Bobby_Greenlease",
        "title": "Kidnapping of Bobby Greenlease",
        "date": "September 28, 1953",
        "year": "1953",
        "location": "",
        "state": "Kansas",
        "place": "Kansas City",
        "county": "Wyandotte County",
        "paragraph": "\nRobert Cosgrove Greenlease Jr. (February 3, 1947 – September 28, 1953) was a six-year-old from Kansas City, Missouri, United States, who was the victim of a kidnapping and homicide on September 28, 1953. His father, Robert Cosgrove Greenlease Sr., was a multi-millionaire auto dealer, and the demanded ransom payment was the largest in American history at the time.\nGreenlease Jr.'s kidnappers, Carl Hall and Bonnie Heady, had no intention of returning him to his family, the child having been murdered before the ransom demand was even issued.[1] Both perpetrators were sentenced to death and executed in Missouri's gas chamber in December 1953. Heady was the third woman ever to be executed by U.S. federal authorities.[2]\n",
        "type": [
            "murder",
            "kidnapping"
        ]
    },
    "101": {
        "link": "/wiki/John_Ritchie_(abolitionist)",
        "title": "John Ritchie (abolitionist)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Franklin",
        "county": "Franklin County",
        "paragraph": "John Ritchie (July 17, 1817 – August 31, 1887) was an American abolitionist in Kansas who served in the Union Army during the American Civil War\nRitchie moved from Franklin, Indiana to Topeka, Kansas Territory, in early spring of 1855 in search of cheap land and to help Kansas enter the country as a \"free\" state. His wife, Mary Jane Shelledy Ritchie, was the fifth woman to settle in Topeka and their young son, Hale was the third child. As early settlers they lived in a dugout through the first winter and around 1856 had constructed and moved into a limestone house that still stands in Topeka today, located at 1116 SE Madison. He was selected to serve as a delegate in two of the four Kansas constitutional conventions: Leavenworth (1858) and Wyandotte (1859).\nRitchie was part of the Bleeding Kansas episode in history and was engaged in various acts opposing the expansion of slavery in Kansas Territory. Ritchie was a close associate and supporter of the notorious politician James H. Lane. Ritchie was associated with the \"Topeka Boys\" and operated a \"station\" on the Underground Railroad. In January 1859, Ritchie helped John Brown and eleven slaves elude federal troops and escape to Nebraska.\n",
        "type": []
    },
    "102": {
        "link": "/wiki/Emily_Sander",
        "title": "Murder of Emily Sander",
        "date": "November 24, 2007(2007-11-24) (aged 18) El Dorado, Kansas",
        "year": "2007",
        "location": "",
        "state": "Kansas",
        "place": "El Dorado",
        "county": "Butler County",
        "paragraph": "Emily Irene Sander (February 26, 1989[1] – November 24, 2007[2]) was an 18-year-old student at Butler Community College in El Dorado, Kansas, United States,[3] who was reported missing on November 23, 2007[4] and found dead six days later.[5] Her disappearance was widely covered in the mainstream news media. Israel Mireles was named as a suspect; he was arrested in Mexico[6]  and in February 2010 found guilty of her murder.[7]\n According to police, Sander and a man they identified as 24-year-old Israel Mireles were seen leaving a bar in east El Dorado on November 23, 2007. This was the last time Sander was seen alive.[8] Later, blood was discovered in Mireles' motel room next door to an Italian restaurant where he worked as a waiter[9] and Sander's car was found still parked at the bar. The rental car Mireles was driving was found abandoned on November 27 in Vernon, Texas, where he has relatives.[10]\nSix days after Sander's disappearance, on November 29, investigators found a body 50 miles (80 km) east of El Dorado,[11] later confirmed to be Sander's. An autopsy was performed, but the results and cause of death were sealed until the trial, when it was revealed that she had been stabbed multiple times and strangled to death with a telephone cord.[12]\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "103": {
        "link": "/wiki/Fort_Saunders",
        "title": "Fort Saunders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "45′11″N",
        "county": "Marshall County",
        "paragraph": "Coordinates: 37°45′11″N 100°05′00″W﻿ / ﻿37.7530°N 100.0833°W﻿ / 37.7530; -100.0833\nFort Saunders, 4 miles (6.4 km) southeast of Clinton, Kansas, and 12 miles (19 km) southwest of Lawrence, Kansas, was owned by James D. Saunders, a militia captain. What little was left of Clinton disappeared during construction of the Clinton Lake in the 1960s; only an outbuilding that was converted into a museum remains.\nFort Saunders, a solid log house of two stories, was probably constructed in or before May 1856, becoming a stronghold for southerners who settled the area. It contained port holes to allow its occupants to shoot at anyone attacking it. The house had considerable breastworks surrounding it. Situated along Washington Creek, this partisan fort was in a very hilly area. It was probably on top of a high ridge. James Saunders, according to Acting Gov. Daniel Woodson, kept a number of U.S. muskets for the defense of Douglas County inside his fortress home.[1][2][3]\n",
        "type": []
    },
    "104": {
        "link": "/wiki/George_York_and_James_Latham",
        "title": "George York and James Latham",
        "date": "George YorkApril 22, 1965 (aged 22) Kansas State Penitentiary, Lansing, Kansas, U.S.James LathamApril 22, 1965 (aged 23) Kansas State Penitentiary, Lansing, Kansas, U.S.",
        "year": "1965",
        "location": "",
        "state": "Kansas",
        "place": "Lansing",
        "county": "Leavenworth County",
        "paragraph": "George Ronald York (February 6, 1943 – June 22, 1965) and James Douglas Latham (April 21, 1942 – June 22, 1965) were an American spree killer duo who are the most recent people to be legally executed by the U.S. state of Kansas.\nIn late 1959, York and Latham met at Fort Hood, Texas, where both were privates in the United States Army. Latham had come to Fort Hood from Fort Carson, Colorado, where he had undergone basic training between May and July 1959. In May 1961 York and Latham (aged 18 and 19 at the time, respectively) went AWOL and decided to travel to York's hometown of Jacksonville, Florida. On May 26, they encountered Edward J. Guidroz in Mix, Louisiana. York and Latham badly beat him and stole his truck. On May 29, they met Althea Ottavio and Patricia Hewett, visitors from Georgia, in Jacksonville, where they had spent the day, shopping. According to the Federal Bureau of Investigation, York and Latham strangled both women with their own stockings, stole their money, and dumped the car they had been driving in a ditch.[2]\nOn June 6, York and Latham attempted to rob a man in a Cadillac near Aiken, South Carolina, but the shots they fired at him missed, and their would-be victim escaped. On June 7, York and Latham murdered John Whittaker in Tullahoma, Tennessee. They took Whittaker's car and abandoned the first truck they had stolen. \n",
        "type": [
            "murder",
            "arson"
        ]
    },
    "105": {
        "link": "/wiki/Leavenworth_Constitution",
        "title": "Leavenworth Constitution",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "The Leavenworth Constitution was one of four Kansas state constitutions proposed during the era of Bleeding Kansas. It was never adopted. The Leavenworth Constitution was drafted by a convention of Free-Staters, and was the most progressive of the four proposed constitutions. The conspicuous aspects of this Constitution were a Bill of Rights that referred to \"all men\" (making no distinction between the rights of white men and Black men), the banning of slavery from the state, and a basic framework for the rights of women.\nThe constitutional convention that framed the Leavenworth Constitution was provided for by an act of the Territorial Legislature passed in February 1858, during the pendency of the Lecompton Constitution in Congress. The constitution was adopted by the convention at Leavenworth April 3, 1858, and by the people at an election held May 18, 1858.\nThe Leavenworth Constitution did not have a great impact on the history of Kansas since the US Senate did not approve of the codified laws in the written document.  The other proposed state constitutions were the Topeka Constitution (1855), the Lecompton Constitution (1857) and the Wyandotte Constitution (1859).\n",
        "type": []
    },
    "106": {
        "link": "/wiki/Lowell_Lee_Andrews",
        "title": "Lowell Lee Andrews",
        "date": "November 30, 1962(1962-11-30) (aged 22) Kansas State Penitentiary, Lansing, Kansas, U.S.",
        "year": "1962",
        "location": "",
        "state": "Kansas",
        "place": "Lansing",
        "county": "Leavenworth County",
        "paragraph": "Lowell Lee Andrews (September 21, 1940 – November 30, 1962) was a University of Kansas sophomore convicted of the murders of his parents and his sister on November 28, 1958, a crime for which he was later executed.\nAndrews, a zoology major who played bassoon in the college band, was described by his hometown newspaper as \"The Nicest Boy in Wolcott\".[1] In reality, the 18-year-old entertained fantasies of poisoning his family and moving to Chicago, Illinois to become a gangster and professional hitman.\nAndrews and his sister, Jennie Marie, were both home for the Thanksgiving holiday in 1958. Jennie Marie was watching television with her parents while Andrews was upstairs reading The Brothers Karamazov. When he finished reading the novel, Andrews shaved, put on a suit, and went downstairs carrying a .22 caliber rifle and a revolver. Walking into the room where his parents and sister were, Andrews turned on a light and opened fire with his rifle. He shot his sister, Jennie Marie, 20, between the eyes. He then turned the gun on his parents, shooting his father, William, 50, twice and mother, Opal, 42, three times. His mother moved towards him and he shot her another three times. His father attempted to crawl to the kitchen and was shot repeatedly with the revolver. Andrews fired a total of 17 shots into his father.\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "107": {
        "link": "/wiki/Lynching_of_Fred_Alexander",
        "title": "Lynching of Fred Alexander",
        "date": "",
        "year": "new 1901",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "The lynching of Fred Alexander was committed by a mob in Leavenworth, Kansas on January 15, 1901, after he was arrested for rape and murder. He was killed when he was burned alive while tied to a metal rail. The Democratic Party-allied newspaper had been fomenting fear of African Americans as libidinous sexual predators. Results of official investigations disputed whether there was a rape and only circumstantial evidence was used to blame him for the alleged crime.[1] The lynching and its aftermath were widely covered in newspapers.[2][3]\nAlexander was a veteran of the Spanish-American War. He was accused of the rape and murder of 19-year-old Pearl Forbes.[4] He was castrated during the lynching.[5]\n",
        "type": [
            "murder",
            "lynching",
            "rape"
        ]
    },
    "108": {
        "link": "/wiki/Lecompton,_Kansas",
        "title": "Lecompton, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Lecompton",
        "county": "Douglas County",
        "paragraph": "Lecompton (pronounced /lɪˈkɒmptən/)[4] is a city in Douglas County, Kansas, United States.[1]  As of the 2020 census, the population of the city was 588.[3]  Lecompton was the de jure territorial capital of Kansas from 1855 to 1861, and the Douglas County seat from 1855 to 1858. Anti-slavery Lawrence became the de facto capital during the latter part of this period, when the county seat was moved there. This time period was known as Bleeding Kansas, due to the violence perpetrated by the pro-slavery, and to a lesser extent the anti-slavery, factions in the eastern part of the state. Lecompton was a hotbed of pro-slavery sentiment during the mid-1800s.\nLecompton was founded in 1854, on a bluff on the south bank of the Kansas River. It was originally called \"Bald Eagle\", but the name was changed to Lecompton in honor of Samuel Lecompte, the chief justice of the territorial Supreme Court.[5] In August 1855, the city became the capital of the Kansas Territory after President Franklin Pierce appointed Andrew Horatio Reeder as governor and charged him and his officials with establishing government offices in Lecompton.[6] The city soon became a stronghold of pro-slavery politics and Southern sympathy, which put it in conflict with nearby Lawrence, which had been founded by Free-Staters from Massachusetts.\nThe first post office in Lecompton was established in September, 1855.[7] The city served as the seat of Douglas County, until 1858, when it was moved to Lawrence.\n",
        "type": []
    },
    "109": {
        "link": "/wiki/Bleeding_Kansas",
        "title": "Bleeding Kansas",
        "date": "1854–1861",
        "year": "1854",
        "location": "Kansas Territory",
        "state": "Kansas",
        "place": "Bloody Kansas",
        "county": "Allen County",
        "paragraph": "\nAntislavery settler victory\nBleeding Kansas, Bloody Kansas, or the Border War was a series of violent civil confrontations in Kansas Territory, and to a lesser extent in western Missouri, between 1854 and 1859. It emerged from a political and ideological debate over the legality of slavery in the proposed state of Kansas.\n",
        "type": []
    },
    "110": {
        "link": "/wiki/Capital_punishment_in_Kansas",
        "title": "Capital punishment in Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "\nCapital punishment is currently a legal penalty in the U.S. state of Kansas, although it has not been used since 1965.[1]\nFrom 1853 to 1965, 76 executions were carried out under Kansas' jurisdiction.[2] All but one, the first, were by hanging.[3] These do not include executions that took place at the United States Penitentiary, Leavenworth and United States Disciplinary Barracks; while located within Kansas borders, these hangings were performed under federal government and U.S. military jurisdiction respectively. \nKansas first abolished capital punishment on January 30, 1907. The state restored it in 1935, albeit no executions took place until 1944.[4] From 1954 to 1960, there were no hangings in Kansas, as Governor George Docking refused to let any execution proceed due to his opposition to capital punishment. The last execution in Kansas took place on June 22, 1965 (double hanging of George York and James Latham).[4]\n",
        "type": []
    },
    "111": {
        "link": "/wiki/Jayhawker",
        "title": "Jayhawker",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "Jayhawkers and red legs are terms that came to prominence in Kansas Territory during the Bleeding Kansas period of the 1850s; they were adopted by militant bands affiliated with the free-state cause during the American Civil War. These gangs were guerrillas who often clashed with pro-slavery groups from Missouri, known at the time in Kansas Territory as \"Border Ruffians\" or \"Bushwhackers\". After the Civil War, the word \"Jayhawker\" became synonymous with the people of Kansas, or anybody born in Kansas.[1] Today a modified version of the term, Jayhawk, is used as a nickname for a native-born Kansan,[2][3][4]\nThe origin of the term \"Jayhawker\" may go back as far as the Revolutionary War, when it was reportedly used to describe a group associated with American Founding Father John Jay, who was also the First Chief Justice of the United States. Jay believed in the abolition of slavery and that America should be governed by Christians; he has been described by historians as a \"Christian Nationalist\" and \"among the most orthodox of Christians,\" according to Cambridge University and Oxford University professor Daniel Dreisbach.[5][6] In 1816, Jay wrote, \"Providence has given to our people the choice of their rulers, and it is the duty, as well as the privilege and interest of our Christian nation to select and prefer Christians for their rulers.\"[7] In 1776, prior to America's founding, Jay condemned slavery as a moral evil, and would be quoted as saying, \"The Holy Gospels are yet to be preached to these western regions, and we have the highest reason to believe that the Almighty will not suffer slavery and the gospel to go hand in hand. It cannot, it will not be.\"[7]\nBecause of his positions on the immorality of slavery and the need for Christianity in government, many dubbed the political and militia groups that arose over the next century that were largely Christian and militantly anti-slavery as \"Jayhawkers.\"[8]\n",
        "type": []
    },
    "112": {
        "link": "/wiki/James_Redpath",
        "title": "James Redpath",
        "date": "February 10, 1891(1891-02-10) (aged 57) New York City",
        "year": "1891",
        "location": "",
        "state": "Kansas",
        "place": "Berwick",
        "county": "Nemaha County",
        "paragraph": "James Redpath (August 24, 1833 in Berwick upon Tweed, England – February 10, 1891, in New York, New York) was an American journalist and anti-slavery activist.\nIn 1848 or 1849, Redpath and his family emigrated from Scotland to a farm near Kalamazoo, Michigan. He worked as a printer in Kalamazoo and Detroit, where he wrote antislavery articles under the pseudonym \"Berwick.\" Then he worked as a reporter for Horace Greeley's New-York Tribune. An early assignment at the Tribune involved compiling \"Facts of Slavery\", a regular series of articles gathered from Southern newspaper exchanges. Beginning in March 1854, he traveled in the American South to examine slavery for himself, interviewing slaves and collecting material. It appeared early in 1859 as The Roving Editor: or, Talks with Slaves in the Southern States, dedicated to \"Old Hero\" Captain John Brown. The book's production costs were covered by prominent antislavery philanthropist Gerrit Smith.[citation needed]\nIn 1855, Redpath moved to the Kansas-Missouri border and reported for a Free Soil newspaper, the Missouri Democrat, on the dispute over slavery in Kansas Territory. For the next three years, he was active in Kansas affairs, engaging in politics, writing dispatches, securing support in New England for Free Soil settlers, and writing poetry about Kansas. In 1856, he interviewed John Brown just days after the massacre at Pottawatomie Creek. Redpath and Brown shared the same abolitionist views, and he became Brown's most fervent publicist. In addition to his abolitionist views, he also advocated reparations for slavery.[1]\n",
        "type": []
    },
    "113": {
        "link": "/wiki/Constitution_Hall_(Lecompton,_Kansas)",
        "title": "Constitution Hall (Lecompton, Kansas)",
        "date": "",
        "year": "",
        "location": "Elmore St. between Woodson and 3rd Sts., Lecompton, Kansas",
        "state": "Kansas",
        "place": "Lecompton",
        "county": "Douglas County",
        "paragraph": "Lecompton Constitution Hall, also known as Constitution Hall, is a building in Lecompton, Kansas, that played an important role in the long-running Bleeding Kansas crisis over slavery in Kansas. It is operated by the Kansas Historical Society as Constitution Hall State Historic Site.\nConstitution Hall was constructed by Samuel J. Jones, the pro-slavery sheriff tasked with keeping the peace in Douglas County in the 1850s. He rented the structure out to the territorial government based out of Lecompton.[3]\nDuring 1857 this building was one of the busiest and most important in Kansas Territory. Thousands of settlers and speculators filed claims in the United States land office on the first floor. They sometimes fought hand-to-hand for their share of the rich lands that were opening for settlement. The government was removing the Native Americans from Kansas to make their lands available to whites.\n",
        "type": []
    },
    "114": {
        "link": "/wiki/Slave_Power",
        "title": "Slave Power",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "The Slave Power, or Slavocracy, referred to the perceived political power in the U.S. federal government held by slave owners during the 1840s and 1850s, prior to the Civil War.[1] Antislavery campaigners, led by Frederick Douglass, during this period bitterly decried what they saw as disproportionate and corrupt influence wielded by wealthy Southerners.  The argument was that this small group of rich slave owners had seized political control of their own states and were trying to take over the federal government in an illegitimate fashion in order to expand and protect slavery. The argument was later widely used by the Republican Party that formed in 1854–55 to oppose the expansion of slavery.\nThe main issue expressed by the term slave power was distrust of the political power of the slave-owning class. Such distrust was shared by many who were not abolitionists; those who were motivated more by a possible threat to the political balance or the impossibility of competing with unwaged slave labor, than by concern over the treatment of slaves. Those who differed on many other issues (such as hating Black people or liking them, denouncing slavery as a sin or promising to guarantee its protection in the Deep South) could unite to attack the slavocracy.[2] The \"Free Soil\" element emphasized that rich slave owners would move into new territory, use their cash to buy up all the good lands, then use their slaves to work the lands, leaving little opportunity room for free farmers. By 1854, the Free Soil Party had largely merged into the new Republican Party.[3]\nThe term was popularized by antislavery writers such as Frederick Douglass, John Gorham Palfrey, Josiah Quincy III, Horace Bushnell, James Shepherd Pike, and Horace Greeley. Politicians who emphasized the theme included John Quincy Adams, Henry Wilson and William Pitt Fessenden. Abraham Lincoln used the concept after 1854 but not the term. They showed, through a combination of emotive argument and hard statistical data, that the South had long held a disproportionate level of power in the United States.\n",
        "type": []
    },
    "115": {
        "link": "/wiki/Scott_Roeder",
        "title": "Assassination of George Tiller",
        "date": "May 31, 2009",
        "year": "2009",
        "location": "Foyer of ReformationLutheran Church7601 East 13th StreetWichita, Kansas",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nOn May 31, 2009, George Tiller, a physician from Wichita, Kansas, who was nationally known for being one of the few doctors in the United States to perform late terminations of pregnancy (also known as \"late-term abortions\"), was murdered by Scott Roeder, an anti-abortion extremist.[2][3][4] Tiller was killed during a Sunday morning service at his church, Reformation Lutheran Church,[5] where he was serving as an usher. Tiller had previously survived an assassination attempt in 1993 when Shelley Shannon shot him in the arms.\nRoeder was arrested within three hours of the shooting and charged with first-degree murder and related crimes two days later. In November 2009, Roeder publicly confessed to the killing, telling the Associated Press that he had shot Tiller because \"preborn children's lives were in imminent danger.\"[6][7] Roeder was found guilty of first-degree murder and two counts of aggravated assault on January 29, 2010,[8] and sentenced on April 1, 2010, to life imprisonment without any chance of parole for 50 years. This sentence was later reduced to allow for the possibility of parole after serving 25 years.[9]\n",
        "type": [
            "murder",
            "assault",
            "shooting",
            "killing"
        ]
    },
    "116": {
        "link": "/wiki/Pottawatomie_Rifles",
        "title": "Pottawatomie Rifles",
        "date": "",
        "year": "new 1855",
        "location": "",
        "state": "Kansas",
        "place": "Anderson County",
        "county": "Anderson County",
        "paragraph": "The Pottawatomie Rifles was a group of about one hundred abolitionist (or free state) settlers of Franklin and Anderson County, Kansas, both of which are along Pottawatomie Creek. The band was formed in the fall of 1855, during the Bleeding Kansas period, as an armed militia to counter growing pro-slavery presence: an influx of men known as border ruffians, from the neighboring slave state of Missouri.\nLed by John Brown's son John Jr.,[1] men from the Pottawatomie Rifles took part in much of the violence known as Bleeding Kansas, including the Battle of Osawatomie and the Pottawatomie massacre.[1] Although John Brown, who was famous for his own raids, such as the raid on Harpers Ferry, frequently accompanied his son, he did not consider himself a member of the group.[1]\nThe Pottawatomie massacre took place during the night between May 24 and 25, 1856.[1] In revenge for the sacking of Lawrence, Kansas, by pro-slavery forces, in which the Douglas County Sheriff Samuel Jones led a mob that trashed newspaper offices and the Free State Hotel, John Brown and various other abolitionist settlers and abolitionist groups, most of whom were Pottawatomie Rifles, killed five pro-slavery settlers. The incident occurred north of Pottawatomie Creek, near its junction to Mosquito Creek, in Franklin County, Kansas. Some sources say that John Brown Sr. led the massacre, beginning from May 22, in a private expedition which consisted of his sons Oliver, Watson, Owen, and Frederick, his son-in-law Henry Thompson, and two men named James Townsley and Thomas Winer who were transporting the men in their wagons, but not his son John Jr.\n",
        "type": [
            "new shooting"
        ]
    },
    "117": {
        "link": "/wiki/Secret_Six",
        "title": "Secret Six",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "The so-called Secret Six, or the Secret Committee of Six, were a group of men who secretly funded the 1859 raid on Harper's Ferry by abolitionist John Brown.[1]\nSometimes described as \"wealthy,\" this was true of only two. The other four were in positions of influence, and could, therefore, encourage others to contribute to \"the cause.\"\nThe name \"Secret Six\" was invented by writers long after Brown's death. The term never appears in the testimony at Brown's trial, in James Redpath's The public life of Capt. John Brown (1859), or in the Memoirs of John Brown of Franklin Benjamin Sanborn  (1878). The men involved helped Brown as individuals and did not work together or correspond with each other. They were never in the same room at the same time, and in some cases barely knew each other.\nThe Secret Six were Thomas Wentworth Higginson, Samuel Gridley Howe, Theodore Parker, Franklin Benjamin Sanborn, Gerrit Smith, and George Luther Stearns.  All six had been involved in the abolitionist cause prior to their meeting John Brown, and had gradually become convinced that violence was necessary in order to end American slavery.\n",
        "type": []
    },
    "118": {
        "link": "/wiki/John_Brown_Junior",
        "title": "John Brown Junior",
        "date": "May 5, 1895(1895-05-05) (aged 73) Put-in-Bay, Ohio, U.S.",
        "year": "1895",
        "location": "",
        "state": "Kansas",
        "place": "Hudson",
        "county": "Stafford County",
        "paragraph": "John Brown Jr. (July 25, 1821 – May 3, 1895) was the eldest son of the abolitionist John Brown. His mother was Brown's first wife, Dianthe Lusk Brown, who died when John Jr. was 11. He was born in Hudson, Ohio. In 1841 he tried teaching in a country school, but left it after one year, finding it frustrating and the children \"snotty\". In spring 1842 he enrolled at the Grand River Institute in Austinburg, Ohio.[1]: 128  In July 1847 he married Wealthy Hotchkiss (1829–1911). The couple settled in Springfield, Massachusetts.[2]\nHe was described by a Kansas acquaintance as \"a man of education, and of more than common abilities. Strictly honest and conscientious.\"[3] \"His family and himself are beloved and sympathized with by his neighbors of all parties; and well he may be; for he is one of the finest specimens of men, physically and intellectually. ...He is a man who would be distinguished anywhere for his active, energetic temperament and fearless manner. Socially he is amiable, warm hearted and affectionate.\"[4]\nJohn Jr. moved with four of his brothers to Kansas Territory in spring 1855. While his brothers Frederick, Owen, and Salmon traveled by land, John Jr., his brother Jason, and their families traveled by boat, across the state of Missouri on the Missouri River.  John Jr. described the trip as \"a horrid business in a low stage of water which is a considerable portion of the year.\" Most of the passengers and crew were pro-slavery, and the captain deliberately left the two boys' parties behind at a stop in Waverly, Missouri.[5]\n",
        "type": []
    },
    "119": {
        "link": "/wiki/Law_and_Order_Party_(Kansas)",
        "title": "Law and Order Party (Kansas)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "The Law and Order Party was a pro-slavery political party founded October 3, 1855 in Leavenworth, Kansas during the Bleeding Kansas period.[1]\nFounders of the party included David Rice Atchison and Joseph C. Anderson.\nEleven members of the Bogus Legislature aligned themselves with the Law and Order Party: W.G. Mathias, Richard R. Rees, D.A.N. Grover, Andrew McDonald, William Barbee, W.P. Richardson, John H. Stringfellow, Lucien Eastin, S.A. Williams, Archibald Payne, and Joseph C. Anderson.[2]\n",
        "type": []
    },
    "120": {
        "link": "/wiki/Mahaffie_House",
        "title": "Mahaffie House",
        "date": "",
        "year": "",
        "location": "1100 Kansas City Road,Olathe, Kansas",
        "state": "Kansas",
        "place": "Olathe",
        "county": "Johnson County",
        "paragraph": "The Mahaffie Stagecoach Stop and Farm Historic Site, locally known as the Mahaffie Farm, is located in Olathe, Kansas.  The house was originally a stop along the Westport Route of the Santa Fe, Oregon, and California Trails, which originated in nearby Westport, Missouri. The house's heyday came with large numbers of westbound travelers of the 1860s.\nThe house has now been converted into a museum and gift shop.  It is situated on almost 40 acres (160,000 m2) of land. It frequently hosts American Civil War reenactments, with a focus on events connected to Bleeding Kansas and bushwhackers. There is also an in-house blacksmith and other various era-specific artisans.\nThe original farm was founded by James Beatty Mahaffie and his wife Lucinda, in 1858. They ran it until 1870 and stayed on the farm until 1886. The existing house was completed by Mahaffie in 1865. It includes two foot thick limestone blocks quarried from the farm itself.[2]\n",
        "type": []
    },
    "121": {
        "link": "/wiki/I-70_killer",
        "title": "I-70 killer",
        "date": "",
        "year": "new 1992",
        "location": "",
        "state": "Kansas",
        "place": "I-70",
        "county": "Wyandotte County",
        "paragraph": "\nThe I-70 killer is an unidentified American serial killer who is known to have killed six store clerks in the Midwest in the spring of 1992. His nickname derives from the fact that several of the stores in which his victims worked were located a few miles off of Interstate 70 (I-70).\nHis victims were usually young, petite, brunette women. One of the victims was a man, but it is believed that the killer may have expected a woman in the store due to the store having a woman's name. All of the stores attacked were specialty stores and were usually only robbed of small amounts of cash.[1] He is also suspected of shooting three more store clerks in Texas during 1993 and 1994, one of whom survived, as well as a 2001 murder of a store clerk in Terre Haute, Indiana.\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "122": {
        "link": "/wiki/John_Edward_Robinson",
        "title": "John Edward Robinson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Kansas City",
        "county": "Wyandotte County",
        "paragraph": "John Edward Robinson (born December 27, 1943) is an American serial killer, con man, embezzler, kidnapper, and forger who was found guilty in 2003 for three murders committed in and around Kansas City, Kansas, receiving the death penalty for two of them. In 2005, he admitted responsibility for five homicides in Missouri as part of a plea bargain to receive multiple life sentences without possibility of parole and avoid more death sentences. Investigators suspect that more victims remain undiscovered.[1]\nBecause he made contact with most of his post-1993 victims via online chatrooms, Robinson is sometimes referred to as \"the Internet's first serial killer\".[2]\nJohn Robinson was born in Cicero, Illinois, the third of five children of an alcoholic father and a disciplinarian mother.[2]: 4  In 1957, Robinson became an Eagle Scout and traveled to London with a group of Scouts who performed before Queen Elizabeth II. He enrolled at Quigley Preparatory Seminary in Chicago, a private boys school for aspiring priests, but dropped out after one year due to disciplinary issues.[3][4]\n",
        "type": [
            "murder",
            "theft"
        ]
    },
    "123": {
        "link": "/wiki/Kansas_v._Marsh",
        "title": "Kansas v. Marsh",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Marsh",
        "county": "Republic County",
        "paragraph": "Kansas v. Marsh, 548 U.S. 163 (2006), is a United States Supreme Court case in which the Court held that a Kansas death penalty statute was consistent with the United States Constitution. The statute in question provided for a death sentence when the aggravating factors and mitigating factors were of equal weight.[1]\nMichael Lee Marsh II was convicted of murder. The Kansas capital punishment statute allowed for the imposition of the death penalty if the mitigating and aggravating factors were of equal weight, so Marsh was sentenced to death.[2]\nAfter Marsh's sentencing, the Kansas Supreme Court in State v Kleypas, declared the law unconstitutional under the Eighth Amendment and overturned it.[3] Ruling that \"fundamental fairness requires that a 'tie goes to the defendant' when life or death is at issue\".[2]\n",
        "type": [
            "murder"
        ]
    },
    "124": {
        "link": "/wiki/Joseph_Pomeroy_Root",
        "title": "Joseph Pomeroy Root",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "Joseph Pomeroy Root (April 3, 1826 – July 20, 1885) was an American doctor, politician, and leader of the Kansas Free Staters.\nA descendant of an old New England family, Root was the great-grandson of Revolutionary War General Seth Pomeroy. He graduated from the Berkshire Medical College in Pittsfield and practiced medicine in New Hartford, Connecticut for five years. In 1855 he was elected to the Connecticut House of Representatives,[1] as a Whig.\nAfter his term, he joined an armed party of abolitionist settlers who ended up settling in Waubansee, Kansas. After Root was briefly a prisoner of pro-slavery settlers, he devoted himself to the Free State cause, ultimately becoming the chairman of the free-state executive committee. After negotiating an exchange of prisoners with pro-slavery Governor Wilson Shannon, Root left Kansas to gather funds, arms, and support among Eastern abolitionists.\n",
        "type": []
    },
    "125": {
        "link": "/wiki/English_Bill_(1858)",
        "title": "English Bill (1858)",
        "date": "",
        "year": "1858",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "The English Bill was drafted on April 23, 1858, it was an offer made by the United States Congress to Kansas Territory. Kansas was offered some millions of acres of public lands in exchange for accepting the Lecompton Constitution.[1]\nThe English Bill was introduced by William Hayden English (1822–1896), a Democratic representative in Congress from 1853 to 1861.[1] The bill itself was not a bribe to the degree that it is usually considered to be, as it reduced the grant of land demanded by the Lecompton Ordinance from 23,500,000 to 3,500,000 acres (951,000,000 to 142,000,000 km2), and offered only the normal cession to new states.[1] This grant, however, was conditioned on the acceptance of the Lecompton Constitution, and Congress made no promise of any grant if that Constitution were not adopted.[1]\nOn August 21, 1858, by a vote of 11,812 to 1,926, Kansans rejected the offer.[2]\n",
        "type": []
    },
    "126": {
        "link": "/wiki/Leavenworth,_Kansas",
        "title": "Leavenworth, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "Leavenworth (/ˈlɛvənˌwɜːrθ/) is the county seat and largest city of Leavenworth County, Kansas, United States[1] and is part of the Kansas City metropolitan area.  As of the 2020 census, the population of the city was 37,351.[5][6]  It is located on the west bank of the Missouri River. The site of Fort Leavenworth, built in 1827, the city became known in American history for its role as a key supply base in the settlement of the American West. During the American Civil War, many volunteers joined the Union Army from Leavenworth.  The city has been notable as the location of several prisons, particularly the United States Disciplinary Barracks and United States Penitentiary, Leavenworth.[7]\nLeavenworth, founded in 1854, was the first city incorporated in the territory of Kansas.[8] The city developed south of Fort Leavenworth, which was established as Cantonment Leavenworth in 1827 by Colonel Henry Leavenworth.[9] Its location on the Missouri River attracted refugee African-American slaves in the antebellum years, who were seeking freedom from the slave state of Missouri across the river. Abolition supporters helped them find refuge. In the years before the American Civil War, Leavenworth was a hotbed of anti-slavery and pro-slavery agitation, often leading to open physical confrontations on the street and in public meetings.[citation needed]\nOn April 3, 1858, the \"Leavenworth Constitution\" for the state of Kansas was adopted here. Although the federal government never approved this early version of the state constitution, it was considered one of the most radical of the four constitutions drafted for the new territory because it recognized freed blacks as citizens.[10]\n",
        "type": []
    },
    "127": {
        "link": "/wiki/John_Allen_Wakefield",
        "title": "John Allen Wakefield",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Wakefield",
        "county": "Clay County",
        "paragraph": "John Allen Wakefield (February 11, 1797 – June 18, 1873) was an American historian, politician, soldier, physician, and lawyer.[1]\nBorn in Pendleton, South Carolina, Wakefield moved with his family to Tennessee, Kentucky, and then to Illinois, where they settled. During the War of 1812, Wakefield served in the Illinois militia as a scout. He later studied medicine and became a physician. He then studied law and was admitted to the Illinois Bar. Wakefield served in the Illinois House of Representatives as well.\nIn 1832, Wakefield took part in the Black Hawk War and wrote a book discussing the war, especially the Bad Axe massacre,[2] near present-day Victory, Wisconsin.[3]\nWakefield moved to Saint Paul, Minnesota in 1849, where he owned the Tremont House and became the first justice of the peace.[4]\n",
        "type": []
    },
    "128": {
        "link": "/wiki/Owen_Brown_(abolitionist,_born_1824)",
        "title": "Owen Brown (abolitionist, born 1824)",
        "date": "January 8, 1889(1889-01-08) (aged 64) Pasadena, California, U.S.",
        "year": "1889",
        "location": "",
        "state": "Kansas",
        "place": "Pasadena",
        "county": "Douglas County",
        "paragraph": "Owen Brown (November 4, 1824 –  January 8, 1889) was the third son of abolitionist John Brown. He participated more in his father's anti-slavery activities than did any of his siblings. He was the only son to participate both in the Bleeding Kansas activities — specifically the Pottawatomie massacre, during which he killed a man[1][2]— and his father's raid on Harpers Ferry. He was the only son of Brown present in Tabor, Iowa, when Brown's recruits were trained and drilled.[3] He was also the son who joined his father in Chatham, Ontario, Canada, when the raid was planned; he was chosen as treasurer of the organization of which his father was made president.[4]\nOwen was named for his grandfather, a prosperous Connecticut tanner, strong abolitionist, and one of the first settlers in Hudson, Ohio.\nHe described himself as \"an engineer on the Underground Railroad\" and a \"woodsman almost all my life\". By this he meant not that he was a lumberjack, but that he was could hike through woody terrain—a skill that later saved his life, escaping from the Harper's Ferry debacle.[5]: 346  (\"[S]o strong is the woodsman in him, that he gave me not only the direction and probable extent of every mountain and valley he passed, night or day, but the nature and quality of the timber almost everywhere in his way.\"[5]: 344 ) He never married, and referred to his one-room cabin in Ohio as \"bachelor hall\".[6] When asked later in life if he had been too busy to marry, his reply was: \"Hardly; there are men who fix their affections on one, and losing that one remain single ever after.\"[7] According to a writer who felt that Owen \"seems to have been a bachelor from principle\", he \"went so far as to divulge the fact that there was one maiden near Springdale [Iowa] whom he would marry, if he ever married at all, but to whom, out of abundant caution, he had resolved never even to speak.\"[8]\n",
        "type": []
    },
    "129": {
        "link": "/wiki/Brandon_Whipple_kidnapping_threat",
        "title": "Brandon Whipple",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nBrandon Whipple (born July 13, 1982) is an American politician and academic serving as mayor of Wichita, Kansas. He previously served as a Democratic member of the Kansas House of Representatives representing the 96th district, which included part of south Wichita and was the Ranking Minority member on the Higher Education Budget committee.[1]\nWhen the Kansas Legislature was not in session, Whipple served as an adjunct professor of American politics at Wichita State University, his alma mater.[2] Whipple defeated incumbent Jeff Longwell in the 2019 Wichita mayoral election.\n",
        "type": []
    },
    "130": {
        "link": "/wiki/The_Immortal_Ten",
        "title": "The Immortal Ten",
        "date": "",
        "year": "new 1859",
        "location": "",
        "state": "Kansas",
        "place": "Lawrence",
        "county": "Douglas County",
        "paragraph": "The Immortal Ten were a group of militant abolitionists and Free-Staters in the Kansas Territory who, on July 23, 1859, freed Dr. John Doy from a Missouri jail, where he was being held for allegedly abducting slaves. Doy and his 19-year-old son Charles were fellow abolitionists who had been arrested by pro-slavery Missouri bounty hunters while trying to deliver slaves to freedom in the Nebraska Territory via the Underground Railroad. While his son was acquitted of the charges and released, John was sentenced to prison. The ten men who took it upon themselves to rescue Doy were led by Major James B. Abbott and included Doy's son Charles, George R. Hay, Silas Soule, Capt. John E. Stewart, S.J. Willis, Thomas Simmons, Joseph Gardner, Jacob Senix, and Captain Joshua A. Pike.[1] The episode occurred during a period of violent interstate ideological conflict preceding the American Civil War known as \"Bleeding Kansas\".\nOn January 25, 1859, the Doys were passing through Lawrence, Kansas en route to the Nebraska Territory with thirteen slaves. John and Charles were just 12 miles outside of Lawrence when they were caught and surrounded by a group of armed pro-slavery \"Border Ruffians\" who had come from Missouri (a slave state) for the purpose of capturing escaped slaves and stopping activity on the Underground Railroad. When confronted, John was threatened to be killed on the spot. All that he asked was that they did not fire toward the carriage, since there were women and children inside. The option of fighting back was not in the Doys' favor as they were greatly outnumbered. Both John and Charles were arrested and thrown in jail temporarily until their trial on March 20, 1859, in St. Joseph, Missouri. Charles was eventually cleared of all charges, but the jury could not agree on a verdict for John and he was tried a second time. At the second trial, Dr. Doy was convicted of abducting slaves and sentenced to five years in the Missouri State Penitentiary.\nIn the summer of 1859, while Dr. Doy was imprisoned in the St. Joseph jail, Major James B. Abbott put together a crew of ten men to rescue him. The plan was carried out on July 23. Two of the men pretended to be bounty hunters who had caught a horse thief (who was also part of the crew) and distracted the guards while the rest of the men overtook the prison and went after Doy. Doy was found very ill and unable to walk due to exhaustion and disease, so a couple of the men carried him out. A famous ambrotype photograph of the Immortal Ten was taken in Lawrence by photographer Amon Gilbert DaLee shortly after the rescue. It depicts the whole crew together while Doy is sitting in a chair in the front, unable to stand on his own.\n",
        "type": [
            "thief"
        ]
    },
    "131": {
        "link": "/wiki/2017_Wichita_swatting",
        "title": "2017 Wichita swatting",
        "date": "December 28, 2017 (2017-12-28)",
        "year": "2017",
        "location": "Wichita, Kansas, United States",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nViner\nOn December 28, 2017, a fatal swatting incident occurred in Wichita, Kansas, United States. During an online dispute between Casey Viner and Shane Gaskill, regarding the video game Call of Duty: WWII, Viner threatened to have Gaskill swatted. Gaskill responded by giving him a false address for his residence, one that was occupied by an uninvolved person, Andrew Finch. Viner then asked Tyler Barriss to make the required fraudulent call to initiate the swatting. Wichita Police responded to the address, and as Finch was exiting his house, police officer Justin Rapp fatally shot him.\n",
        "type": [
            "killing"
        ]
    },
    "132": {
        "link": "/wiki/Kansas%E2%80%93Nebraska_Act",
        "title": "Kansas–Nebraska Act",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Atchison",
        "county": "Atchison County",
        "paragraph": "The Kansas–Nebraska Act of 1854 (10 Stat. 277) was a territorial organic act that created the territories of Kansas and Nebraska. It was drafted by Democratic Senator Stephen A. Douglas, passed by the 33rd United States Congress, and signed into law by President Franklin Pierce. Douglas introduced the bill intending to open up new lands to develop and facilitate the construction of a transcontinental railroad, but the Kansas–Nebraska Act is most notable for effectively repealing the Missouri Compromise, stoking national tensions over slavery, and contributing to a series of armed conflicts known as \"Bleeding Kansas\".\nThe United States had acquired vast amounts of land in the 1803 Louisiana Purchase, and since the 1840s Douglas had sought to establish a territorial government in a portion of the Louisiana Purchase that was still unorganized. Douglas's efforts were stymied by Senator David Rice Atchison and other Southern leaders who refused to allow the creation of territories that banned slavery; slavery would have been banned because the Missouri Compromise outlawed slavery in the territory north of latitude 36°30' north (except for Missouri). To win the support of Southerners like Atchison, Pierce and Douglas agreed to back the repeal of the Missouri Compromise, with the status of slavery instead decided based on \"popular sovereignty\". Under popular sovereignty, the citizens of each territory, rather than Congress, would determine whether slavery would be allowed.[1]\nDouglas's bill to repeal the Missouri Compromise and organize Kansas Territory and Nebraska Territory won approval by a wide margin in the Senate, but faced stronger opposition in the House of Representatives. Though Northern Whigs strongly opposed the bill, the bill passed the House with the support of almost all Southerners and some Northern Democrats. After the passage of the act, pro- and anti-slavery elements flooded into Kansas to establish a population that would vote for or against slavery, resulting in a series of armed conflicts known as \"Bleeding Kansas\".[2] Douglas and Pierce hoped that popular sovereignty would help bring an end to the national debate over slavery, but the Kansas–Nebraska Act outraged Northerners. The division between pro-slavery and anti-slavery forces caused by the Act was the death knell for the ailing Whig Party, which broke apart after the Act. Its Northern remnants would give rise to the anti-slavery Republican Party. The Act, and the tensions over slavery it inflamed, were key events leading to the American Civil War.\n",
        "type": []
    },
    "133": {
        "link": "/wiki/William_S._Harney",
        "title": "William S. Harney",
        "date": "May 9, 1889(1889-05-09) (aged 88) Orlando, Florida, US",
        "year": "1889",
        "location": "",
        "state": "Kansas",
        "place": "St. Louis",
        "county": "Washington County",
        "paragraph": "\nWilliam Selby Harney (August 22, 1800 – May 9, 1889) was a Tennessee-born cavalry officer in the US Army, who became known during the Indian Wars and the Mexican–American War for his brutality and ruthlessness. One of four general officers in the US Army at the beginning of the American Civil War, he was removed from overseeing the Department of the West because of his Southern sympathies early in the war, although he kept Missouri from joining the Confederacy. Under President Andrew Johnson, he served on the Indian Peace Commission, negotiating several treaties before spending his retirement partly in St. Louis and partly trading reminiscences with Jefferson Davis and Ulysses S. Grant in Mississippi.\nBorn on August 27, 1800, in Haysborough (Haysboro), a community on the Cumberland River (then a few miles above Nashville, Tennessee, now incorporated in the city), Harney attended a local private academy. His father Thomas Harney had been an army officer.\n",
        "type": []
    },
    "134": {
        "link": "/wiki/Battle_of_Fort_Titus",
        "title": "Battle of Fort Titus",
        "date": "August 16, 1856",
        "year": "1856",
        "location": "Lecompton, Kansas Territory",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "Free-State victory\nThe Battle of Fort Titus was a battle that occurred during  conflicts in the Kansas Territory between abolitionist and pro-slavery militias prior to the American Civil War. The era is known as Bleeding Kansas.\nFort Titus was built about April 1856 to be the fortress home of Henry T. Titus, a colonel in the militia of the Southern-oriented of the two governments of Kansas Territory. It was said Titus squatted on the claim of a free-state settler while he was away and built his cabin on this land. Fort Titus was a fortified log cabin with gun loopholes built into its walls to allow it to be defended from the inside.[2] This fort had at least one window and it had a small log addition on the north side that served as a kitchen.[3]\n",
        "type": [
            "riot"
        ]
    },
    "135": {
        "link": "/wiki/Lane_University",
        "title": "Lane University",
        "date": "",
        "year": "new 1865",
        "location": "E side of Lecompton, Lecompton, Kansas",
        "state": "Kansas",
        "place": "Lecompton",
        "county": "Douglas County",
        "paragraph": "Lane University was a college located in Lecompton, Kansas, United States.[2] It was founded in 1865 by Rev. Solomon Weaver, the first president, and was named after U.S. Senator James H. Lane.  Jim Lane was a main free-state leader, and Lecompton was previously the capital of the opposing pro-slavery faction.  Local tradition notes that a funding drive to construct the university promised to name it after the major contributor. Allegedly, James H. Lane made the largest pledge, received the namesake honor, and then died of a self-inflicted gunshot wound before he could carry out his promise.[2]\nIn 1865\nThe university was first located in what had been the Rowena Hotel. In 1865 the state donated to the university 13 acres of land that included the foundation of what had been intended to be the Kansas Territorial Capitol building at Lecompton. A college building was erected on the south half of the old foundation in 1882.\nThe Church of the United Brethren in Christ owned and controlled the school during its entire history. Almost all of the presidents were pastors. In 1900 it had 11 faculty members and 178 enrolled students.[2] In 1902 Lane University was united with Campbell University to form Campbell College (Kansas).\n",
        "type": [
            "new murder"
        ]
    },
    "136": {
        "link": "/wiki/Wichita_Massacre",
        "title": "Wichita Massacre",
        "date": "December 8–15, 2000",
        "year": "2000",
        "location": "Wichita, Kansas, U.S.",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nThe Wichita Massacre, also known as the Wichita Horror, was a week-long series of random brutal crimes perpetrated by brothers Reginald and Jonathan Carr in the city of Wichita, Kansas between December 8 and 15, 2000. Five people were killed, and two people, a man and a woman, were severely wounded. The brothers were arrested and convicted of multiple counts of murder, kidnapping, robbery, and rape. They were both sentenced to death in October 2002.[1] Their vicious crimes created panic in the Wichita area resulting in an increase in the sales of guns, locks, and home security systems.[2]\nThe case has received significant attention because the killers' death sentences have been subject to various rulings related to the use of executions in Kansas. In 2004, the Kansas Supreme Court overturned the state's death penalty law, but the Kansas Attorney General appealed to the US Supreme Court, which upheld the constitutionality of the death penalty in Kansas. On July 25, 2014, the Kansas Supreme Court again overturned the Carrs' death sentences on a legal technicality relating to their original trial judge not giving each brother a separate penalty proceeding.[3] After an appeal by the state's attorney general to the US Supreme Court, it overturned the decision of the Kansas Supreme Court in January 2016 and reinstated the death sentences.[4] The Carr brothers are incarcerated on death row at El Dorado Correctional Facility.\n",
        "type": [
            "murder",
            "robber",
            "kidnapping",
            "mass murder",
            "robbery",
            "rape"
        ]
    },
    "137": {
        "link": "/wiki/George_Floyd_protests_in_Kansas",
        "title": "George Floyd protests in Kansas",
        "date": "May 28, 2020 – July 24, 2020",
        "year": "2020",
        "location": "Kansas, United States",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Kansas, United States. Protests occurred in at least fifteen various communities in the state through July 2020. \nAbout 200 people attended a protest on the campus of Coffeyville Community College on June 4.[3]\n",
        "type": [
            "riot"
        ]
    },
    "138": {
        "link": "/wiki/2017_Olathe,_Kansas_shooting",
        "title": "2017 Olathe, Kansas shooting",
        "date": "February 22, 2017 (2017-02-22) 7:15 p.m[1] (CST)",
        "year": "2017",
        "location": "Austins Bar and GrillOlathe, Kansas, US",
        "state": "Kansas",
        "place": "Olathe",
        "county": "Johnson County",
        "paragraph": "On February 22, 2017, Adam Purinton shot two Indian men, Srinivas Kuchibhotla and Alok Madasani, whom he had allegedly mistaken for Iranians, at a restaurant in Olathe, Kansas, killing Kuchibhotla.[3] He reportedly yelled \"get out of my country\" and \"terrorist\" before firing. A third man, Ian Grillot, was wounded after he came to the two men's aid.[4][5][6] Several hours later, Purinton was arrested in Clinton, Missouri.\nAccording to witness accounts, the incident, at Austin's Bar and Grill at Mur-Len Shop on 151st St. and Mur-Len Rd., began as patrons were watching a basketball game; a man started yelling racial slurs at the victims, asking them whether their \"status was legal\".[7] The man had been escorted from the premises after he was confronted by restaurant staff and other guests, but returned later with a gun and began firing.[8] He reportedly told the two targeted victims—South Indian men who work for Garmin, a technology firm—to \"get out of my country\" before firing. Ian Grillot, a 24-year-old white American, was shot and suffered multiple bullet wounds as he came to the victims' aid.[9]\nThe suspect, Adam Purinton, was arrested while drinking at a restaurant bar in Clinton, Missouri, about 82 miles (132 km) away. He had attracted the barman's attention by saying he needed a place to hide because he had just killed one Middle Eastern man and injured another.[10]\n",
        "type": [
            "murder",
            "shooting",
            "terrorist",
            "killing"
        ]
    },
    "139": {
        "link": "/wiki/Knights_of_the_Golden_Circle",
        "title": "Knights of the Golden Circle",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Havana",
        "county": "Montgomery County",
        "paragraph": "The Knights of the Golden Circle (KGC) was a secret society founded in 1854 by American George W. L. Bickley, the objective of which was to create a new country, known as the Golden Circle (Spanish: Círculo Dorado), where slavery would be legal. The country would have been centered in Havana and would have consisted of the Southern United States and a \"golden circle\" of territories in Mexico (which was to be divided into 25 new slave states), Central America, northern parts of South America, and Cuba, Haiti, Dominican Republic, and most other islands in the Caribbean, about 2,400 miles (3,900 km) in diameter.[1][2]\nOriginally, the KGC advocated that the new territories should be annexed by the United States, in order to vastly increase the number of slave states and thus the power of the slave-holding Southern upper classes. In response to the increased anti-slavery agitation that followed the Dred Scott decision (1857) the Knights changed their position: the Southern United States should secede, forming their own confederation, and then invade and annex the area of the Golden Circle to vastly expand the power of the South.[3] In the United States, the new country's northern border would roughly coincide with the Mason–Dixon line, and within it were included such cities as Washington, D.C., St. Louis, Mexico City, and Panama City.\nThe KGC's proposal grew out of previous unsuccessful proposals to annex Cuba (Ostend Manifesto), parts of Central America (Filibuster War), and all of Mexico (All of Mexico Movement). In Cuba, the issue was complicated by the desire of many in the colony for independence from Spain.[citation needed] Mexico and Central America had no interest in being part of the United States.[citation needed]\n",
        "type": []
    },
    "140": {
        "link": "/wiki/Thomas_Washington_Barber",
        "title": "Wakarusa War",
        "date": "November–December 1855",
        "year": "1855",
        "location": "Douglas County, Kansas",
        "state": "Kansas",
        "place": "Douglas County",
        "county": "Douglas County",
        "paragraph": "The Wakarusa War was an armed standoff that took place in the Kansas Territory during November and December 1855. It is often cited by historians as the first instance of violence during the \"Bleeding Kansas\" conflict between anti-slavery and pro-slavery factions in the region.\nThe incident took place in Douglas County, centered on the Wakarusa River Valley and the town of Lawrence, where the opposing militias confronted each other for the first time. At the behest of Territorial Governor Wilson Shannon, the two sides eventually agreed to a truce, but it was short-lived, and widespread violence resumed the following spring.\nWhile pro- and anti-slavery settlers had been antagonistic towards one another for some time, the genesis of the Wakarusa War in particular dates to November 21, 1855, when a pro-slavery settler named Franklin Coleman shot a Free-Stater named Charles Dow nine times in the back, killing him. The murder was the culmination of a long-simmering feud between the two, as for some time they had argued about a land claim near Hickory Point, located about 14 miles (23 km) south of Lawrence.[1] According to the Border War Encyclopedia, \"Politics had not motivated Coleman to kill Dow, but the murder marked the genesis of the violent political divisions that characterized Kansas for the next 10 years.\"[2]\n",
        "type": [
            "murder",
            "riot",
            "killing"
        ]
    },
    "141": {
        "link": "/wiki/4th_Cavalry_Regiment_(United_States)",
        "title": "4th Cavalry Regiment (United States)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Fort Riley",
        "county": "Riley County",
        "paragraph": "\nThe 4th Cavalry Regiment is a United States Army cavalry regiment, whose lineage is traced back to the mid-19th century. It was one of the most effective units of the Army against American Indians on the Texas frontier. Today, the regiment exists as separate squadrons within the U.S. Army. The 1st Squadron of the 4th Cavalry's official nickname is \"Quarterhorse\", which alludes to its 1/4 Cav designation. The 3rd Squadron of the 4th Cavalry's official nickname is \"Raiders\". Today, the \"1st Squadron, 4th Cavalry\", \"2nd Squadron, 4th Cavalry\", \"4th Squadron, 4th Cavalry\", and \"6th Squadron, 4th Cavalry\" are parts of the 1st Infantry Division, while the \"3rd Squadron, 4th Cavalry\" serves as part of the 25th Infantry Division. On 23 September 2009, the \"4th Squadron, 4th Cavalry\" officially stood up at Fort Riley, Kansas as part of the 1st \"Devil\" Brigade, 1st Infantry Division. On 28 March 2008, the \"5th Squadron, 4th Cavalry\" officially stood up at Fort Riley, Kansas as part of the 2nd \"Dagger\" Brigade, 1st Infantry Division. The 6th Squadron, 4th Cavalry served as part of the recently inactivated 1st Infantry Division, 3rd \"Duke\" Brigade, at Fort Knox, Kentucky. The 1st and 5th Squadrons are assigned to their respective Brigade Combat Teams in the 1st Infantry Division. The 4th Squadron was inactivated in October 2015. The 3rd Squadron is assigned to the 3rd Brigade Combat Team in the 25th Infantry Division.\nIn 1855, the United States Congress recognized the need for mounted regiments in the U.S. Army in addition to the First and Second Regiments of Dragoons and the Regiment of Mounted Riflemen.[1] The 1st Cavalry Regiment—later re-designated as the 4th Cavalry Regiment—was organized under the act of 3 March 1855.[2] On 26 March 1855, the regiment was organized at Jefferson Barracks, Missouri.[1] The regiment's first commander was Colonel Edwin V. Sumner, who served from 3 March 1855 to 16 March 1861.[2] In August 1855, the regiment was transferred to Fort Leavenworth, Kansas.[1] Colonel Sumner had two missions. The first was to keep the peace between the pro-slavery and free state factions in Kansas; the second was to protect settlers from attacks by Cheyenne warriors.[1]\n",
        "type": []
    },
    "142": {
        "link": "/wiki/Beecher%27s_Bibles",
        "title": "Beecher's Bibles",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\"Beecher's Bibles\" was the name given to the breech-loading Sharps rifle that were supplied to and used by the anti-slavery settlers and combatants in Kansas, during the Bleeding Kansas period (1854–1860).[1] The breech loading model 1853 Sharps Carbines were shipped in crates marked \"Books and Bibles\". After an 1856 article in the New-York Tribune carried a quote by Henry Ward Beecher, the Sharps Carbines became known as Beecher's Bibles.[2]\nFor decades there had been a conflict between pro-slavery and anti-slavery activists in America. Before Missouri asked to be admitted to the United States there were 11 free and 11 slave states. Missouri was admitted as a slave state and Maine was admitted as a free state. The 1820 Missouri Compromise stated that all states south of Missouri could be admitted as slave states. In 1854 Congress initiated the Kansas–Nebraska Act which said voters could decide. Settlers from both sides came to Kansas. Violence was common between the two sides in Kansas. It was during this conflict that Minister Henry Ward Beecher raised funds to buy rifles for the free-staters: Beecher's Bibles were sent to the territory.[3] Henry W. Beecher believed that such weapons were, \"a greater moral urgency among border ruffians than the scriptures\".[4]\nThe name \"Beecher's Bibles\" in reference to Sharps rifles and carbines was inspired by the comments and activities of the abolitionist New England minister Henry Ward Beecher,[5] of the New England Emigrant Aid Society, of whom it was written in a February 8, 1856, article in the New-York Tribune:[6] Beecher was an outspoken abolitionist and he raised funds to buy weapons for Kansas free state settlers. Some newspapers began calling Beecher's church the \"Bible and Rifle Company\". From there the guns that were purchased and sent came to be known as Beecher’s Bibles.[7]\n",
        "type": []
    },
    "143": {
        "link": "/wiki/James_Shepherd_Pike",
        "title": "James Shepherd Pike",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Calais",
        "county": "Sedgwick County",
        "paragraph": "James Shepherd Pike (September 8, 1811 – November 29, 1882) was an American journalist and a historian of South Carolina during the Reconstruction Era.\nPike was born in Calais, Maine, and was a journalist in the United States during the mid 19th century. From 1850-1860 he was the chief Washington correspondent and associate editor of the New York Tribune. The Tribune was the chief source of news and commentary for many Republican newspapers across the country. Republican editors reprinted his dispatches prior to the outbreak of the American Civil War. In 1854 he led the fight against the Kansas-Nebraska Act, calling for the formation of a new political entity to oppose it. Pike wrote that a \"solid phalanx of aggression rears its black head everywhere south of Mason and Dixon's line, banded for the propagation of Slavery all over the continent.\"[1] His reports were, \"widely quoted, bitterly attacked or enthusiastically praised; they exerted a profound influence upon public opinion and gave to their author national prominence, first as an uncompromising anti-slavery Whig, and later as an ardent Republican.\"[2]\nPresident Abraham Lincoln appointed Pike to be minister to the Netherlands, where he fought Confederate diplomatic efforts and promoted the Union war aims from 1861 to 1866.[3] On returning to Washington in 1866, Pike resumed writing for the New York Tribune and also wrote editorials for the New York Sun.\n",
        "type": []
    },
    "144": {
        "link": "/wiki/Andrew_Butler",
        "title": "Andrew Butler",
        "date": "May 25, 1857(1857-05-25) (aged 60) Edgefield, South Carolina, U.S.",
        "year": "1857",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nAndrew Pickens Butler  (November 18, 1796 – May 25, 1857) was a United States senator from South Carolina who authored the Kansas-Nebraska Act with Senator Stephen Douglas of Illinois.\nIn 1856, abolitionist senator Charles Sumner gave a speech in which he insulted Butler’s character. In response Preston Brooks, Butler’s first cousin once-removed,  caned Sumner on the Senate floor, nearly killing him.\n",
        "type": [
            "killing"
        ]
    },
    "145": {
        "link": "/wiki/Indian_cavalry",
        "title": "Indian cavalry",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "Indian cavalry is the name collectively given to the Midwest and Eastern American Indians who fought during the American Civil War, most of them on horseback and for the Confederate States of America.\n",
        "type": []
    },
    "146": {
        "link": "/wiki/Shelley_Shannon",
        "title": "Shelley Shannon",
        "date": "",
        "year": "new 1993",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "Rachelle Ranae \"Shelley\" Shannon (born March 31, 1956)[1] is an American anti-abortion extremist[2][3][4] who was convicted in a Kansas state court for the attempted murder of George Tiller by shooting him in his car in Wichita, Kansas in 1993.[5][6][7]  She was also convicted in U.S. federal court for ten attacks at abortion clinics using arson or acid.  At her sentencing in U.S. District Court in 1995, the presiding judge described Shannon as a terrorist and agreed with prosecutors that she was a threat even from behind bars.[8]  She served her sentence at the Federal Correctional Institution in Waseca, Minnesota and was released in November 2018.[9][10]\nShannon became involved in the anti-abortion movement around 1988.[11] She was arrested several times for trespassing and physically obstructing access to clinics.[6]\nAfter the murder of an abortion provider in Pensacola in 1993, Shannon wrote at least 25 letters to the perpetrator, calling him a \"hero\" and \"brave soldier\" and describing her disillusionment with nonviolence.[12] She traveled to Kentucky to visit John Brockhoeft, convicted of firebombing a Cincinnati abortion clinic.[12]\n",
        "type": [
            "murder",
            "shooting",
            "terrorist",
            "arson"
        ]
    },
    "147": {
        "link": "/wiki/Franklin%27s_Fort",
        "title": "Franklin's Fort",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Franklin",
        "county": "Franklin County",
        "paragraph": "Franklin's Fort was a small fortification that had been erected in Franklin, Douglas County, Kansas by pro-slavery settlers. During the \"Bleeding Kansas\" period, the fort was the site of two minor battles between pro- and anti-slavery factions.\nFranklin was a small town established in 1854 in Douglas County, Kansas Territory. It was established by settlers, mostly from the nation's south, who wanted the territory admitted to the Union as a slave state. By late 1855 Franklin had about a dozen homes and businesses and a post office. It became a center devoted to the southern cause in Kansas.[1] By May 1856 a blockhouse was built inside Franklin, which was used to store arms and the \"Old Sacramento Cannon\", which had been seized during a raid on the Liberty, Missouri arsenal. The blockhouse was built to be defended in the event of attack by forces from Lawrence.[2][3]\nTwo attacks were made on Franklin's fort during summer 1856. The first attack was made on June 4 by about fifteen members of the Stubbs, a free-state militia based in Lawrence. The free-staters entered town after dark to search for \"Old Sacramento Cannon,\" which had been taken during a southern raid on Lawrence. Some sleeping defenders at the fort were aroused by noise and what was termed the First Battle of Franklin erupted. The cannon was fired once without injuring any free-staters. Town residents shot from their houses at the free-staters, town, forcing their retreat. One Franklin man was killed and a few persons were wounded. Some Franklin men may have been captured by the Lawrence men.[4][5]\n",
        "type": []
    },
    "148": {
        "link": "/wiki/Olathe,_Kansas",
        "title": "Olathe, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Olathe",
        "county": "Johnson County",
        "paragraph": "Olathe (/oʊˈleɪθə/ oh-LAY-tha) is the county seat of Johnson County, Kansas, United States.[1]  It is the fourth-most populous city in both the Kansas City metropolitan area and the state of Kansas, with a 2020 population of 141,290.[4][5]\nOlathe was founded by John T. Barton in the spring of 1857. He rode to the center of Johnson County, and staked two quarter sections of land as the town site.[citation needed] He later described his ride to friends: \"...the prairie was covered with verbena and other wild flowers. I kept thinking the land was beautiful and that I should name the town Beautiful.\"[citation needed] Purportedly, Barton asked a Shawnee interpreter how to say \"Beautiful\" in his native language. The interpreter responded, \"Olathe.\"[7]\nOlathe was incorporated in 1857,[8] and while not the first city in Johnson County, its rapid growth led to it being named the county seat in October 1859.[7] Rising tensions across the nation over the issue of slavery led to numerous clashes between abolitionist settlers and neighboring slave state Missouri. These clashes further escalated and become a part of the greater conflict known as Bleeding Kansas. With the admission of Kansas into the Union as a free state in 1861, violence began to dissipate. Peace continued to elude Olathe for many years to come, however. In 1861, Union officials and local military forces created a military post in the city. It housed one company of troops along with the local militia.\n",
        "type": []
    },
    "149": {
        "link": "/wiki/United_States_Disciplinary_Barracks",
        "title": "United States Disciplinary Barracks",
        "date": "",
        "year": "",
        "location": "Fort Leavenworth, Kansas, U.S.",
        "state": "Kansas",
        "place": "Fort Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "\nThe United States Disciplinary Barracks (USDB) colloquially known as Leavenworth, is a military correctional facility[2] located on Fort Leavenworth, a United States Army post in Kansas.\nIt is one of three major prisons built on Fort Leavenworth property, the others being the federal civilian United States Penitentiary, Leavenworth, four miles (6 km) to the south, and the military Midwest Joint Regional Correctional Facility, which opened on 5 October 2010.[3]\n",
        "type": []
    },
    "150": {
        "link": "/wiki/Dennis_Rader",
        "title": "Dennis Rader",
        "date": "",
        "year": "new 1974",
        "location": "",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nDennis Lynn Rader (born March 9, 1945) is an American serial killer known as BTK (an abbreviation he gave himself, for \"bind, torture, kill\"), the BTK Strangler or the BTK Killer. Between 1974 and 1991, he killed ten people in Wichita and Park City, Kansas, and sent taunting letters to police and media outlets describing the details of his crimes.[4][5][6] After a decade-long hiatus, Rader resumed sending letters in 2004, leading to his 2005 arrest and subsequent guilty plea. He is currently serving 10 consecutive life sentences at the El Dorado Correctional Facility.[1]\nRader was born on March 9, 1945, to Dorothea Mae Rader (née Cook) and William Elvin Rader, one of four sons. Sources give Rader's place of birth as either Columbus, Kansas,[7][8] or Pittsburg, Kansas.[9] He grew up in Wichita. Both parents worked long hours and paid little attention to their children at home; Rader later described feeling ignored by his mother in particular and resenting her for it.[10]\n",
        "type": [
            "murder",
            "torture",
            "mass murder"
        ]
    },
    "151": {
        "link": "/wiki/Charles_Branscomb",
        "title": "Charles Branscomb",
        "date": "January 3, 1891(1891-01-03) (aged 68) Denver, Colorado",
        "year": "1891",
        "location": "",
        "state": "Kansas",
        "place": "Denver",
        "county": "Butler County",
        "paragraph": "Charles Henry Branscomb (June 16, 1822 – January 3, 1891) was a member of the New England Emigrant Aid Society who, along with Charles L. Robinson, helped found the city of Lawrence, Kansas in 1854.\nCharles Branscomb was born on June 16, 1822, in Newmarket, New Hampshire.[3][4] He attended Phillips Exeter Academy for his secondary education, graduating in 1839.[5][6] Afterwards, he graduated from Dartmouth College (1845) and the Cambridge Law School (1848).[5] After passing the bar, he served for a time as a lawyer in Holyoke, Massachusetts.[5][7] In the 1850s, he became a member of the New England Emigrant Aid Society, at one point serving as its secretary pro tempore.[8]\nIn 1854, he and Charles L. Robinson surveyed Kansas Territory, looking for suitable land upon which the Emigrant Aid Society could found a town dedicated to the free state cause.[7] Later that year, he led the first group of colonists supported by the Emigrant Aid Society to the territory and helped establish the city of Lawrence.[9][10] Until 1858, Branscomb worked for New England Emigrant Aid Society, after which he founded a private law firm in Lawrence. Branscomb later served in the territorial legislature and voted on the Leavenworth Constitution.[5]\n",
        "type": []
    },
    "152": {
        "link": "/wiki/Marais_des_Cygnes_Massacre_Site",
        "title": "Marais des Cygnes Massacre Site",
        "date": "",
        "year": "new 1858",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nThe Marais des Cygnes Massacre Site, also known as Marais des Cygnes Massacre Memorial Park,[1] is a state historic site near Trading Post, Kansas that commemorates the 1858 massacre of the same name. On May 19, 1858, during a period of political instability and sporadic violence known as Bleeding Kansas, a group of pro-slavery border ruffians captured 11 abolitionist free-staters.  The prisoners were forced to a nearby ravine, where 10 of them were shot, resulting in five fatalities.  The abolitionist John Brown later built a fort near the site.  The first commemoration at the site was two stone markers erected by men of the 3rd Iowa Cavalry Regiment in 1864, although these monuments had been destroyed by souvenir hunters by 1895.  In 1941, the land where the massacre occurred, as well as an 1870s-era house constructed by a friend of Brown, were transferred to the state of Kansas.  The site was listed on the National Register of Historic Places in 1971 and designated a National Historic Landmark in 1974.  The Kansas Historical Society administers the site, which is interpreted by signage and a hand-cranked audio recording.\nWhen the United States Congress passed the Kansas–Nebraska Act in 1854, it did not directly state whether Kansas Territory and Nebraska Territory would allow slavery or not.  While Nebraska did not see much controversy, Kansas became a hotly debated area.  While the previous Missouri Compromise would have prevented slavery from being practiced in Kansas, the new law left the question open.[2]  In response to the new opening, pro-slavery advocates known as border ruffians, many of whom were from Missouri, entered Kansas to illegally vote in an attempt to sway local elections.  The New England Emigrant Aid Company also sought to bring anti-slavery settlers into the territory.  The elections, which were held on March 30, 1855, resulted in a pro-slavery majority in the Kansas territorial government, who in turn created laws protecting slavery and, among other things, outlawing abolitionist literature.  Abolitionist sentiment was strong near Lawrence, and several prominent Lawrence residents formed the Free State Party to organize resistance to the pro-slavery government in September.  In October, free-staters drafted the Topeka Constitution, which sought to create an abolitionist government in the state.  There were now both pro- and anti-slavery governments vying for control of Kansas; President of the United States Franklin Pierce supported the pro-slavery government as the lawful one.[2][3]\n",
        "type": [
            "new shooting"
        ]
    },
    "153": {
        "link": "/wiki/Amos_A._Lawrence",
        "title": "Amos A. Lawrence",
        "date": "August 22, 1886(1886-08-22) (aged 72) Nahant, Massachusetts",
        "year": "1886",
        "location": "",
        "state": "Kansas",
        "place": "Appleton",
        "county": "Labette County",
        "paragraph": "\nAmos Adams Lawrence (July 31, 1814 – August 22, 1886) was an American businessman, philanthropist, and social activist. He was a key figure in the United States abolitionist movement in the years leading up to the Civil War and the growth of the Episcopal Church in Massachusetts. He was instrumental in the establishment of the University of Kansas and Lawrence University in Appleton, Wisconsin.\nLawrence was born in Boston, Massachusetts on July 31, 1814.[1][2][3] His father, Amos Lawrence, was a merchant, philanthropist, and member of the prominent Lawrence family.[4]\n",
        "type": []
    },
    "154": {
        "link": "/wiki/Debora_Green",
        "title": "Debora Green",
        "date": "",
        "year": "new 1995",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nDebora Green (née  Jones; born February 28, 1951) is an American physician who pleaded no contest to setting a 1995 fire which burned down her family's home and killed two of her children, and to poisoning her husband with ricin with the intention of causing his death. The case was sensational, and covered heavily by news media, especially in the Kansas–Missouri area, where the crimes occurred. Though Green has petitioned for a new trial twice in recent years, her requests have not been successful.\nGreen married Michael Farrar in 1979 while practicing as an emergency physician. The marriage was tumultuous, and Farrar filed for divorce in July 1995. Between August and September 1995, Farrar repeatedly fell violently ill, and despite numerous hospitalizations his doctors could not pinpoint the source of his illness. Green's emotional stability deteriorated and she began to drink heavily, even while supervising her children. On October 24, 1995, the Farrar family home, occupied by Green and the couple's three children, caught fire. Kate Farrar and Debora Green escaped without harm, but despite the efforts of firefighters, Timothy and Kelly Farrar died in the blaze. Investigation showed that trails of accelerant in the house led back to Green's bedroom, and that the source of Michael Farrar's intractable illness had been ricin, a poison served to him in his food by Green.\n",
        "type": [
            "murder",
            "arson"
        ]
    },
    "155": {
        "link": "/wiki/Stephen_A._Douglas",
        "title": "Stephen A. Douglas",
        "date": "June 3, 1861(1861-06-03) (aged 48) Chicago, Illinois, U.S.",
        "year": "1861",
        "location": "",
        "state": "Kansas",
        "place": "Chicago",
        "county": "Cherokee County",
        "paragraph": "\nStephen Arnold Douglas (April 23, 1813 – June 3, 1861) was an American politician and lawyer from Illinois. A senator, he was one of two nominees of the badly split Democratic Party for president in the 1860 presidential election, which was won by Republican Abraham Lincoln. Douglas had previously defeated Lincoln in the 1858 United States Senate election in Illinois, known for the pivotal Lincoln–Douglas debates. He was one of the brokers of the Compromise of 1850 which sought to avert a sectional crisis; to further deal with the volatile issue of extending slavery into the territories, Douglas became the foremost advocate of popular sovereignty, which held that each territory should be allowed to determine whether to permit slavery within its borders. This attempt to address the issue was rejected by both pro-slavery and anti-slavery advocates. Douglas was nicknamed the \"Little Giant\" because he was short in physical stature but a forceful and dominant figure in politics.\nBorn in Brandon, Vermont, Douglas migrated to Jacksonville, Illinois, in 1833 to establish a legal practice. He experienced early success in politics as a member of the newly formed Democratic Party, serving in the Illinois House of Representatives and various other positions. He resigned from the Supreme Court of Illinois upon being elected to the United States House of Representatives in 1843. Douglas became an ally of President James K. Polk, and favored the annexation of Texas and the Mexican–American War. He was one of four Northern Democrats in the House to vote against the Wilmot Proviso, which would have banned slavery in any territory acquired from Mexico.\n",
        "type": []
    },
    "156": {
        "link": "/wiki/Eli_Thayer",
        "title": "Eli Thayer",
        "date": "April 15, 1899(1899-04-15) (aged 79) Worcester, Massachusetts",
        "year": "1899",
        "location": "",
        "state": "Kansas",
        "place": "Territory",
        "county": "Douglas County",
        "paragraph": "\nEli Thayer (June 11, 1819 – April 15, 1899) was a member of the United States House of Representatives from 1857 to 1861. He was born in Mendon, Massachusetts. He graduated from Worcester Academy in 1840, from Brown University in 1845, and in 1848 founded Oread Institute, a school for young women in Worcester, Massachusetts. He is buried at Hope Cemetery, Worcester.\nHe is chiefly remembered for his crusade to ensure that the Kansas Territory would enter into the United States as a free state. With this aim in view, early in 1854 Thayer organized the Massachusetts Emigrant Aid Company to send anti-slavery settlers to the Kansas Territory. In 1855, this organization joined with the New York Emigrant Aid Company and the name was changed to the New England Emigrant Aid Company.[citation needed] The motives of Thayer in establishing the New England Emigrant Aid Company were questioned by historian David S. Reynolds, who wrote that Thayer \"opposed slavery not on moral grounds but because [he] wanted to foster laissez-faire capitalism in the Territory.\"[2]\n",
        "type": []
    },
    "157": {
        "link": "/wiki/Vinland,_Kansas",
        "title": "Vinland, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Vinland",
        "county": "Douglas County",
        "paragraph": "Vinland is an unincorporated community in Douglas County, Kansas, United States.[1]  It is located south of Lawrence and north of Baldwin City.\nThe first settlement was made at Vinland in 1854.[2] In the earliest days of the community, some called it \"Coal Creek\", due to deposits of the sedimentary rock in a nearby waterway.[3] The settlement eventually earned the name \"Vineland\" (after the orchard of one of the first settlers, William Barnes), which later evolved into \"Vinland\" after a clerical error. Most of the settlers of the early community were abolitionists or Free-Staters from New England, and consequently, they opposed the extension of slavery into Kansas Territory.[4][5]\nIn 1859, Annie Soule and Martha Cutter helped found a library (and an associated book club), in the hopes that it \"would contribute to the 'moral, social, and intellectual improvement of [the settlement's] members\";[5] specifically, they hoped \"to prevent dancing from becoming the only amusement in the community.\"[3] The library initially boasted a collection 10 books (which eventually grew to over 2,000), and residents of the small town were allowed to check them out if they contributed an annual fee of 50 cents.[6][7] The building that currently holds the collection was constructed in 1900 when the community's book supply grew too large.[7] Today, Coal Creek Library is considered the oldest subscription library in the state.[5]\n",
        "type": []
    },
    "158": {
        "link": "/wiki/Minneola,_Franklin_County,_Kansas",
        "title": "Minneola, Franklin County, Kansas",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Minneola",
        "county": "Clark County",
        "paragraph": "Minneola is a ghost town in Franklin County, Kansas, United States. Briefly in the running to be the territorial capital of Kansas, it was roughly one mile away from Centropolis. Today, hardly anything remains at the original site.\nMinneola was located roughly one mile east of Centropolis. Today, the site rests on both the north and south sides of Stafford Road, between Kentucky and Iowa Roads. The site is currently on private property, and in 1988 consisted of \"little more than a few ruins and half a dozen farms.\"[1][2]\nThe ghost town can trace its origins to the earlier settlement of St. Bernard, founded in 1855. The town's postmaster, J. M. Bernard, was pro-slavery, and he angered many of the men in the area, who had anti-slavery leanings. Eventually, after Bernard was convinced to leave the settlement, St. Bernard developed into Minneola. At this time, Minneola became the chief rival of nearby Centropolis, as both were hoping to be the newly appointed territorial capital of Kansas. After Kansas free-state voters overcame the pro-slavery faction in 1857, the government voted against naming Centropolis as the capital of Kansas, since the town had pro-slavery leanings.[1] However, the new free-state government still wished to move the territorial capital from Lecompton, and so the legislature convened at Lawrence to decide a new location. Perry Fuller—a man who had been successful in establishing Centropolis as a city—and several associates purchased 14 quarter sections of farm land near Minneola, hoping to expand the small town into the future capital.[1][3] Around this time, Centropolis's newspaper, the Kansas Leader was brought into Minneola, and renamed to the Minneola Statesman.[1]\n",
        "type": []
    },
    "159": {
        "link": "/wiki/John_Noland",
        "title": "John Noland",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Jackson County",
        "county": "Jackson County",
        "paragraph": "John Noland (1844 – June 25, 1908) was an enslaved man who was the personal servant of bushwhacker William C. Quantrill during the American Civil War.[1] Noland was a chattel slave owned by Francis Asbury Noland in Jackson County, Missouri.[2]\nIn 1863, Lincoln signed the Emancipation Proclamation which did not apply to border states like Missouri.[3] Slavery was still legal there and in Kansas where many of Quantrill's actions occurred.[4] There is no conclusive evidence Asbury Noland freed Noland.[5] That same year, Noland may have helped with scouting Lawrence, Kansas before the massacre by Quantrill's men which killed over 143 people.\nAccording to one historian, several white men in Quantrill’s guerilla group shared Noland’s last name and might have been familial relations.[6][7][8] In this time period, it was not unusual for slaveholders to send a servant to camp to perform menial tasks or to “hire out” slaves. It is unknown how John Noland became William Quantrill’s servant and hostler.\n",
        "type": []
    },
    "160": {
        "link": "/wiki/2016_Kansas%E2%80%93Missouri_murder_spree",
        "title": "2016 Kansas–Missouri murder spree",
        "date": "",
        "year": "2016",
        "location": "",
        "state": "Kansas",
        "place": "Kansas City",
        "county": "Wyandotte County",
        "paragraph": "The 2016 Kansas–Missouri murder spree was a March 2016 American mass shooting in which four men were shot in a killing spree in Kansas and another was shot, shortly afterward, in Missouri.[1][2]\nOn the night of March 7, 2016, four men were shot to death with a shotgun in Kansas City, Kansas.[2] One of them managed to call police about the shooting before dying.[3] On the morning of March 8, 49-year-old Randy J. Nordman was shot to death in Montgomery County, Missouri, 170 mi (270 km) east of the site of the first shooting.[1] A truck believed to have been driven by the suspect was found five miles away along Interstate 70, and a massive manhunt for him was launched.[3] Two police helicopters and at least one SWAT team were involved in the search.[4]\nOn March 9, police in New Florence, Missouri, responded to reports of a man pulling a firearm on a civilian at a gas station.[2] At 12:18 a.m., suspect Pablo Antonio Serrano-Vitorino, 40, who lived next door to the four initial victims, was found at a muddy hill alongside Interstate 70 and arrested by Missouri State Highway Patrol Sergeants Primm and McGinnis. No shots were fired despite him being armed.[2][5] He was armed with a Kalashnikov rifle at the time of his arrest.[1][6]  He was charged with four counts of first-degree murder in Kansas and was jailed in Montgomery County, Missouri, with bail set at $2 million.[3] The day following the arrest, he attempted suicide by cutting himself with a safety razor. He was admitted to a local hospital and was classified to be in stable condition.[7]\n",
        "type": [
            "murder",
            "shooting",
            "mass shooting",
            "killing"
        ]
    },
    "161": {
        "link": "/wiki/Samuel_J._Reader",
        "title": "Samuel J. Reader",
        "date": "September 15, 1914(1914-09-15) (aged 78) Topeka, Kansas, U.S.",
        "year": "1914",
        "location": "",
        "state": "Kansas",
        "place": "Topeka",
        "county": "Shawnee County",
        "paragraph": "\nSamuel J. Reader (1836–1914) was an American diarist and artist who wrote about his experiences living in Bleeding Kansas and the American Civil War.[1]\nSamuel James Reader was born on January 25, 1836, in Greenfield (present-day Coal Center), Pennsylvania,[2] where his father settled in 1847 upon his second marriage,[3] the son of carpenter and millwright Francis Reader and Catherine (née James) Reader.[3] His mother died May 19, 1836, and he was raised by his maternal grandparents and an aunt, Eliza James. He lived in La Harpe, Illinois, from the age of five to 18.[4][3][a] He had a sister, Eliza Matilda,[3] who later became the wife of Dr. M. A. Campdoras.[4]\n",
        "type": []
    },
    "162": {
        "link": "/wiki/Felix_Mitchell",
        "title": "Felix Mitchell",
        "date": "August 21, 1986(1986-08-21) (aged 31) Leavenworth, Kansas, U.S.",
        "year": "1986",
        "location": "",
        "state": "Kansas",
        "place": "Leavenworth",
        "county": "Leavenworth County",
        "paragraph": "\nFelix Wayne Mitchell Jr. (August 23, 1954 – August 21, 1986) was a drug lord from Oakland, California, and leader of the \"69 Mob\" criminal organization, which operated throughout California and into the Midwest. He was known as \"Felix the Cat\" after the cartoon character.\nMitchell was born in Oakland and lived in the 69th Avenue San Antonio Village housing projects. After dropping out of high school, Mitchell created a criminal organization called \"My Other Brother\", or \"6-9 Mob\" a.k.a. \"MOB\".  Connected with L.A. kingpin Tootie Reese, he made business contacts in the Bay Area, Los Angeles and Detroit.\n",
        "type": []
    },
    "163": {
        "link": "/wiki/Judge_Wakefield%27s_house",
        "title": "Judge Wakefield's house",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Douglas County",
        "county": "Douglas County",
        "paragraph": "John Allen Wakefield and his family was one of the first settlers to come to the newly created Kansas Territory.  Free soilers, they arrived in western Douglas County, Kansas, in July 1854, one month after the territory was opened to settlement. They built a large log house to serve primarily as their living quarters. It had six rooms and was 6 miles (9.7 km) west of the free-state stronghold of Lawrence, Kansas. For protection the family built loop holes for guns into the sides of the house.[1]\nWakefield became the justice of the Squatters' Court, when it was organized August 26, 1854. Because of his position, he was thereafter known as Judge Wakefield. He tried cases involving both northern and southern settlers and until spring 1856 both groups got along without much trouble. That spring southern partisans in the area began a picket of men assigned to watch the house. In August 1856 much trouble erupted between the free-state men and the southern men in eastern Kansas. Free-state men at times garrisoned Judge Wakefield's house. At 2 A.M. on August 16 southern partisans, including Henry T. Titus, attacked the fortress home, but they were unable to take it. Later that day free-state men attacked and destroy the fortress home of Titus, called Fort Titus.[2]\nThe southern partisans sought retaliation for their string of defeats in August, when not only Fort Titus, but New Georgia's fort, Franklin's Fort and Fort Saunders were all taken by free-state partisans. On the night of September 1, 1856, the southerners burned six houses and one other building, including Judge Wakefield's house. The family lost all their possessions.[3]\n",
        "type": []
    },
    "164": {
        "link": "/wiki/Richard_Realf",
        "title": "Richard Realf",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "England",
        "county": "Johnson County",
        "paragraph": "Richard Realf (14 June 1832, Framfield, East Sussex, England – 28 October 1878, Oakland, California) was a poet who lived in many places throughout the United States, and whose work was informed by these travels. An obituary called him \"a singularly unhappy man\".[1]\nAt the age of fifteen he began to write verses, and two years later he became amanuensis to a lady in Brighton. A traveling lecturer on phrenology recited some of young Realf's poems, as illustrations of ideality, and thereupon several literary people in Brighton sought him out and encouraged him. Under their patronage a collection of his poems was published, entitled \"Guesses at the Beautiful\" (London, 1852). Realf spent a year in Leicestershire, studying scientific agriculture, and in 1854 came to the United States.\nAfter arriving in the U.S., Realf explored the slums of New York City, became a Five Points missionary, and assisted in establishing there a course of cheap lectures and a self-improvement association. In 1856 he accompanied a party of free-state emigrants to Kansas, where he became a journalist and correspondent of several Eastern newspapers. He made the acquaintance of John Brown, accompanied him to Chatham, Ontario, Canada, and was to be Secretary of State in the provisional government that Brown projected. The movement being deferred for two years, Realf made a visit to England and a tour in the Southern states. When Brown made his attack on Harpers Ferry in October 1859, Realf was in Texas, where he was arrested and sent to Washington, D.C., being in imminent danger of lynching on the way.[1][2]\n",
        "type": [
            "lynching"
        ]
    },
    "165": {
        "link": "/wiki/Shawnee_Methodist_Mission",
        "title": "Shawnee Methodist Mission",
        "date": "",
        "year": "",
        "location": "3403 W. 53rd Street, Fairway, Kansas",
        "state": "Kansas",
        "place": "Fairway",
        "county": "Johnson County",
        "paragraph": "\nShawnee Methodist Mission, also known as the Shawnee Mission, which later became the Shawnee Indian Manual Labor School, is located in Fairway, Kansas, United States. Designated as a National Historic Landmark in 1968, the Shawnee Methodist Mission is operated by the city as a museum.[2] The site is owned by the Kansas Historical Society and administered as the Shawnee Indian Mission State Historic Site. \nThe Shawnee Indian Manual Labor Boarding School served briefly as the second capital of the Kansas Territory, when the legislature was controlled by pro-slavery advocates.[3] The building held that designation from July 16 to August 7, 1855.\n",
        "type": []
    },
    "166": {
        "link": "/wiki/Ed_Beard",
        "title": "Ed Beard",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Delano",
        "county": "Sedgwick County",
        "paragraph": "Edward T. \"Red\" Beard, (c. 1828-November 11, 1873) was a gambler and saloon keeper of the Old West.\nBeard is the son of the man who first settled Beardstown, Illinois. Originally from Illinois, Beard settled in Virginia, and was for a period a man of wealth, having married well. In 1861 at the outbreak of the Civil War, Beard promptly left his life behind and moved west. Traveling through California, Oregon and Colorado he developed a nasty reputation as being good with a gun, and having a bad temper.\nBy 1873 he had settled in Delano, Kansas, then a bustling town across the Arkansas River from Wichita, Kansas. He opened a successful saloon which for a time prospered. On October 27, 1873, he became angry with a prostitute who was in his saloon, but who worked across the street at the saloon owned by \"Rowdy Joe\" Lowe. He chased the girl outside, shooting at her. After chasing her across the street, still shooting, they entered the Lowe Saloon, where he accidentally shot and wounded a patron and another girl. Lowe opened fire, wounding Beard, who died on November 11.\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "167": {
        "link": "/wiki/Samuel_J._Jones",
        "title": "Samuel J. Jones",
        "date": "December 10, 1883(1883-12-10) (aged 56)",
        "year": "1883",
        "location": "",
        "state": "Kansas",
        "place": "Douglas County",
        "county": "Douglas County",
        "paragraph": "\nSamuel Jefferson Jones (April 16, 1827 – December 10, 1883) was a pro-slavery settler who held the position of Douglas County sheriff in Kansas Territory from late 1855 until early 1857. He helped found the territorial capital of Lecompton and played a prominent role in the \"Bleeding Kansas\" conflict.\nIn 1858, he moved to La Mesilla, New Mexico Territory. In September of that year, he was appointed the collector of customs at El Paso del Norte (now Ciudad Juárez, Mexico). In New Mexico, he was involved with the Mowry City land scam. When that settlement's prospects collapsed, he bought a ranch near La Mesilla and died there in 1883. His tombstone was returned to Lecompton in 2013.\n",
        "type": []
    },
    "168": {
        "link": "/wiki/Kansas_State_Capitol",
        "title": "Kansas State Capitol",
        "date": "",
        "year": "",
        "location": "SW 8th & SW Van Buren,Topeka, Kansas",
        "state": "Kansas",
        "place": "Topeka",
        "county": "Shawnee County",
        "paragraph": "The Kansas State Capitol, known also as the Kansas Statehouse, is the building housing the executive and legislative branches of government for the U.S. state of Kansas. Located in the city of Topeka, which has served as the capital of Kansas since the territory became a state in 1861, the building is the second to serve as the Kansas Capitol.[2][failed verification] During the territorial period (1854–1861), an earlier capitol building was begun but not completed in Lecompton, Kansas, and smaller structures in Lecompton and Topeka were where the territorial legislatures met (see Capitols of Kansas).\nThe dome, at 304 ft (93 m), is taller than the 288 ft (88 m) United States Capitol dome, although its diameter (50 ft (15 m)) is approximately half that of the national capitol (96 ft (29 m)). It is one of the few capitols in the United States that continues to offer tours that go to the top of the dome.[3] Visitors enter the dome by climbing 296 steps leading from the fifth floor to the top.[4]\nThe land for Capitol Square was donated by Cyrus K. Holliday via his Topeka Town Company in 1862.  The master architect was Edward Townsend Mix with the wings designed by John G. Haskell.[5] Construction on the East Wing began in 1866, using \"native\" limestone from Geary County, Kansas. Construction began on the West Wing in 1879 using limestone from Cottonwood Falls, Kansas and in 1881, the legislature authorized and appropriated funds for the construction of a central building to link the two wings. Construction of this central building began in 1886, and the contract for dome construction was let in May, 1889.[6]\n",
        "type": []
    },
    "169": {
        "link": "/wiki/Wyandotte_Constitution",
        "title": "Wyandotte Constitution",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "The Wyandotte Constitution is the constitution of the U.S. state of Kansas.\nThe Kansas Territory was created in 1854. The largest issue by far in territorial Kansas was whether slavery was to be permitted or prohibited; aside from the moral question, which at the time was seen as a religious question, the admission of Kansas to the highly polarized Union would help either the pro- or anti-slavery faction in Congress. As a procedure for resolving the issue, Congress accepted the proposal of Senator Stephen A. Douglas, that the question be settled by popular sovereignty: the residents of the territory would decide the question by vote. This did not work, because there was no accepted definition of who was a resident of the territory and could therefore vote. Hoping to make Kansas a slave state, thousands of \"Border Ruffians\" from the neighboring slave state of Missouri poured into Kansas, some with the intent to live in Kansas, but more planning to return to Missouri as soon as they had voted. The Massachusetts Anti-Slavery Society and similar groups sponsored free-state farmers who would move to Kansas. The most famous of these was John Brown, who told the free-state Kansans that violence was unfortunately necessary if Kansas were to be a free state. He put this into practice himself at the Pottawatomie massacre of 1856. As it was put later by his son John Brown, Jr., \"only force and fire-arms kept slavery out of Kansas\".[1]\nThe upshot was that there were sizeable pro- and anti-slavery factions in Kansas, although the former were more numerous, if one accepted at face value their claim to be genuine Kansas residents. The result was duelling constitutions: for several years Kansas had two governments, in two different cities (Lecompton and Lawrence), with two constitutions, one pro- and one anti-slavery, each claiming to be the only legitimate government of the entire territory.\n",
        "type": []
    },
    "170": {
        "link": "/wiki/1st_Mechanical_Kansas_Militia",
        "title": "1st Mechanical Kansas Militia",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "",
        "county": "",
        "paragraph": "\nThe 1st Kansas Mechanical Militia was a militia-movement organization based in Kansas, United States. The group became known for openly campaigning for war against the federal government of the United States and claiming that Chinese communist troops were training on American soil. It is unknown if the group is still active.[1][2]\nThe group was led by Bradley Glover, a conspiracy theorist. The Militia itself claimed to have around 1000 members. The group maintained contact with other anti-government groups and individuals such as Kevin and Terry Hobeck from Ohio, Ronald Griesacker from the Republic of Texas Militia Group, and Merlon \"Butch\" Lingenfelter, Jr., a longtime follower of the UFO phenomenon. Two FBI agents infiltrated and observed the group. Glover and others wanted to attack the 4th of July Independence Day celebrations of 1997 at Fort Hood. Glover and Michael Dorsett were arrested in July 16.[3][4] Seven men and women arrested during the month of July had planned to use antipersonnel bombs and other weapons at bases where they believed United Nations troops were stationed, said Lt. Richard Coffey of the Missouri Highway Patrol. They were initially charged with possession of illegal weapons.[5][6][7]\n",
        "type": [
            "terrorism",
            "riot"
        ]
    },
    "171": {
        "link": "/wiki/Assassination_of_George_Tiller",
        "title": "Assassination of George Tiller",
        "date": "May 31, 2009",
        "year": "2009",
        "location": "Foyer of ReformationLutheran Church7601 East 13th StreetWichita, Kansas",
        "state": "Kansas",
        "place": "Wichita",
        "county": "Sedgwick County",
        "paragraph": "\nOn May 31, 2009, George Tiller, a physician from Wichita, Kansas, who was nationally known for being one of the few doctors in the United States to perform late terminations of pregnancy (also known as \"late-term abortions\"), was murdered by Scott Roeder, an anti-abortion extremist.[2][3][4] Tiller was killed during a Sunday morning service at his church, Reformation Lutheran Church,[5] where he was serving as an usher. Tiller had previously survived an assassination attempt in 1993 when Shelley Shannon shot him in the arms.\nRoeder was arrested within three hours of the shooting and charged with first-degree murder and related crimes two days later. In November 2009, Roeder publicly confessed to the killing, telling the Associated Press that he had shot Tiller because \"preborn children's lives were in imminent danger.\"[6][7] Roeder was found guilty of first-degree murder and two counts of aggravated assault on January 29, 2010,[8] and sentenced on April 1, 2010, to life imprisonment without any chance of parole for 50 years. This sentence was later reduced to allow for the possibility of parole after serving 25 years.[9]\n",
        "type": [
            "murder",
            "assault",
            "shooting",
            "killing"
        ]
    },
    "172": {
        "link": "/wiki/Julius_Wayland",
        "title": "Julius Wayland",
        "date": "November 10, 1912(1912-11-10) (aged 58) Girard, Kansas, U.S.",
        "year": "1912",
        "location": "",
        "state": "Kansas",
        "place": "Girard",
        "county": "Crawford County",
        "paragraph": "Julius Augustus Wayland (April 26, 1854 – November 10, 1912) was a Midwestern US socialist during the Progressive Era. He is most noted for publishing Appeal to Reason, a socialist publication often deemed to be the most important socialist periodical of the time.[1][2]\nJulius Wayland was born in Versailles, Indiana, on April 26, 1854. As an infant, his father and four of his siblings died in a cholera epidemic. His early years were spent in abject poverty and he was forced to find work after only two years of schooling. He then apprenticed to a printer in his home town.[citation needed]\nWayland became owner of the Versailles Gazette in 1874. As a result of reading books such as Laurence Gronlund's The Cooperative Commonwealth and Edward Bellamy's Looking Backward, Wayland became a socialist. His writings created tensions with home-town conservatives and he fled Versailles to avoid lynching.[1]\n",
        "type": [
            "lynching"
        ]
    },
    "173": {
        "link": "/wiki/Overland_Park_Jewish_Community_Center_shooting",
        "title": "Overland Park Jewish Community Center shooting",
        "date": "April 13, 2014 (2014-04-13) c. 1:00 p.m. – c. 2:45 p.m. (CDT)",
        "year": "2014",
        "location": "Overland Park, Kansas, United States",
        "state": "Kansas",
        "place": "Overland Park",
        "county": "Johnson County",
        "paragraph": "On April 13, 2014, two shootings occurred at the Jewish Community Center of Greater Kansas City and Village Shalom, a Jewish retirement community, both located in Overland Park, Kansas. A total of three people were killed in the shootings, two of whom were shot at the community center and one shot at the retirement community. The gunman, 73-year-old Frazier Glenn Miller Jr. of Aurora, Missouri, originally from North Carolina, was arrested during the attack and was subsequently tried, convicted of murder and other crimes, and sentenced to death. Miller, a former Klansman, neo-Nazi and former political candidate, died in prison in 2021 while awaiting execution.[5]\nThe shootings began at around 1:00 p.m. (CDT) at a rear parking lot of the Jewish Community Center of Greater Kansas City, near the entrance to the White Theater. The gunman first fired a handgun at two men. One of the men managed to escape immediately, while the second man tried to flee in his car. A bullet struck the shoulder bag of the man's seat, but he escaped uninjured.[6] The shooter then fired at two males, 69-year-old[7] William Lewis Corporon and his 14-year-old grandson, Reat Griffin Underwood, who were hit by gunfire as they pulled into the parking lot inside their car. Corporon died at the scene of a shotgun wound to the head, while Underwood died of handgun wounds at a hospital.\nDuring the time of the first shooting, teenagers were inside the building auditioning for KC Superstar, a singing competition.[8] In addition to that, actors, crew members, and other staff were in the White Theater preparing for a 2:00 p.m. performance of To Kill a Mockingbird. There was also a fitness program being conducted for children with autism, Fun and Fitness with Friends.  This program consisted of 15 children with autism and 6 volunteers. The gunman was able to fire several shots into the building. The staff inside the building were the first to make 9-1-1 calls alerting the police. Multiple staff members, one with paramedic training and the other with military medical experience, attempted life-saving measures on the victims, but were ultimately unsuccessful.[9]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "174": {
        "link": "/wiki/Henry_Washington_Younger",
        "title": "Henry Washington Younger",
        "date": "July 20, 1862 (aged 52) Westport, Missouri, US",
        "year": "1862",
        "location": "",
        "state": "Kansas",
        "place": "Kansas City",
        "county": "Wyandotte County",
        "paragraph": "Henry Washington Younger (February 22, 1810 – July 20, 1862) was a businessman and father to the Younger outlaws Cole, Jim, John and Bob. He was the father of fourteen children.  He was the son of Colonel Charles Lee Younger and Sarah Sullivan Purcell and married Bersheba Leighton Fristoe in about 1830.\nThe family moved to Harrisonville in 1857, and in 1859 Henry was assigned as second mayor of the city.[1]\nHe was frequently robbed and lost a lot of money.  This angered his son Cole who thought he should make a stand. On July 20, 1862 Henry was traveling to Kansas City on a business trip while carrying $1,500 on his person. About one mile south of Westport he was shot three times in the back and killed. It was discovered the killing was politically motivated and not a robbery.\n",
        "type": [
            "robbery",
            "robber",
            "killing"
        ]
    },
    "175": {
        "link": "/wiki/Perry_Edward_Smith",
        "title": "Perry Edward Smith",
        "date": "November 15, 1959",
        "year": "1959",
        "location": "",
        "state": "Kansas",
        "place": "Holcomb",
        "county": "Finney County",
        "paragraph": "Perry Edward Smith (October 27, 1928 – April 14, 1965) was one of two career criminals convicted of murdering the four members of the Clutter family in Holcomb, Kansas, United States, on November 15, 1959, a crime that was made famous by Truman Capote in his 1966 non-fiction novel In Cold Blood.[1][2] Along with Richard Hickock, Smith took part in the burglary and multiple murder at the Clutter family farmhouse.\nPerry Edward Smith was born in Huntington, Nevada, a now-abandoned community in Elko County.[3] His parents, Florence Julia \"Flo\" Buckskin and John \"Tex\" Smith, were rodeo performers.[3] Sources conflict on whether Smith was of mixed Dutch and Shoshone ancestry (from his father's and mother's side, respectively)[4] or Irish–Cherokee.[5] The family moved to Juneau, Alaska in 1929, where the elder Smith distilled bootleg whisky for a living. Smith's father abused his wife and four children, and in 1935 his wife left him, taking the children with her to San Francisco, California.[3]\nSmith and his siblings were raised initially with their alcoholic mother, Flo. After Flo died from choking on her own vomit when he was 13, he and his siblings were placed in a Catholic orphanage, where nuns allegedly[6] abused him physically and emotionally for his lifelong problem of chronic bed wetting, a result of malnutrition. He was also placed in a Salvation Army orphanage, where one of the caretakers allegedly[6] tried to drown him. In his adolescence, Smith reunited with his father, Tex, and together they lived an itinerant existence across much of the western United States. Smith also spent time in different juvenile detention homes after joining a street gang and becoming involved in petty crime. In the mid-1960s, Tex moved to Cold Springs, Nevada, where he lived to the age of 92 before dying by suicide, distraught over poor health.[7]\n",
        "type": [
            "murder",
            "mass murder",
            "burglary"
        ]
    },
    "176": {
        "link": "/wiki/Richard_Grissom",
        "title": "Richard Grissom",
        "date": "",
        "year": "new 1989",
        "location": "",
        "state": "Kansas",
        "place": "Johnson County",
        "county": "Johnson County",
        "paragraph": "Richard Anthony Grissom Jr. (born November 10, 1960) is an American serial killer who, over eight days in June 1989, murdered three young women in Johnson County, Kansas. Grissom, who years earlier had been imprisoned for killing his neighbor, was convicted of the three murders and sentenced to life in prison. The bodies of the women have never been found.[1]\nRichard Anthony Grissom Jr. was born on an American military installation in South Korea, the son of a US army Seargent and a South Korean woman, on November 10, 1960.[2] Its unknown what his original name was, but soon after his birth his family gave him up to an orphanage, where three years later he was adopted by US army Seargent Richard Grissom Sr. and his wife Fredonia.[3] Afterwards the family moved to the United States. Even there, his new family moved across numerous states before finally settling in Kansas state.[2] Details of his childhood are not exactly known, but after his family moved to Leavenworth in the mid-1970s, Grissom enrolled at Leavenworth High School, where he gained popularity as a friendly, good looking, and smart kid who regularly got As and Bs and was a halfback for his school's football team.[2]\nOn the morning of January 27, 1977, Grissom left his home after an argument with his parents.[2] Sometime after leaving, he stole a railroad spike, which he used to break into the home of his neighbor, 72-year-old Hazel Meeker. In the house he attacked Meeker, viciously beating her until her death, then left the house. Meeker's granddaughter, Carla, went to visit her grandmother, but found her dead body in a pool of blood.[4] She contacted the police who showed up and conducted an investigation. Police discovered that there were footprints in the snow all around the house, and they subsequently followed the trail which led them to the southern railroad tracks.[4] They continued to follow them until they ended right where Grissom was hiding in a trailer park. When they noticed him, Grissom attempted to bury a handgun he had stolen from another home under the snow, but police handcuffed him before he could.[4]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "177": {
        "link": "/wiki/Bloody_Benders",
        "title": "Bloody Benders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Labette County",
        "county": "Labette County",
        "paragraph": "The Bender family, more well known as the Bloody Benders, were a family of serial killers who lived and operated in Labette County, Kansas, United States, from May 1871 to December 1872.[1] The family consisted of John Bender, his wife Elvira and their son John Jr. and daughter Kate. While popular retelling of the story holds that John Jr. and Kate were siblings, contemporary newspapers reported that several of the Benders' neighbors had stated that they claimed to be married, possibly in a common law marriage.\nWhile there is no definitive number, estimates report that the Benders killed at least a dozen travelers before their crimes were discovered. The fate of the family remains unknown, with theories ranging from a lynching of the family to a successful escape. Much folklore and legend surrounds the Benders, making it difficult to separate fact from fiction.\nIn October 1870, five families of spiritualists homesteaded in and around the township of Osage in northwestern Labette County, approximately 7 mi (11 km) northeast of where Cherryvale was established seven months later. One of the families was John Bender Sr. and John Bender Jr., who registered 160 acres (65 ha) of land located adjacent to the Great Osage Trail, which was then the only open road for traveling farther west. After a cabin, a barn with a corral, and a well were built, in the fall of 1871, Elvira Bender and daughter Kate arrived, and the cabin was divided into two rooms by a canvas wagon-cover. The Benders used the smaller room at the rear for living quarters, while the front room was converted into a \"general store\" where a few dry goods were sold. The front section also contained the kitchen and dining table, where travelers could stop for a meal or even spend the night. Elvira and Kate Bender also planted a 2-acre (0.81 ha) vegetable garden and apple orchard north of the cabin.[1][2][3]\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "178": {
        "link": "/wiki/Fort_Bain",
        "title": "Fort Bain",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kansas",
        "place": "Fort Scott",
        "county": "Bourbon County",
        "paragraph": "Fort Bain (also called \"Fort Bourbon\") was a log house in the Kansas Territory built in 1857 by John Brown and his associate Captain Oliver P. Bain (or Baynes).[1]  The house was located in northern Bourbon County, on the north side of the Osage River 1.5 miles due east of Fort Lincoln, approximately seven miles from the border with Missouri, near the present town of Fulton.[2]\nThe house was used as a rendezvous point for both John Brown and James Montgomery throughout 1857-58 during the Bleeding Kansas troubles, and was also a point on the Underground Railroad.  Although no contemporary illustrations or photographs of the house have been located, it was described by Brown as being substantial and capable of housing 50 men.[citation needed]\nOn December 16, 1857, a small number of men who identified themselves as a \"Squatter's Court\" defended the house against an armed posse of about 50 men led by United States Deputy Marshal Little from Fort Scott.[3]  Upon the arrival of Little's force, a parley ensued, but ended without resolution.  Little advanced on the house and four of his men were wounded.  Retreating and regrouping, Little and ten men attempted a second attack on Fort Bain, which was also unsuccessful but without any casualties.  Little and his men then returned to Fort Scott.  Little returned on December 17 with 150 men and found that Fort Bain had been abandoned by the Free Staters.[4]\n",
        "type": []
    },
    "179": {
        "link": "/wiki/Henry_Newton_Brown",
        "title": "Henry Newton Brown",
        "date": "April 30, 1884 (aged 26-27) Medicine Lodge, Kansas",
        "year": "1884",
        "location": "",
        "state": "Kansas",
        "place": "Phelps County",
        "county": "Sedgwick County",
        "paragraph": "Gunfighter\nHenry Newton Brown (1857 – April 30, 1884) was an American Old West gunman who played the roles of both lawman and outlaw during his life.\nBrown was raised in Cold Springs Township, in Phelps County, ten miles south of Rolla, Missouri. An orphan, he lived there with his uncle Jasper and aunt Aldamira Richardson until the age of seventeen, when he left home and headed west.  He drifted through various cowboy jobs in Colorado and Texas, supposedly killing a man in a gunfight in the Texas Panhandle.\n",
        "type": [
            "robber",
            "killing"
        ]
    }
}