[
    {
        "link": "/wiki/Bloody_Monday",
        "title": "Bloody Monday",
        "date": "August 6, 1855",
        "year": "1855",
        "location": "Louisville, Kentucky",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "Protestant Mob\nCatholic residents\nBloody Monday was a series of riots on August 6, 1855, in Louisville, Kentucky, an election day, when Protestant mobs attacked Irish and German Catholic neighborhoods. These riots grew out of the bitter rivalry between the Democrats and the Nativist Know-Nothing Party. Multiple street fights raged, leaving twenty-two people dead, scores injured, and much property destroyed by fire. Five people were later indicted, but none were convicted, and the victims were not compensated.\n"
    },
    {
        "link": "/wiki/Sexual_assault_of_Savannah_Dietrich",
        "title": "Sexual assault of Savannah Dietrich",
        "date": "August 2011 (2011-08)",
        "year": "2011",
        "location": "Louisville, Kentucky",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "\nIn August 2011, a female American high-school student named Savannah Dietrich was sexually assaulted by Will Frey and Austin Zehnder, lacrosse players from Trinity High School (Louisville), an exclusive Catholic high school in Louisville, Kentucky.[1][2] The assault was photographed by Frey and Zehnder and other observers, and images and comments from the incident went viral on the internet.\nIn a plea bargain, two 16-year-old boys Frey and Zehnder pleaded guilty to sexual abuse in the first degree, a felony, and voyeurism, a misdemeanor. Dietrich released the names of her attackers and argued publicly that they were not adequately punished despite being instructed not to discuss the case by the presiding judge. International controversy regarding the case developed when attorneys for the boys attempted to have her held in contempt, but the motion was subsequently dropped.\n"
    },
    {
        "link": "/wiki/Mel_Ignatow",
        "title": "Mel Ignatow",
        "date": "September 1, 2008(2008-09-01) (aged 70)Louisville, Kentucky, U.S.",
        "year": "2008",
        "location": "",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "\nMelvin Henry Ignatow[1] (March 26, 1938 – September 1, 2008)[2] was a resident of Louisville, Kentucky, U.S., who was tried for the 1988 murder of his former girlfriend, Brenda Sue Schaefer. The case was controversial because Ignatow was acquitted of the charge and he later admitted killing Schaefer. Under the legal principle of double jeopardy, however, Ignatow could not be tried a second time for the murder. He was, instead, convicted and jailed for several instances of perjury in his grand jury testimony for the case.[3]\nIgnatow and Brenda Schaefer had been in a relationship for two years at the time of the murder.[4] Ignatow knew that Schaefer, who had complained that he was abusive, was planning to break off the involvement.[5] He asked a former girlfriend, Mary Ann Shore, to help him plan and carry out the murder. They spent several weeks making extensive preparations. Shore testified they had \"scream tested\" her house and dug a grave in the woods behind it.\n"
    },
    {
        "link": "/wiki/Louisville_protest_shooting",
        "title": "Killing of Breonna Taylor",
        "date": "March 13, 2020; 2 years ago (2020-03-13)",
        "year": "2020",
        "location": "Louisville, Kentucky, U.S.",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "\nBreonna Taylor, a 26-year-old African-American woman, was fatally shot in her Louisville, Kentucky apartment on March 13, 2020, when at least seven police officers forced entry into the apartment as part of an investigation into drug dealing operations.[10] Three Louisville Metro Police Department (LMPD) officers—Jonathan Mattingly, Brett Hankison, and Myles Cosgrove—were involved in the shooting. Taylor's boyfriend, Kenneth Walker, was inside the apartment with her when the plainclothes officers knocked on the door and then forced entry.[11][12] The officers said that they announced themselves as police before forcing entry, but Walker said he did not hear any announcement, thought the officers were intruders, and fired a warning shot at them.[13] The shot hit Mattingly in the leg,[14] and the officers fired 32 shots in return.[11][15][16] Walker was unhurt but Taylor, who was behind Walker, was hit by six bullets and died.[17][11][18][19][20] During the incident, Hankison moved to the side of the apartment and shot 10 bullets through a covered window and glass door.[21] According to police, Taylor's home was never searched.[13][22]\nWalker was charged with assault and attempted murder of a police officer, but the charges were dismissed with prejudice 12 months later. On June 23, 2020, the LMPD fired Hankison for blindly firing through the covered patio door and window of Taylor's apartment.[23] On September 15, the city of Louisville agreed to pay Taylor's family $12 million and reform police practices.[24] On September 23, a state grand jury indicted Hankison on three counts of first-degree wanton endangerment for endangering Taylor's neighbors with his shots.[25][26] Cosgrove was determined to have fired the fatal shot that killed Taylor.[27] On October 2, 2020, recordings from the grand jury investigation into the shooting were released.[28] Two of the jurors released a statement saying that the grand jury was not presented with homicide charges against the officers.[29][30] Several jurors have also accused Kentucky Attorney General Daniel Cameron and the police of covering up what happened.[31][32][33]\n"
    },
    {
        "link": "/wiki/1968_Louisville_riots",
        "title": "1968 Louisville riots",
        "date": "May 27–29, 1968",
        "year": "1968",
        "location": "Louisville, Kentucky, United States",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "The Louisville riots of 1968 refers to riots in Louisville, Kentucky in May 1968. As in many other cities around the country, there were unrest and riots partially in response to the assassination of Martin Luther King Jr., on April 4. On May 27, a group of 400 people, mostly blacks, gathered at 28th and Greenwood Streets, in the Parkland neighborhood. The intersection, and Parkland in general, had recently become an important location for Louisville's black community, as the local NAACP branch had moved its office there.\nThe crowd was protesting against the possible reinstatement of a white officer who had been suspended for beating a black man some weeks earlier. Several community leaders arrived and told the crowd that no decision had been reached, and alluded to disturbances in the future if the officer was reinstated. By 8:30, the crowd began to disperse.\nHowever, rumors (which turned out to be untrue) were spread that Student Nonviolent Coordinating Committee speaker Stokely Carmichael's plane to Louisville was being intentionally delayed by whites. After bottles were thrown by the crowd, the crowd became unruly and police were called. However the small and unprepared police response simply upset the crowd more, which continued to grow. The police, including a captain who was hit in the face by a bottle, retreated, leaving behind a patrol car, which was turned over and burned.\n"
    },
    {
        "link": "/wiki/Tom_Payne_(basketball)",
        "title": "Tom Payne (basketball)",
        "date": "",
        "year": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nThomas Robert Payne (born November 19, 1950) is a former professional basketball player, professional boxer and a convicted serial rapist.\nA 7-foot, 2-inch center, Payne played with the Atlanta Hawks of the National Basketball Association (NBA) during the 1971-1972 season.[1] He was also the first African American ever to play basketball for the University of Kentucky.[2]\n"
    },
    {
        "link": "/wiki/Standard_Gravure_shooting",
        "title": "Standard Gravure shooting",
        "date": "September 14, 1989 (1989-09-14) 8:38 – 9:00 a.m. (EDT)",
        "year": "1989",
        "location": "Louisville, Kentucky, United States",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "The Standard Gravure shooting occurred on September 14, 1989, in Louisville, Kentucky, when Joseph T. Wesbecker, a 47-year-old pressman, killed eight people and injured twelve at his former workplace, Standard Gravure, before committing suicide. The shooting is the deadliest mass shooting in Kentucky's history.[1] The murders resulted in a high-profile lawsuit against Eli Lilly and Company, manufacturers of the antidepressant drug Prozac, which Wesbecker had begun taking during the month prior to his shooting rampage.[2]\nOn September 14, 1989, Wesbecker, who was nicknamed \"Rocky\" by his colleagues, parked his car in front of the main entrance of Standard Gravure and entered the plant at 8:38 a.m., carrying a Polytech AK-47S, (a Chinese-made semiautomatic AK-47 derivative), a SIG Sauer P226 9mm pistol, and a duffel bag containing two MAC-11s, a snubnosed .38 caliber Smith & Wesson Model 12 Airweight revolver, a bayonet, and several hundred rounds of ammunition.[2]\nHe took the elevator to the executive reception area on the third floor and, as soon as the doors opened, he fired at receptionists Sharon Needy, whom he killed, and Angela Bowman, who he paralyzed with a shot in the back. Searching for Standard Gravure's President, Michael Shea, and other supervisors and managers of the plant, Wesbecker calmly walked through the hallways, deliberately shooting at people. He killed James Husband and injured Forrest Conrad, Paula Warman and John Stein, a bindery supervisor whom he shot in the head and abdomen. Wesbecker then headed down the stairs to the pressroom, where he killed Paul Sallee and wounded Stanley Hatfield and David Sadenfaden, two electricians from Marine Electric who were working on a broken machine.[2]\n"
    },
    {
        "link": "/wiki/Trinity_murders",
        "title": "Trinity murders",
        "date": "September 29, 1984",
        "year": "1984",
        "location": "Louisville, Kentucky, United States",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "The \"Trinity murders\" (so named for the high school attended by the victims) occurred in Louisville, Kentucky on September 29, 1984, when Victor Dewayne Taylor and George Ellis Wade kidnapped and murdered two 17-year-old Trinity High School students, Scott Christopher Nelson and Richard David Stephenson. Taylor was sentenced to death, and Wade was sentenced to life imprisonment.[1]\nOn September 29, 1984, Scott Nelson and Richard David Stephenson were headed to a Trinity High School soccer game at Louisville Male High School football stadium on East Burnett Avenue in the Schnitzelburg neighborhood of Louisville, Kentucky, when they became lost.[2] The pair stopped at a  Moby Dick restaurant located at the intersection of Logan & Oak Street to get directions, where Victor Taylor and his cousin George Wade said they would lead them to the stadium in exchange for a ride.[2] Nelson and Stephenson were instead taken to a vacant lot in the 300 block of Ardella Ct. near the football stadium of Louisville Male High School where they were forced to take off their clothes, hand over their personal property, and were bound and gagged. After Victor Taylor sexually assaulted one of them, Nelson and Stephenson were shot in the back of the head to avoid the identification of Taylor and Wade.\nThe widely publicized murders led to the suspects when a relative who had been given a Trinity High school jacket reported George Wade to the police. Wade implicated Victor Taylor in the crime, and the personal belongings of the two murdered students were found in the home of Taylor's mother.\n"
    },
    {
        "link": "/wiki/TWA_Flight_541",
        "title": "TWA Flight 541",
        "date": "December 21, 1978",
        "year": "1978",
        "location": "",
        "state": "New York",
        "county": "Los Angeles",
        "paragraph": "\nTWA Flight 541 was a domestic passenger flight hijacked in the United States by Robin Oswald in an attempt to free Garrett Brock Trapnell, who was a prisoner at the United States Penitentiary, Marion (USP Marion).[1]  The hijacking was successfully resolved when a Federal Bureau of Investigation (F.B.I.) negotiating team had her release the passengers and then surrender.[2]\nOn January 29, 1972, Garrett B. Trapnell hijacked a TWA plane flying from Los Angeles to New York. He demanded $306,800 (equivalent to $1,987,488 in 2021), the release of the imprisoned Angela Davis and a conversation with President Nixon.[3] The hijacking was resolved when Trapnell was disarmed after being shot by an F.B.I. agent who pretended to be a negotiator.[3]\n"
    },
    {
        "link": "/wiki/Shawn_Windsor",
        "title": "Shawn Windsor",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "Shawn William Windsor (born November 29, 1963) is an American man convicted of killing his estranged wife, Betty Jean Windsor, and son, Corey Windsor, in Louisville, Kentucky in 2003. Windsor appeared on the television show America's Most Wanted twice before viewers provided police with tips that led to his July 2004 capture in Shelby, North Carolina. Windsor was sentenced to death on November 17, 2006, and is currently on death row at the Kentucky State Penitentiary in Eddyville, Kentucky.\n\n\n"
    },
    {
        "link": "/wiki/Henry_Hardin_Cherry_Hall",
        "title": "Henry Hardin Cherry Hall",
        "date": "",
        "year": "",
        "location": "Bowling Green, Kentucky",
        "state": "Kentucky",
        "county": "",
        "paragraph": "Henry Hardin Cherry Hall is a building located on the campus of Western Kentucky University in Bowling Green, Kentucky. Built with funds appropriated under the New Deal,[2] the building was completed in 1937. It is named for Henry Hardin Cherry, who founded the Bowling Green Normal School, the forerunner of the modern university. It was added to the National Register of Historic Places in 1979.\nThe idea for the construction of Henry Hardin Cherry Hall (or Cherry Hall for short) was formulated by Louisville architect Brinton B. Davis. Nicknamed \"the hill builder,\"[3]  Davis had designed a majority of the buildings at what became Western Kentucky University prior to that time. His plan was to use funds appropriated through the Public Works Administration to make improvements to the campus and expand classroom space.\nThe crown jewel of the university, Cherry Hall was completed in 1937. Located at the intersection of College and 15th Streets,[4] the building contained space for fifty classrooms, sixteen laboratories and sixty offices. At the time of its construction, Cherry also housed the campus bookstore and post office.[2] The building contains three floors, as well as a basement which provides extra office and classroom space.\n"
    },
    {
        "link": "/wiki/Hines_House_(Bowling_Green,_Kentucky)",
        "title": "Hines House (Bowling Green, Kentucky)",
        "date": "",
        "year": "",
        "location": "1103 Adams St., Bowling Green, Kentucky",
        "state": "Kentucky",
        "county": "Bowling Green",
        "paragraph": "The Hines House was a historic building in Bowling Green, Kentucky, placed on the National Register of Historic Places on December 18, 1979.  It was built by and for the Reverend James Davis Hines around the year 1840.  Hines eventually sold the building to an N.E. Goodsall, whose heirs sold the house in 1859 to Doctor Albert Covington.[2]\nWhen added to the National Register, it was one of the few houses left in Bowling Green of that age and structure.[2]  The house was destroyed by an intentionally set fire on 12 February 1995.[3]\n\n"
    },
    {
        "link": "/wiki/Ashland_tragedy",
        "title": "Ashland tragedy",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Ashland",
        "paragraph": "The Ashland tragedy is the name given to the violent murder of three teenagers, Robert and Fannie Gibbons and Emma Carico, in Ashland, Kentucky in 1881.[1]\nRobert and Fannie Gibbons and Emma Carico (otherwise known under her stepfather's surname of Thomas),[2] staying together at the Gibbons home in Ashland, were beaten to death with axes on the night of December 23, 1881. Afterwards, the murderers set the house on fire. Emma's mother, next door, saw the flames and sounded an alarm. Neighbors found the three victims inside.\nGeorge Ellis, a bricklayer, soon confessed to the crime, and implicated fellow workers William Neal and Ellis Craft. The three were taken to a Catlettsburg jail, removed to avoid a lynch mob, and returned for trial on January 16, 1882. Neal and Craft were convicted in a ten-day trial and sentenced to death; they appealed the verdict.\n"
    },
    {
        "link": "/wiki/Lynching_of_Benjamin_and_Mollie_French",
        "title": "Lynching of Benjamin and Mollie French",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Warsaw",
        "paragraph": "The lynching of the Frenches of Warsaw took place in Warsaw, Gallatin County, Kentucky on May 3, 1876, between 1 am and 2 am on a Wednesday morning. Benjamin and Mollie French, African Americans,  were lynched by a white mob for the murder of another African American, which was unusual for this period.[1] Lake Jones was an elderly black man who had faithfully served a white family named Howard, both before and after his emancipation from slavery.[2] The Frenches were accused of poisoning Lake Jones with arsenic and intending to steal his money.[3][4][5][6]\nThe Ku Klux Klan lynched the Frenches because, they said, Lake Jones was \"the best nigger in the country.\"[1][7][8] The KKK broke into the jail, took the Frenches about a mile upstream of Warsaw, and hanged them both from a tree on J.H. McDaniels' (McDonnell's in another account) farm.[2][7]\nLake Jones lived with his cousin Mollie and her husband Benjamin French in a run-down building called \"the Malt-house\" in Warsaw.[7] When he moved in with the Frenches, Jones contributed to the household food and paid their rent. After he moved out, the Frenches schemed to get the rest of his money.\n"
    },
    {
        "link": "/wiki/1866_Gallatin_County_race_riot",
        "title": "1866 Gallatin County race riot",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Gallatin County",
        "paragraph": "The 1866 Gallatin County Race Riot took place from August 3 past August 13 a year after the close of the American Civil War in Gallatin County, Kentucky. It was part of waves of violence by whites against blacks in the state, and even in northern Kentucky, where the black population was relatively small.[1] According to historians Lowell H. Harrison and James C. Klotter, \"A band of five hundred whites in Gallatin County... forced hundreds of blacks to flee across the Ohio River.\"[2]\nThis was part of white insurgent violence throughout the state against blacks. In the aftermath of war, most veterans had retained their arms. The Freedmen's Bureau reported \"hundreds of outrages\" against blacks during this year.[3] The Civil Rights Act of 1866 had been passed by Congress, giving blacks the right to testify against whites in court, but Kentucky courts ignored the law, and white vigilantes went largely unpunished.[3]\nIn areas with a relatively small black population, like Gallatin County, whites sometimes tried to drive all blacks away. During the 1866 race riot, for example, some 500 whites in Warsaw were \"whipping Blacks, stealing their property, and ordering them to leave the area,\" according to a letter by the local Freedman's Bureau office.[4][1]\n"
    },
    {
        "link": "/wiki/Lynching_of_Marie_Thompson",
        "title": "Lynching of Marie Thompson",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Lebanon",
        "paragraph": "\nThe lynching of Marie Thompson of Shepherdsville took place in the early morning on June 15, 1904, in Lebanon Junction, Bullitt County, Kentucky, for her killing of John Irvin, a white landowner. The day before Thompson had attempted to defend her son from being beaten by Irvin in a dispute; he ordered her off the land. As she was walking away from him, he attacked her with a knife and she killed him in self-defense with a razor.[1][2][3] She was arrested and put in the county jail.\nAbout a dozen white men went to the jail at midnight the day of the killing to lynch Thompson. They were surprised by a group of blacks and fled the scene. Assured by the sheriff that he would protect Thompson, the African Americans left. Two hours later, a larger lynch mob of about 50 took Thompson from the jail and prepared to hang her from a nearby tree. She grabbed a knife and freed herself, but did not run far before the group brought her down with a fusillade of mortal shots. She died the following day in jail of her injuries.\n"
    },
    {
        "link": "/wiki/Lynching_of_the_Walker_family",
        "title": "Lynching of the Walker family",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Fulton County",
        "paragraph": "\nThe lynching of the Walker family took place near Hickman, Fulton County, Kentucky, on October 3, 1908, at the hands of about fifty masked Night Riders.[1] David Walker was a landowner, with a 21.5-acre (8.7 ha) farm. The entire family of seven African Americans, parents, infant in arms, and four children, was reported killed, with the event carried by national newspapers. Governor Augustus E. Willson of Kentucky strongly condemned the murders and promised a reward for information leading to prosecution. No one was ever prosecuted. \nThese murders took place in a period of civil disruption when white farmers in western Kentucky and Tennessee organized as Night Riders, threatening and attacking people after the West Tennessee Land Company took private control of the Reelfoot Lake. Local residents had long treated the lake as their own. They were also resisting the expansion into this area of the cotton economy, led by large-scale planters who hired many African Americans as sharecroppers. \n"
    },
    {
        "link": "/wiki/Lynching_of_Leonard_Woods",
        "title": "Lynching of Leonard Woods",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Whitesburg",
        "paragraph": "\nLeonard Woods was an African-American man who was lynched by a mob in Pound Gap, on the border between Kentucky and Virginia, after they broke him out of jail in Whitesburg, Kentucky, on November 30, 1927.[1] Woods was alleged to have killed the foreman of a mine, Herschel Deaton. A mob of people from Kentucky and Virginia took him from the jail and away from town and hanged him, and riddled his body with shots.[2] The killing, which became widely publicized, was the last in a long line of extrajudicial murders in the area, and, prompted by the activism of Louis Isaac Jaffe and others, resulted in the adoption of strong anti-lynching legislation in Virginia.[3]\nAs happens frequently with lynchings, accounts printed by white newspapers differed considerably from those found in Black newspapers. The white papers had Woods (and two young Black women) essentially jumping onto a car (driven by Deaton, who was accompanied by two friends) and then shooting Deaton, a young Virginia man from a well-to-do family who was a foreman in a Kentucky mine. The narrative in the Black papers, prompted by a report written for the NAACP, provided background information that suggested that the two Black women involved may have been prostitutes involved with Deaton and his two companions, and that Woods had some kind of relationship with one or both of the women. The lynching, then, would have served to avert a trial in which Woods's testimony might have harmed the reputation of Deaton, his friends, and his family.\n"
    },
    {
        "link": "/wiki/Atlantis_Plastics_shooting",
        "title": "Atlantis Plastics shooting",
        "date": "June 25, 2008 (2008-06-25) c. 12:00 a.m. (CDT)",
        "year": "2008",
        "location": "Henderson, Kentucky, United States",
        "state": "Kentucky",
        "county": "Henderson",
        "paragraph": "\nThe Atlantis Plastics shooting was an incident of mass murder that took place at an Atlantis Plastics factory in Henderson, Kentucky, United States on June 25, 2008. The gunman, 25-year-old Wesley Neal Higdon, shot and killed five people and critically injured a sixth person before taking his own life.[1] The shooting is the worst in the history of Henderson County, Kentucky in terms of casualties, surpassing triple homicides occurring in 1799 and 1955.[2]\nHenderson police said that the shooter, who had a reputation for being difficult, had argued with supervisor Kevin Taylor and was being escorted out of the factory by the supervisor. The shooter apparently retrieved a handgun, shot the supervisor, then went back into the factory and shot five co-workers before turning the gun on himself.[3][4][5] Subsequent reports indicate that Taylor had reprimanded Higdon twice before the shooting, once for talking on his cell phone too much and for not wearing safety glasses, then later for an altercation with co-worker Joshua Hinojosa at a convenience store across the street from the factory.\n"
    },
    {
        "link": "/wiki/Heath_High_School_shooting",
        "title": "Heath High School shooting",
        "date": "December 1, 1997 7:45 a.m. (CST)",
        "year": "1997",
        "location": "West Paducah, Kentucky, U.S.",
        "state": "Kentucky",
        "county": "West Paducah",
        "paragraph": "\nThe Heath High School shooting occurred at Heath High School in West Paducah,  Kentucky, United States, on December 1, 1997. 14-year-old Michael Carneal opened fire on a group of students, killing three and injuring five.\nOn December 1, 1997, Carneal wrapped a shotgun and a rifle in a blanket and took them to school, passing them off as an art project he was working on. He carried a loaded Ruger MK II .22-caliber pistol in his backpack. Carneal rode to school with his sister and arrived at approximately 7:45 a.m. When he arrived, he inserted earplugs into his ears and took the pistol out of his bag. He fired ten rounds in fast succession at a youth group of students. Three girls later died and five other students were wounded.\n"
    },
    {
        "link": "/wiki/2022_shooting_of_Kentucky_police_officers",
        "title": "2022 shooting of Kentucky police officers",
        "date": "June 30, 2022 c. 6:44 p.m.[1]",
        "year": "2022",
        "location": "Allen, Kentucky, United States",
        "state": "Kentucky",
        "county": "Allen",
        "paragraph": "\nOn June 30, 2022, a mass shooting involving police officers occurred in Allen, Kentucky, United States. Three police officers and a police dog were killed, and four others were injured, including three police officers. The alleged shooter, 49-year-old Lance Storz, was arrested and charged with murder and attempted murder of a police officer.[1][2][3]\nFloyd County Sheriff John Hunt reported that around 2:30 p.m. on June 30, an officer received a phone call from someone who alleged that Lance Storz was holding a woman against her will and abusing her. The officer and another went to the home, where the woman was outside, and went with officers, who found Storz to be still inside the home. Storz's home was on an elevated spot that had a clear field of fire for about 200 yards with one single-lane road leading up to the property.[4] With testimony from the woman, officers procured a protection order for the woman and went to Storz's home to arrest him over the assault allegations.[5]\n"
    },
    {
        "link": "/wiki/Marshall_County_High_School_shooting",
        "title": "Marshall County High School shooting",
        "date": "January 23, 2018 7:57 AM[1] (CST)",
        "year": "2018",
        "location": "Draffenville, Kentucky, U.S.",
        "state": "Kentucky",
        "county": "Draffenville",
        "paragraph": "\nThe Marshall County High School shooting occurred at Marshall County High School near Benton, Kentucky,[a] on January 23, 2018. The gunman, 15-year-old student Gabe Parker, opened fire in an open area at the school, murdering two students and injuring 14 others.\nOn June 12, 2020, Parker was given two life sentences with the possibility of parole after 20 years.\n"
    },
    {
        "link": "/wiki/Standard_Gravure_shooting",
        "title": "Standard Gravure shooting",
        "date": "September 14, 1989 (1989-09-14) 8:38 – 9:00 a.m. (EDT)",
        "year": "1989",
        "location": "Louisville, Kentucky, United States",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "The Standard Gravure shooting occurred on September 14, 1989, in Louisville, Kentucky, when Joseph T. Wesbecker, a 47-year-old pressman, killed eight people and injured twelve at his former workplace, Standard Gravure, before committing suicide. The shooting is the deadliest mass shooting in Kentucky's history.[1] The murders resulted in a high-profile lawsuit against Eli Lilly and Company, manufacturers of the antidepressant drug Prozac, which Wesbecker had begun taking during the month prior to his shooting rampage.[2]\nOn September 14, 1989, Wesbecker, who was nicknamed \"Rocky\" by his colleagues, parked his car in front of the main entrance of Standard Gravure and entered the plant at 8:38 a.m., carrying a Polytech AK-47S, (a Chinese-made semiautomatic AK-47 derivative), a SIG Sauer P226 9mm pistol, and a duffel bag containing two MAC-11s, a snubnosed .38 caliber Smith & Wesson Model 12 Airweight revolver, a bayonet, and several hundred rounds of ammunition.[2]\nHe took the elevator to the executive reception area on the third floor and, as soon as the doors opened, he fired at receptionists Sharon Needy, whom he killed, and Angela Bowman, who he paralyzed with a shot in the back. Searching for Standard Gravure's President, Michael Shea, and other supervisors and managers of the plant, Wesbecker calmly walked through the hallways, deliberately shooting at people. He killed James Husband and injured Forrest Conrad, Paula Warman and John Stein, a bindery supervisor whom he shot in the head and abdomen. Wesbecker then headed down the stairs to the pressroom, where he killed Paul Sallee and wounded Stanley Hatfield and David Sadenfaden, two electricians from Marine Electric who were working on a broken machine.[2]\n"
    },
    {
        "link": "/wiki/Bloody_Monday",
        "title": "Bloody Monday",
        "date": "August 6, 1855",
        "year": "1855",
        "location": "Louisville, Kentucky",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "Protestant Mob\nCatholic residents\nBloody Monday was a series of riots on August 6, 1855, in Louisville, Kentucky, an election day, when Protestant mobs attacked Irish and German Catholic neighborhoods. These riots grew out of the bitter rivalry between the Democrats and the Nativist Know-Nothing Party. Multiple street fights raged, leaving twenty-two people dead, scores injured, and much property destroyed by fire. Five people were later indicted, but none were convicted, and the victims were not compensated.\n"
    },
    {
        "link": "/wiki/Corbin,_Kentucky_race_riot_of_1919",
        "title": "Corbin, Kentucky race riot of 1919",
        "date": "October 31, 1919",
        "year": "1919",
        "location": "Corbin, Kentucky, United States",
        "state": "Kentucky",
        "county": "Corbin",
        "paragraph": "Corbin, Kentucky race riot of 1919 was a race riot in 1919 in which a white mob forced nearly all the town's 200 black residents onto a freight train out of town, and a sundown town policy until the late 20th century.\nOn October 29, 1919, two men robbed and stabbed A.F. Thompson before escaping without him getting a good look.[1] Thompson was able to stumble to a nearby house and get help. Word quickly spread about the crime and that the attackers were two black men. On October 31, 1919, an enraged and armed white mob made up of hundreds of Corbin's townspeople organized and went house-to-house rounding up black residents.[2] When they felt that all of the African-Americans of the town had been gathered, the mob marched a group of approximately 200 men, women, and children to the train station, and herded them onto cramped railcars. The train departed with its human cargo and were sent south to the town Knoxville.[1][3][4][5] \"They swore at us and said: 'By God we are going to run all Negroes out of this town tonight,'\" said longtime black Corbin resident John Turner in a signed affidavit about the incident.[2]\nThis uprising was one of several incidents of civil unrest that began with the American Red Summer, in April 1919 - terrorist attacks on black communities and white oppression in over three dozen cities and counties. In most cases, white mobs attacked African-American neighborhoods. In some cases, black community groups resisted the attacks, especially in Chicago and Washington DC; however, more deaths occurred in rural areas during events like the Elaine Race Riot in Arkansas, where an estimated 100 to 240 black people were killed. Also, in 1919, were the Chicago Race Riot and Washington D.C. race riot in which 38 and 39 people (respectively) were killed.  Both events also had many more non-fatal injuries and extensive property damage reaching up into the millions of dollars.[6]\n"
    },
    {
        "link": "/wiki/Battle_of_Evarts",
        "title": "Battle of Evarts",
        "date": "May 5, 1931",
        "year": "1931",
        "location": "Evarts, Kentucky, United States",
        "state": "Kentucky",
        "county": "",
        "paragraph": "The Battle of Evarts (May 5, 1931) occurred in Harlan, Kentucky during the Harlan County Wars. The coal miners desired improved working conditions, higher wages, and more housing options for their families.[1] These reasons, along with other factors, led the miners to go on strike. It ended when the Kentucky National Guard was called in to break it up.[2] This battle lasted approximately 15 minutes.\nNumerous forces and factors were involved in the so-called battle. Opposing the miners were the heavily armed private \"police\" ordered by the company to break up the strike, while other associations chose not to become involved.[2] The United Mine Workers of America, or UMWA, considered helping the miners, but once it realized the amount of resources required, decided not to offer support. The Red Cross also decided not offer any support, saying the strike was an \"industrial dispute\" which did not involve them.[3] The Black Mountain Coal Company's hired gunmen were eager to fight, and were responsible for the deaths that followed.[4]\nThe 'Battle of Evarts' began on the morning of May 5, 1931. The company had ordered a motorcade to drive to Harlan to deliver goods to the 'Scabs' (non-union miners who had been hired to replace those on strike) there.[5] The motorcade consisted of just three cars, with a sheriff's deputy in each one. The deputies correctly expected violence, and had prepared for some sort of attack. The striking miners waited for the motorcade near the Evarts railroad, and as the motorcade approached them, a single shot rang out. No one knows who fired it, but each side blamed the other. The motorcade halted, and Deputy Jim Daniels, one of the most hated anti-union deputies in the county, jumped out and hid behind a rock.[5] Daniels raised his head to fire at the miners, but as soon as he did so, he was fatally shot and killed. The exchange of gunfire lasted for fifteen minutes, with an estimated 1,000 shots fired. When it ended, the three deputies and one miner lay dead.[5]\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Kentucky",
        "title": "George Floyd protests in Kentucky",
        "date": "May 28, 2020 – July 2020",
        "year": "2020",
        "location": "Kentucky, United States",
        "state": "Kentucky",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Kentucky, United States. In 2020, there were protests throughout Kentucky in reaction to the murder of George Floyd and the shooting of Breonna Taylor by police, as well as the shooting of David McAtee by the Kentucky Army National Guard. The demonstrations happened regularly in the largest cities in Kentucky, including Louisville and Lexington.[3][4] Many of the smaller cities had protests on at least one day.[5][6]\nOn June 5, protesters gathered at the old \"El Mariachi\" building on Daniel Boone Drive before marching to the Court Square. This is the first Black Lives Matter protest in Barbourville and was organized by the Tri-County Fairness Coalition. The crowd took a knee and engaged in an eight minute and 46 second moment of silence; the amount of time Derek Chauvin spent kneeling on George Floyd's neck while he was murdering Floyd. Floyd's murder and the death of Louisville's Breonna Taylor spurred protests across the country over racism and police brutality. The Barbourville protest was held on what would have been Taylor's 27 birthday.[7]\n"
    },
    {
        "link": "/wiki/Greene%E2%80%93Jones_War",
        "title": "Greene–Jones War",
        "date": "",
        "year": "",
        "location": "",
        "state": "North Carolina",
        "county": "Hawkins County",
        "paragraph": "The Greene–Jones War was an Appalachian Mountain clan feud in the United States reputed to be second only to that of the Hatfield–McCoy feud in scale, duration, and number of people killed. At least sixteen people, including one child, were killed during the course of the feud, and many others were seriously injured.[1] The feud took place primarily in the border areas of Hawkins County (formerly part of Sullivan County, North Carolina, one of the earliest Tennessee counties and said to have a large Melungeon population), Washington County, Claiborne County, Hancock County, Tennessee (created when Hawkins County, Tennessee was subdivided), and Lee County, Virginia, not far from Cumberland Gap, the narrow Appalachian Mountain pass sometimes called The Wilderness Road leading into Kentucky.\nMost of the history of this feud is found in family records, particularly in a self-published small-edition book by Alton Lee Greene, a genealogist who lived in Sanger, Texas. Alton Lee Greene (a 20th-century descendant of the feuding families) traced the genealogy of the descendants of American colonist Judge William Greene, a judge in the Court of Common Pleas who was born in Lincolnshire, England in 1671 and died in 1722 in Hunterdon County, New Jersey.[2] Judge Greene married Joanna \"Hannah\" Reeder, the daughter of John Reeder and Joanna  Burroughs Reeder, who was born in 1699 in Newtown, Long Island, New York.  Judge William Greene and Hannah settled in the area of Ewing, New Jersey and built the William Green House (Ewing Township, New Jersey), now on the National Historic Register and located on the campus of The College of New Jersey. Despite fund-raising efforts, the old farmhouse near where the troops of George Washington's crossing of the Delaware River once rested during the Revolutionary War, has never been fully restored.[3]\nJudge William Greene and Joanna Reeder Greene were the great-grandparents of Jeremiah Greene, who along with other Greene relatives migrated to an area near Rowan, North Carolina (a vast county of indefinite boundaries formed in 1753), where they formed a community called The Jersey Settlement by joining West Jersey residents who left New Jersey due to their unwillingness to adhere to the demands of Colonel Daniel Coxe, an English Colonial landowner and physician. Disgusted by Coxe's rampant political corruption, the Greene family settled near the Yadkin River in North Carolina and started the Jersey Settlement Meeting House, now on the National Historic Register. Jeremiah's family migrated to the Jersey Settlement and then to Hancock County, Tennessee, where his descendants figured prominently in the Greene–Jones War.[4]\n"
    },
    {
        "link": "/wiki/Harlan_County_War",
        "title": "Harlan County War",
        "date": "1931–1939",
        "year": "1931",
        "location": "Harlan County, Kentucky, United States",
        "state": "Kentucky",
        "county": "Harlan County",
        "paragraph": "\nHarry Simms\nSheriff J. H. Blair\n"
    },
    {
        "link": "/wiki/1968_Louisville_riots",
        "title": "1968 Louisville riots",
        "date": "May 27–29, 1968",
        "year": "1968",
        "location": "Louisville, Kentucky, United States",
        "state": "Kentucky",
        "county": "Louisville",
        "paragraph": "The Louisville riots of 1968 refers to riots in Louisville, Kentucky in May 1968. As in many other cities around the country, there were unrest and riots partially in response to the assassination of Martin Luther King Jr., on April 4. On May 27, a group of 400 people, mostly blacks, gathered at 28th and Greenwood Streets, in the Parkland neighborhood. The intersection, and Parkland in general, had recently become an important location for Louisville's black community, as the local NAACP branch had moved its office there.\nThe crowd was protesting against the possible reinstatement of a white officer who had been suspended for beating a black man some weeks earlier. Several community leaders arrived and told the crowd that no decision had been reached, and alluded to disturbances in the future if the officer was reinstated. By 8:30, the crowd began to disperse.\nHowever, rumors (which turned out to be untrue) were spread that Student Nonviolent Coordinating Committee speaker Stokely Carmichael's plane to Louisville was being intentionally delayed by whites. After bottles were thrown by the crowd, the crowd became unruly and police were called. However the small and unprepared police response simply upset the crowd more, which continued to grow. The police, including a captain who was hit in the face by a bottle, retreated, leaving behind a patrol car, which was turned over and burned.\n"
    },
    {
        "link": "/wiki/Northpoint_Training_Center",
        "title": "Northpoint Training Center",
        "date": "",
        "year": "",
        "location": "",
        "state": "Kentucky",
        "county": "Boyle County",
        "paragraph": "Northpoint Training Center is a medium-security prison located in Boyle County, near Danville, Kentucky. It opened in 1983 and had a prison capacity of 1,256 as of 2006.\nNorthpoint was originally constructed as a state mental hospital called Kentucky State Hospital.\nFrom 1941 to 1946, the U.S. Army controlled the facilities and renamed it Darnell Hospital.  It was used to provide care for soldiers suffering from psychiatric illness and to contain German prisoners of war (POWs).\n"
    },
    {
        "link": "/wiki/Redhead_murders",
        "title": "Redhead murders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "county": "",
        "paragraph": "\nThe Redhead murders is the media epithet used to refer to a series of unsolved homicides of redheaded females in the United States between October 1978 and 1992, believed to have been committed by an unidentified male serial killer. The murders believed to be related have occurred in states including Tennessee, Arkansas, Kentucky, Mississippi, Pennsylvania, and West Virginia.[1][2][3] The murders may have continued until 1992.[4][5][6] The victims, many remaining unidentified for years, were usually women with reddish hair, whose bodies were abandoned along major highways in the United States. Officials believe that the women were likely hitchhiking or may have engaged in sex work.[3][7]\nAuthorities are unsure how many people were responsible for these murders, if they were all performed by the same perpetrator(s), and how many victims there have been.[8] It is believed that there may have been a total of five to fourteen victims.[3][9][10] Of the presumed victims, four were identified by November 2018.[11][8][12][13] The suspect was informally called the \"Bible Belt Strangler\" in 2018, because of the territory where the bodies were found.\n"
    }
]