[
    {
        "link": "/wiki/C-Murder",
        "title": "C-Murder",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nCorey Miller (born March 9, 1971),[1] better known by his stage name C-Murder, is an American rapper and songwriter. He initially gained fame in the mid-1990s as a part of his brother Master P's label No Limit Records, primarily as a member of the label's supergroup, TRU. Miller went on to release several solo albums of his own through the label, including 1998's platinum Life or Death. C-Murder has released nine albums altogether on six different labels, No Limit Records, TRU Records, Koch Records, Asylum Records, RBC Records, and Venti Uno.\n"
    },
    {
        "link": "/wiki/Danziger_Bridge_shootings",
        "title": "Danziger Bridge shootings",
        "date": "September 4, 2005  (Central Daylight Time)",
        "location": "New Orleans, Louisiana, U.S.",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nOn the morning of September 4, 2005, six days after Hurricane Katrina struck New Orleans, members of the New Orleans Police Department (NOPD), ostensibly responding to a call from an officer under fire, shot and killed two civilians at the Danziger Bridge: 17-year-old James Brissette and 40-year-old Ronald Madison. Four other civilians were wounded. All the victims were African-American. None were armed or had committed any crime. Madison, a mentally disabled man, was shot in the back. The shootings caused public anger and further eroded the trust New Orleans had in the federal response to Hurricane Katrina and the NOPD.[2]\n"
    },
    {
        "link": "/wiki/Robert_Davis_(New_Orleans)",
        "title": "Robert Davis (New Orleans)",
        "date": "",
        "location": "",
        "state": "",
        "county": "New Orleans",
        "paragraph": "Robert Davis (born 1941) is a retired elementary school teacher and resident of New Orleans who was detained, arrested, and beaten by four police officers on October 8, 2005, on suspicion of public intoxication. Davis has denied intoxication, but he resisted arrest by failing to allow himself to be handcuffed and was beaten, which was filmed by the members of the Associated Press. A fifth officer was charged with assaulting an Associated Press producer.\nDavis is an African American and the two officers who beat him (while two others held him down) are white, adding to the controversy. Davis, who was charged with public intoxication, resisting arrest, battery, and public intimidation, pleaded not guilty on October 12, 2005.[1] The officers have also been charged with battery and were accused of using extreme force.[2] Regarding the charge of public intoxication, Davis said, \"I haven't had a drink in 25 years.\"[3]\n"
    },
    {
        "link": "/wiki/Mark_Essex",
        "title": "Mark Essex",
        "date": "December 31, 1972, and January 7, 1973",
        "location": "",
        "state": "New York",
        "county": "New Orleans",
        "paragraph": "Mark James Robert Essex (August 12, 1949[4] – January 7, 1973) was an American serial sniper and black nationalist known as the \"New Orleans Sniper\" who killed a total of nine people, including five policemen, and wounded twelve others in two separate attacks in New Orleans on December 31, 1972, and January 7, 1973. Essex was killed by police in the second armed confrontation.[2]\nEssex was a former member of a New York-based branch of the Black Panthers. He is strongly believed to have specifically sought to kill white people and police officers due to racism he had previously experienced while enlisted in the Navy. His increasingly extremist anti-police, black supremacist, and anti-white views are believed to have solidified following a November 1972 violent clash between Baton Rouge police officers and student civil rights demonstrators, during which two young black demonstrators were shot and killed.[5]\n"
    },
    {
        "link": "/wiki/Shooting_of_Henry_Glover",
        "title": "Shooting of Henry Glover",
        "date": "September 2, 2005 (2005-09-02)",
        "location": "New Orleans, Louisiana, United States",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "Henry Glover was an African American resident of New Orleans, Louisiana, who was shot to death by New Orleans Police Department (NOPD) officer David Warren on September 2, 2005. Glover's charred body was later found in a destroyed Chevrolet Malibu parked on a Mississippi River levee.\nWarren was tried on federal charges relating to Glover's death, eventually resulting in an acquittal. Four other NOPD officers were charged in connection with events following Glover's death, including the burning of the body.\n"
    },
    {
        "link": "/wiki/Know-Nothing_Riot",
        "title": "Know-Nothing Riot",
        "date": "",
        "location": "",
        "state": "Washington",
        "county": "Philadelphia",
        "paragraph": "The term Know-Nothing Riot has been used to refer to a number of political uprisings of the Nativist American Know Nothing Party in the United States of America during the mid-19th century. These anti-immigrant and anti-Catholic protests culminated into riots in Philadelphia in 1844, St. Louis in 1854, Cincinnati and Louisville in 1855, Baltimore in 1856, Washington, D.C. and New York in 1857, and New Orleans in 1858.\nThe Election Day Riots of 1855 occurred in Cincinnati between April 2-7, 1855. The election was between James J. Faran, the Democratic contender and editor of the Cincinnati Enquirer, and James D. Taylor, rabid nativist editor of the Cincinnati Times. Rumors of illegal voting, ballot-box stuffing, and naturalized voters preventing native-born citizens from voting sparked the events. [1]\n"
    },
    {
        "link": "/wiki/Battle_of_Liberty_Place",
        "title": "Battle of Liberty Place",
        "date": "September 14-17, 1874",
        "location": "New Orleans, Louisiana",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": " Louisiana State Government\nThe Battle of Liberty Place, or Battle of Canal Street, was an attempted insurrection and coup d'etat by the Crescent City White League against the Reconstruction Era Louisiana Republican state government on September 14, 1874, in New Orleans, which was the capital of Louisiana at the time.  Five thousand members of the White League, a paramilitary terrorist organization made up largely of  Confederate veterans, fought against the outnumbered New Orleans Metropolitan Police and state militia.  The insurgents held the statehouse, armory, and downtown for three days, retreating before arrival of Federal troops that restored the elected government. No insurgents were charged in the action. This was the last major event of violence stemming from the disputed 1872 gubernatorial election, after which Democrat John McEnery and Republican William Pitt Kellogg both claimed victory.\n"
    },
    {
        "link": "/wiki/March_14,_1891_New_Orleans_lynchings",
        "title": "March 14, 1891 New Orleans lynchings",
        "date": "March 14, 1891",
        "location": "New Orleans, Louisiana, U.S.",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nThe March 14, 1891, New Orleans lynchings were the murders of 11 Italian Americans and immigrants in New Orleans, Louisiana, by a mob for their alleged role in the murder of police chief David Hennessy after some of them had been acquitted at trial. It was the largest single mass lynching in American history.[2][3][note 1] Most of the lynching victims accused in the murder had been rounded up and charged due to their Italian ethnicity.[6]\n"
    },
    {
        "link": "/wiki/New_Orleans_massacre_of_1866",
        "title": "New Orleans massacre of 1866",
        "date": "July 30, 1866",
        "location": "New Orleans, Louisiana",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "The New Orleans Massacre of 1866 occurred on July 30, when a peaceful demonstration of mostly Black Freedmen was set upon by a mob of white rioters, many of whom had been soldiers of the recently defeated Confederate States of America, leading to a full-scale massacre. [4] The violence erupted outside the Mechanics Institute, site of a reconvened Louisiana Constitutional Convention. The Republican Party of Louisiana had called for the Convention, as they were angered by the legislature's enactment of the Black Codes and refusal to extend voting rights to Black men. White Democrats considered the reconvened convention to be illegal and were hostile towards Republican attempts to gain increased political power in the state. The massacre \"stemmed from deeply rooted political, social, and economic causes,\"[5] and took place in part because of the battle \"between two opposing factions for power and office.\"[5] According to the official report, a total of 38 were killed and 146 wounded, of whom 34 dead and 119 wounded were Black Freedmen. Unofficial estimates were higher.[6] Gilles Vandal estimated 40 to 50 Black Americans were killed and more than 150 Black Americans wounded.[7] Others have claimed nearly 200 were killed.[8] In addition, three white convention attendees were killed, as was one white protester.[9]\nDuring much of the American Civil War, New Orleans had been occupied and under martial law imposed by the Union. On May 12, 1866, Mayor John T. Monroe, a Democrat who had ardently supported the Confederacy, was reinstated as acting mayor, the position he held before the war. Judge R. K. Howell was elected as chairman of the convention, with the goal of increasing participation by voters likely to vote for removal of the Black Codes.[10]\n"
    },
    {
        "link": "/wiki/Robert_Charles_riots",
        "title": "Robert Charles riots",
        "date": "July 23 – July 28, 1900",
        "location": "New Orleans, Louisiana, United States",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "Mob\nMayor Paul Capdevielle\n"
    },
    {
        "link": "/wiki/UpStairs_Lounge_arson_attack",
        "title": "UpStairs Lounge arson attack",
        "date": "June 24, 1973 7:56–8:12 p.m.",
        "location": "604 Iberville Street, New Orleans, Louisiana, United States[1]",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nThe UpStairs Lounge arson attack occurred on June 24, 1973 at a gay bar called the UpStairs (or Up Stairs) Lounge located on the second floor of the three-story building at 604 Iberville Street in New Orleans, Louisiana, in the United States.[2] Thirty-two people died and at least fifteen were injured as a result of fire or smoke inhalation.[3] The official cause is still listed as \"undetermined origin\".[4] The primary suspect, a gay man with a history of psychiatric impairment named Roger Dale Nunez who had been ejected from the bar earlier in the day, was never charged and took his own life in November 1974.[5][6][7] No evidence has ever been found that the arson was motivated by hatred or overt homophobia.[7]\n"
    },
    {
        "link": "/wiki/Murder_of_Frank_Morris",
        "title": "Murder of Frank Morris",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Ferriday",
        "paragraph": "Frank Morris (1914–1964) was an American businessman who died as a result of arson to his shoe shop in Ferriday, Louisiana, a city with a history of racial violence. There have been allegations of witness intimidation, evidence tampering, and involvement by local law enforcement. No charges have been brought despite three FBI investigations.\nFrank Morris's mother, Charlotte, died shortly after his birth. His father, Sullivan, operated a shoe shop in Natchez, Mississippi. Frank Morris fathered one child, and had two grandchildren.\n"
    },
    {
        "link": "/wiki/UpStairs_Lounge_arson_attack",
        "title": "UpStairs Lounge arson attack",
        "date": "June 24, 1973 7:56–8:12 p.m.",
        "location": "604 Iberville Street, New Orleans, Louisiana, United States[1]",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nThe UpStairs Lounge arson attack occurred on June 24, 1973 at a gay bar called the UpStairs (or Up Stairs) Lounge located on the second floor of the three-story building at 604 Iberville Street in New Orleans, Louisiana, in the United States.[2] Thirty-two people died and at least fifteen were injured as a result of fire or smoke inhalation.[3] The official cause is still listed as \"undetermined origin\".[4] The primary suspect, a gay man with a history of psychiatric impairment named Roger Dale Nunez who had been ejected from the bar earlier in the day, was never charged and took his own life in November 1974.[5][6][7] No evidence has ever been found that the arson was motivated by hatred or overt homophobia.[7]\n"
    },
    {
        "link": "/wiki/Colfax_massacre",
        "title": "Colfax massacre",
        "date": "April 13, 1873",
        "location": "Colfax, Louisiana, United States31°31′01″N 92°42′42″W﻿ / ﻿31.51691°N 92.71175°W﻿ / 31.51691; -92.71175Coordinates: 31°31′01″N 92°42′42″W﻿ / ﻿31.51691°N 92.71175°W﻿ / 31.51691; -92.71175",
        "state": "Louisiana",
        "county": "Colfax",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/John_Cecil_Jones",
        "title": "John Cecil Jones",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Minden",
        "paragraph": "John Cecil Jones (1915-1946) was an honorably-discharged World War II corporal and veteran who was tortured and lynched near Minden, in Webster Parish, Louisiana by a mob in 1946. His 17-year-old cousin Albert Harris, Jr. was tortured and left for dead alongside Jones. This was the only known post-World War II lynching to occur in Louisiana, and it involved multiple well-known local individuals, politicians, and a cover-up by multiple law enforcement entities.[1]\nOn the night of July 30, 1946, a pregnant woman complained to her husband that she had been startled by a prowler in their yard. The next day, the husband looked around his yard and found that a window screen had been tampered with, along with some grass and a portion of the fence that surrounded the yard. He looked to the neighboring house and saw Albert Harris, Jr. holding a stick and sitting on the front porch. The husband talked to his father, and ultimately two civilians and two Webster Parish Sheriff's Deputies went to the Harris house and arrested Albert, Jr. He was held in jail for a few days without charge and released by Webster Parish Deputy Sheriff O.H. Haynes, Jr. in Dixie Inn to a mob. The mob took Albert, Jr. to a field in rural Webster Parish, tied him upside down to a pipe, covered his head, and at gunpoint, they forced him by way of multiple beatings to implicate his cousin (Jones) as an accomplice in the alleged prowling. After Albert, Jr. was released by the mob, his parents sent him out of the state. On August 3, 1946, two deputies, including Haynes, went to the Harris' house to procure Albert, Jr. One of the deputies smashed Albert Harris, Sr.'s jaw and told him to bring Albert, Jr. back into custody. Albert, Jr. was returned to the sheriff's custody August 4. Jones had been arrested on August 3 in connection with the matter. While both men were in jail, they were questioned by the husband's father and deputies. They were also beaten by deputies. They were held several days without charge.[2]\n"
    },
    {
        "link": "/wiki/Lynchings_of_Mer_Rouge,_Louisiana",
        "title": "Lynchings of Mer Rouge, Louisiana",
        "date": "\nDisappeared on August 24, 1922\nBodies discovered on December 24, 1922\n",
        "location": "Mer Rouge, Morehouse Parish, Louisiana",
        "state": "Louisiana",
        "county": "Mer Rouge",
        "paragraph": "\nFilmore Watt Daniels and Thomas F. Richards were lynched in Mer Rouge, Morehouse Parish, Louisiana by black robed Ku Klux Klan members on August 24, 1922. According to the United States Senate Committee on the Judiciary they were the 47th and 48th of 61 lynchings during 1922 in the United States.[1] There were five lynchings in the state of Louisiana and of the 61 lynchings they were 2 of 6 white victims.[2]\n"
    },
    {
        "link": "/wiki/March_14,_1891_New_Orleans_lynchings",
        "title": "March 14, 1891 New Orleans lynchings",
        "date": "March 14, 1891",
        "location": "New Orleans, Louisiana, U.S.",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nThe March 14, 1891, New Orleans lynchings were the murders of 11 Italian Americans and immigrants in New Orleans, Louisiana, by a mob for their alleged role in the murder of police chief David Hennessy after some of them had been acquitted at trial. It was the largest single mass lynching in American history.[2][3][note 1] Most of the lynching victims accused in the murder had been rounded up and charged due to their Italian ethnicity.[6]\n"
    },
    {
        "link": "/wiki/Murder_of_Frank_Morris",
        "title": "Murder of Frank Morris",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Ferriday",
        "paragraph": "Frank Morris (1914–1964) was an American businessman who died as a result of arson to his shoe shop in Ferriday, Louisiana, a city with a history of racial violence. There have been allegations of witness intimidation, evidence tampering, and involvement by local law enforcement. No charges have been brought despite three FBI investigations.\nFrank Morris's mother, Charlotte, died shortly after his birth. His father, Sullivan, operated a shoe shop in Natchez, Mississippi. Frank Morris fathered one child, and had two grandchildren.\n"
    },
    {
        "link": "/wiki/2021_Grambling_State_University_shooting",
        "title": "List of school shootings in the United States (2000–present)",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nSchool shootings in the United States have occurred at K–12 public and private schools, as well as at colleges and universities, and on school buses. Excluded from this list are the following:\n"
    },
    {
        "link": "/wiki/Byrd_Gang",
        "title": "Byrd Gang",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "the Piff Gang",
        "paragraph": "The Byrd Gang also known as the Piff Gang, is a criminal organization located in New Orleans, Louisiana. Detectives with New Orleans Police Department's Multi-Agency Gang unit previously described the Byrd Gang as \"one of the most murderous gangs in town.\" The gang have a long history of violence which has made them gain notoriety among other gangs in the city. \nThe Byrd Gang originated from the former C.J. Peete public housing development, known as Magnolia Projects, an infamous housing projects in Central City. For years the gang have feuded with the 3-N-G gang and clashed with them during the 2009 Mardi Gras parade where seven people were shot, including a baby. The shooting made national headlines in the news and brought the gang to the attention of the FBI.[1][2][3] In 2017, members of the gang were involved in a violent broad daylight shootout on Magazine Street that left two men wounded.[4]\nIn November of 2020 6 members of the Byrd Gang were charged with conspiracy to commit murder, and murder for fatally shooting a woman from Grass Valley, California after they attempted to purchase 30 pounds of marijuana from the woman with fake money and then attempted to flee. The woman and another person began to chase the Byrd Gang members. One of the members then pulled out his pistol and shot the woman in the head. [5]\nLater in April 2019, 2 members would be arrested for retaliation to the injustice murder of Torrence Allen.[citation needed]\n"
    },
    {
        "link": "/wiki/Danziger_Bridge_shootings",
        "title": "Danziger Bridge shootings",
        "date": "September 4, 2005  (Central Daylight Time)",
        "location": "New Orleans, Louisiana, U.S.",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nOn the morning of September 4, 2005, six days after Hurricane Katrina struck New Orleans, members of the New Orleans Police Department (NOPD), ostensibly responding to a call from an officer under fire, shot and killed two civilians at the Danziger Bridge: 17-year-old James Brissette and 40-year-old Ronald Madison. Four other civilians were wounded. All the victims were African-American. None were armed or had committed any crime. Madison, a mentally disabled man, was shot in the back. The shootings caused public anger and further eroded the trust New Orleans had in the federal response to Hurricane Katrina and the NOPD.[2]\n"
    },
    {
        "link": "/wiki/2015_Lafayette_shooting",
        "title": "2015 Lafayette shooting",
        "date": "July 23, 2015; 7 years ago (2015-07-23) 7:27 p.m. (CDT)",
        "location": "3141 Johnston Street, Lafayette, Louisiana, U.S.",
        "state": "Louisiana",
        "county": "Johnston Street",
        "paragraph": "\nOn July 23, 2015, a mass shooting occurred at the Grand 16 movie theater in Lafayette, Louisiana.[3] John Russell Houser,[4][5] 59, opened fire during a showing of the film Trainwreck, killing two people and injuring nine others before committing suicide.[6][7][8][9]\n"
    },
    {
        "link": "/wiki/January_2019_Louisiana_shootings",
        "title": "January 2019 Louisiana shootings",
        "date": "January 26, 2019",
        "location": "Ascension and Livingston parishes, Louisiana",
        "state": "Louisiana",
        "county": "",
        "paragraph": "On January 26, 2019, a gunman shot and killed five people in Ascension and Livingston parishes, Louisiana, before being taken into custody in Virginia.\nA few weeks prior to the incident, Dakota Theriot was taken in by his girlfriend's family, after being kicked out by his own parents.[1] Investigators claim that Theriot, using a handgun he stole from his father,[2][3] killed three members of his girlfriend's family in Livingston Parish, before he stole a truck and drove to the neighboring county of Ascension and killed his parents.[4] The victims in Livingston Parish were Billy Ernest, aged 43, Summer Ernest, aged 20, and Tanner Ernest, aged 17; Elizabeth and Keith Theriot, both in their early fifties, were killed in Gonzales.[5] The neighbor of the Ernest family told reporters that the two surviving Ernest children; aged 7 and 1 years old, ran to her home to call 9-1-1 and were unharmed in the incident.[6] Police found both Elizabeth and Keith Theriot alive at their house after Keith called 911. Keith reportedly identified his son as the shooter. The couple later died at the hospital.[4]\n"
    },
    {
        "link": "/wiki/John_McDonogh_High_School_shooting",
        "title": "John McDonogh High School shooting",
        "date": "April 14, 2003 approximately 10:30 a.m. (CDT)",
        "location": "New Orleans, Louisiana, United States",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "The John McDonogh High School shooting was a school shooting that occurred on April 14, 2003 at John McDonogh High School[1] in the Mid-City neighborhood of New Orleans, Louisiana, United States.[2] Two men shot and killed 15-year-old student Jonathan \"Caveman\" Williams during a mid-morning gym class in a gang neighborhood retaliation killing.[3]\nAt 10:30 a.m. on April 14, 2003, two men armed with an AK-47 and a semi-automatic pistol entered the school property via gaps in the fence.[4] Immediately after students and faculty entered the school gymnasium, the two men shot at 15-year-old Jonathan \"Caveman\" Williams[5] at least 20 times. Three female students were wounded, and a pregnant senior was trampled by a stampede of students.[6][7] Jonathan Williams died at the scene and the two perpetrators immediately fled the school campus.[4] The injured recovered.[5]\n"
    },
    {
        "link": "/wiki/2016_shooting_of_Baton_Rouge_police_officers",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "county": "Baton Rouge",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\n"
    },
    {
        "link": "/wiki/Gus_Bailey",
        "title": "Gus Bailey",
        "date": "",
        "location": "",
        "state": "North Carolina",
        "county": "Gibson",
        "paragraph": "Augustus Bailey (February 18, 1951 – November 28, 1988) was an American basketball player.\nBorn in Gibson, North Carolina, Bailey played collegiately for the University of Texas at El Paso.\n"
    },
    {
        "link": "/wiki/Tommy_Blake_(musician)",
        "title": "Tommy Blake (musician)",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nTommy Blake (born Thomas LeVan Givens, September 14, 1931 – December 24, 1985) was an American rockabilly singer and songwriter active in the 1950s to the 1970s. Regarded as a skilled writer, Blake penned several songs that were later recorded by rock and country music artists, including Johnny Horton, George Jones, and Johnny Cash among others. He also achieved modest success as a recording artist for Sun Records, but failed to record a national hit himself, a fact that frustrated Blake later in his life. Retrospectively, he has received praise for his contributions to rockabilly and was inducted in the Rockabilly Hall of Fame.\n"
    },
    {
        "link": "/wiki/Frank_Clancy_(sheriff)",
        "title": "Frank Clancy (sheriff)",
        "date": "",
        "location": "",
        "state": "",
        "county": "New Orleans",
        "paragraph": "\nFrank Clancy was sheriff and alleged American Mafia associate.\nAn old time political boss,[citation needed] Clancy had recently appeared before the Kefauver Committee and had testified that he had allowed organized crime figures to place 5,000 slot machines in his parish. It was also claimed he had earned a percentage of gambling casinos operated by acting New Orleans crime family boss Carlos Marcello, in which he maintained the right to hire employees below management position. Although Clancy's testimony did implicate Marcelo, it had relatively little impact on his gambling operations.\n"
    },
    {
        "link": "/wiki/Carol_Cole",
        "title": "Killing of Carol Cole",
        "date": "",
        "location": "",
        "state": "Michigan",
        "county": "Bellevue",
        "paragraph": "Carol Ann Cole (previously nicknamed as \"Bossier Doe\" or \"Bossier's Doe\" and officially known as Cold Case No. 81-018329)[1][2] was a 17-year-old American homicide victim whose body was discovered in early 1981 in Bellevue, Bossier Parish, Louisiana.[3] The victim remained unidentified until 2015, when DNA tests confirmed her identity. Cole, native to Kalamazoo, Michigan, had been missing from San Antonio, Texas since 1980.[4] Cole's killing remains unsolved, although the investigation is continuing.[5]\nCarol Cole and her sister Linda \"Jeanie\" Phelps lived in Kalamazoo, Michigan, primarily under the care of their grandmother after their mother and father divorced. Later in life, Cole decided to leave Kalamazoo to accompany her mother, Sue, to San Antonio, Texas in 1979 at age 15 but remained in contact with her sister by telephone. Cole was at a girl's home run by the Palmer Drug Abuse Program, also called PDAP, on West 23rd St. in Austin, Texas, from May to October 1980.[6]\n"
    },
    {
        "link": "/wiki/Ryan_Francis",
        "title": "Ryan Francis",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Baton Rouge",
        "paragraph": "Ryan LeChanc Francis (March 17, 1987 – May 13, 2006) was an American college basketball player. At the time of his death, he was the starting point guard for the USC Trojans. He was murdered during a trip to his hometown in Baton Rouge, Louisiana, after his freshman season at USC. \nAs a freshman, Francis was the starting point guard during the 2005–2006 season for the USC Trojans and averaged 7.1 points, 3.7 assists and 1.6 steals per game. He ranked seventh in the Pac-10 Conference in assists and fifth in steals which was good enough to make the honorable-mention pac-10 all-freshman team selected by the conference coaches. His jersey number was 12.  It has been suggested that after basketball he planned to enter coaching or work with criminals.\n"
    },
    {
        "link": "/wiki/Brad_Garafola",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "county": "Baton Rouge",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\n"
    },
    {
        "link": "/wiki/Matthew_Gerald",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "county": "Baton Rouge",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\n"
    },
    {
        "link": "/wiki/Young_Greatness",
        "title": "Young Greatness",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nTheodore Joseph Jones III (September 19, 1984 – October 29, 2018),[1] better known by his stage name Young Greatness, was an American rapper. He was best known for his 2015 single \"Moolah\",[2] which peaked at number 85 on the Billboard Hot 100 chart.[3]  He was shot and killed in October 2018.[2]\n"
    },
    {
        "link": "/wiki/Braxton_Hebert",
        "title": "Amy Hebert",
        "date": "August 20, 2007",
        "location": "",
        "state": "Louisiana",
        "county": "Mathews",
        "paragraph": "Amy T. Hebert[3] (née Talbot[4]) is a woman from Mathews, Louisiana, United States, who was convicted of murdering her two children in August 2007 in an act of revenge against her ex-husband; she also killed the family dog. Hebert was sentenced to life in prison without the possibility of parole.[5]\nAmy Hebert, originally from Larfourche Parish, Louisiana, worked as a teacher's aide at Lockport Lower Elementary School in Lockport.[6][7] In Hebert's criminal trial, experts summoned by the prosecution and the defense stated that Hebert had been severely depressed around the time she committed the crime.[8]\n"
    },
    {
        "link": "/wiki/Camille_Hebert",
        "title": "Amy Hebert",
        "date": "August 20, 2007",
        "location": "",
        "state": "Louisiana",
        "county": "Mathews",
        "paragraph": "Amy T. Hebert[3] (née Talbot[4]) is a woman from Mathews, Louisiana, United States, who was convicted of murdering her two children in August 2007 in an act of revenge against her ex-husband; she also killed the family dog. Hebert was sentenced to life in prison without the possibility of parole.[5]\nAmy Hebert, originally from Larfourche Parish, Louisiana, worked as a teacher's aide at Lockport Lower Elementary School in Lockport.[6][7] In Hebert's criminal trial, experts summoned by the prosecution and the defense stated that Hebert had been severely depressed around the time she committed the crime.[8]\n"
    },
    {
        "link": "/wiki/David_Hennessy",
        "title": "David Hennessy",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "David C. Hennessy (1858 – October 16, 1890) was a police chief of New Orleans, Louisiana. As a young detective, he made headlines in 1881 when he captured a notorious Italian criminal, Giuseppe Esposito. In 1888, he was promoted to superintendent and chief of police. While in office he made a number of improvements to the force, and was well known and respected in the New Orleans community.\nHis assassination in 1890 led to a sensational trial. A series of acquittals and mistrials angered locals, and an enormous mob formed outside the prison the next day. The prison doors were forced open and 11 of the 19 Italian men who had been indicted for Hennessy's murder were lynched. The March 14, 1891 lynchings were the largest known mass lynching in U.S. history.\n"
    },
    {
        "link": "/wiki/Helen_Hill",
        "title": "Helen Hill",
        "date": "",
        "location": "",
        "state": "",
        "county": "New Orleans",
        "paragraph": "Helen Wingard Hill (May 9, 1970 – January 4, 2007) was an American artist, filmmaker, writer, teacher, and social activist. When her final film, The Florestine Collection, was released in 2011, curators and critics praised her work and legacy, describing her, for example, as \"one of the most well-regarded experimental animators of her generation.\"[1]\nHill's death at the age of 36 brought considerable media attention. In 2007, an unidentified intruder shot and killed her in her New Orleans home. Her death (one of six murders in the city that day), coupled with the murder a week before of New Orleans musician Dinerral Shavers, sparked civic outrage. Thousands marched against the rampant and continuing post-Katrina violence in New Orleans. This \"March Against Violence on City Hall\" drew significant press coverage throughout the United States and beyond. However, in the years following that tragic notoriety, Helen Hill's life and creative work have been widely celebrated, with her films continuing to circulate to a degree they did not during her lifetime. In 2012, Daniel Eagan wrote about Helen Hill as one of \"Five Women Animators Who Shook Up the Industry\".[2]\n"
    },
    {
        "link": "/wiki/Montrell_Jackson",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "county": "Baton Rouge",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\n"
    },
    {
        "link": "/wiki/JayDaYoungan",
        "title": "JayDaYoungan",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nJavorius Tykies Scott (July 15, 1998 – July 27, 2022), known professionally as JayDaYoungan, was an American rapper and singer.[3] He was best known for his singles \"23 Island\", \"Elimination\", and \"Opps\", which have received 73, 35, and 40 million respective streams on SoundCloud as of November 2022. Scott released the mixtapes Forever 23 (2018), Endless Pain (2019), and his debut commercial mixtape Misunderstood (2019), which peaked at number 43 on the US Billboard 200. His debut studio album, Baby23, was released on June 5, 2020. He was first exposed to the mainstream with his mixtapes Ruffwayy and The Real Jumpman 23, which included the tracks \"Sliding Freestyle\" and \"Muddy Situation\".\n"
    },
    {
        "link": "/wiki/Jeff_Davis_8",
        "title": "Jeff Davis 8",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Louisiana.[1][2",
        "paragraph": "The Jeff Davis 8, sometimes called the Jennings 8, refers to a series of unsolved murders in Jefferson Davis Parish, Louisiana.[1][2] Between 2005 and 2009, the bodies of eight women were found in swamps and canals surrounding Jennings, Louisiana. Most of the bodies were found in such a state of decomposition as to make the actual cause of death difficult to determine.[1][2]\nAuthor and investigative reporter Ethan Brown has revealed how police investigations have been plagued by missteps in the sheriff's office, contributing to lost or missing evidence.[2] Brown's work has revealed that there are multiple suspects in the Jeff Davis 8 case and that therefore it is unlikely that this is a serial killer case; furthermore, Brown has revealed that law enforcement's own witnesses have named members of local law enforcement as suspects in the case.[2]\n"
    },
    {
        "link": "/wiki/Juan_Joseph",
        "title": "Juan Joseph",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "Juan Joseph (August 26, 1987 – November 16, 2014) was a professional Arena football quarterback who also played American and Canadian football. He last played for the Lafayette Wildcatters of the Southern Indoor Football League (SIFL). He was signed by the Edmonton Eskimos as an undrafted free agent in 2009. He played college football for the Millsaps Majors. He was also a member of the Saskatchewan Roughriders.\nJoseph attended West Saint John Parish High School in Edgard, Louisiana,[1] where he was a member of the Rams 2003 and 2004 Class 2A State Championship teams.[1] While in high school, he was a teammate of future LSU and NFL players Tyson Jackson and Quinn Johnson. In high school, he played baseball, basketball and football, trying out for the football team in his sophomore year.\n"
    },
    {
        "link": "/wiki/Mayeus_Lafleur",
        "title": "Mayeus Lafleur",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Mamou",
        "paragraph": "Mayeus Lafleur (born in Mamou, Louisiana in 1906) was one of the earliest musicians to record Cajun music. Along with fellow musician Leo Soileau, he recorded the standard \"He Mon\" (which is widely considered to be only the second recorded documentation of the genre),[1] in 1928.[2] However, less than two weeks after the recording session, he was shot to death during a quarrel involving moonshine at a local dance after jumping to the aid of a friend, Alexander Bellon, who was shot first. He was only 22 at the time of his death.[3][4][5]\n"
    },
    {
        "link": "/wiki/Jim_Leslie_(journalist)",
        "title": "Jim Leslie (journalist)",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Shreveport",
        "paragraph": "James S. Leslie (October 27, 1937 – July 9, 1976),[1] known as Jim Leslie, was a journalist for The Shreveport Times who became a public relations and advertising executive in Shreveport, Louisiana, United States. He is known for having been murdered in Baton Rouge on July 9, 1976, in a case described by the police as a \"professional hit.\" George W. D'Artois, the Public Safety Commissioner in Shreveport, was twice arrested in the case; the first time he was released for lack of evidence. He was arrested again on charges of first-degree murder in April 1977, suspected of contracting for the murder of Leslie, but died in June of that year during heart surgery. No one was tried in the case.\nLeslie had been hired by D'Artois in 1974 to manage communications in his re-election campaign; he had been in office since 1962. In the mid-1970s, D'Artois was the subject of an extended investigation by the Times. Leslie had told a friend earlier in 1976 that D'Artois had tried to pay him with city funds for his work on his 1974 campaign, and warned him against testifying before a grand jury. With a full-scale investigation of the commissioner underway, Leslie was called to testify to a grand jury about alleged corruption in D'Artois's department.\n"
    },
    {
        "link": "/wiki/St._John_Richardson_Liddell",
        "title": "St. John Richardson Liddell",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Woodville",
        "paragraph": "St. John Richardson Liddell (September 6, 1815 – February 14, 1870) was a prominent Louisiana planter who served as a general in the Confederate States Army during the American Civil War. He was an outspoken proponent of Southern emancipation of slaves. Following the war, Liddell had a prominent feud with a former Confederate officer, Charles Jones, who eventually murdered Liddell near his home in 1870.\nLiddell was born to a wealthy plantation family near Woodville, Mississippi. He was a schoolmate of future Confederate President Jefferson Davis, whom he would interact with several times during the early years of the Civil War on behalf of fellow general Albert Sidney Johnston.\n"
    },
    {
        "link": "/wiki/Huey_Long",
        "title": "Huey Long",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "",
        "paragraph": "\nHuey Pierce Long Jr. (August 30, 1893 – September 10, 1935), byname \"The Kingfish\", was an American politician who served as the 40th governor of Louisiana from 1928 to 1932 and as a United States senator from 1932 until his assassination in 1935. He was a left-wing populist member of the Democratic Party and rose to national prominence during the Great Depression for his vocal criticism of President Franklin D. Roosevelt and his New Deal, which Long deemed insufficiently radical. As the political leader of Louisiana, he commanded wide networks of supporters and often took forceful action. A controversial figure, Long is celebrated as a populist champion of the poor or, conversely, denounced as a fascistic demagogue.\n"
    },
    {
        "link": "/wiki/Joe_McKnight",
        "title": "Joe McKnight",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nJoseph Nathan McKnight Jr. (April 16, 1988 – December 1, 2016) was an American football running back and return specialist who played in the National Football League (NFL) and Canadian Football League (CFL).\n"
    },
    {
        "link": "/wiki/VL_Mike",
        "title": "VL Mike",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "Michael Allen (January 19, 1976 – April 20, 2008), better known as VL Mike, was an American rapper from New Orleans, Louisiana.\nHe first appeared on the mainstream rap scene in 2004 as a member of the New Orleans-based record label, Chopper City Records, of which rapper B.G. is the CEO. Mike was known for his gangsta rhyme structure and street lyrics throughout New Orleans. After the 2007 release of the Chopper City Boyz' debut album We Got This, VL Mike departed from Chopper City Records[1] and set out to pursue his solo career. VL Mike stated on his Place Yo Betz mixtape that the reason he departed from the label because B.G. had been portraying himself as a gangster for years through his music when he was not. VL Mike stated in an interview that he had a deal with Sony/Epic Records and his debut album, It's Only One Me, would be released in April.[2]\n"
    },
    {
        "link": "/wiki/Murder_of_Oneal_Moore",
        "title": "Murder of Oneal Moore",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "",
        "paragraph": " Oneal Moore (1931 – June 2, 1965) was the first African-American deputy sheriff for the Washington Parish Sheriff's Office in Varnado, Louisiana. He was murdered on June 2, 1965, by alleged members of the Ku Klux Klan in a drive-by shooting, one year and a day after his landmark appointment as deputy sheriff. An Army veteran, he was 34 years old, married, and the father of four daughters.\nThe evening of June 2, 1965, Moore was driving home from work when an individual in a pickup truck shot at him and his partner, David Creed Rogers, another African-American deputy sheriff. Moore lost control of the vehicle and crashed into a tree, dying instantly from a gunshot wound to the head.[1] Rogers suffered injuries, including to one eye, but survived the shooting and crash; he immediately  broadcast a description of the vehicle, which he noted had a Confederate flag decal on its front bumper.[2]\n"
    },
    {
        "link": "/wiki/Muhiyidin_Moye",
        "title": "Muhiyidin Moye",
        "date": "",
        "location": "",
        "state": "South Carolina",
        "county": "Charleston",
        "paragraph": "\nMuhiyidin El Amin Moye (April 22, 1985 – February 6, 2018), also known as Muhiyidin d'Baha, was a leading Black Lives Matter activist known nationally for crossing a yellow police tape line to snatch a Confederate battle flag from a demonstrator on live television in Charleston, South Carolina, in February 2017.\n"
    },
    {
        "link": "/wiki/Messy_Mya",
        "title": "Messy Mya",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "Messy Mya (born Anthony Barré, December 15, 1987 – November 14, 2010) was an American rapper from New Orleans, Louisiana.\nHe was most known for the controversy regarding his voice being sampled in Beyoncé's \"Formation\".[1] Barré was shot & killed leaving his girlfriend's baby shower in November 2010, New Orleans' 7th ward.[2][3][4]\n"
    },
    {
        "link": "/wiki/Jackie_Neal",
        "title": "Jackie Neal",
        "date": "",
        "location": "",
        "state": "",
        "county": "",
        "paragraph": "\nJacqueline \"Jackie\" Neal (July 7, 1967 – March 10, 2005)[1] was an American blues singer.\n"
    },
    {
        "link": "/wiki/Sadie_Roberts-Joseph",
        "title": "Sadie Roberts-Joseph",
        "date": "",
        "location": "",
        "state": "Mississippi",
        "county": "Southern United",
        "paragraph": "Sadie Roberts-Joseph (1944 – July 12, 2019) was an American community activist and founder of the Baton Rouge Odell S. Williams Now & Then Museum of African-American History in 2001.[1] She was also the founder of a non-profit organization, Community Against Drugs and Violence (CADAV).[2] She organized the annual \"Juneteenth Celebration\" which commemorates the emancipation of slaves in the Southern United States.[3] She helped organize an annual Veterans Day celebration at the Port Hudson National Cemetery to honor veterans of all races who fought in the Civil War.[4]\nRoberts-Joseph was born in 1944 and grew up in Woodville, Mississippi. She was the fifth in a family of twelve children, and her parents were sharecroppers.[5] The family later moved to Baton Rouge, Louisiana. She attended Baton Rouge Vocational-Technical School and Southern University, studying education and speech pathology. She was an active volunteer in the local black community, and worked for many years as a certified respiratory therapy technician.[4]\n"
    },
    {
        "link": "/wiki/Barry_Seal",
        "title": "Barry Seal",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Barry Seal",
        "paragraph": "Adler Berriman \"Barry\" Seal (July 16, 1939 – February 19, 1986) was an American commercial airline pilot who became a major drug smuggler for the Medellín Cartel. When Seal was convicted of smuggling charges, he became an informant for the Drug Enforcement Administration and testified in several major drug trials. He was murdered on February 19, 1986 by contract killers hired by the cartel.\nBarry Seal was born in Baton Rouge, Louisiana, the son of Mary Lou (née Delcambre) and Benjamin Curtis Seal, a candy wholesaler. Seal began to fly as a teenager, earning a student pilot certificate at 16 and a private pilot's certificate at 17. His flight instructor described him as a naturally gifted pilot.[1]\n"
    },
    {
        "link": "/wiki/Dinerral_Shavers",
        "title": "Dinerral Shavers",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nDinerral Jevone \"Dick\" Shavers (March 19, 1981 — December 28, 2006) was an American jazz drummer and educator from New Orleans, Louisiana, who was best known as a member of the Hot 8 Brass Band.\n"
    },
    {
        "link": "/wiki/Mary_S._Sherman",
        "title": "Mary S. Sherman",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "Northwestern University\nMary Stults Sherman (April 21, 1913 – July 21, 1964) was an American orthopedic surgeon and  cancer researcher in New Orleans, Louisiana.\n"
    },
    {
        "link": "/wiki/Dave_Short",
        "title": "Dave Short",
        "date": "",
        "location": "",
        "state": "Arkansas",
        "county": "Magnolia",
        "paragraph": "David Orvis Short (May 11, 1917 – November 22, 1983) was a professional baseball player.  He was an outfielder for parts of two seasons (1940–41) with the Chicago White Sox.  For his career, he compiled a .091 batting average in 11 at-bats.[1]  After playing for the Chicago White Sox he joined the military during World War II.  He was murdered in 1983.[2]\nAn alumnus of Louisiana Tech University, he was born in Magnolia, Arkansas and later died in Shreveport, Louisiana at the age of 66.\n"
    },
    {
        "link": "/wiki/Magnolia_Shorty",
        "title": "Magnolia Shorty",
        "date": "",
        "location": "",
        "state": "Texas",
        "county": "New Orleans",
        "paragraph": "Renetta Yemika Lowe-Bridgewater (September 30, 1982 – December 20, 2010), known by the stage name Magnolia Shorty, was an American rapper in the New Orleans-based bounce music scene.[1]\nMagnolia Shorty and Ms. Tee (Trishell Williams) were the first women signed to Cash Money Records.[2] Her 1997 debut album Monkey on the Dick (often stylized Monkey On Tha D$ck) is considered a bounce classic, and she \"was already considered a legend of bounce music\" at the time of her death.[2] Offbeat said the album exemplifies \"the eccentric New Orleans elements of sexuality, comedy and hard edged dance rhythms.\"[3] In his 2007 book Triksta, Nik Cohn credits Magnolia Shorty with his own discovery of bounce, and the third chapter of that book is named after her debut album. She was sampled on Fort Worth, Texas rapper Bone's hit “Homegurl” as well as \"In My Feelings\" by Drake and \"Wobble Up\" by Chris Brown.[4][5]\n"
    },
    {
        "link": "/wiki/Will_Smith_(defensive_end)",
        "title": "Will Smith (defensive end)",
        "date": "",
        "location": "",
        "state": "Ohio",
        "county": "",
        "paragraph": "\nWilliam Raymond Smith III (July 4, 1981 – April 9, 2016) was an American football defensive end in the National Football League (NFL). He played college football for Ohio State and was drafted by the New Orleans Saints in the first round of the 2004 NFL draft, where he played for the entirety of his career.  Smith was shot and killed during an altercation after an alcohol related traffic crash.\n"
    },
    {
        "link": "/wiki/Soulja_Slim",
        "title": "Soulja Slim",
        "date": "",
        "location": "",
        "state": "",
        "county": "New Orleans",
        "paragraph": "James Adarryl Tapp Jr. (September 9, 1977 – November 26, 2003),[1] better known by his stage name Soulja Slim, was an American rapper and songwriter. He is perhaps best known for featuring on the U.S. number one hit \"Slow Motion\".[2]\nJames A'Darryl Tapp Jr. was born in New Orleans on September 9, 1977, to James and Linda Tapp. He was raised in the Magnolia Projects in New Orleans and attended Cohen Senior High School before dropping out of school in the 11th grade. He began selling drugs, as well as forming an addiction to heroin and cocaine. By 1993, he was rapping as \"Magnolia Slim\" in venues and block parties in the projects.[3] His first recordings, however, would be on Parkway Pumpin', an independent label run by legendary producer KLC and also featuring 39 Posse, Fiend, Mac, Mystikal Mike (later Mystikal), Mr. Serv-On and Da Hound. Soulja Slim's solo debut was Soulja Fa Lyfe was released in 1994 by Parkway Pumpin' and Hype Enough Records. The album did well, selling 90,000 units independently. In 1995, he released the four-song EP The Dark Side by Hype Enough Records.[4]\n"
    },
    {
        "link": "/wiki/Clarence_Triggs",
        "title": "Clarence Triggs",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Jackson",
        "paragraph": "Clarence Triggs (1943 – July 30, 1966) was a married African-American bricklayer and veteran, who was murdered on July 30, 1966 in Bogalusa, Louisiana, about a month after participating in a civil rights march for voting.[1] Two white men were arrested and indicted in the case. One was acquitted and the other never tried. Although the cold case was reopened by the FBI in the early 21st century, Triggs' murder has never been solved.\nTriggs, a 24-year-old construction worker, had recently moved with his wife Emma to Bogalusa from Jackson, Mississippi. He worked as a bricklayer.[2]\n"
    },
    {
        "link": "/wiki/Clyde_Vidrine",
        "title": "Clyde Vidrine",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "Las Vegas",
        "paragraph": "\nClyde C. Vidrine (1938 – December 16, 1986) was a bodyguard for four-term Louisiana Governor Edwin Edwards. He became famous for making accusations about the governor's elaborate Las Vegas trips and alleged infidelity to Edwards' wife Elaine Edwards. Vidrine, who had already been fired by Edwards, was murdered during Edwards' third term as governor.[1]\nVidrine was shot and killed in broad daylight on the steps of the Caddo Parish court house in downtown Shreveport on December 16, 1986. At the time Vidrine was serving as bodyguard for a woman who had recently separated from her husband, James Cummings. Cummings believed Vidrine and his wife were having an adulterous affair. Cummings stated that only he (James Cummings) was at the federal court house (not the parish court house) because of a bankruptcy hearing where he and his estranged wife were to appear. Cummings stated that Vidrine had threatened him in the past and had reached for a gun when Cummings shot him. A report, that he was waiting across the street in his car for his wife and Vidrine to arrive, contradicted James Cummings' version of what happened.[2] When Clyde Vidrine and Kathy Cummings arrived, James Cummings opened fire three times with a 12-gauge shotgun, killing Clyde Vidrine but leaving Kathy Cummings untouched.[3]\n"
    },
    {
        "link": "/wiki/Bogalusa,_Louisiana",
        "title": "Bogalusa, Louisiana",
        "date": "",
        "location": "",
        "state": "Washington",
        "county": "New Orleans",
        "paragraph": "[1]Bogalusa is a city in Washington Parish, Louisiana, United States. The population was 12,232 at the 2010 census. In the 2020 census the city, town, place equivalent reported a population of 10,659. It is the principal city of the Bogalusa Micropolitan Statistical Area, which includes all of Washington Parish and is also part of the larger New Orleans–Metairie–Hammond combined statistical area.\n"
    },
    {
        "link": "/wiki/Colfax_massacre",
        "title": "Colfax massacre",
        "date": "April 13, 1873",
        "location": "Colfax, Louisiana, United States31°31′01″N 92°42′42″W﻿ / ﻿31.51691°N 92.71175°W﻿ / 31.51691; -92.71175Coordinates: 31°31′01″N 92°42′42″W﻿ / ﻿31.51691°N 92.71175°W﻿ / 31.51691; -92.71175",
        "state": "Louisiana",
        "county": "Colfax",
        "paragraph": "\n\n"
    },
    {
        "link": "/wiki/Coushatta_massacre",
        "title": "Coushatta massacre",
        "date": "August 1874",
        "location": "Coushatta, Louisiana",
        "state": "Louisiana",
        "county": "",
        "paragraph": "The Coushatta massacre (1874) was an attack by members of the White League, a white supremacist paramilitary organization composed of white Southern Democrats, on Republican officeholders and freedmen in Coushatta, the parish seat of Red River Parish, Louisiana.  They assassinated six white Republicans and five to 20 freedmen who were witnesses.[1][2]\nThe White League had organized to restore white supremacy by driving Republicans out of Louisiana, disrupting their political organizing, and intimidating or murdering freedmen.[3]  Like the Red Shirts and other \"White Line\" organizations, they were described as \"the military arm of the Democratic Party.\"\n"
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Louisiana",
        "title": "George Floyd protests in Louisiana",
        "date": "May 28, 2020 – September 2020",
        "location": "Louisiana, United States",
        "state": "Louisiana",
        "county": "",
        "paragraph": "\nThis is a list of George Floyd protests in Louisiana, United States.\n"
    },
    {
        "link": "/wiki/Grabow_riot",
        "title": "Grabow riot",
        "date": "July 7, 1912",
        "location": "Grabow, Louisiana",
        "state": "Louisiana",
        "county": "",
        "paragraph": "The Grabow riot or Grabow massacre was a violent confrontation that took place between private police hired by management and labor factions in the timber industry near Grabow (Graybow), Louisiana, on July 7, 1912. The clash left three union workers and a company security employee dead, including union leader Asbury Decatur (\"Kate\") Hall, and an estimated fifty wounded. It was a crucial event in attempts to organize locals and unionize sawmill workers in Louisiana and east Texas in a series of events known as the Louisiana-Texas Lumber War of 1911-1912.\nThere had been unrest for years in western Louisiana and eastern Texas as workers tried to organize to gain better conditions in the industry. At Grabow the main factions involved were the Galloway Lumber Company and a party of striking unionized mill workers and their supporters. The union workers were known as the Brotherhood of Timber Workers (BTW),[1] a branch of the Lumber Workers Industrial Union (LWIU), which was affiliated with the Industrial Workers of the World (IWW). The Brotherhood tried to recruit mill workers by giving speeches and conducting meetings at various mills. Although they had limited success in Louisiana, the LWIU became very successful from 1917 to 1924. \n"
    },
    {
        "link": "/wiki/Know-Nothing_Riot",
        "title": "Know-Nothing Riot",
        "date": "",
        "location": "",
        "state": "Washington",
        "county": "Philadelphia",
        "paragraph": "The term Know-Nothing Riot has been used to refer to a number of political uprisings of the Nativist American Know Nothing Party in the United States of America during the mid-19th century. These anti-immigrant and anti-Catholic protests culminated into riots in Philadelphia in 1844, St. Louis in 1854, Cincinnati and Louisville in 1855, Baltimore in 1856, Washington, D.C. and New York in 1857, and New Orleans in 1858.\nThe Election Day Riots of 1855 occurred in Cincinnati between April 2-7, 1855. The election was between James J. Faran, the Democratic contender and editor of the Cincinnati Enquirer, and James D. Taylor, rabid nativist editor of the Cincinnati Times. Rumors of illegal voting, ballot-box stuffing, and naturalized voters preventing native-born citizens from voting sparked the events. [1]\n"
    },
    {
        "link": "/wiki/Battle_of_Liberty_Place",
        "title": "Battle of Liberty Place",
        "date": "September 14-17, 1874",
        "location": "New Orleans, Louisiana",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": " Louisiana State Government\nThe Battle of Liberty Place, or Battle of Canal Street, was an attempted insurrection and coup d'etat by the Crescent City White League against the Reconstruction Era Louisiana Republican state government on September 14, 1874, in New Orleans, which was the capital of Louisiana at the time.  Five thousand members of the White League, a paramilitary terrorist organization made up largely of  Confederate veterans, fought against the outnumbered New Orleans Metropolitan Police and state militia.  The insurgents held the statehouse, armory, and downtown for three days, retreating before arrival of Federal troops that restored the elected government. No insurgents were charged in the action. This was the last major event of violence stemming from the disputed 1872 gubernatorial election, after which Democrat John McEnery and Republican William Pitt Kellogg both claimed victory.\n"
    },
    {
        "link": "/wiki/March_14,_1891_New_Orleans_lynchings",
        "title": "March 14, 1891 New Orleans lynchings",
        "date": "March 14, 1891",
        "location": "New Orleans, Louisiana, U.S.",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nThe March 14, 1891, New Orleans lynchings were the murders of 11 Italian Americans and immigrants in New Orleans, Louisiana, by a mob for their alleged role in the murder of police chief David Hennessy after some of them had been acquitted at trial. It was the largest single mass lynching in American history.[2][3][note 1] Most of the lynching victims accused in the murder had been rounded up and charged due to their Italian ethnicity.[6]\n"
    },
    {
        "link": "/wiki/New_Orleans_massacre_of_1866",
        "title": "New Orleans massacre of 1866",
        "date": "July 30, 1866",
        "location": "New Orleans, Louisiana",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "The New Orleans Massacre of 1866 occurred on July 30, when a peaceful demonstration of mostly Black Freedmen was set upon by a mob of white rioters, many of whom had been soldiers of the recently defeated Confederate States of America, leading to a full-scale massacre. [4] The violence erupted outside the Mechanics Institute, site of a reconvened Louisiana Constitutional Convention. The Republican Party of Louisiana had called for the Convention, as they were angered by the legislature's enactment of the Black Codes and refusal to extend voting rights to Black men. White Democrats considered the reconvened convention to be illegal and were hostile towards Republican attempts to gain increased political power in the state. The massacre \"stemmed from deeply rooted political, social, and economic causes,\"[5] and took place in part because of the battle \"between two opposing factions for power and office.\"[5] According to the official report, a total of 38 were killed and 146 wounded, of whom 34 dead and 119 wounded were Black Freedmen. Unofficial estimates were higher.[6] Gilles Vandal estimated 40 to 50 Black Americans were killed and more than 150 Black Americans wounded.[7] Others have claimed nearly 200 were killed.[8] In addition, three white convention attendees were killed, as was one white protester.[9]\nDuring much of the American Civil War, New Orleans had been occupied and under martial law imposed by the Union. On May 12, 1866, Mayor John T. Monroe, a Democrat who had ardently supported the Confederacy, was reinstated as acting mayor, the position he held before the war. Judge R. K. Howell was elected as chairman of the convention, with the goal of increasing participation by voters likely to vote for removal of the Black Codes.[10]\n"
    },
    {
        "link": "/wiki/Opelousas_massacre",
        "title": "Opelousas massacre",
        "date": "September 28, 1868",
        "location": "Opelousas, LouisianaCoordinates: 30°31′37″N 92°05′10″W﻿ / ﻿30.527°N 92.086°W﻿ / 30.527; -92.086",
        "state": "",
        "county": "Sebastian May",
        "paragraph": "\nJohn Williams, James R. Dickson, Sebastian May\n"
    },
    {
        "link": "/wiki/Robert_Charles_riots",
        "title": "Robert Charles riots",
        "date": "July 23 – July 28, 1900",
        "location": "New Orleans, Louisiana, United States",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "Mob\nMayor Paul Capdevielle\n"
    },
    {
        "link": "/wiki/St._Bernard_Parish_massacre",
        "title": "St. Bernard Parish, Louisiana",
        "date": "",
        "location": "",
        "state": "Louisiana",
        "county": "New Orleans",
        "paragraph": "\nSt. Bernard Parish (French: Paroisse de Saint-Bernard; Spanish: Parroquia de San Bernardo) is a parish in the U.S. state of Louisiana. The parish seat and largest community is Chalmette.[2] The parish was formed in 1807.[3] St. Bernard Parish is part of the New Orleans–Metairie metropolitan statistical area; the parish is located southeast of the city of New Orleans and comprises the Chandeleur Islands and Chandeleur Sound in the east.\n"
    }
]