{
    "0": {
        "link": "/wiki/Willie_Francis",
        "title": "Willie Francis",
        "date": "May 9, 1947(1947-05-09) (aged 18) Louisiana State Penitentiary, West Feliciana Parish, Louisiana, U.S.",
        "year": "1947",
        "location": "",
        "state": "Louisiana",
        "place": "West Feliciana Parish",
        "county": "West Feliciana Parish",
        "paragraph": "Willie Francis (January 12, 1929 – May 9, 1947) was an African American teenager known for surviving a failed execution by electrocution in the United States.[1]  He was a juvenile offender sentenced to death at age 16 by the state of Louisiana in 1945 for the murder of Andrew Thomas, a Cajun pharmacy owner in St. Martinville who had once employed him. He was 17 when he survived the first attempt to execute him, as the chair malfunctioned. After an appeal of his case taken to the US Supreme Court failed, he was executed in 1947 at age 18.\nIn 1944, Andrew Thomas, a pharmacist in St. Martinville, Louisiana, was shot and killed. His murder remained unsolved for nine months, but in August 1945, Willie Francis was detained in Texas due to his proximity to an unrelated crime. Police claimed that he was carrying Thomas' wallet in his pocket, though no evidence of this claim was submitted during the trial.[2]\nFrancis initially named several others in connection with the murder, but the police dismissed these claims. A short time later, while under interrogation, Francis confessed to Thomas' murder, writing, \"It was a secret about me and him.\"  He had no counsel with him.[3] The meaning of his statement is still uncertain. Author Gilbert King, in his book, The Execution of Willie Francis (2008), alludes to rumors in St. Martinville of sexual abuse of the youth by the pharmacist. Francis later directed the police to where he had disposed of the holster used to carry the murder weapon. The gun used to kill Thomas was found near the crime scene. It belonged to a deputy sheriff in St. Martinville who had once threatened to kill Thomas. The gun, and the bullets recovered from the crime scene and Thomas' body, disappeared from police evidence just before the trial.\n",
        "type": [
            "murder"
        ]
    },
    "1": {
        "link": "/wiki/Robert_Charles",
        "title": "Robert Charles",
        "date": "July 23–27, 1900",
        "year": "1900",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Robert Charles (1865–1900) was a Black American living in New Orleans who took part in a gunfight after being assaulted by a police officer, leading to the death of 4 police and 2 civilians, and the wounding of over 20 others. The event sparked a major race riot in 1900; known as the Robert Charles riots.[2]\nOn Monday, July 23, 1900, Charles sat on the front steps of a house in New Orleans talking with a friend, while waiting to rendezvous with his girlfriend, Virginia Banks, who lived on the block.[3] Three white police officers, Sergeant Jules C. Aucion, August T. Mora, and Joseph D. Cantrelle, investigated reports of \"two suspicious looking negroes\" sitting on a porch in a predominantly white neighborhood. They found Robert Charles and his roommate, 19-year-old Leonard Pierce, at the scene. The policemen questioned the two men, demanding to know what they \"were doing and how long they had been there.\" One of the two men replied that they were \"waiting for a friend.\" Charles stood up, which the police took as an aggressive move. Mora grabbed him and the two struggled. Mora hit Charles with his billy club. Mora and Charles pulled guns and exchanged shots. Reports vary on who drew first; both men received non-lethal gunshot wounds to the legs. Charles fled to his residence, leaving a trail of blood.[4]\nAt Charles' residence, two officers, Officer Lamb and Captain Day, arrived and attempted to arrest Charles, but he brandished a rifle and shot and killed them both.[5] Charles then fled on foot and the police initiated a manhunt.\n",
        "type": [
            "assault",
            "riot"
        ]
    },
    "2": {
        "link": "/wiki/Helen_Hill",
        "title": "Helen Hill",
        "date": "January 4, 2007(2007-01-04) (aged 36) New Orleans, Louisiana, United States",
        "year": "2007",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Helen Wingard Hill (May 9, 1970 – January 4, 2007) was an American artist, filmmaker, writer, teacher, and social activist. When her final film, The Florestine Collection, was released in 2011, curators and critics praised her work and legacy, describing her, for example, as \"one of the most well-regarded experimental animators of her generation.\"[1]\nHill's death at the age of 36 brought considerable media attention. In 2007, an unidentified intruder shot and killed her in her New Orleans home. Her death (one of six murders in the city that day), coupled with the murder a week before of New Orleans musician Dinerral Shavers, sparked civic outrage. Thousands marched against the rampant and continuing post-Katrina violence in New Orleans. This \"March Against Violence on City Hall\" drew significant press coverage throughout the United States and beyond. However, in the years following that tragic notoriety, Helen Hill's life and creative work have been widely celebrated, with her films continuing to circulate to a degree they did not during her lifetime. In 2012, Daniel Eagan wrote about Helen Hill as one of \"Five Women Animators Who Shook Up the Industry\".[2]\nHelen Hill was a native of Columbia, South Carolina, where she lived until graduating from Dreher High School in 1988. She identified herself as a Southerner (although after marrying Paul Gailiunas, a Canadian citizen originally from Edmonton, Alberta, she later became a dual US-Canadian citizen) and had deep roots in her home city of Columbia. Her mother, Becky, named her Helen Wingard Hill after her own mother, Helen Addison Wingard, another Columbian.\n",
        "type": [
            "murder"
        ]
    },
    "3": {
        "link": "/wiki/Dalton_Prejean",
        "title": "Dalton Prejean",
        "date": "June 1974July 2, 1977",
        "year": "1974",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Dalton Prejean (December 10, 1959 – May 18, 1990) was one of 22 people in the United States executed for crimes committed as a juvenile prior to the decision Roper v. Simmons in 2005.[1] He was tried, convicted, and executed in the electric chair in Louisiana for the murder of Louisiana State Police Trooper Donald Cleveland.\nThe case received international attention because the defendant was a black man convicted by an all-white jury; had brain damage and tested just above mental retardation; and was age 17 at the time of the crime.[2]\nPrejean's son, Dalton Prejean Jr., born while his father was awaiting execution, was himself convicted of the 2001 death of a 14-month old baby. Prejean Jr. is currently serving a 60-year sentence in the same prison his father was executed in.[3]\n",
        "type": [
            "murder"
        ]
    },
    "4": {
        "link": "/wiki/Will_Smith_(defensive_end)",
        "title": "Will Smith (defensive end)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Queens",
        "county": "St. Tammany Parish",
        "paragraph": "\nWilliam Raymond Smith III (July 4, 1981 – April 9, 2016) was an American football defensive end in the National Football League (NFL). He played college football for Ohio State and was drafted by the New Orleans Saints in the first round of the 2004 NFL draft, where he played for the entirety of his career.  Smith was shot and killed during an altercation after an alcohol related traffic crash.\nSmith was born on July 4, 1981 in Queens, New York, to William and Lisa Smith.[1]  He was raised in Utica, New York.[2] At Proctor High School in Utica, Smith was a USA Today All-American pick, and was rated by Prep Football Report as the best defensive line prospect in the state. As a senior, he had 20 sacks.[citation needed]\n",
        "type": [
            "murder"
        ]
    },
    "5": {
        "link": "/wiki/Byrd_Gang",
        "title": "Byrd Gang",
        "date": "",
        "year": "new 2017",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "The Byrd Gang also known as the Piff Gang, is a criminal organization located in New Orleans, Louisiana. Detectives with New Orleans Police Department's Multi-Agency Gang unit previously described the Byrd Gang as \"one of the most murderous gangs in town.\" The gang have a long history of violence which has made them gain notoriety among other gangs in the city. \nThe Byrd Gang originated from the former C.J. Peete public housing development, known as Magnolia Projects, an infamous housing projects in Central City. For years the gang have feuded with the 3-N-G gang and clashed with them during the 2009 Mardi Gras parade where seven people were shot, including a baby. The shooting made national headlines in the news and brought the gang to the attention of the FBI.[1][2][3] In 2017, members of the gang were involved in a violent broad daylight shootout on Magazine Street that left two men wounded.[4]\nIn November of 2020 6 members of the Byrd Gang were charged with conspiracy to commit murder, and murder for fatally shooting a woman from Grass Valley, California after they attempted to purchase 30 pounds of marijuana from the woman with fake money and then attempted to flee. The woman and another person began to chase the Byrd Gang members. One of the members then pulled out his pistol and shot the woman in the head. [5]\nLater in April 2019, 2 members would be arrested for retaliation to the injustice murder of Torrence Allen.[citation needed]\nIn March 2018, three members of the Byrd Gang were indicted by a grand jury, charged with multiple counts of distributing heroin.[6][7][8]\n",
        "type": [
            "murder",
            "shooting",
            "mass shooting"
        ]
    },
    "6": {
        "link": "/wiki/Carol_Cole",
        "title": "Killing of Carol Cole",
        "date": "December 1980 (aged 17)",
        "year": "1980",
        "location": "",
        "state": "Louisiana",
        "place": "Bellevue",
        "county": "Plaquemines Parish",
        "paragraph": "Carol Ann Cole (previously nicknamed as \"Bossier Doe\" or \"Bossier's Doe\" and officially known as Cold Case No. 81-018329)[1][2] was a 17-year-old American homicide victim whose body was discovered in early 1981 in Bellevue, Bossier Parish, Louisiana.[3] The victim remained unidentified until 2015, when DNA tests confirmed her identity. Cole, native to Kalamazoo, Michigan, had been missing from San Antonio, Texas since 1980.[4] Cole's killing remains unsolved, although the investigation is continuing.[5]\nCarol Cole and her sister Linda \"Jeanie\" Phelps lived in Kalamazoo, Michigan, primarily under the care of their grandmother after their mother and father divorced. Later in life, Cole decided to leave Kalamazoo to accompany her mother, Sue, to San Antonio, Texas in 1979 at age 15 but remained in contact with her sister by telephone. Cole was at a girl's home run by the Palmer Drug Abuse Program, also called PDAP, on West 23rd St. in Austin, Texas, from May to October 1980.[6]\nShe continued to call and mail letters to her family, which eventually ceased in late December 1980. A location that Cole had stayed after leaving PDAP was traced by her grandmother in Kalamazoo to a home in Shreveport, Louisiana.[7] Her grandmother called the residence where she was informed that Cole had departed to attend a party but she had never returned.[8] Linda Phelps and her friend Patty Thorington continued to search for her, but were unsuccessful.[6] Cole had been previously excluded as a possible identity of the victim by a medical examiner for unknown reasons.[9][10]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "7": {
        "link": "/wiki/Robert_Davis_(New_Orleans)",
        "title": "Robert Davis (New Orleans)",
        "date": "",
        "year": "new 2005",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Robert Davis (born 1941) is a retired elementary school teacher and resident of New Orleans who was detained, arrested, and beaten by four police officers on October 8, 2005, on suspicion of public intoxication. Davis has denied intoxication, but he resisted arrest by failing to allow himself to be handcuffed and was beaten, which was filmed by the members of the Associated Press. A fifth officer was charged with assaulting an Associated Press producer.\nDavis is an African American and the two officers who beat him (while two others held him down) are white, adding to the controversy. Davis, who was charged with public intoxication, resisting arrest, battery, and public intimidation, pleaded not guilty on October 12, 2005.[1] The officers have also been charged with battery and were accused of using extreme force.[2] Regarding the charge of public intoxication, Davis said, \"I haven't had a drink in 25 years.\"[3]\nDavis said he returned to view and possibly rebuild his family's six properties that were destroyed by Hurricane Katrina. He went out during the night to buy cigarettes in the French Quarter and asked a mounted officer when a curfew would go into effect that night.[4]\n",
        "type": [
            "assault",
            "battery"
        ]
    },
    "8": {
        "link": "/wiki/Franklin_Sinclair",
        "title": "Franklin Sinclair",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Ouachita Parish",
        "county": "Ouachita Parish",
        "paragraph": "Franklin Sinclair (unknown – April 16, 1868) was an African American teacher and political activist in Ouachita Parish, Louisiana. He was assassinated the day before an election in which he was the Republican nominee for a seat in the Louisiana House of Representatives, of which he would have been one of the first Black members.[1]\nSinclair (who is also identified in some sources as Franklin St. Clair) was a Massachusetts native and graduate of Oberlin College who, like many other educated African Americans in the north, headed south after the war to help the formerly enslaved population.[2][3] He opened a school and became the only teacher of African American children in the parish.[4][5]\nIn 1867, he was named a commissioner of elections in Ouachita Parish.[6] In March 1868, he was nominated by Republicans for the position of county coroner, but in the weeks that followed, he was nominated instead for the state legislature.[7]\n",
        "type": []
    },
    "9": {
        "link": "/wiki/Robert_Sawyer_(murderer)",
        "title": "Robert Sawyer (murderer)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Gretna",
        "county": "Jefferson Parish",
        "paragraph": "Robert Wayne Sawyer (c. 1951 – March 5, 1993) was an American convicted murderer. He was tried, convicted, and executed by the state of Louisiana for the murder of Frances Arwood. He was the first inmate put to death by lethal injection in Louisiana. Allegations about Sawyer’s mental capacity were made after his conviction.\nOn September 28, 1979, Robert Sawyer, Frances Arwood, and Charles W. Lane were at Cynthia Shano's mother's house in Gretna, Louisiana. Arwood was Shano's sister in law, and was baby-sitting with Shano's two small children, who were also present. Sawyer lived at the residence with Shano. When Shano returned home at approximately 12:30 p.m., Sawyer, Lane, and Arwood were arguing. As the arguing continued, Sawyer pushed Arwood's head back against a sofa bed and hit her in the face. At this point, Lane also hit Arwood in the face with his fist. Sawyer then started hitting her in the chest. As Arwood tried to get up from the bed, Sawyer kicked her in the chest and told her to get up and go wash herself.\nAfter Shano had gone into the bedroom with the children, she heard Lane hitting Arwood. When she came out of the bedroom, Shano saw Sawyer drag Arwood by the hair into the bathroom. When Arwood would not get into the bathtub, Sawyer kicked her in the chest, knocking her into the tub, and hitting her head against the wall. Lane then pulled Arwood out of the bathtub and undressed her. The bathroom door was then closed for about twenty minutes.\n",
        "type": [
            "murder"
        ]
    },
    "10": {
        "link": "/wiki/Axeman_of_New_Orleans",
        "title": "Axeman of New Orleans",
        "date": "",
        "year": "new 1911",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nThe Axeman of New Orleans was an unidentified American serial killer active in New Orleans, Louisiana, and surrounding communities, including Gretna, from May 1918 to October 1919. Press reports during the height of public panic about the killings mentioned similar murders as early as 1911, but recent researchers have called these reports into question.[1] The Axeman was never identified, and the murders remain unsolved. He mainly targeted Italian immigrants and Italian-Americans. This leaves the possibility open that the killings were racially motivated, but as the killer was never caught, this was never conclusively proven.\nAs the killer's epithet implies, the victims usually were attacked with an axe, which often belonged to the victims themselves.[2] In most cases, a panel on a back door of a home was removed by a chisel, which along with the panel was left on the floor near the door. The intruder then attacked one or more of the residents with either an axe or straight razor. The crimes were not motivated by robbery, and the perpetrator never removed items from his victims' homes.[3]\n",
        "type": [
            "robber",
            "murder",
            "robbery",
            "killing"
        ]
    },
    "11": {
        "link": "/wiki/Jena_Six",
        "title": "Jena Six",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Jena",
        "county": "La Salle Parish",
        "paragraph": "\nThe Jena Six were six black teenagers in Jena, Louisiana, convicted in the 2006 beating of Justin Barker, a white student at the local Jena High School, which they also attended. Barker was injured on December 4, 2006, by the members of the Jena Six, and received treatment at an emergency room. While the case was pending, it was often cited by some media commentators as an example of racial injustice in the United States. Some commentators believed that the defendants had been charged initially with too-serious offenses and had been treated unfairly.\nA number of events had taken place in and around Jena in the months before the Barker assault, which the media have associated with an alleged escalation of local racial tensions. These events included: the hanging of rope nooses from a tree in the high school courtyard, two violent confrontations between white and black youths, and the destruction by fire of the main building of Jena High School. Extensive news coverage related to the Jena Six often reported these events as linked.[1] Federal and parish attorneys concluded from their investigations that assessment was inaccurate for some of the events; for instance, the burning of the high school was an attempt to destroy grade records.\n",
        "type": [
            "assault",
            "battery"
        ]
    },
    "12": {
        "link": "/wiki/Camille_Hebert",
        "title": "Amy Hebert",
        "date": "August 20, 2007",
        "year": "2007",
        "location": "",
        "state": "Louisiana",
        "place": "Mathews",
        "county": "Lafourche Parish",
        "paragraph": "Amy T. Hebert[3] (née Talbot[4]) is a woman from Mathews, Louisiana, United States, who was convicted of murdering her two children in August 2007 in an act of revenge against her ex-husband; she also killed the family dog. Hebert was sentenced to life in prison without the possibility of parole.[5]\nAmy Hebert, originally from Larfourche Parish, Louisiana, worked as a teacher's aide at Lockport Lower Elementary School in Lockport.[6][7] In Hebert's criminal trial, experts summoned by the prosecution and the defense stated that Hebert had been severely depressed around the time she committed the crime.[8]\nHebert's husband, Chad Hebert, sought a divorce in 2005, which was finalized in April of the following year.[4] Chad subsequently entered into a relationship with another woman, whom he married in 2008.[1]\n",
        "type": [
            "murder"
        ]
    },
    "13": {
        "link": "/wiki/Eric_Matthews_(serial_killer)",
        "title": "Eric Matthews (serial killer)",
        "date": "",
        "year": "new 1994",
        "location": "",
        "state": "Louisiana",
        "place": "Chicago",
        "county": "Franklin Parish",
        "paragraph": "Eric Dawon Matthews (born May 3, 1974)[1] is an American serial killer and rapist who killed two of his ex-girlfriends in Indiana in 1994, followed by his wife and stepson in Louisiana in 1998.[2] Additionally linked to two rapes while on the run, he was arrested and put on trial after years of delay, where he was found guilty and sentenced to life imprisonment.[3]\nLittle is known about Matthews' upbringing. Born in Indianapolis on May 3, 1974, his troubles began as early as age 3, when one of his uncles began molesting him.[4] In the ensuing years, he constantly got in trouble with police due to small-time crimes, but could not be prosecuted due to his young age. In an attempt to help him, he was first sent to a mental hospital at age 9, and for a few years was shuffled between various institutions in Michigan, Chicago and Arizona.[4] At age 10, he was convicted of raping a 35-year-old staff worker at one of the hospitals he was interned in. However, despite his violent record, Matthews was released and returned to Indianapolis, graduating from Lawrence Central High School. He was known as a charming, but very violent, character, who nonetheless had no trouble maintaining relationships with women.[4]\nIn June 1994, Matthews was working at a pancake house in Castleton, together with a 19-year-old co-worker named Kenya L. Willis. Around this time, Willis vanished mysteriously, and has not been located to this very day. At the time, Matthews was not suspected, and the circumstances surrounding this case remained unclear until his arrest.[4] Around the same time, Matthews' 18-year-old live-in girlfriend, Christina Darnell, had moved in with him at his Indianapolis apartment to look after their 3-year-old daughter, Erica. However, Matthews began beating her on a regular basis, causing Darnell to send their daughter away to live at her parents' home in Madison, Alabama.[5] Against her mother's wishes, she decided to stay with Matthews, keeping in contact with her mother and daughter by talking to them on the phone every day. On October 1, Darnell's mother, who had not heard from her in three days, finally reported her as missing. The authorities went to Matthews' household, and after interrogation, he admitted that the pair had been in a fight on August 29, but claimed that Darnell had taken $700 and simply left.[6] At a later interview with The Indianapolis Star, he continued to proclaim his innocence and pointed to the fact that all leads for the case were essentially provided by him, since he was the one who filed the missing persons report.[6] While Darnell's family members were highly suspicious of Matthews' involvement in the case, he could not be arrested at the time due to lack of evidence, coupled with the fact that the possibility that Darnell, who suffered from a dissociative identity disorder, could have been interned at a psychiatric institution for treatment.[4] In spite of their efforts to locate her, her trail went cold.[6]\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "14": {
        "link": "/wiki/John_Russell_Houser",
        "title": "2015 Lafayette shooting",
        "date": "July 23, 2015; 7 years ago (2015-07-23) 7:27 p.m. (CDT)",
        "year": "2015",
        "location": "3141 Johnston Street, Lafayette, Louisiana, U.S.",
        "state": "Louisiana",
        "place": "Lafayette",
        "county": "Lafayette Parish",
        "paragraph": "\nOn July 23, 2015, a mass shooting occurred at the Grand 16 movie theater in Lafayette, Louisiana.[3] John Russell Houser,[4][5] 59, opened fire during a showing of the film Trainwreck, killing two people and injuring nine others before committing suicide.[6][7][8][9]\nThe shooting occurred in theater 14[10] during the 7:10 p.m. screening of Trainwreck, held at the Grand 16 movie theater in Lafayette.[2] John Russell Houser, 59, went to the theater alone, bought a ticket ten minutes late into the movie,[11] and sat for several minutes in the theater's second-to-last row. Along with Houser,[12] there were 25 people in the theater and 300 people in the building.[13][14][15] He was armed with a Hi-Point Model JCP .40-caliber handgun[1] and equipped with two 10-round magazines. Shortly before 7:30 p.m., Houser stood up, pulled out the handgun from his pants, and started shooting indiscriminately while walking down the steps. He fired at least 13 rounds and reloaded once. He killed two people and injured nine others.[16][17][18][19]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "15": {
        "link": "/wiki/Magnolia_Shorty",
        "title": "Magnolia Shorty",
        "date": "December 20, 2010(2010-12-20) (aged 28) Edgelake, New Orleans, Louisiana, U.S.",
        "year": "2010",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Renetta Yemika Lowe-Bridgewater (September 30, 1982 – December 20, 2010), known by the stage name Magnolia Shorty, was an American rapper in the New Orleans-based bounce music scene.[1]\nMagnolia Shorty and Ms. Tee (Trishell Williams) were the first women signed to Cash Money Records.[2] Her 1997 debut album Monkey on the Dick (often stylized Monkey On Tha D$ck) is considered a bounce classic, and she \"was already considered a legend of bounce music\" at the time of her death.[2] Offbeat said the album exemplifies \"the eccentric New Orleans elements of sexuality, comedy and hard edged dance rhythms.\"[3] In his 2007 book Triksta, Nik Cohn credits Magnolia Shorty with his own discovery of bounce, and the third chapter of that book is named after her debut album. She was sampled on Fort Worth, Texas rapper Bone's hit “Homegurl” as well as \"In My Feelings\" by Drake and \"Wobble Up\" by Chris Brown.[4][5]\nMagnolia Shorty was discovered by Birdman.[6][7] She received her nickname from Soulja Slim, also known as Magnolia Slim, because both had grown up in New Orleans' dangerous Magnolia Projects.[8] Nicknamed \"Queen of Bounce,\" she collaborated with many Cash Money artists beginning in the 1990s, including Juvenile and Hot Boys.[4] She was first featured on Juvenile's 1997 song \"3rd Ward Solja.\"[9] In 2009 she appeared at the SXSW music festival[10] and won Best Bounce Song at the Underground Hip-Hop Awards in New Orleans.[2] She was a member of Lil Wayne's Cash Money crew in the early 1990s, and she was collaborating as well as working on her second album on the Cash Money/Young Money label in 2010.[11]\n",
        "type": [
            "murder"
        ]
    },
    "16": {
        "link": "/wiki/Amy_Hebert",
        "title": "Amy Hebert",
        "date": "August 20, 2007",
        "year": "2007",
        "location": "",
        "state": "Louisiana",
        "place": "Mathews",
        "county": "Lafourche Parish",
        "paragraph": "Amy T. Hebert[3] (née Talbot[4]) is a woman from Mathews, Louisiana, United States, who was convicted of murdering her two children in August 2007 in an act of revenge against her ex-husband; she also killed the family dog. Hebert was sentenced to life in prison without the possibility of parole.[5]\nAmy Hebert, originally from Larfourche Parish, Louisiana, worked as a teacher's aide at Lockport Lower Elementary School in Lockport.[6][7] In Hebert's criminal trial, experts summoned by the prosecution and the defense stated that Hebert had been severely depressed around the time she committed the crime.[8]\nHebert's husband, Chad Hebert, sought a divorce in 2005, which was finalized in April of the following year.[4] Chad subsequently entered into a relationship with another woman, whom he married in 2008.[1]\n",
        "type": [
            "murder"
        ]
    },
    "17": {
        "link": "/wiki/Huey_Long",
        "title": "Huey Long",
        "date": "September 10, 1935(1935-09-10) (aged 42) Baton Rouge, Louisiana, U.S.",
        "year": "1935",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nHuey Pierce Long Jr. (August 30, 1893 – September 10, 1935), byname \"The Kingfish\", was an American politician who served as the 40th governor of Louisiana from 1928 to 1932 and as a United States senator from 1932 until his assassination in 1935. He was a left-wing populist member of the Democratic Party and rose to national prominence during the Great Depression for his vocal criticism of President Franklin D. Roosevelt and his New Deal, which Long deemed insufficiently radical. As the political leader of Louisiana, he commanded wide networks of supporters and often took forceful action. A controversial figure, Long is celebrated as a populist champion of the poor or, conversely, denounced as a fascistic demagogue.\nLong was born in the impoverished north of Louisiana in 1893. After working as a traveling salesman and briefly attending three colleges, he was admitted to the bar in Louisiana. Following a short career as an attorney, in which he frequently represented poor plaintiffs, Long was elected to the Louisiana Public Service Commission. As Commissioner, he prosecuted large corporations such as Standard Oil, a lifelong target of his rhetorical attacks. After Long successfully argued before the U.S. Supreme Court, Chief Justice and former president William Howard Taft praised him as \"the most brilliant lawyer who ever practiced before the United States Supreme Court\".\n",
        "type": []
    },
    "18": {
        "link": "/wiki/Prosecution_of_Rodricus_Crawford",
        "title": "Prosecution of Rodricus Crawford",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Caddo",
        "county": "Caddo Parish",
        "paragraph": "The prosecution of Rodricus Crawford in Caddo Parish, Louisiana in 2013, attracted national media attention. Crawford, a young black man, was convicted and sentenced to death that year for suffocating his one-year-old son.[2]  His death sentence was seen as part of a pattern in the parish, which has the highest rate of death penalty sentencing in the nation.[3] The prosecutor in this case said this penalty was needed for society's revenge.[4]\nThe conviction greatly depended upon the findings of a disputed pathology report.[4] After sentencing, Crawford was held on death row, the second-youngest man there. He was imprisoned at Louisiana State Penitentiary, commonly called Angola. New medical evidence introduced in 2014 on appeal of the case disputed the findings of the prosecution witnesses.\nIn 2016, the conviction was overturned by the Louisiana Supreme Court on appeal, due to findings of prosecution misconduct in jury selection.[5] In April 2017, the Caddo Parish District Attorney's Office dismissed all charges against Crawford; he was exonerated.\n",
        "type": [
            "murder"
        ]
    },
    "19": {
        "link": "/wiki/Colfax_massacre",
        "title": "Colfax massacre",
        "date": "April 13, 1873",
        "year": "1873",
        "location": "Colfax, Louisiana, United States31°31′01″N 92°42′42″W﻿ / ﻿31.51691°N 92.71175°W﻿ / 31.51691; -92.71175Coordinates: 31°31′01″N 92°42′42″W﻿ / ﻿31.51691°N 92.71175°W﻿ / 31.51691; -92.71175",
        "state": "Louisiana",
        "place": "Colfax",
        "county": "Grant Parish",
        "paragraph": "\n\nCourthouse attackers\n",
        "type": [
            "riot"
        ]
    },
    "20": {
        "link": "/wiki/William_M._Rainach",
        "title": "William M. Rainach",
        "date": "",
        "year": "new 1917",
        "location": "",
        "state": "Louisiana",
        "place": "Kentwood",
        "county": "Tangipahoa Parish",
        "paragraph": "William Monroe Rainach Sr. (July 31, 1913 – January 26, 1978) was an American segregationist politician[1] and businessman.[2] A Democrat, he was a member of the Louisiana House of Representatives and the State Senate.[3]\nWilliam Odom was born in Kentwood, Louisiana.[2] His mother died of influenza in 1917, and his father placed him in an orphanage. He was adopted by Mr. and Mrs. Albert M. Rainach of Summerfield in Claiborne Parish, Louisiana. In 1924, he was struck in the eye by a baseball, which eventually cost him his sight in that eye.[2]\nAfter attending Southern State College, Strayer’s Business College and Louisiana State University, he founded the Claiborne Electric Cooperative in 1939, which brought power to rural northwestern Louisiana. In 1945, he also established the Claiborne Butane Company.[2] His business success enabled him to enter politics.[citation needed]\n",
        "type": [
            "new murder"
        ]
    },
    "21": {
        "link": "/wiki/Murder_of_Frank_Morris",
        "title": "Murder of Frank Morris",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Charlotte",
        "county": "Iberia Parish",
        "paragraph": "Frank Morris (1914–1964) was an American businessman who died as a result of arson to his shoe shop in Ferriday, Louisiana, a city with a history of racial violence. There have been allegations of witness intimidation, evidence tampering, and involvement by local law enforcement. No charges have been brought despite three FBI investigations.\nFrank Morris's mother, Charlotte, died shortly after his birth. His father, Sullivan, operated a shoe shop in Natchez, Mississippi. Frank Morris fathered one child, and had two grandchildren.\nMorris opened Frank's Shoes Service in the late 1930s, in his hometown of Ferriday, Louisiana. This business serviced both black and white customers. His daily tasks included repairing shoes and saddles, selling jewellery, hats, and clothing, and dyeing purses. The shop was very successful and was known by the tag line, \"Open every day and half the night\", in its ads in the Concordia Sentinel.[1][page needed] The shop was also his residence. The building was burned down in the early morning of December 10, 1964.\n",
        "type": [
            "arson",
            "murder",
            "lynching"
        ]
    },
    "22": {
        "link": "/wiki/Thibodaux_massacre",
        "title": "Thibodaux massacre",
        "date": "November 22–25, 1887",
        "year": "1887",
        "location": "Thibodaux, Louisiana",
        "state": "Louisiana",
        "place": "Thibodaux",
        "county": "Lafourche Parish",
        "paragraph": "\nThe Thibodaux massacre was an episode of racial violence that occurred in Thibodaux, Louisiana on November 23, 1887. It followed a three-week strike during the critical harvest season in which an estimated 10,000 workers protested against the living and working conditions which existed on sugar cane plantations in four parishes: Lafourche, Terrebonne, St. Mary, and Assumption.\nThe strike was the largest strike in the history of the industry and it was also the first strike to be conducted by a formal labor organization, the Knights of Labor. At planters' requests, the state sent the militia to protect strikebreakers from ambush attacks by strikers, and work resumed on some plantations. Black workers and their families were evicted from plantations in Lafourche and Terrebonne parishes and retreated to Thibodaux.\n",
        "type": [
            "murder"
        ]
    },
    "23": {
        "link": "/wiki/Gary_Tyler",
        "title": "Gary Tyler",
        "date": "",
        "year": "new 1974",
        "location": "",
        "state": "Louisiana",
        "place": "St. Rose",
        "county": "St. Charles Parish",
        "paragraph": "Gary Tyler (born July 1958), from St. Rose, Louisiana, is an African-American man who is a former prisoner at the Louisiana State Prison in Angola, Louisiana. He was convicted of the October 7, 1974 shooting death of a white 13-year-old boy and the wounding of another, on a day of violent protests by whites against black students at Destrehan High School in St. Charles Parish, Louisiana. He was tried as an adult and convicted of first-degree murder at age 17 by an all-white jury; he received the mandatory death sentence for that crime, according to state law. When he entered Louisiana State Prison (Angola), he was the youngest person on death row.\nIn 1976 the United States Supreme Court ruled in Roberts v. Louisiana that the state's death penalty law was unconstitutional, as it required mandatory sentences for convictions of certain capital charges, without consideration of mitigating factors. The Supreme Court ordered state court reviews and the commutation of sentences of persons on death row to the next lower level of punishment. Tyler's sentence was commuted to life in prison without parole for 20 years. \nHis defense appealed the conviction. The United States Court of Appeals for the Fifth Circuit ruled in 1980 that Tyler's trial had convicted him on \"unconstitutional charges\" and was \"fundamentally unfair\"; it remanded the case to the lower courts and ordered a new trial. But on state appeal, it changed its ruling in 1981, saying that attorney error by Tyler's original defense counsel did not allow redress. Tyler was recommended by the state parole board for a pardon, but governors had failed to act on this. \n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "24": {
        "link": "/wiki/Mayeus_Lafleur",
        "title": "Mayeus Lafleur",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Mamou",
        "county": "Evangeline Parish",
        "paragraph": "Mayeus Lafleur (born in Mamou, Louisiana in 1906) was one of the earliest musicians to record Cajun music. Along with fellow musician Leo Soileau, he recorded the standard \"He Mon\" (which is widely considered to be only the second recorded documentation of the genre),[1] in 1928.[2] However, less than two weeks after the recording session, he was shot to death during a quarrel involving moonshine at a local dance after jumping to the aid of a friend, Alexander Bellon, who was shot first. He was only 22 at the time of his death.[3][4][5]\n",
        "type": []
    },
    "25": {
        "link": "/wiki/Kennedy_v._Louisiana",
        "title": "Kennedy v. Louisiana",
        "date": "March 1998",
        "year": "1998",
        "location": "",
        "state": "Louisiana",
        "place": "Harvey",
        "county": "Jefferson Parish",
        "paragraph": "\nKennedy v. Louisiana, 554 U.S. 407 (2008), is a landmark decision by the Supreme Court of the United States that held that the Eighth Amendment's Cruel and Unusual Punishments Clause prohibits imposing the death penalty for the rape of a child in cases where the victim did not die and death was not intended.\nPatrick O'Neal Kennedy (born December 13, 1964),[1] a man from Harvey, Louisiana in Greater New Orleans,[2] was sentenced to death after being convicted of raping and sodomizing his eight-year-old stepdaughter. The rape, taking place in March 1998, was uncommonly brutal: it tore the victim's perineum \"from her vaginal opening to her anal opening. [It] tore her vagina on the interior such that it separated partially from her cervix and allowed her rectum to protrude into her vagina. Invasive emergency surgery was required to repair these injuries.\"[3] Kennedy maintained that the battery was committed by two neighborhood boys, and refused to plead guilty when a deal was offered to spare him from a death sentence.[4] Nevertheless, he was convicted in 2003 and sentenced under a 1995 Louisiana law that allowed the death penalty for the rape of a child under the age of 12.[citation needed]\n",
        "type": [
            "rape",
            "battery"
        ]
    },
    "26": {
        "link": "/wiki/David_Hennessy",
        "title": "David Hennessy",
        "date": "October 16, 1890 (aged 31–32) New Orleans, United States",
        "year": "1890",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "David C. Hennessy (1858 – October 16, 1890) was a police chief of New Orleans, Louisiana. As a young detective, he made headlines in 1881 when he captured a notorious Italian criminal, Giuseppe Esposito. In 1888, he was promoted to superintendent and chief of police. While in office he made a number of improvements to the force, and was well known and respected in the New Orleans community.\nHis assassination in 1890 led to a sensational trial. A series of acquittals and mistrials angered locals, and an enormous mob formed outside the prison the next day. The prison doors were forced open and 11 of the 19 Italian men who had been indicted for Hennessy's murder were lynched. The March 14, 1891 lynchings were the largest known mass lynching in U.S. history.\nDavid C. Hennessy was born into an Irish Catholic family, son of Margaret and David Hennessy Sr., at 275 Girod St., New Orleans. David Sr. was a member of the First Louisiana Cavalry of the Union Army during the U.S. Civil War, formed after the state was occupied by Union troops. After the war, during the Reconstruction era, he served with the Metropolitan Police, a New Orleans force under the authority of the governor of Louisiana. Local white Democrats generally considered the Metropolitan Police as a military occupation army, in part because it protected the right of freedmen to vote, in accordance with the Fifteenth Amendment. David Sr. was murdered in 1869 by Arthur Guerin, a fellow policeman.[1]\n",
        "type": [
            "murder",
            "lynching"
        ]
    },
    "27": {
        "link": "/wiki/Battle_of_Liberty_Place",
        "title": "Battle of Liberty Place",
        "date": "September 14-17, 1874",
        "year": "1874",
        "location": "New Orleans, Louisiana",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": " Louisiana State Government\nThe Battle of Liberty Place, or Battle of Canal Street, was an attempted insurrection and coup d'etat by the Crescent City White League against the Reconstruction Era Louisiana Republican state government on September 14, 1874, in New Orleans, which was the capital of Louisiana at the time.  Five thousand members of the White League, a paramilitary terrorist organization made up largely of  Confederate veterans, fought against the outnumbered New Orleans Metropolitan Police and state militia.  The insurgents held the statehouse, armory, and downtown for three days, retreating before arrival of Federal troops that restored the elected government. No insurgents were charged in the action. This was the last major event of violence stemming from the disputed 1872 gubernatorial election, after which Democrat John McEnery and Republican William Pitt Kellogg both claimed victory.\nThe \"Battle of Liberty Place\" was the name given to the insurrection by its Democratic supporters, as part of their story of the struggle to overturn Republicans and the Reconstruction government. Although this government brought about greater equality and opportunity for blacks, white supremacists saw it as tyranny.[3] In the election of 1872, John McEnery, a Democrat, was supported by a coalition of Democrats and anti-Grant Republicans, including Republican Gov. Henry C. Warmoth. Warmoth's opponents in the Republican Party remained loyal to President Grant, and supported the Republican Party nominee, William Pitt Kellogg.\n",
        "type": [
            "terrorist",
            "riot"
        ]
    },
    "28": {
        "link": "/wiki/Robert_Charles_riots",
        "title": "Robert Charles riots",
        "date": "July 23 – July 28, 1900",
        "year": "1900",
        "location": "New Orleans, Louisiana, United States",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Mob\nMayor Paul Capdevielle\nThe Robert Charles riots of July 24–27, 1900 in New Orleans, Louisiana were sparked after Afro-American laborer Robert Charles fatally shot a white police officer during an altercation and escaped arrest. A large manhunt for him ensued, and a white mob started rioting, attacking blacks throughout the city. The manhunt for Charles began on Monday, July 23, 1900, and ended when Charles was killed on Friday, July 27, shot by a special police volunteer. The mob shot him hundreds more times, and beat the body.\n",
        "type": [
            "murder",
            "riot",
            "mass murder"
        ]
    },
    "29": {
        "link": "/wiki/Robert_Lee_Willie",
        "title": "Robert Lee Willie",
        "date": "December 28, 1984(1984-12-28) (aged 26) Louisiana State Penitentiary, West Feliciana Parish, Louisiana, U.S.",
        "year": "1984",
        "location": "",
        "state": "Louisiana",
        "place": "West Feliciana Parish",
        "county": "West Feliciana Parish",
        "paragraph": "Robert Lee Willie (January 2, 1958 – December 28, 1984) was an American serial killer who killed at least three people in Louisiana from the late 1970s to 1980. He was sentenced to death for the rape and murder of 18-year-old Faith Hathaway and was executed in 1984.\nSister Helen Prejean, a teacher and one of the Sisters of Saint Joseph of Medaille from New Orleans, began to write to him and later served as his spiritual adviser. In her book Dead Man Walking (1993), she explored her experiences with men on death row and the basis for her growing opposition to the death penalty. The book  was adapted as a 1995 film of the same name, starring Susan Sarandon and Sean Penn. The book was also adapted as an opera, first produced by the San Francisco Opera in 2000.\nWillie was the son of Elizabeth Oalman of Covington, and had four brothers. In interviews, he recounted a life filled with drugs, alcoholism and violence. Willie's mother said he had a ninth-grade education and left home when he was 16, after he started using drugs.[1]\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "30": {
        "link": "/wiki/JayDaYoungan",
        "title": "JayDaYoungan",
        "date": "July 27, 2022(2022-07-27) (aged 24) Bogalusa, Louisiana, U.S.",
        "year": "2022",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nJavorius Tykies Scott (July 15, 1998 – July 27, 2022), known professionally as JayDaYoungan, was an American rapper and singer.[3] He was best known for his singles \"23 Island\", \"Elimination\", and \"Opps\", which have received 73, 35, and 40 million respective streams on SoundCloud as of November 2022. Scott released the mixtapes Forever 23 (2018), Endless Pain (2019), and his debut commercial mixtape Misunderstood (2019), which peaked at number 43 on the US Billboard 200. His debut studio album, Baby23, was released on June 5, 2020. He was first exposed to the mainstream with his mixtapes Ruffwayy and The Real Jumpman 23, which included the tracks \"Sliding Freestyle\" and \"Muddy Situation\".\nScott was born on July 15, 1998, in Bogalusa, Louisiana. He began his rapping career at the age of 18 and dropped out of high school to pursue his career.\n",
        "type": []
    },
    "31": {
        "link": "/wiki/Andrew_Lee_Jones",
        "title": "Andrew Lee Jones",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Andrew Lee Jones (c. 1955 – July 22, 1991) was an American executed for murder. He was tried, convicted, and executed in the electric chair in Louisiana for the murder of Tumekica Jackson. He was the last inmate to die in Louisiana's infamous electric chair, \"Gruesome Gertie\".\nOn February 17, 1984, eleven-year-old Tumekica Jackson was living with her mother and her grandparents in the Scotlandville area of Baton Rouge. At 4:00 a.m., the grandmother discovered that Tumekica was missing from her bedroom. The police discovered that someone had broken the screen of the rear den window and had opened the back door. In the muddy ground near the house, police obtained a cast of an imprint made by the left shoe from a pair of size 8⅓ tennis shoes. There were no signs of a struggle inside the house.\nThe investigation immediately focused on Jones because his stormy romantic relationship of several years with Tumekica's mother had been broken off by her the week before. Tumekica knew Jones well, and he had been in the home many times. On the evening of Tumekica's disappearance, Jones had called the mother's home three times and had told the grandmother that he would not be responsible for his actions if the mother continued to refuse to see him.\n",
        "type": [
            "murder"
        ]
    },
    "32": {
        "link": "/wiki/Clive_Stafford_Smith",
        "title": "Clive Stafford Smith",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nClive Adrian Stafford Smith OBE (born 9 July 1959) is a British attorney who specialises in the areas of civil rights and working against the death penalty in the United States of America.[1] He worked to overturn death sentences for convicts, and helped found the not-for-profit Louisiana Capital Assistance Center in New Orleans. By 2002 this was the \"largest capital defence organisation in the South.\"[2] He was a founding board member of the Gulf Region Advocacy Center, based in Houston, Texas.\nIn addition, he has represented more than 80 of the detainees held as enemy combatants since 2002 at the US Guantanamo Bay detention camp. As of February 2021, a total of 40 men are still held there.[3]\n",
        "type": []
    },
    "33": {
        "link": "/wiki/Vince_Marinello",
        "title": "Vince Marinello",
        "date": "",
        "year": "new 2020",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Vince Marinello (1938/1939 – February 21, 2020) was an American longtime sportscaster who was featured on WWL AM/FM radio and, previously, on WVUE and  WDSU in New Orleans, Louisiana.[1]  He was later known as a leading media personality, covering aspects of the recovery of the city from the devastation following Hurricane Katrina.[2] Before his arrest for the murder of his third wife, he served as an in-house television host and analyst at the Fair Grounds Race Course from 1990 until 2005. Marinello died in custody at Dixon Correctional Institute on February 21, 2020 of natural causes.[3]\nOn August 31, 2006, Marinello's estranged wife, Mary Elizabeth, was shot twice in the face in the parking lot of an office tower in Metairie, Louisiana.[4] Jefferson Parish Sheriff's authorities initially announced their belief that the murder was a result of a botched robbery.[5]\nMarinello voluntarily met with sheriff's investigators and initially denied any connection to the murder of his estranged wife, saying he was in Jackson, Mississippi.[4] On September 7, he voluntarily turned himself in to the Jefferson Parish Sheriff's Department's main office in Gretna, Louisiana. He was subsequently arrested and charged with second-degree murder in the killing of his wife, who filed for a contentious divorce after she discovered he was not legally divorced when they wed.[6] On the night of September 11, 2006, Marinello posted a $250,000 bond and was released from jail.[7]\n",
        "type": [
            "robber",
            "murder",
            "robbery",
            "killing"
        ]
    },
    "34": {
        "link": "/wiki/Moreese_Bickham",
        "title": "Moreese Bickham",
        "date": "April 2, 2016(2016-04-02) (aged 98) Alameda, California, U.S.[1]",
        "year": "2016",
        "location": "",
        "state": "Louisiana",
        "place": "Alameda",
        "county": "East Baton Rouge Parish",
        "paragraph": "Moreese Bickham (June 6, 1917 – April 2, 2016) was an American resident of Mandeville, Louisiana who was arrested, convicted, and sentenced to death for the July 12, 1958 killing of a sheriff's deputy, reportedly a local Klan leader. In 1974, Bickham's death sentence was converted to life without parole after the U.S. Supreme Court's decision in Furman v. Georgia, which invalidated death penalty convictions in certain circumstances.[2]  In April, 1995, through a detailed legal challenge to Bickham's 1958 conviction, the Governor of Louisiana consented to commute Bickham's sentence to 75 years.  Several months later, Bickham's attorney won a full release, and Bickham left Angola State Penitentiary in January, 1996, after 37 1/2 years in prison.  Bickham lived the rest of his life in California, and died in hospice care in Alameda, California after a short illness, at the age of 98.[1]\nBorn in 1917, the grandson of enslaved Africans, Bickham lived most of his life in Mississippi and Louisiana. He served in the United States Navy in World War II, stationed at Pearl Harbor.\nIn 1958, Bickham lived in Mandeville, Louisiana, a town north of New Orleans. According to trial transcripts, at around 11 pm on the evening of July 12, 1958, Bickham became drawn into an argument with two sheriff's deputies in a bar called \"Buck's Place\" in Mandeville.  At trial, prosecutors submitted evidence that Bickham's girlfriend, Florence Spencer, had been \"acting unruly.\"  At approximately 11 pm the two deputies—Gus Gill, 68, and Jake Galloway, 74—drove Spencer home.  The deputies wore street clothes, and many in the community reported that they believed the two deputies were associated with the Ku Klux Klan, something not unusual for law enforcement personnel in a small, rural town in 1958 Louisiana.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "35": {
        "link": "/wiki/Tensas_State_Bank_hostage_crisis",
        "title": "Tensas State Bank hostage crisis",
        "date": "September 13, 2013 (2013-09-13)",
        "year": "2013",
        "location": "St. Joseph, Tensas ParishLouisiana, United States",
        "state": "Louisiana",
        "place": "St. Joseph",
        "county": "Tensas Parish",
        "paragraph": "On August 13, 2013, a gunman, identified as 20-year-old Fuaed Abdo Ahmed, took two women and a man hostage at the St. Joseph branch of Tensas State Bank. He killed two of the hostages after releasing the third. A subsequent police investigation officially concluded that Ahmed suffered from mental health issues and acted alone, while the incident was not classified as an act of terrorism.\nOn August 13, 2013, Ahmed entered the St. Joseph branch of Tensas State Bank, armed with both a handgun and an AK-47 rifle. His duffel bag was packed with items that he planned to use to torture his hostages.[1] He held three people hostage: Charles Henry \"Jay\" Warbington, Jr., of Wisner in Franklin Parish, Tamara LaDean \"Deannie\" McDaniel, and Patricia White.[2][3] All three were employees at the bank for more than twenty years. During negotiations, state police superintendent, Colonel Mike Edmonson, located a friend of Ahmed's in Alaska, who talked him into releasing one of the hostages, Patricia White. According to Edmondson, Ahmed was \"mad at people that he said were mean to him. He had voices in his head.\"[4] Authorities said that Ahmed believed the family of his ex-girlfriend in Lake Providence had caused their breakup and had placed a \"microphone device\" of some kind in his head.[5][6]\nEventually, Ahmed shot the remaining two hostages. Warbington died at the scene, while McDaniel was critically wounded and died two days later at Rapides Regional Medical Center in Alexandria.[6] Soon afterward, the Louisiana State Police broke into the bank and fatally shot Ahmed.[1][4] It did not appear that Ahmed knew the hostages,[1] but the hostages recognized him.[5]\n",
        "type": [
            "terrorism",
            "torture",
            "murder"
        ]
    },
    "36": {
        "link": "/wiki/Joe_McKnight",
        "title": "Joe McKnight",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nJoseph Nathan McKnight Jr. (April 16, 1988 – December 1, 2016) was an American football running back and return specialist who played in the National Football League (NFL) and Canadian Football League (CFL).\nHe attended the University of Southern California (USC), where he played college football for the USC Trojans. McKnight was selected in the fourth round of the 2010 NFL Draft by the New York Jets. After playing in the NFL for the Jets and Kansas City Chiefs, he played in the CFL for the Edmonton Eskimos and the Saskatchewan Roughriders.\n",
        "type": []
    },
    "37": {
        "link": "/wiki/Danziger_Bridge_shootings",
        "title": "Danziger Bridge shootings",
        "date": "September 4, 2005  (Central Daylight Time)",
        "year": "2005",
        "location": "New Orleans, Louisiana, U.S.",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nOn the morning of September 4, 2005, six days after Hurricane Katrina struck New Orleans, members of the New Orleans Police Department (NOPD), ostensibly responding to a call from an officer under fire, shot and killed two civilians at the Danziger Bridge: 17-year-old James Brissette and 40-year-old Ronald Madison. Four other civilians were wounded. All the victims were African-American. None were armed or had committed any crime. Madison, a mentally disabled man, was shot in the back. The shootings caused public anger and further eroded the trust New Orleans had in the federal response to Hurricane Katrina and the NOPD.[2]\nThe NOPD attempted to cover-up the killings, falsely reporting that seven police officers responded to a police dispatch reporting an officer down, and that at least four suspects were firing weapons at the officers upon their arrival.[3] Rev. Raymond Brown, the local head of the National Action Network, described the shootings as \"...a racial tragedy.\"[4]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "38": {
        "link": "/wiki/John_Cecil_Jones",
        "title": "John Cecil Jones",
        "date": "(1946-08-08) August 8, 1946Webster Parish, Louisiana",
        "year": "1946",
        "location": "",
        "state": "Louisiana",
        "place": "Parish",
        "county": "St. Landry Parish",
        "paragraph": "John Cecil Jones (1915-1946) was an honorably-discharged World War II corporal and veteran who was tortured and lynched near Minden, in Webster Parish, Louisiana by a mob in 1946. His 17-year-old cousin Albert Harris, Jr. was tortured and left for dead alongside Jones. This was the only known post-World War II lynching to occur in Louisiana, and it involved multiple well-known local individuals, politicians, and a cover-up by multiple law enforcement entities.[1]\nOn the night of July 30, 1946, a pregnant woman complained to her husband that she had been startled by a prowler in their yard. The next day, the husband looked around his yard and found that a window screen had been tampered with, along with some grass and a portion of the fence that surrounded the yard. He looked to the neighboring house and saw Albert Harris, Jr. holding a stick and sitting on the front porch. The husband talked to his father, and ultimately two civilians and two Webster Parish Sheriff's Deputies went to the Harris house and arrested Albert, Jr. He was held in jail for a few days without charge and released by Webster Parish Deputy Sheriff O.H. Haynes, Jr. in Dixie Inn to a mob. The mob took Albert, Jr. to a field in rural Webster Parish, tied him upside down to a pipe, covered his head, and at gunpoint, they forced him by way of multiple beatings to implicate his cousin (Jones) as an accomplice in the alleged prowling. After Albert, Jr. was released by the mob, his parents sent him out of the state. On August 3, 1946, two deputies, including Haynes, went to the Harris' house to procure Albert, Jr. One of the deputies smashed Albert Harris, Sr.'s jaw and told him to bring Albert, Jr. back into custody. Albert, Jr. was returned to the sheriff's custody August 4. Jones had been arrested on August 3 in connection with the matter. While both men were in jail, they were questioned by the husband's father and deputies. They were also beaten by deputies. They were held several days without charge.[2]\nOn the night of August 8, 1946, both men were released by Deputy Sheriff O.H. Haynes, Jr. to a mob in front of the jail. Almost immediately upon release, Jones understood what was happening and began to protest, but he was hit over the head with the butt of a gun, knocking him unconscious and limp. He had to be carried under the arms and loaded into one of the mob's two idling cars. They were driven outside of Minden to a private pond, where they were tortured and mutilated with clubs, sticks, strops, and a blowtorch. Despite the violence, Albert, Jr. had not been done in, and he awoke to the cries and moans of his cousin. Jones asked Albert to get him some water, and to take care of his German pistol that he had brought back from Germany. Jones died in Albert's arms after about 5 minutes. Albert walked for miles into Minden, hiding from passing cars. When stopped by a Minden Police car, the officers obviously had been apprised of what had happened because they asked him where the \"other boy was.\" Albert went to a family member's house in Minden, and ultimately escaped to Chicago and then Detroit.[3]\n",
        "type": [
            "torture",
            "murder",
            "lynching"
        ]
    },
    "39": {
        "link": "/wiki/Killing_of_Yoshihiro_Hattori",
        "title": "Killing of Yoshihiro Hattori",
        "date": "October 17, 1992; 30 years ago (1992-10-17)",
        "year": "1992",
        "location": "Baton Rouge, Louisiana, U.S.",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nYoshihiro Hattori (服部 剛丈, Hattori Yoshihiro, November 22, 1975 – October 17, 1992, often referred to as Yoshi Hattori[4]) was a Japanese student on an exchange program to the United States who was shot to death in Baton Rouge, Louisiana. The shooting happened when Hattori, on his way to a Halloween party, went to the wrong house by mistake. Property owner Rodney Peairs (/piːrz/)[5] fatally shot Hattori, thinking that he was trespassing with criminal intent. The killing and Peairs' acquittal received worldwide attention.\nYoshihiro Hattori was born in Nagoya, Aichi Prefecture, Japan, the second of the three children of Masaichi Hattori, an engineer, and his wife Mieko Hattori.[6] He was 16 years old when he went to Baton Rouge, Louisiana, United States, in August 1992 as part of the American Field Service (AFS) student exchange program; he had also received a scholarship from the Morita Foundation for his trip. Hattori was hosted as a homestay student in Baton Rouge by Richard and Holley Haymaker (a college professor and a physician, respectively) and their teenage son, Webb.[7]\n",
        "type": [
            "murder",
            "shooting",
            "killing"
        ]
    },
    "40": {
        "link": "/wiki/Grabow_riot",
        "title": "Grabow riot",
        "date": "July 7, 1912",
        "year": "1912",
        "location": "Grabow, Louisiana",
        "state": "Louisiana",
        "place": "Grabow",
        "county": "Beauregard Parish",
        "paragraph": "The Grabow riot or Grabow massacre was a violent confrontation that took place between private police hired by management and labor factions in the timber industry near Grabow (Graybow), Louisiana, on July 7, 1912. The clash left three union workers and a company security employee dead, including union leader Asbury Decatur (\"Kate\") Hall, and an estimated fifty wounded. It was a crucial event in attempts to organize locals and unionize sawmill workers in Louisiana and east Texas in a series of events known as the Louisiana-Texas Lumber War of 1911-1912.\nThere had been unrest for years in western Louisiana and eastern Texas as workers tried to organize to gain better conditions in the industry. At Grabow the main factions involved were the Galloway Lumber Company and a party of striking unionized mill workers and their supporters. The union workers were known as the Brotherhood of Timber Workers (BTW),[1] a branch of the Lumber Workers Industrial Union (LWIU), which was affiliated with the Industrial Workers of the World (IWW). The Brotherhood tried to recruit mill workers by giving speeches and conducting meetings at various mills. Although they had limited success in Louisiana, the LWIU became very successful from 1917 to 1924. \nIn October 1940, Congress passed the Wages and Hours Act (later the Fair Labor Standards Act); this was upheld by the United States Supreme Court on February 3, 1941.\n",
        "type": [
            "riot"
        ]
    },
    "41": {
        "link": "/wiki/Opelousas_massacre",
        "title": "Opelousas massacre",
        "date": "September 28, 1868",
        "year": "1868",
        "location": "Opelousas, LouisianaCoordinates: 30°31′37″N 92°05′10″W﻿ / ﻿30.527°N 92.086°W﻿ / 30.527; -92.086",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nJohn Williams, James R. Dickson, Sebastian May\nEmerson Bentley\n",
        "type": [
            "riot"
        ]
    },
    "42": {
        "link": "/wiki/UpStairs_Lounge_arson_attack",
        "title": "UpStairs Lounge arson attack",
        "date": "June 24, 1973 7:56–8:12 p.m.",
        "year": "1973",
        "location": "604 Iberville Street, New Orleans, Louisiana, United States[1]",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nThe UpStairs Lounge arson attack occurred on June 24, 1973 at a gay bar called the UpStairs (or Up Stairs) Lounge located on the second floor of the three-story building at 604 Iberville Street in New Orleans, Louisiana, in the United States.[2] Thirty-two people died and at least fifteen were injured as a result of fire or smoke inhalation.[3] The official cause is still listed as \"undetermined origin\".[4] The primary suspect, a gay man with a history of psychiatric impairment named Roger Dale Nunez who had been ejected from the bar earlier in the day, was never charged and took his own life in November 1974.[5][6][7] No evidence has ever been found that the arson was motivated by hatred or overt homophobia.[7]\nUntil the 2016 Orlando nightclub shooting, in which 49 people were murdered, the UpStairs Lounge arson attack was the deadliest attack on a gay club in U.S. history. \n",
        "type": [
            "arson",
            "murder",
            "shooting"
        ]
    },
    "43": {
        "link": "/wiki/Wilbert_Rideau",
        "title": "Wilbert Rideau",
        "date": "1961",
        "year": "1961",
        "location": "",
        "state": "Louisiana",
        "place": "Lake Charles",
        "county": "Calcasieu Parish",
        "paragraph": "Wilbert Rideau (born February 13, 1942) is an American convicted killer and former death row inmate from Lake Charles, Louisiana, who became an author and award-winning journalist while held for 44 years at Angola Prison. Rideau was convicted in 1961 of first-degree murder of Julia Ferguson in the course of a bank robbery that year, and sentenced to death. He was held in solitary confinement on death row, pending execution. After the Supreme Court of the United States ruled that states had to rework their death penalty statutes because of constitutional concerns, the Louisiana Court judicially amended his sentence in 1972 to life in prison.\nDuring his 12 years on death row, Rideau had begun to educate himself, by reading numerous books. After being returned to the general prison population, from 1975 Rideau served for more than 20 years as editor of The Angolite, the magazine written and published by prisoners at Louisiana State Prison (Angola); he was the first African-American editor of any prison newspaper in the United States. Under his leadership, the magazine won the George Polk Award and Robert F. Kennedy Journalism Award for its reporting, and it was nominated for others.\nRideau appealed his case four times. The Supreme Court of the United States and lower courts ordered a total of three new trials; SCOTUS overturned his conviction and ordered a new trial because of adverse pre-trial publicity. He was convicted again of murder two more times, in 1964 and 1970, each time by all-male, all-white juries.[1] He served more than 40 years in the State Penitentiary; parole was never approved. In 2005 Rideau was tried a fourth time. He was unanimously convicted by the jury of the lesser charge of manslaughter; they did not believe he had planned the killing. Rideau was sentenced to the maximum of 21 years; as he had already served nearly 44 years, he was freed.\n",
        "type": [
            "robber",
            "murder",
            "robbery",
            "killing"
        ]
    },
    "44": {
        "link": "/wiki/Sadie_Roberts-Joseph",
        "title": "Sadie Roberts-Joseph",
        "date": "July 12, 2019 (aged 75)",
        "year": "2019",
        "location": "",
        "state": "Louisiana",
        "place": "Woodville",
        "county": "Lincoln Parish",
        "paragraph": "Sadie Roberts-Joseph (1944 – July 12, 2019) was an American community activist and founder of the Baton Rouge Odell S. Williams Now & Then Museum of African-American History in 2001.[1] She was also the founder of a non-profit organization, Community Against Drugs and Violence (CADAV).[2] She organized the annual \"Juneteenth Celebration\" which commemorates the emancipation of slaves in the Southern United States.[3] She helped organize an annual Veterans Day celebration at the Port Hudson National Cemetery to honor veterans of all races who fought in the Civil War.[4]\nRoberts-Joseph was born in 1944 and grew up in Woodville, Mississippi. She was the fifth in a family of twelve children, and her parents were sharecroppers.[5] The family later moved to Baton Rouge, Louisiana. She attended Baton Rouge Vocational-Technical School and Southern University, studying education and speech pathology. She was an active volunteer in the local black community, and worked for many years as a certified respiratory therapy technician.[4]\nHer brother serves as pastor of the New St. Luke Baptist church in Baton Rouge. She had two children, a son, Jason Roberts, now curator of the Baton Rouge African American museum,and a daughter: Angela Roberts Machen, a commissioner on the Greater Baton Rouge Port Commission.[4][6]\n",
        "type": [
            "murder"
        ]
    },
    "45": {
        "link": "/wiki/G-Slimm",
        "title": "G-Slimm",
        "date": "October 13, 1996(1996-10-13) (aged 21) New Orleans, Louisiana, United States",
        "year": "1996",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Kenneth Jackson Jr. (February 17, 1975 – October 13, 1996), stage name G-Slimm, was a gangsta rapper from New Orleans, Louisiana. His debut album Fours Deuces & Trays was released in 1994 on New Orleans independent rap label Big Boy Records and was produced by Leroy \"Precise\" Edwards. Fours Deuces & Trays was a huge success and he was on the verge of signing a major deal with Relativity Records in 1995-1997. He was shot and killed in a triple shooting in 1996, before he could sign to Relativity.[1]\nBorn Kenneth Jackson Jr. in 1975, he was raised in the Christopher Homes area which is located in the  Algiers neighborhood of New Orleans. As a teenager he began rapping and was discovered by Charles \"Big Boy\" Temple in 1992. He was signed the next year to Big Boy Records along with Mystikal, Black Menace and Partners-N-Crime. Jackson dropped k from his name adopting the G and began doing features as G-Slimm. His debut album Fours Deuces & Trays was released on September 3, 1994, and featured, Mystikal who also made his debut on the album. Leroy \"Precise\" Edwards produced the tracks on the album, giving it a West Coast southern feel.[2] The album sold well over 200,000 copies the first month, becoming the most acclaimed local rap albums of 1994.[3][4][5] Due to the identical track layout format, it was often compared with Dr. Dre.'s The Chronic album. It was the first album produced in New Orleans to have a California G-Funk sound, relevant to G-Funk area of the mid 1990s. The following year Jackson was offered a deal by Relativity Records. While working on his sophomore album titled G-Slimm for Relativity, he was murdered before it hit the stores. His last feature was with close friend rapper Tim Smooth on his album \"Da Franchise.\" Da Franchise was released in 1998 two years after his death.[6] G-Slimm's vocals was also featured on Big Boy's 1997 compilation album \"We G's\".[7]\nOn October 13, 1996, Jackson and three other men were walking from the Christopher Homes Housing Development on Murl Street when unknown gunmen fired shots at them at 1:30 pm. All three men were hit including G-Slimm who shot once in the back. Jackson was later pronounced dead at 2:14 pm at Charity Hospital.[8][9][10]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "46": {
        "link": "/wiki/Abduction_of_Jody_Plauch%C3%A9",
        "title": "Gary Plauché",
        "date": "October 23, 2014(2014-10-23) (aged 68) Baton Rouge, Louisiana, U.S.",
        "year": "2014",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nLeon Gary Plauché (November 10, 1945 – October 23, 2014) was an American man known for publicly killing Jeff Doucet, who had kidnapped, raped, and molested Plauché's prepubescent son, Jody. The killing occurred on Friday, March 16, 1984, and was captured on camera by a local news crew. For the fatal shooting, Plauché was given a seven-year suspended sentence with five years' probation and 300 hours of community service and received no prison time. The case received wide publicity because some people questioned whether Plauché should have been charged with murder or let off. Plauché contended that he was in the right, and that anyone in a similar position would have taken the same action.[1]\nGary Plauché lived in Baton Rouge, Louisiana. He was separated from his wife, June, at the time of the shooting. During 1983 and 1984, his 11-year-old son, Jody Plauché, was taking karate lessons with an instructor, 25-year-old Jeffrey Doucet, who had been sexually abusing the boy for at least a year. In February 1984, Doucet kidnapped Jody and took him to a motel in Anaheim, California, where he sexually assaulted and molested him. Police searched the country for Jody, and he was eventually found after Doucet allowed the boy to place a collect call to his mother from the motel.[2] California police raided the motel and arrested Doucet without incident.[3]\n",
        "type": [
            "killing",
            "kidnapped",
            "rape",
            "assault",
            "murder",
            "shooting"
        ]
    },
    "47": {
        "link": "/wiki/Know-Nothing_Riot",
        "title": "Know-Nothing Riot",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Philadelphia",
        "county": "Ascension Parish",
        "paragraph": "The term Know-Nothing Riot has been used to refer to a number of political uprisings of the Nativist American Know Nothing Party in the United States of America during the mid-19th century. These anti-immigrant and anti-Catholic protests culminated into riots in Philadelphia in 1844, St. Louis in 1854, Cincinnati and Louisville in 1855, Baltimore in 1856, Washington, D.C. and New York in 1857, and New Orleans in 1858.\nThe Election Day Riots of 1855 occurred in Cincinnati between April 2-7, 1855. The election was between James J. Faran, the Democratic contender and editor of the Cincinnati Enquirer, and James D. Taylor, rabid nativist editor of the Cincinnati Times. Rumors of illegal voting, ballot-box stuffing, and naturalized voters preventing native-born citizens from voting sparked the events. [1]\nSee Bloody Monday.\n",
        "type": [
            "riot"
        ]
    },
    "48": {
        "link": "/wiki/Mary_S._Sherman",
        "title": "Mary S. Sherman",
        "date": "July 21, 1964(1964-07-21) (aged 51) New Orleans, Louisiana, U.S.",
        "year": "1964",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Northwestern University\nMary Stults Sherman (April 21, 1913 – July 21, 1964) was an American orthopedic surgeon and  cancer researcher in New Orleans, Louisiana.\nOn July 21, 1964, Sherman was found dead in her apartment on St. Charles Avenue in New Orleans.[1] The body had stab wounds and burns from a fire.[1] The police report classified the death as a murder. An autopsy was performed by Monroe S. Samuels, M.D., on July 21, 1964. The autopsy report classified Sherman's death as a homicide.[2] Dr. Samuels determined that Sherman died of a stab wound in her heart. Most of the right side of her upper torso, including her right arm had been incinerated.[3] Sherman's murder remains unsolved.[4]\n",
        "type": [
            "murder"
        ]
    },
    "49": {
        "link": "/wiki/Tommy_Blake_(musician)",
        "title": "Tommy Blake (musician)",
        "date": "December 24, 1985(1985-12-24) (aged 54) Haughton, Louisiana",
        "year": "1985",
        "location": "",
        "state": "Louisiana",
        "place": "Haughton",
        "county": "Bossier Parish",
        "paragraph": "\nTommy Blake (born Thomas LeVan Givens, September 14, 1931 – December 24, 1985) was an American rockabilly singer and songwriter active in the 1950s to the 1970s. Regarded as a skilled writer, Blake penned several songs that were later recorded by rock and country music artists, including Johnny Horton, George Jones, and Johnny Cash among others. He also achieved modest success as a recording artist for Sun Records, but failed to record a national hit himself, a fact that frustrated Blake later in his life. Retrospectively, he has received praise for his contributions to rockabilly and was inducted in the Rockabilly Hall of Fame.\nBlake was born Thomas LeVan Givens in Dallas, Texas in 1931. He never knew his father nor did he develop a healthy relationship with his mother. His troubles continued into his teen years when Blake was imprisoned on statutory rape charges.[1] In 1951, he joined the United States Marine Corps. During his service, he lost an eye, either, as Blake claimed, while on tour in Korea or more likely during boot camp. While in the Marine Corps, Blake nurtured his ambitions of being a professional musician by frequently singing and playing on the guitar for enlisted men before his discharge.[2]\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "50": {
        "link": "/wiki/Leslie_Dale_Martin",
        "title": "Leslie Dale Martin",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Leslie Dale Martin (April 24, 1967 – May 10, 2002) was an American criminal. He was convicted and later executed by the state of Louisiana for the rape and murder of Christina Burgin.\nAbout 1:30 a.m. the next morning, after Roland and most of the victim's friends had left the lounge, the victim asked Martin for a ride home, and Martin agreed. No one ever saw the victim alive again.\nAbout 7:30 a.m., Martin visited Leo Guimbellot, his carpentry supervisor on a recent job, and stated he had met a blonde college student the night before, left the lounge with her and woke up on Galveston Beach not knowing where he was. Martin's clothes were dirty, and he pointed to vomit in his ashtray, stating, \"I guess the bitch threw up in my truck.\"\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "51": {
        "link": "/wiki/C._Edmund_Kells",
        "title": "C. Edmund Kells",
        "date": "May 7, 1928(1928-05-07) (aged 71) New Orleans",
        "year": "1928",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nClarence Edmund Kells Jr. (1856–1928) was an American dentist and inventor who is sometimes described as \"the father of dental radiography\". He practiced dentistry in New Orleans for 50 years and held about 30 patents for dental and electrical devices. He introduced a suction apparatus for use by both dentists and surgeons, took some of the earliest X-rays of the teeth of live patients, hired the first female dental assistant, and had one of the first dental offices with electricity. \nA graduate of the New York College of Dentistry, Kells joined his father's dental practice in 1878, and they worked together until his father died in 1896. In 1908, Kells moved his office to the Maison Blanche building. He wrote two books on dentistry and contributed three chapters to a popular dental textbook. He finished the manuscript for a third book on the conservation of teeth, but it was never published.  \n",
        "type": []
    },
    "52": {
        "link": "/wiki/Bonnie_and_Clyde",
        "title": "Bonnie and Clyde",
        "date": "May 23, 1934(1934-05-23) (aged 25) Bienville Parish, Louisiana, U.S.",
        "year": "1934",
        "location": "",
        "state": "Louisiana",
        "place": "Bienville Parish",
        "county": "Bienville Parish",
        "paragraph": "\nBonnie Elizabeth Parker (October 1, 1910 – May 23, 1934) and Clyde Chestnut (Champion) Barrow (March 24, 1909 – May 23, 1934) were an American criminal couple who traveled the Central United States with their gang during the Great Depression. The couple were known for their bank robberies, although they preferred to rob small stores or rural funeral homes. Their exploits captured the attention of the American press and its readership during what is occasionally referred to as the \"public enemy era\" between 1931 and 1934. They were ambushed by police and shot to death in Bienville Parish, Louisiana. They are believed to have murdered at least nine police officers and four civilians.[1][2]\nThe 1967 film Bonnie and Clyde, directed by Arthur Penn and starring Warren Beatty and Faye Dunaway in the title roles, revived interest in the criminals and glamorized them with a romantic aura.[3] The 2019 Netflix film The Highwaymen depicted their manhunt from the point of view of the pursuing lawmen, and received middling reviews.\n",
        "type": [
            "robber",
            "robberies",
            "murder"
        ]
    },
    "53": {
        "link": "/wiki/Bogalusa_sawmill_killings",
        "title": "Bogalusa sawmill killings",
        "date": "November 22, 1919",
        "year": "1919",
        "location": "Bogalusa, Louisiana, USA30°46′50″N 89°51′50″W﻿ / ﻿30.78056°N 89.86389°W﻿ / 30.78056; -89.86389Coordinates: 30°46′50″N 89°51′50″W﻿ / ﻿30.78056°N 89.86389°W﻿ / 30.78056; -89.86389",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Sol Dacus Lum William\nWilliam H. Sullivan\n\n",
        "type": [
            "killing"
        ]
    },
    "54": {
        "link": "/wiki/Nathaniel_Code",
        "title": "Nathaniel Code",
        "date": "",
        "year": "new 1984",
        "location": "",
        "state": "Louisiana",
        "place": "Shreveport",
        "county": "Caddo Parish",
        "paragraph": "Nathaniel Robert Code Jr. (born March 12, 1956), known as the Cedar Grove Killer,[1] is an American serial killer and rapist who stalked and murdered at least eight people in Shreveport, Louisiana between 1984 and 1987. He was sentenced to death for four of these killings and has been on death row in Louisiana for over 31 years, despite the wishes of his victims' family members for his execution.[2]\nNathaniel Robert Code Jr. was born on March 12, 1956. Six months after his birth, his parents divorced, and so his great aunt Josephine Code and his grandfather William T. Code raised him.[3]  As a child, Code, who was nicknamed Junior, was considered off by family members, noted for his tendencies to stop in the middle of a sentence and stare blankly into space for a while before continuing.[4] He was also alleged to have set fire to animals.[5] After failing ninth-grade, Code dropped out of high school.[6] He began living with his uncle Johnny Boyd shortly after.[7] In 1971, Code was shot four times by Boyd after an argument. Code was able to run four blocks down where he collapsed on the street, and soon after, two patrolmen found him. Code told them that Boyd, whom he knew as \"uncle Joe\", had done it. Boyd was later arrested.[8]\nIn July 1975, Code was charged with aggravated rape and burglary in connection with the assault of a 20-year-old woman on June 30.[9] He pleaded guilty to attempted aggravated rape in November 1975 and was sentenced to 15 years in prison.[6] While still incarcerated, in 1983, his birth mother died.[3] Code was released on good behavior in January 1984, and afterwards Code got a job at Fitzgerald's Contractors, but after a 1985 incident where he attacked a co-worker over what radio-station they would listen to, Code was fired.[6] On February 3, 1986, he married 27-year-old Vera Code.[10]\n",
        "type": [
            "killing",
            "mass murder",
            "burglary",
            "rape",
            "assault",
            "murder"
        ]
    },
    "55": {
        "link": "/wiki/Jim_Leslie_(journalist)",
        "title": "Jim Leslie (journalist)",
        "date": "July 9, 1976(1976-07-09) (aged 38) Baton Rouge, Louisiana, U.S.",
        "year": "1976",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "James S. Leslie (October 27, 1937 – July 9, 1976),[1] known as Jim Leslie, was a journalist for The Shreveport Times who became a public relations and advertising executive in Shreveport, Louisiana, United States. He is known for having been murdered in Baton Rouge on July 9, 1976, in a case described by the police as a \"professional hit.\" George W. D'Artois, the Public Safety Commissioner in Shreveport, was twice arrested in the case; the first time he was released for lack of evidence. He was arrested again on charges of first-degree murder in April 1977, suspected of contracting for the murder of Leslie, but died in June of that year during heart surgery. No one was tried in the case.\nLeslie had been hired by D'Artois in 1974 to manage communications in his re-election campaign; he had been in office since 1962. In the mid-1970s, D'Artois was the subject of an extended investigation by the Times. Leslie had told a friend earlier in 1976 that D'Artois had tried to pay him with city funds for his work on his 1974 campaign, and warned him against testifying before a grand jury. With a full-scale investigation of the commissioner underway, Leslie was called to testify to a grand jury about alleged corruption in D'Artois's department.\nJames S. Leslie, known as \"Jim\", was born in Shreveport, Louisiana, in 1937. He attended public schools before going to college. After graduation, he became involved in journalism and worked for The Shreveport Times for several years as a reporter. He developed a wide network among colleagues, and with people in city and state government. Leslie later went into public relations and ultimately became an advertising executive. He also became involved in political communications and conceived of a number of campaigns.\n",
        "type": [
            "murder"
        ]
    },
    "56": {
        "link": "/wiki/Shooting_of_Henry_Glover",
        "title": "Shooting of Henry Glover",
        "date": "September 2, 2005 (2005-09-02)",
        "year": "2005",
        "location": "New Orleans, Louisiana, United States",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Henry Glover was an African American resident of New Orleans, Louisiana, who was shot to death by New Orleans Police Department (NOPD) officer David Warren on September 2, 2005. Glover's charred body was later found in a destroyed Chevrolet Malibu parked on a Mississippi River levee.\nWarren was tried on federal charges relating to Glover's death, eventually resulting in an acquittal. Four other NOPD officers were charged in connection with events following Glover's death, including the burning of the body.\nHenry Glover had endured Hurricane Katrina in New Orleans along with his mother, brother, and sister.[1] On September 2, 2005, Glover had gone to a strip mall to retrieve some suitcases of loot.[2] NOPD Police Officer David Warren fatally shot Glover from a second-story balcony, from where Warren had been guarding a detective bureau office.[3]\n",
        "type": [
            "shooting"
        ]
    },
    "57": {
        "link": "/wiki/January_2019_Louisiana_shootings",
        "title": "January 2019 Louisiana shootings",
        "date": "January 26, 2019",
        "year": "2019",
        "location": "Ascension and Livingston parishes, Louisiana",
        "state": "Louisiana",
        "place": "Livingston Parish",
        "county": "Livingston Parish",
        "paragraph": "On January 26, 2019, a gunman shot and killed five people in Ascension and Livingston parishes, Louisiana, before being taken into custody in Virginia.\nA few weeks prior to the incident, Dakota Theriot was taken in by his girlfriend's family, after being kicked out by his own parents.[1] Investigators claim that Theriot, using a handgun he stole from his father,[2][3] killed three members of his girlfriend's family in Livingston Parish, before he stole a truck and drove to the neighboring county of Ascension and killed his parents.[4] The victims in Livingston Parish were Billy Ernest, aged 43, Summer Ernest, aged 20, and Tanner Ernest, aged 17; Elizabeth and Keith Theriot, both in their early fifties, were killed in Gonzales.[5] The neighbor of the Ernest family told reporters that the two surviving Ernest children; aged 7 and 1 years old, ran to her home to call 9-1-1 and were unharmed in the incident.[6] Police found both Elizabeth and Keith Theriot alive at their house after Keith called 911. Keith reportedly identified his son as the shooter. The couple later died at the hospital.[4]\nAfter a day-long manhunt, Theriot was arrested by the Virginia State Police in Richmond County, Virginia, approximately 1,000 miles (1,600 km) from the crime scene,[4][7] in the driveway of his grandmother's home in Warsaw.[8] He allegedly pointed the gun at the officers, trying to get them to fatally shoot him.[9][10] It was reported he had driven there to \"hug and kiss his two aunts and grandmother goodbye\" and did not fight extradition.[1]\n",
        "type": [
            "murder",
            "shooting",
            "riot",
            "mass shooting"
        ]
    },
    "58": {
        "link": "/wiki/Braxton_Hebert",
        "title": "Amy Hebert",
        "date": "August 20, 2007",
        "year": "2007",
        "location": "",
        "state": "Louisiana",
        "place": "Mathews",
        "county": "Lafourche Parish",
        "paragraph": "Amy T. Hebert[3] (née Talbot[4]) is a woman from Mathews, Louisiana, United States, who was convicted of murdering her two children in August 2007 in an act of revenge against her ex-husband; she also killed the family dog. Hebert was sentenced to life in prison without the possibility of parole.[5]\nAmy Hebert, originally from Larfourche Parish, Louisiana, worked as a teacher's aide at Lockport Lower Elementary School in Lockport.[6][7] In Hebert's criminal trial, experts summoned by the prosecution and the defense stated that Hebert had been severely depressed around the time she committed the crime.[8]\nHebert's husband, Chad Hebert, sought a divorce in 2005, which was finalized in April of the following year.[4] Chad subsequently entered into a relationship with another woman, whom he married in 2008.[1]\n",
        "type": [
            "murder"
        ]
    },
    "59": {
        "link": "/wiki/Execution_of_Antonio_James",
        "title": "Execution of Antonio James",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Antonio G. James (c. 1954 – March 1, 1996) was an American murderer. He was tried and executed in Louisiana for the murder of Henry Silver. James claims to have not been the murderer in the event and held that conviction to his death. This case is notable not for any unusual or intrinsic aspect, but for being one of the few such cases that ever comes to the attention of the general public.\nLike the case of Edward Earl Johnson whose last days on death row in Mississippi were filmed for the BBC in 1987 as Fourteen Days in May, this case came to light precisely because it was so ordinary, and was seen to be so. To some it demonstrated the need for capital punishment to protect the public from such dangerous people. To others it demonstrated the inhumanity of death row. Whatever conclusions were reached, this case remains one of the few such cases in the public domain that does not involve a celebrity perpetrator or victim, and so reminds all concerned of nature of most capital cases in the United States.[1]\nJames had amassed a very extensive juvenile and criminal record by the time he was tried for the murder of Silver. The post-sentence investigation report prepared for the sentencing court listed 37 juvenile incidents. James was ordered confined to the Louisiana Training Institute at age 14. In 1973, he was convicted of attempted armed robbery and sentenced to serve three years at the state penitentiary. During this period of confinement, he was convicted of attempted simple escape. He was released in 1975. In 1978, he was charged with aggravated rape, but the charge was later refused by the prosecution. James was convicted of the January 23, 1979, first degree murder of Alvin Adams and was sentenced to life imprisonment. He was convicted of the January 26, 1979, armed robbery of Robert Hooten and was sentenced to 99 years for this offense, the maximum under Louisiana law.[citation needed]\n",
        "type": [
            "robber",
            "murder",
            "robbery",
            "rape"
        ]
    },
    "60": {
        "link": "/wiki/Jena_High_School",
        "title": "Jena High School",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Jena",
        "county": "La Salle Parish",
        "paragraph": "Jena High School is a secondary school located in Jena, Louisiana, United States. The school, serving grades 9 through 12, is a part of the LaSalle Parish School Board. As of 2006–2007, the school enrollment was 538 students.\nThe school serves the town of Jena and the unincorporated communities of Belah, Nebo, and Rhinehart.\nThe high school reflects the population of the town and about 10% of its students are African Americans. At times there have been tensions between different groups of students, including some groups divided by race. Beginning September 1, 2006, several incidents in the area occurred which some observers thought were all related to racial tensions. Law enforcement investigations by parish and federal prosecutors did not support that conclusion for each incident.\n",
        "type": []
    },
    "61": {
        "link": "/wiki/Toni_Jo_Henry",
        "title": "Toni Jo Henry",
        "date": "November 28, 1942(1942-11-28) (aged 26) Lake Charles Calcasieu, Louisiana",
        "year": "1942",
        "location": "",
        "state": "Louisiana",
        "place": "Shreveport",
        "county": "Caddo Parish",
        "paragraph": "\nToni Jo Henry  (née Annie Beatrice McQuiston;[1] January 3, 1916 – November 28, 1942) was the only woman ever to be executed in Louisiana's electric chair.[2] Married to Claude 'Cowboy' Henry, she decided to break her husband out of jail where he was serving a fifty-year sentence in the Texas State Penitentiary for murder. Together with Harold Burks, she took a ride with Joseph P. Calloway, whom they then robbed and murdered. Toni Jo Henry was convicted and sentenced to death. After three trials,[3] she was executed by electrocution on November 28, 1942. Her case generated several popular books and films including A Savage Wisdom and Stone Justice.\nHenry was born Annie Beatrice McQuiston in Shreveport, Louisiana on January 3, 1916, the third of five children. She lived with her grandmother for a while, while her mother was ill. Her mother died of tuberculosis when Henry was six years of age. After her mother died she lived with her father and stepmother, although always wanted to return to living with her grandmother.[2]\n",
        "type": [
            "murder"
        ]
    },
    "62": {
        "link": "/wiki/Kirksey_Nix",
        "title": "Kirksey Nix",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Kirksey McCord Nix Jr.  (born 1943) is the former leader of the Dixie Mafia.[1][2]\nHe was a suspect in the assassination attempt on Sheriff Buford Pusser and in the death of Buford's wife on August 12, 1967. Nix has repeatedly refused to comment about Pusser's claims that he was one of his wife's killers.[1]\nIn 1972, Nix was convicted of murdering Frank Corso, a New Orleans grocery executive, in a break-in at Corso's home, and began serving a life sentence without parole.[1][2]\n",
        "type": [
            "murder"
        ]
    },
    "63": {
        "link": "/wiki/Clementine_Barnabet",
        "title": "Clementine Barnabet",
        "date": "Unknown",
        "year": "new 1911",
        "location": "",
        "state": "Louisiana",
        "place": "St. Martinville",
        "county": "Saint Martin Parish",
        "paragraph": "Clementine Barnabet (born c. 1894) was an accused American serial killer who was convicted of killing one person and confessed to have killed as many as 35. However, doubt has since been cast on her involvement.[1]\nClementine Barnabet is believed to have been born around 1894 in St. Martinville, Louisiana, to Nina Porter and Raymond Barnabet. She had three brothers, one of them named Zepherin. Barnabet's father reportedly abused his family. They moved to Lafayette in 1909.[2]\nProfessor Vance McLaughlin[1] wrote: \"Between 1911 and 1912, in towns along the Southern Pacific railroad line running through Louisiana and Texas, a minimum of twelve African-American families were murdered in their homes. All the murders occurred at night and an axe was used to fracture the skulls of the victims. Only one person, Clementine Barnabet, was ever punished for any of these homicides.\"\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "64": {
        "link": "/wiki/Jeff_Davis_8",
        "title": "Jeff Davis 8",
        "date": "",
        "year": "new 2005",
        "location": "",
        "state": "Louisiana",
        "place": "Jefferson Davis Parish",
        "county": "Jefferson Davis Parish",
        "paragraph": "The Jeff Davis 8, sometimes called the Jennings 8, refers to a series of unsolved murders in Jefferson Davis Parish, Louisiana.[1][2] Between 2005 and 2009, the bodies of eight women were found in swamps and canals surrounding Jennings, Louisiana. Most of the bodies were found in such a state of decomposition as to make the actual cause of death difficult to determine.[1][2]\nAuthor and investigative reporter Ethan Brown has revealed how police investigations have been plagued by missteps in the sheriff's office, contributing to lost or missing evidence.[2] Brown's work has revealed that there are multiple suspects in the Jeff Davis 8 case and that therefore it is unlikely that this is a serial killer case; furthermore, Brown has revealed that law enforcement's own witnesses have named members of local law enforcement as suspects in the case.[2]\nThe first victim, Loretta Lewis, 28, was found floating in a river by a fisherman on May 20, 2005.[3][4] Other victims were Ernestine Marie Daniels Patterson, 30; Kristen Gary Lopez, 21; Whitnei Dubois, 26; Laconia \"Muggy\" Brown, 23; Crystal Shay Benoit Zeno, 24; and Brittney Gary, 17.[4] The final body of Necole Guilory, 26, was found off Interstate 10 in 2009.[5]\n",
        "type": [
            "murder"
        ]
    },
    "65": {
        "link": "/wiki/Lowenfield_v._Phelps",
        "title": "Lowenfield v. Phelps",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Lowenfield v. Phelps, 484 U.S. 231 (1988), is a United States Supreme Court case in which the Court held that the two jury polls and the supplemental charge did not impermissibly coerce the jury to return a death sentence, and that the death sentence does not violate the Eighth Amendment simply because the single statutory \"aggravating circumstance\" found by the jury duplicates an element of the underlying offense of first-degree murder.\nIn 1984, Leslie Lowenfield, a Guyanese immigrant welder, was convicted of the 1982 killing of his girlfriend, a sheriff's deputy, and four members of her family, including a 4-year-old girl.[1]\nThe court, in an opinion by Chief Justice Rehnquist, held that the trial judge's polling of the jury and supplemental Allen instruction did not coerce the jury to return a verdict of guilty. The Court also rejected a challenge that Louisiana's death penalty statute did not sufficiently narrow the category of defendants who are eligible for the death penalty. The aggravating circumstance in the case, intentionally killing more than one person was found by the jury in the guilt phase after returning 3 first degree murder verdicts.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "66": {
        "link": "/wiki/Pat_Patterson_(coach)",
        "title": "Pat Patterson (coach)",
        "date": "October 11, 2007(2007-10-11) (aged 73) Ruston, Lincoln Parish Louisiana",
        "year": "2007",
        "location": "",
        "state": "Louisiana",
        "place": "Delhi",
        "county": "Richland Parish",
        "paragraph": "James E. \"Gravy\" Patterson, also known as Pat Patterson, (March 26, 1934[1] – October 11, 2007) was head baseball coach at Louisiana Tech University, in Ruston, from 1968 to 1990 and compiled a 741-462-2 record. Patterson produced eighteen winning seasons in twenty-three years, and his teams won forty or more games in five of those years. He was Conference Coach of the Year seven times. \nIn retirement, he often returned as an interim coach. Seven of Patterson's players, including Mike Jeffcoat, Phil Hiatt, and David Segui, reached the majors.[2] Patterson also coached high school baseball and college football. He should not be confused with the wrestler Pierre Clemont, who used the name \"Pat Patterson\" as his ring name.\nPatterson was born in Delhi in Richland Parish in northeastern Louisiana. He graduated from Louisiana Tech in 1958, playing football and baseball under legendary Bulldog coaches Joe Aillet and Berry Hinton. He earned four football letters and two baseball letters and went on to earn his master’s degree from the University of Mississippi (\"Ole Miss\") in 1961. \n",
        "type": []
    },
    "67": {
        "link": "/wiki/Clyde_Vidrine",
        "title": "Clyde Vidrine",
        "date": "",
        "year": "new 1986",
        "location": "",
        "state": "Louisiana",
        "place": "Caddo",
        "county": "Caddo Parish",
        "paragraph": "\nClyde C. Vidrine (1938 – December 16, 1986) was a bodyguard for four-term Louisiana Governor Edwin Edwards. He became famous for making accusations about the governor's elaborate Las Vegas trips and alleged infidelity to Edwards' wife Elaine Edwards. Vidrine, who had already been fired by Edwards, was murdered during Edwards' third term as governor.[1]\nVidrine was shot and killed in broad daylight on the steps of the Caddo Parish court house in downtown Shreveport on December 16, 1986. At the time Vidrine was serving as bodyguard for a woman who had recently separated from her husband, James Cummings. Cummings believed Vidrine and his wife were having an adulterous affair. Cummings stated that only he (James Cummings) was at the federal court house (not the parish court house) because of a bankruptcy hearing where he and his estranged wife were to appear. Cummings stated that Vidrine had threatened him in the past and had reached for a gun when Cummings shot him. A report, that he was waiting across the street in his car for his wife and Vidrine to arrive, contradicted James Cummings' version of what happened.[2] When Clyde Vidrine and Kathy Cummings arrived, James Cummings opened fire three times with a 12-gauge shotgun, killing Clyde Vidrine but leaving Kathy Cummings untouched.[3]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "68": {
        "link": "/wiki/Killing_of_Alton_Sterling",
        "title": "Killing of Alton Sterling",
        "date": "July 5, 2016 (2016-07-05)",
        "year": "2016",
        "location": "2112 North Foster Drive, Baton Rouge, Louisiana",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nOn July 5, 2016, Alton Sterling, a 37-year-old black man, was shot and killed by two Baton Rouge Police Department officers in Baton Rouge, Louisiana. The officers, who were attempting to control Sterling's arms, shot Sterling while Sterling allegedly reached for the loaded handgun in his pants pocket.[5] Police were responding to a report that Sterling was selling CDs and that he had used a gun to threaten a man outside a convenience store.[6] The owner of the store where the shooting occurred said that Sterling was \"not the one causing trouble\" during the situation that led to the police being called.[7][8]\nThe shooting was recorded by multiple bystanders.\nThe shooting led to protests in Baton Rouge and a request for a civil rights investigation by the U.S. Department of Justice. In May 2017 they decided not to file criminal charges against the police officers involved. In response, Louisiana's attorney general, Jeff Landry, said the state of Louisiana would open an investigation into the shooting once the Department of Justice released the physical evidence. In March 2018, Landry's office announced it would not bring charges against the officers[9] stating that they acted in a \"reasonable and justifiable manner\".[2]\n",
        "type": [
            "shooting",
            "killing"
        ]
    },
    "69": {
        "link": "/wiki/Young_Greatness",
        "title": "Young Greatness",
        "date": "October 29, 2018(2018-10-29) (aged 34) New Orleans, Louisiana, U.S.",
        "year": "2018",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nTheodore Joseph Jones III (September 19, 1984 – October 29, 2018),[1] better known by his stage name Young Greatness, was an American rapper. He was best known for his 2015 single \"Moolah\",[2] which peaked at number 85 on the Billboard Hot 100 chart.[3]  He was shot and killed in October 2018.[2]\nJones was born on September 19, 1984, in New Orleans, Louisiana. He moved to Houston after Hurricane Katrina.[4] He grew up listening to Juvenile, Jay-Z and Biggie Smalls.[5]\n",
        "type": []
    },
    "70": {
        "link": "/wiki/John_McDonogh_High_School_shooting",
        "title": "John McDonogh High School shooting",
        "date": "April 14, 2003 approximately 10:30 a.m. (CDT)",
        "year": "2003",
        "location": "New Orleans, Louisiana, United States",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "The John McDonogh High School shooting was a school shooting that occurred on April 14, 2003 at John McDonogh High School[1] in the Mid-City neighborhood of New Orleans, Louisiana, United States.[2] Two men shot and killed 15-year-old student Jonathan \"Caveman\" Williams during a mid-morning gym class in a gang neighborhood retaliation killing.[3]\nAt 10:30 a.m. on April 14, 2003, two men armed with an AK-47 and a semi-automatic pistol entered the school property via gaps in the fence.[4] Immediately after students and faculty entered the school gymnasium, the two men shot at 15-year-old Jonathan \"Caveman\" Williams[5] at least 20 times. Three female students were wounded, and a pregnant senior was trampled by a stampede of students.[6][7] Jonathan Williams died at the scene and the two perpetrators immediately fled the school campus.[4] The injured recovered.[5]\nAfter the event, officers commanded by Jimmy Keen, a lieutenant with the New Orleans Police Department, attempted to interview witnesses at school and their houses. A TIME magazine news story described the event as having 150 witnesses. Keen said that the students responded to questions from the officers with \"shrugs and stares.\" Keen said that his sergeant stated he feels \"like the Marine Expeditionary Force in Iraq. The people in the neighborhoods don't want us here. They don't speak our language. They won't talk to us.'\"[8]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "71": {
        "link": "/wiki/Jimmy_L._Glass",
        "title": "Glass v. Louisiana",
        "date": "",
        "year": "new 1952",
        "location": "",
        "state": "Louisiana",
        "place": "Glass",
        "county": "Vernon Parish",
        "paragraph": "Glass v. Louisiana, 471 U.S. 1080 (1985), was a case denied for hearing by the United States Supreme Court in 1985. The case is famous for Justice Brennan's dissent from the denial of certiorari, joined by Justice Marshall, arguing that the death penalty is always unconstitutional.\nJimmy L. Glass (May 27, 1962 – June 12, 1987) was an American convicted murderer who was sentenced to death by the state of Louisiana.\nGlass originally hailed from Arkansas.[1] He was a high school dropout and had a criminal record.[2] With fellow inmate Jimmy C. Wingo (March 14, 1952 – June 16, 1987), Glass escaped from the Webster Parish, Louisiana Jail in December 1982 and, during their escape, they killed Newt Brown (born 1927) and his wife, Erlene Nealy Brown (born 1931), at their home on Christmas Eve in Dixie Inn outside Minden. The Browns' son, Gary Lamar Brown, was the son-in-law of Judge Charles A. Marvin (1929–2003) of the Louisiana Court of Appeal for the Second Circuit, based in Shreveport. Glass and Wingo were soon arrested. Both were sentenced to death in the electric chair.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "72": {
        "link": "/wiki/Elmo_Patrick_Sonnier",
        "title": "Elmo Patrick Sonnier",
        "date": "November 5, 1977",
        "year": "1977",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nElmo Patrick \"Pat\" Sonnier (February 21, 1950 – April 5, 1984) was a convicted American murderer and rapist in Louisiana who was executed by electrocution at Louisiana State Penitentiary in Louisiana on April 5, 1984.  Sonnier was sentenced to death on April 25, 1978, for the November 5, 1977, rape and murder of Loretta Ann Bourque, 18, and the murder of David LeBlanc, 17. His younger brother, Eddie, was sentenced to life in prison.\nSister Helen Prejean was asked to write to death row inmates as part of her Order's community outreach program and wrote to Sonnier. She became his spiritual adviser and eventually wrote Dead Man Walking (1993) about her experience and her belief that the death penalty was morally wrong.\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "73": {
        "link": "/wiki/Phillip_Kastel",
        "title": "Phillip Kastel",
        "date": "August 16, 1962New Orleans, Louisiana",
        "year": "1962",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Phillip \"Dandy Phil\" Kastel (April 2, 1893 – August 16, 1962) was a Jewish-American organized crime figure, gambler, and longtime associate of both the Genovese and New Orleans crime family.\nPhillip Frank Kastel was born to a Jewish family[1] on New York's Lower East Side to Solomon Kastel and Rachel Rosenthal on April 2, 1893. He was brother to Allen, Florence, Ida and Rose Kastel. He stood 5'7\" and weighed 165 pounds. He married Elsie Conner in 1940 but they later divorced and he married Margaret Dennis. Despite growing up in a violent neighborhood frequented by street gangs and others of the city's underworld, Kastel instead became involved in gambling and confidence games during the early 1900s and held interests in many of the city's gambling dens shortly before Prohibition.\nIn 1917, upon the United States entry into World War I, Kastel fled to Canada in order to avoid the draft and operated a nightclub in Montreal, Quebec, for the remainder of the war. Returning to New York in 1919, Kastel was quickly arrested for extortion, although the charges were dismissed. Finding employment with Arnold Rothstein, Kastel oversaw Rothstein's numerous bucket shops, an early telemarketing scam selling fraudulent securities. He also preyed upon local chorus girls, specifically being charged with stealing $22,000 from chorus girl Betty Brown in 1922; however this charge was dismissed.\n",
        "type": []
    },
    "74": {
        "link": "/wiki/Capital_punishment_in_Louisiana",
        "title": "Capital punishment in Louisiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nCapital punishment is a legal penalty in the U.S. state of Louisiana.\nDespite remaining a legal penalty, there have been no executions in Louisiana since 2010, and no involuntary executions since 2002. Execution protocols are tied up in litigation due to a 2012 lawsuit challenging Louisiana's lethal injection procedures. In addition, certain pharmaceutical companies and manufacturers do not want their products associated with capital punishment, meaning the state has been unable to obtain lethal injection drugs. Despite this, a 2018 survey by the Louisiana State University found that the majority of Louisianan citizens still support capital punishment.[1] The most recent execution was of Gerald Bordelon, who waived his appeals and asked to be executed in 2010. He is the only person to have been executed in Louisiana since 2002.[2]\n",
        "type": []
    },
    "75": {
        "link": "/wiki/Robert_Wayne_Williams",
        "title": "Robert Wayne Williams",
        "date": "January 5, 1979",
        "year": "1979",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Robert Wayne Williams (February 6, 1952 – December 14, 1983) was an American murderer convicted of the January 5, 1979, murder of Willie Kelly, a 67-year-old security guard. He was executed in 1983 by the state of Louisiana by electric chair.[1] He became the first person to be executed in Louisiana since 1976 when the death penalty was reinstated.[2]\nOn January 5, 1979, Williams and his accomplice, Ralph Holmes, entered the A & P Supermarket located at 3525 Perkins Road in Baton Rouge, Louisiana. Both men placed ski masks over their faces and Williams pulled out a 12-gauge sawed-off shotgun. They then approached the security guard, 67-year-old Willie Kelly, who was bagging groceries. Holmes tried to remove Kelly's pistol from his holster. As Kelly made a move with his hand toward his pistol, Williams yelled, \"Don't try it\", and immediately shot Kelly in the face at point-blank range. Williams and Holmes then proceeded to complete the robbery. During this process, Holmes pistol-whipped one of the customers, and Williams accidentally shot two people in their feet. The police received a telephone call from an informant implicating Holmes, Williams, and Williams' wife. Following their arrest, both Williams and his wife gave confessions, implicating themselves in the crime.[3]\nWilliams was convicted of first-degree murder and was sentenced to death by District Judge Frank Foil on May 30, 1979.[4] The jury recommended that Holmes receive a life term for his role in the crime.[5] Williams consistently maintained that the gun had gone off accidentally and that he had not intended to shoot Kelly.[6] However, he did not testify at his own trial.[7]\n",
        "type": [
            "robber",
            "murder",
            "robbery"
        ]
    },
    "76": {
        "link": "/wiki/Barry_Seal",
        "title": "Barry Seal",
        "date": "February 19, 1986(1986-02-19) (aged 46) Baton Rouge, Louisiana, U.S.",
        "year": "1986",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Adler Berriman \"Barry\" Seal (July 16, 1939 – February 19, 1986) was an American commercial airline pilot who became a major drug smuggler for the Medellín Cartel. When Seal was convicted of smuggling charges, he became an informant for the Drug Enforcement Administration and testified in several major drug trials. He was murdered on February 19, 1986 by contract killers hired by the cartel.\nBarry Seal was born in Baton Rouge, Louisiana, the son of Mary Lou (née Delcambre) and Benjamin Curtis Seal, a candy wholesaler. Seal began to fly as a teenager, earning a student pilot certificate at 16 and a private pilot's certificate at 17. His flight instructor described him as a naturally gifted pilot.[1]\nIn 1962, Seal enlisted in the Louisiana Army National Guard for six years: six months of active duty, followed by five and a half years of inactive duty. Seal's active duty began in July 1962. He was assigned to the 20th Special Forces Group and graduated from the United States Army Airborne School selection and training. His non-active duty was served in the 245th Engineer Battalion, where his MOS was radio telephone operator.[2]\n",
        "type": [
            "murder"
        ]
    },
    "77": {
        "link": "/wiki/Mark_Essex",
        "title": "Mark Essex",
        "date": "December 31, 1972, and January 7, 1973",
        "year": "1972",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Mark James Robert Essex (August 12, 1949[4] – January 7, 1973) was an American serial sniper and black nationalist known as the \"New Orleans Sniper\" who killed a total of nine people, including five policemen, and wounded twelve others in two separate attacks in New Orleans on December 31, 1972, and January 7, 1973. Essex was killed by police in the second armed confrontation.[2]\nEssex was a former member of a New York-based branch of the Black Panthers. He is strongly believed to have specifically sought to kill white people and police officers due to racism he had previously experienced while enlisted in the Navy. His increasingly extremist anti-police, black supremacist, and anti-white views are believed to have solidified following a November 1972 violent clash between Baton Rouge police officers and student civil rights demonstrators, during which two young black demonstrators were shot and killed.[5]\nMark James Robert Essex was born in Emporia, Kansas, the second of five children born to Mark Henry and Nellie (née Evans) Essex. He was raised in a close-knit and religious household. His father was a foreman in a meat-packing plant and his mother counseled preschool-age children in a program for disadvantaged children.[6]\n",
        "type": [
            "murder",
            "shooting",
            "mass shooting"
        ]
    },
    "78": {
        "link": "/wiki/Jones%E2%80%93Liddell_feud",
        "title": "Jones–Liddell feud",
        "date": "1847-1870",
        "year": "1847",
        "location": "The Black River, in Catahoula Parish, LouisianaCoordinates: 31°33′N 91°49′W﻿ / ﻿31.55°N 91.82°W﻿ / 31.55; -91.82",
        "state": "Louisiana",
        "place": "Catahoula Parish",
        "county": "Catahoula Parish",
        "paragraph": "St. John Richardson Liddell\nLt. Col. Charles Jones\nThe Jones–Liddell feud (1847-1870) also known as the Liddell–Jones feud or the Black River War was a warring dispute between two prominent families from Catahoula Parish, Louisiana. It resulted in the death of at least six people, with other estimates suggesting as many as fourteen.\n",
        "type": []
    },
    "79": {
        "link": "/wiki/Bill_Fincher_(baseball)",
        "title": "Bill Fincher (baseball)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Shreveport",
        "county": "Caddo Parish",
        "paragraph": "William Allen Fincher (May 26, 1894 – May 7, 1946) was a Major League Baseball pitcher who played for the St. Louis Browns in 1916.[1] In 1946, Fincher committed suicide with a pistol in Shreveport, Louisiana.[2]\n\nThis biographical article relating to an American baseball pitcher born in the 1890s is a stub. You can help Wikipedia by expanding it.",
        "type": []
    },
    "80": {
        "link": "/wiki/C._B._Forgotston",
        "title": "C. B. Forgotston",
        "date": "January 3, 2016(2016-01-03) (aged 70) Hammond, Louisiana, U.S.",
        "year": "2016",
        "location": "",
        "state": "Louisiana",
        "place": "Hammond",
        "county": "Tangipahoa Parish",
        "paragraph": "Charlton Bath Forgotston, Jr., known as C. B. Forgotston (January 19, 1945 – January 3, 2016), was an American attorney, political pundit and state government watchdog from Hammond in southeastern Louisiana. For seven years, he was the chief counsel of the Appropriations Committee of the Louisiana House of Representatives. Long afflicted with bipolar disorder,[1] Forgotston committed suicide by firearm early in 2016, around two weeks before his 71st birthday.[2]\nForgotston was born to Charlton Bath Forgotston (1913–1987) and Elsa de Vries (1918–2014) in Newellton, Louisiana.[citation needed] The senior Forgotston owned Newellton Electric Company and served for twenty years on the Newellton Town Council.[3][4][5]\nIn 2013, Forgotston opposed Bobby Jindal's proposal to end the Louisiana state income tax accompanied by an increase in sales taxes. At the time, Forgotston correctly predicted that Jindal's plan would fail to clear the legislature because of the higher sales taxes, the lack of needed Democratic support to offset Republican defectors, and the likelihood that the plan would not increase overall state revenues.[6] After Jindal subsequently withdrew the plan because of the lack of public and legislative support, the Louisiana Republican Party issued a personal attack on Forgotston.[7][8]\n",
        "type": []
    },
    "81": {
        "link": "/wiki/Alton_Sterling",
        "title": "Killing of Alton Sterling",
        "date": "July 5, 2016 (2016-07-05)",
        "year": "2016",
        "location": "2112 North Foster Drive, Baton Rouge, Louisiana",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nOn July 5, 2016, Alton Sterling, a 37-year-old black man, was shot and killed by two Baton Rouge Police Department officers in Baton Rouge, Louisiana. The officers, who were attempting to control Sterling's arms, shot Sterling while Sterling allegedly reached for the loaded handgun in his pants pocket.[5] Police were responding to a report that Sterling was selling CDs and that he had used a gun to threaten a man outside a convenience store.[6] The owner of the store where the shooting occurred said that Sterling was \"not the one causing trouble\" during the situation that led to the police being called.[7][8]\nThe shooting was recorded by multiple bystanders.\nThe shooting led to protests in Baton Rouge and a request for a civil rights investigation by the U.S. Department of Justice. In May 2017 they decided not to file criminal charges against the police officers involved. In response, Louisiana's attorney general, Jeff Landry, said the state of Louisiana would open an investigation into the shooting once the Department of Justice released the physical evidence. In March 2018, Landry's office announced it would not bring charges against the officers[9] stating that they acted in a \"reasonable and justifiable manner\".[2]\n",
        "type": [
            "shooting",
            "killing"
        ]
    },
    "82": {
        "link": "/wiki/Ronald_Dominique",
        "title": "Ronald Dominique",
        "date": "",
        "year": "new 1997",
        "location": "",
        "state": "Louisiana",
        "place": "Thibodaux",
        "county": "Lafourche Parish",
        "paragraph": "Ronald Joseph Dominique (born January 9, 1964), also known as the Bayou Strangler, is an American serial killer and rapist who murdered at least 23 men and boys in the state of Louisiana between 1997 and 2006. On September 23, 2008, Dominique was found guilty and sentenced to several terms of life imprisonment without parole for his crimes. Following his conviction, the Federal Bureau of Investigation (FBI) stated that Dominique's was the most significant serial homicide case in the country over the past two decades in terms of both death toll and duration.[1][2]\nDespite the number of victims, Dominique's arrest received little publicity outside of the state media.[3]\nRonald Joseph Dominique was born on January 9, 1964, in Thibodaux, Louisiana, the younger of two children. His parents were poor laborers who lived in a trailer park located on the outskirts of the city. Because of his family's financial circumstances, Dominique lived out his childhood and adolescence in poverty, but still managed to attend the local Thibodaux High School, from which he graduated in 1983. After leaving school, he entered the Nicholls State University, where he studied computer science. However, he quickly lost interest and dropped out in the mid-1980s.\n",
        "type": [
            "murder"
        ]
    },
    "83": {
        "link": "/wiki/Dobie_Gillis_Williams",
        "title": "Dobie Gillis Williams",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Dobie Gillis Williams (1961 – January 8, 1999) was an American criminal in Louisiana who was convicted of the murder of Sonja Knippers in 1984, and sentenced to death. He was executed in 1999. His case has been controversial.\nPolice contended that he confessed, although they had no recording. He was evaluated as intellectually disabled, according to one standard, but his defense attorney failed to discuss this or mitigating factors from his childhood. Williams' execution was twice stayed and his sentence was overturned by a federal district court judge. But Williams was executed because the 5th Circuit Court of Appeals ruled that mitigating information was introduced to the jury too late in the case. It ruled that the execution had to proceed, under the 1996 Antiterrorism and Effective Death Penalty Act (AEDPA).[1]\nIn 2005, Williams was one of two subjects of a book by Sister Helen Prejean, a Catholic nun and anti-death penalty activist. She contended that Williams could not have possibly committed the murder and was wrongfully convicted and executed. She believed that he had ineffective legal counsel; his lawyer was later disbarred for incompetence.[1] She also notes that poor and minority people are disproportionately sentenced to death and executed in the United States criminal justice system.\n",
        "type": [
            "terrorism",
            "murder"
        ]
    },
    "84": {
        "link": "/wiki/Gerald_Washington",
        "title": "Gerald Washington",
        "date": "",
        "year": "new 2006",
        "location": "",
        "state": "Louisiana",
        "place": "Westlake",
        "county": "Calcasieu Parish",
        "paragraph": "Gerald \"Wash\" Washington (c. 1949 – December 30, 2006) was a local politician and elected in 2006 as the first black mayor of Westlake, Louisiana, in the southwest part of the state. Having served three terms on the city council, he died of a single gunshot wound on December 30, 2006. He was scheduled to take office on January 2, 2007. The Calcasieu Parish coroner ruled that his death was a suicide, which the family rejected. A state police investigation also concluded he had committed suicide.\nWashington was a well-known and popular local political figure, having been elected and served three terms on the city council. He was a veteran of Vietnam and had a career with Conoco, retiring as a refinery supervisor.[1]\nElected in the fall of 2006 as the first black mayor in the city's history, Washington was scheduled to take office on January 2, 2007. The city is majority white, and more than 80% of those who voted for him were white.[1]\n",
        "type": [
            "new murder"
        ]
    },
    "85": {
        "link": "/wiki/Louisiana_State_Penitentiary",
        "title": "Louisiana State Penitentiary",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Angola",
        "county": "West Feliciana Parish",
        "paragraph": "\nThe Louisiana State Penitentiary (known as Angola, and nicknamed the \"Alcatraz of the South\", \"The Angola Plantation\" and \"The Farm\"[8]) is a maximum-security prison farm in Louisiana operated by the Louisiana Department of Public Safety & Corrections.  It is named \"Angola\" after the former slave plantation that occupied this territory. The plantation was named after the country of Angola from which many slaves originated before arriving in Louisiana.[9]\nAngola is the largest maximum-security prison in the United States[10] with 6,300 prisoners and 1,800 staff, including corrections officers, janitors, maintenance, and wardens. Due to these large numbers, it has been given the nickname \"a gated community\". Located in West Feliciana Parish, the prison is set between oxbow lakes on the east side of a bend of the Mississippi River, thus flanked on three sides by water.  It lies less than two miles (three kilometers) south of Louisiana's straight east-west border with Mississippi.\n",
        "type": []
    },
    "86": {
        "link": "/wiki/Gerald_Bordelon",
        "title": "Gerald Bordelon",
        "date": "November 15, 2002",
        "year": "2002",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Gerald James Bordelon (February 19, 1962 – January 7, 2010)[1] was an American convicted murderer and sex offender who was executed in Louisiana for murder. Bordelon was sentenced to death for the kidnapping and murder of Courtney LeBlanc, his 12-year-old stepdaughter. Bordelon waived his appeals and asked to be executed, saying he would commit a similar crime again if he was ever given the opportunity. Bordelon was executed at Louisiana State Penitentiary on January 7, 2010, becoming the first person executed in Louisiana since 2002 and the state's first voluntary execution.[2] He remains the last person executed in Louisiana.[3]\nBordelon was born on February 19, 1962, and grew up in Louisiana. He attended schools in the Baton Rouge area and was considered impaired. As a result, he was put in a special resource class, before his mother took him out of school altogether after the principal advised her to. Doctors believed Bordelon suffered from antisocial personality disorder and sexual sadism disorder but had an IQ in the normal range.[4]\nOn March 17, 1982, Bordelon offered an 18-year-old woman a ride home in his car. After she got in, he pulled out a knife, took her to a house, and forced oral sex on her. In 1982, he pleaded guilty to sexual battery and was sentenced to ten years in prison. On June 14, 1990, he kidnapped another woman at knife point, and took her to an abandoned building where he forced oral sex on her and raped her. In 1990, Bordelon was convicted of forcible rape and two counts of aggravated crime against nature and sentenced to 20 years in prison.[4][5]\n",
        "type": [
            "kidnapping",
            "battery",
            "kidnapped",
            "rape",
            "murder"
        ]
    },
    "87": {
        "link": "/wiki/Glass_v._Louisiana",
        "title": "Glass v. Louisiana",
        "date": "",
        "year": "new 1952",
        "location": "",
        "state": "Louisiana",
        "place": "Glass",
        "county": "Vernon Parish",
        "paragraph": "Glass v. Louisiana, 471 U.S. 1080 (1985), was a case denied for hearing by the United States Supreme Court in 1985. The case is famous for Justice Brennan's dissent from the denial of certiorari, joined by Justice Marshall, arguing that the death penalty is always unconstitutional.\nJimmy L. Glass (May 27, 1962 – June 12, 1987) was an American convicted murderer who was sentenced to death by the state of Louisiana.\nGlass originally hailed from Arkansas.[1] He was a high school dropout and had a criminal record.[2] With fellow inmate Jimmy C. Wingo (March 14, 1952 – June 16, 1987), Glass escaped from the Webster Parish, Louisiana Jail in December 1982 and, during their escape, they killed Newt Brown (born 1927) and his wife, Erlene Nealy Brown (born 1931), at their home on Christmas Eve in Dixie Inn outside Minden. The Browns' son, Gary Lamar Brown, was the son-in-law of Judge Charles A. Marvin (1929–2003) of the Louisiana Court of Appeal for the Second Circuit, based in Shreveport. Glass and Wingo were soon arrested. Both were sentenced to death in the electric chair.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "88": {
        "link": "/wiki/Ryan_Francis",
        "title": "Ryan Francis",
        "date": "May 13, 2006(2006-05-13) (aged 19) Baton Rouge, Louisiana",
        "year": "2006",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Ryan LeChanc Francis (March 17, 1987 – May 13, 2006) was an American college basketball player. At the time of his death, he was the starting point guard for the USC Trojans. He was murdered during a trip to his hometown in Baton Rouge, Louisiana, after his freshman season at USC. \nAs a freshman, Francis was the starting point guard during the 2005–2006 season for the USC Trojans and averaged 7.1 points, 3.7 assists and 1.6 steals per game. He ranked seventh in the Pac-10 Conference in assists and fifth in steals which was good enough to make the honorable-mention pac-10 all-freshman team selected by the conference coaches. His jersey number was 12.  It has been suggested that after basketball he planned to enter coaching or work with criminals.\nFrancis was a standout at Glen Oaks High School in Baton Rouge, Louisiana. He averaged 22 points and five assists per game in his senior year and led his team to a perfect 36–0 record and the Class 4A state title in 2005.[1] Francis also won the MVP award for the state championship game and was named the 2005 Louisiana Class 4A Outstanding Player.[2]\n",
        "type": [
            "murder"
        ]
    },
    "89": {
        "link": "/wiki/New_Orleans_massacre_of_1866",
        "title": "New Orleans massacre of 1866",
        "date": "July 30, 1866",
        "year": "1866",
        "location": "New Orleans, Louisiana",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "The New Orleans Massacre of 1866 occurred on July 30, when a peaceful demonstration of mostly Black Freedmen was set upon by a mob of white rioters, many of whom had been soldiers of the recently defeated Confederate States of America, leading to a full-scale massacre. [4] The violence erupted outside the Mechanics Institute, site of a reconvened Louisiana Constitutional Convention. The Republican Party of Louisiana had called for the Convention, as they were angered by the legislature's enactment of the Black Codes and refusal to extend voting rights to Black men. White Democrats considered the reconvened convention to be illegal and were hostile towards Republican attempts to gain increased political power in the state. The massacre \"stemmed from deeply rooted political, social, and economic causes,\"[5] and took place in part because of the battle \"between two opposing factions for power and office.\"[5] According to the official report, a total of 38 were killed and 146 wounded, of whom 34 dead and 119 wounded were Black Freedmen. Unofficial estimates were higher.[6] Gilles Vandal estimated 40 to 50 Black Americans were killed and more than 150 Black Americans wounded.[7] Others have claimed nearly 200 were killed.[8] In addition, three white convention attendees were killed, as was one white protester.[9]\nDuring much of the American Civil War, New Orleans had been occupied and under martial law imposed by the Union. On May 12, 1866, Mayor John T. Monroe, a Democrat who had ardently supported the Confederacy, was reinstated as acting mayor, the position he held before the war. Judge R. K. Howell was elected as chairman of the convention, with the goal of increasing participation by voters likely to vote for removal of the Black Codes.[10]\nThe massacre expressed conflicts deeply rooted in the social structure of Louisiana. It was a continuation of the war: more than half of the whites were Confederate veterans and nearly half of the Black Americans were veterans of the Union army. The national reaction of outrage at the earlier Memphis riots of 1866 and the New Orleans Massacre helped the Radical Republicans win a majority in both houses of Congress in the 1866 midterm elections. The riots catalyzed support for the Fourteenth Amendment, extending suffrage and full citizenship to freedmen, and the Reconstruction Act, to establish military districts for the national government to oversee areas of the South and work to change their social arrangements.\n",
        "type": [
            "murder",
            "riot",
            "mass murder"
        ]
    },
    "90": {
        "link": "/wiki/Old_Sparky",
        "title": "Old Sparky",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Old Sparky is the nickname of the electric chairs in Arkansas, Connecticut, Florida, Georgia, Illinois, Kentucky, Nebraska, New York, Ohio, Oklahoma, South Carolina, Texas, Virginia, and West Virginia. Old Smokey was the nickname of the electric chairs used in New Jersey, Pennsylvania, and Tennessee.[1] \"Old Sparky\" is sometimes used to refer to electric chairs in general, and not one of a specific state.\nConnecticut legislated lethal injection as its sole method of execution in 1995.[2] The last person executed by electrocution was Joseph \"Mad Dog\" Taborsky in May 1960.[3] Connecticut's \"Old Sparky\" has not been tested since it was moved from Wethersfield to the Northern Correctional Institution in Somers in 1962, and prison officials claim the prison's electrical system cannot handle it.[4]\nThe electric chair was the sole means of execution in Florida from 1924 until 2000, when the Florida State Legislature, under pressure from the U.S. Supreme Court, signed lethal injection into law. Although no one has been executed in this manner since 1999, prisoners awaiting execution on Florida's death row may still be electrocuted at their request. It is currently located in Florida State Prison on the outskirts of Starke. It was known for frequent malfunctions in the 1990s, namely in the cases of Jesse Tafero (executed May 4, 1990), Pedro Medina (executed March 25, 1997) and Allen Lee Davis (executed July 8, 1999). Reportedly, 6-inch flames shot out of Tafero's head and 12-inch flames shot out of Medina's head, raising the question whether use of the electric chair was \"cruel and unusual punishment\". After the Medina execution, Florida Attorney General Bob Butterworth commented, \"People who wish to commit murder, they'd better not do it in the state of Florida because we may have a problem with the electric chair.\"[5]\n",
        "type": [
            "murder"
        ]
    },
    "91": {
        "link": "/wiki/Louisiana_ex_rel._Francis_v._Resweber",
        "title": "Louisiana ex rel. Francis v. Resweber",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Louisiana ex rel. Francis v. Resweber, 329 U.S. 459 (1947), is a case in which the U.S. Supreme Court was asked whether imposing capital punishment (the electric chair) a second time, after it failed in an attempt to execute Willie Francis in 1946,[1] constituted a violation of the United States Constitution. The issues raised surrounded the double jeopardy clause of the 5th Amendment, and the cruel and unusual punishment clause of the 8th Amendment, as made applicable to the State of Louisiana via the due process clause of the 14th Amendment.\nIn an opinion by Justice Stanley Forman Reed, which three other justices (Chief Justice Vinson and Associate Justices Hugo Black and Robert H. Jackson) joined, and with which Justice Felix Frankfurter concurred, the Court held that re-executing Francis did not constitute double jeopardy or cruel and unusual punishment.  Justice Reed wrote,\nOur minds rebel against permitting the same sovereignty to punish an accused twice for the same offense. But where the accused successfully seeks review of a conviction, there is no double jeopardy upon a new trial. Even where a state obtains a new trial after conviction because of errors, while an accused may be placed on trial a second time, it is not the sort of hardship to the accused that is forbidden by the Fourteenth Amendment ... For we see no difference from a constitutional point of view between a new trial for error of law at the instance of the state that results in a death sentence instead of imprisonment for life and an execution that follows a failure of equipment. When an accident, with no suggestion of malevolence, prevents the consummation of a sentence, the state's subsequent course in the administration of its criminal law is not affected on that account by any requirement of due process under the Fourteenth Amendment. We find no double jeopardy here which can be said to amount to a denial of federal due process in the proposed execution. (Citations omitted).",
        "type": []
    },
    "92": {
        "link": "/wiki/VL_Mike",
        "title": "VL Mike",
        "date": "April 20, 2008(2008-04-20) (aged 32) New Orleans, Louisiana, U.S.",
        "year": "2008",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Michael Allen (January 19, 1976 – April 20, 2008), better known as VL Mike, was an American rapper from New Orleans, Louisiana.\nHe first appeared on the mainstream rap scene in 2004 as a member of the New Orleans-based record label, Chopper City Records, of which rapper B.G. is the CEO. Mike was known for his gangsta rhyme structure and street lyrics throughout New Orleans. After the 2007 release of the Chopper City Boyz' debut album We Got This, VL Mike departed from Chopper City Records[1] and set out to pursue his solo career. VL Mike stated on his Place Yo Betz mixtape that the reason he departed from the label because B.G. had been portraying himself as a gangster for years through his music when he was not. VL Mike stated in an interview that he had a deal with Sony/Epic Records and his debut album, It's Only One Me, would be released in April.[2]\nAllen died on April 20, 2008, after he was shot several times while exiting his vehicle on the 4700 block of Miles Drive at around 1:00 p.m. He was later pronounced dead at University Hospital.[3]\n",
        "type": [
            "murder"
        ]
    },
    "93": {
        "link": "/wiki/2015_Lafayette_shooting",
        "title": "2015 Lafayette shooting",
        "date": "July 23, 2015; 7 years ago (2015-07-23) 7:27 p.m. (CDT)",
        "year": "2015",
        "location": "3141 Johnston Street, Lafayette, Louisiana, U.S.",
        "state": "Louisiana",
        "place": "Lafayette",
        "county": "Lafayette Parish",
        "paragraph": "\nOn July 23, 2015, a mass shooting occurred at the Grand 16 movie theater in Lafayette, Louisiana.[3] John Russell Houser,[4][5] 59, opened fire during a showing of the film Trainwreck, killing two people and injuring nine others before committing suicide.[6][7][8][9]\nThe shooting occurred in theater 14[10] during the 7:10 p.m. screening of Trainwreck, held at the Grand 16 movie theater in Lafayette.[2] John Russell Houser, 59, went to the theater alone, bought a ticket ten minutes late into the movie,[11] and sat for several minutes in the theater's second-to-last row. Along with Houser,[12] there were 25 people in the theater and 300 people in the building.[13][14][15] He was armed with a Hi-Point Model JCP .40-caliber handgun[1] and equipped with two 10-round magazines. Shortly before 7:30 p.m., Houser stood up, pulled out the handgun from his pants, and started shooting indiscriminately while walking down the steps. He fired at least 13 rounds and reloaded once. He killed two people and injured nine others.[16][17][18][19]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "94": {
        "link": "/wiki/Dave_Short",
        "title": "Dave Short",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Magnolia",
        "county": "Plaquemines Parish",
        "paragraph": "David Orvis Short (May 11, 1917 – November 22, 1983) was a professional baseball player.  He was an outfielder for parts of two seasons (1940–41) with the Chicago White Sox.  For his career, he compiled a .091 batting average in 11 at-bats.[1]  After playing for the Chicago White Sox he joined the military during World War II.  He was murdered in 1983.[2]\nAn alumnus of Louisiana Tech University, he was born in Magnolia, Arkansas and later died in Shreveport, Louisiana at the age of 66.\n\n",
        "type": [
            "murder"
        ]
    },
    "95": {
        "link": "/wiki/Feltus_Taylor",
        "title": "Feltus Taylor",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Feltus Taylor Jr. (1962 – June 6, 2000) was an American murderer. He was convicted and later executed by the state of Louisiana for robbery and the murder of Donna Ponsano.\nDonna Ponsano worked as a cook at Cajun's Fabulous Fried Chicken restaurant on Florida Boulevard in Baton Rouge. At approximately 7:00 a.m. on the morning of March 27, 1991, Keith Clark, the restaurant's manager, arrived to assist Ponsano in opening for business. After tending to morning chores in the rear of the restaurant, Clark returned to the front and noticed Taylor knocking at the front door. Taylor, a former employee of the restaurant whom Clark had hired approximately six months earlier, had been fired by Clark about two weeks previously for poor performance, he and Clark were still friendly. Clark opened the door for Taylor. \nTaylor, who was experiencing financial problems, asked Clark to rehire him. Clark refused, but assisted him in searching for another job by giving him money to buy a newspaper and sitting with him in a restaurant booth to review classified job advertisements. Clark found that a local Popeyes restaurant was seeking a cook, and called to recommend Taylor for the job. He made a 9:00 a.m. appointment with the Popeyes manager responsible for hiring, and intended to accompany Taylor to discuss his qualifications.\n",
        "type": [
            "robber",
            "murder",
            "robbery"
        ]
    },
    "96": {
        "link": "/wiki/Juan_Joseph",
        "title": "Juan Joseph",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Juan Joseph (August 26, 1987 – November 16, 2014) was a professional Arena football quarterback who also played American and Canadian football. He last played for the Lafayette Wildcatters of the Southern Indoor Football League (SIFL). He was signed by the Edmonton Eskimos as an undrafted free agent in 2009. He played college football for the Millsaps Majors. He was also a member of the Saskatchewan Roughriders.\nJoseph attended West Saint John Parish High School in Edgard, Louisiana,[1] where he was a member of the Rams 2003 and 2004 Class 2A State Championship teams.[1] While in high school, he was a teammate of future LSU and NFL players Tyson Jackson and Quinn Johnson. In high school, he played baseball, basketball and football, trying out for the football team in his sophomore year.\nJoseph played collegiately for the Millsaps College Majors of the NCAA's Division III. He was offered a full scholarship at Alcorn State University, but chose Millsaps because he wanted to attain a degree from a school with a nationally recognized business program.\n",
        "type": []
    },
    "97": {
        "link": "/wiki/Jack_Favor",
        "title": "Jack Favor",
        "date": "December 27, 1988(1988-12-27) (aged 77) Arlington, Texas, U.S.",
        "year": "1988",
        "location": "",
        "state": "Louisiana",
        "place": "Arlington",
        "county": "East Baton Rouge Parish",
        "paragraph": "Jack Graves Favor, also known as Cadillac Jack Favor,[3][4] (November 30, 1911 – December 27, 1988) was an American rodeo performer.[5][6]\nFavor was born on a ranch in Eula, Texas.[1][2] He attended and graduated from Abilene High School.[2] While at high school he won his first rodeo competition as a bronc rider in Cameron, Texas.[2]\nFavor served in the United States Navy from 1929 to 1932, returning to Texas after his discharge.[2] He worked as a truck driver for a plumbing company in Abilene, Texas.[2] Favor later settled in Fort Worth, Texas,[1] before returning to the Navy in 1941.[2]\n",
        "type": []
    },
    "98": {
        "link": "/wiki/Gruesome_Gertie",
        "title": "Gruesome Gertie",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Albany",
        "county": "Livingston Parish",
        "paragraph": "Gruesome Gertie was the nickname given by death row inmates to the Louisiana electric chair.\nIt is also widely known for the failed execution of Willie Francis, the first failed execution by electric chair.\nThe 1940 Louisiana legislature changed the method of execution, making execution by electrocution effective from June 1, 1941. Louisiana's electric chair did not have a permanent home at first, and was taken from parish to parish to perform the executions. The electrocution would usually be carried out in the courthouse or jail of the parish where the condemned inmate had been convicted. Eugene Johnson, a black man convicted of robbing and murdering Steven Bench, a white farmer who lived near Albany, was the first to die in Louisiana's electric chair; he was electrocuted in the Livingston Parish Jail on September 11, 1941.\n",
        "type": [
            "murder"
        ]
    },
    "99": {
        "link": "/wiki/List_of_people_executed_in_Louisiana",
        "title": "List of people executed in Louisiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nThe following is a list of people executed by the U.S. state of Louisiana since capital punishment was resumed in 1976.\nA total of 28 people convicted of murder have been executed by the state of Louisiana since 1976. Of the 28 people executed, 20 were executed via electrocution and 8 via lethal injection. The most recent Louisiana inmate to be put to death, Gerald Bordelon, waived his appeals and asked the state to carry out his sentence.[1]\n",
        "type": [
            "murder"
        ]
    },
    "100": {
        "link": "/wiki/John_E._Hart",
        "title": "John E. Hart",
        "date": "June 11, 1863(1863-06-11) (aged 39) St. Francisville, Louisiana",
        "year": "1863",
        "location": "",
        "state": "Louisiana",
        "place": "St. Francisville",
        "county": "West Feliciana Parish",
        "paragraph": "\nJohn Elliot Hart (April 4, 1824 – June 11, 1863) was an officer in the Union Navy during the American Civil War. He died in June 1863 on board his ship USS Albatross while taking part in the Union attempt to blockade the Mississippi River. He is best known for the unusual circumstances of his burial in Louisiana, which the town of St. Francisville, Louisiana, commemorates every year in a three-day festival called \"The Day the War Stopped.\"\nHart was born in 1824 in New York City to a family with 200-year roots there. His father was Benjamin Franklin Hart and his mother was Sarah Ann Copp.[1] The family had a strong Navy tradition. His grandfather John Elliot Copp, for whom he was named, and his uncle Ezekiel Bishop Hart were both killed serving in the Navy during the War of 1812.[1]\n",
        "type": []
    },
    "101": {
        "link": "/wiki/Jackie_Neal",
        "title": "Jackie Neal",
        "date": "March 10, 2005Baton Rouge, Louisiana",
        "year": "2005",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nJacqueline \"Jackie\" Neal (July 7, 1967 – March 10, 2005)[1] was an American blues singer.\nBorn in Baton Rouge, Louisiana, her parents were Shirley and Raful Neal. Her father was also a blues musician, as were eight of her ten siblings, including Kenny Neal.  She was best known for her hit singles \"Right Thang, Wrong Man\", \"The Way We Roll\" featuring her son Bro Bro, and \"Down in the Club\".\n",
        "type": [
            "murder"
        ]
    },
    "102": {
        "link": "/wiki/Killing_of_Jeff_Doucet",
        "title": "Gary Plauché",
        "date": "October 23, 2014(2014-10-23) (aged 68) Baton Rouge, Louisiana, U.S.",
        "year": "2014",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nLeon Gary Plauché (November 10, 1945 – October 23, 2014) was an American man known for publicly killing Jeff Doucet, who had kidnapped, raped, and molested Plauché's prepubescent son, Jody. The killing occurred on Friday, March 16, 1984, and was captured on camera by a local news crew. For the fatal shooting, Plauché was given a seven-year suspended sentence with five years' probation and 300 hours of community service and received no prison time. The case received wide publicity because some people questioned whether Plauché should have been charged with murder or let off. Plauché contended that he was in the right, and that anyone in a similar position would have taken the same action.[1]\nGary Plauché lived in Baton Rouge, Louisiana. He was separated from his wife, June, at the time of the shooting. During 1983 and 1984, his 11-year-old son, Jody Plauché, was taking karate lessons with an instructor, 25-year-old Jeffrey Doucet, who had been sexually abusing the boy for at least a year. In February 1984, Doucet kidnapped Jody and took him to a motel in Anaheim, California, where he sexually assaulted and molested him. Police searched the country for Jody, and he was eventually found after Doucet allowed the boy to place a collect call to his mother from the motel.[2] California police raided the motel and arrested Doucet without incident.[3]\n",
        "type": [
            "killing",
            "kidnapped",
            "rape",
            "assault",
            "murder",
            "shooting"
        ]
    },
    "103": {
        "link": "/wiki/Warren_Harris_(serial_killer)",
        "title": "Warren Harris (serial killer)",
        "date": "",
        "year": "new 1974",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans'",
        "county": "Orleans Parish",
        "paragraph": "\nWarren Harris, Jr. (born 1961), known as The French Quarter Stabber, is an American serial killer who, as a teenager, fatally stabbed four people, three of whom were gay men, in New Orleans' French Quarter from February to April 1977. Convicted for three of the murders, he was given three consecutive life terms without parole, which he is still serving to this day.\nLittle is known about Harris' upbringing. Born in New Orleans in 1961, he was presumably raised by his mother and his maternal grandfather, who was a well-respected Baptist minister in the city. From an early age, Harris started committing small-time crimes like purse snatching and thefts, and was incarcerated in 1974 for auto theft.[1] Despite his criminal record, he was not considered a violent individual, and after dropping out of the eight grade, he moved in with a transsexual roommate in an apartment within the French Quarter.[2]\n",
        "type": [
            "theft",
            "murder"
        ]
    },
    "104": {
        "link": "/wiki/John_A._Brown_Jr.",
        "title": "John A. Brown Jr.",
        "date": "September 7, 1984",
        "year": "1984",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "John Ashley Brown Jr. (c.1962/1963[1] – April 24, 1997) was an American from New Orleans who was convicted of first-degree murder and incarcerated on death row in Louisiana State Penitentiary for 12 years. He was one of six inmates featured in the 1998 documentary entitled The Farm: Angola, USA. He was executed in 1997 for the murder of Omer Laughlin in New Orleans in 1984.\nBrown was a resident of New Orleans. He said that on September 7, 1984, he had run out of cocaine and needed money to purchase more of the drug.\nThat evening Omer Laughlin and his wife had eaten dinner at a restaurant near the corner of Dauphine and Touro streets in Faubourg Marigny in New Orleans. At approximately 11:45 p.m., they left the restaurant and began walking to their car, located about a block away. A man stepped out of a nearby vehicle and confronted the Laughlins. He pinned them against their car and demanded money from Omer Laughlin. His wife screamed and ran back toward the restaurant. By the time she returned to the car with help, her husband was dead.[citation needed]\n",
        "type": [
            "murder"
        ]
    },
    "105": {
        "link": "/wiki/C-Murder",
        "title": "C-Murder",
        "date": "",
        "year": "new 2002",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nCorey Miller (born March 9, 1971),[1] better known by his stage name C-Murder, is an American rapper and songwriter. He initially gained fame in the mid-1990s as a part of his brother Master P's label No Limit Records, primarily as a member of the label's supergroup, TRU. Miller went on to release several solo albums of his own through the label, including 1998's platinum Life or Death. C-Murder has released nine albums altogether on six different labels, No Limit Records, TRU Records, Koch Records, Asylum Records, RBC Records, and Venti Uno.\nIn 2002, Miller was arrested in connection with the murder of 16-year-old Steve Thomas, and was sentenced to life in prison on August 14, 2009. Miller is serving his sentence at the Louisiana State Penitentiary.[2][3] Controversy surrounding witnesses involved in Miller's trial came to light in 2018 when two key witnesses recanted their statements, claiming they had been pressured into testifying against Miller by authorities. Miller maintains his innocence, and he, his brothers, and his nephew have all called for a new trial numerous times.[4][5]\n",
        "type": [
            "murder"
        ]
    },
    "106": {
        "link": "/wiki/Murder_of_Oneal_Moore",
        "title": "Murder of Oneal Moore",
        "date": "June 2, 1965 (aged 34) Varnado, Louisiana",
        "year": "1965",
        "location": "",
        "state": "Louisiana",
        "place": "Varnado",
        "county": "Washington Parish",
        "paragraph": " Oneal Moore (1931 – June 2, 1965) was the first African-American deputy sheriff for the Washington Parish Sheriff's Office in Varnado, Louisiana. He was murdered on June 2, 1965, by alleged members of the Ku Klux Klan in a drive-by shooting, one year and a day after his landmark appointment as deputy sheriff. An Army veteran, he was 34 years old, married, and the father of four daughters.\nThe evening of June 2, 1965, Moore was driving home from work when an individual in a pickup truck shot at him and his partner, David Creed Rogers, another African-American deputy sheriff. Moore lost control of the vehicle and crashed into a tree, dying instantly from a gunshot wound to the head.[1] Rogers suffered injuries, including to one eye, but survived the shooting and crash; he immediately  broadcast a description of the vehicle, which he noted had a Confederate flag decal on its front bumper.[2]\nTwo suspects were arrested in Mississippi not long afterward. One was Ernest Ray McElveen, a known white supremacist. McElveen was represented by Baton Rouge, Louisiana, attorney Osier Brown. He later also represented the two men charged with Clarence Triggs' murder the following year in 1966.[3] The police filed no charges due to a lack of evidence and witnesses.[4]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "107": {
        "link": "/wiki/Killing_of_Jeremy_Mardis",
        "title": "Killing of Jeremy Mardis",
        "date": "November 3, 2015 (2015-11-03) ≈ 9:30 p.m.",
        "year": "2015",
        "location": "Marksville, Louisiana, in Avoyelles Parish, U.S.",
        "state": "Louisiana",
        "place": "Marksville",
        "county": "Avoyelles Parish",
        "paragraph": "\nGreenhouse:\nOn November 3, 2015, Jeremy Mardis, a six-year-old boy, was killed by police in Marksville, Louisiana, in a shooting that also wounded his father, Chris Few. \n",
        "type": [
            "shooting",
            "killing"
        ]
    },
    "108": {
        "link": "/wiki/Muhiyidin_Moye",
        "title": "Muhiyidin Moye",
        "date": "February 6, 2018(2018-02-06) (aged 32) New Orleans, Louisiana, U.S.",
        "year": "2018",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nMuhiyidin El Amin Moye (April 22, 1985 – February 6, 2018), also known as Muhiyidin d'Baha, was a leading Black Lives Matter activist known nationally for crossing a yellow police tape line to snatch a Confederate battle flag from a demonstrator on live television in Charleston, South Carolina, in February 2017.\nMoye, an African-American, was born in Poughkeepsie, New York, and as a teen the family moved to Hollywood, South Carolina. He attended University of South Carolina and in 2006 suffered severe burns from an arson attack at a house he was staying at. He went on to attend Winthrop University, finishing in 2011. That fall he appeared at Occupy Eugene. Back in Charleston he found and joined the Baháʼí Faith around 2014 and soon was visible in the news following the shooting of Walter Scott and being known as a Black Lives Matter activist in 2015. After some more work in 2016 Moye became involved in a February 2017 Bree Newsome speaking engagement that drew protestors and counter protestors during which he made a leap crossing police lines to take down an oversized Confederate battle flag that happened to occur during a news broadcast and so was caught on live television. A year later Moye went to New Orleans and while riding a bicycle through the midnight streets on February 6, 2018, he was shot, traveled on some blocks, left his bike and called for help to which police responded and took him to the hospital. However he had lost too much blood and died in the morning.\n",
        "type": [
            "arson",
            "murder",
            "shooting"
        ]
    },
    "109": {
        "link": "/wiki/Matthew_Gerald",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "year": "2016",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\nThe shooting occurred during a period of unrest in Baton Rouge, though it is unclear if the events are related.[11] Baton Rouge was experiencing ongoing protests following the officer-involved killing of Alton Sterling less than two weeks before on July 5.[12][13] On July 7, the FBI's New Orleans field office issued a warning about \"threats to law enforcement and potential threats to the safety of the general public\" stemming from the death of Sterling.[14] Within the previous week, four suspects were arrested in connection with an alleged plot to kill Baton Rouge police officers, which was described as a credible threat by law enforcement officials.[12][15] Ten days earlier, five police officers were killed in a mass shooting in Dallas.[6]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "110": {
        "link": "/wiki/Clarence_Triggs",
        "title": "Clarence Triggs",
        "date": "July 30, 1966 (aged 24) Bogalusa, Louisiana",
        "year": "1966",
        "location": "",
        "state": "Louisiana",
        "place": "Jackson",
        "county": "Jackson Parish",
        "paragraph": "Clarence Triggs (1943 – July 30, 1966) was a married African-American bricklayer and veteran, who was murdered on July 30, 1966 in Bogalusa, Louisiana, about a month after participating in a civil rights march for voting.[1] Two white men were arrested and indicted in the case. One was acquitted and the other never tried. Although the cold case was reopened by the FBI in the early 21st century, Triggs' murder has never been solved.\nTriggs, a 24-year-old construction worker, had recently moved with his wife Emma to Bogalusa from Jackson, Mississippi. He worked as a bricklayer.[2]\nHe had taken part in some marches organized by the Congress on Racial Equality and the Bogalusa Voters League to push for blacks to be allowed to register freely to vote in elections, after decades of being disenfranchised. Triggs was killed a month later. This was about a year after Oneal Moore, the first black deputy sheriff in Washington Parish, was shot and murdered while on patrol; his partner, deputy Creed Rodgers, was severely wounded and lost sight in one eye.[citation needed] Congress had passed the Voting Rights Act of 1965 to authorize federal oversight and enforcement in jurisdictions with historic under-representation of minorities in voting, but many areas of the South were resisting this change.\n",
        "type": [
            "murder"
        ]
    },
    "111": {
        "link": "/wiki/Bogalusa,_Louisiana",
        "title": "Bogalusa, Louisiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Washington Parish",
        "county": "Washington Parish",
        "paragraph": "[1]Bogalusa is a city in Washington Parish, Louisiana, United States. The population was 12,232 at the 2010 census. In the 2020 census the city, town, place equivalent reported a population of 10,659. It is the principal city of the Bogalusa Micropolitan Statistical Area, which includes all of Washington Parish and is also part of the larger New Orleans–Metairie–Hammond combined statistical area.\nThe name of the city derives from the Choctaw language term bogue lusa, which translates into English as \"dark water[4] or \"smoky water\".[5] Located in an area of pine forests, in the early 20th century, this industrial city was developed as a company town, to provide worker housing and services in association with a Great Southern Lumber Company sawmill. In the late 1930s, this operation was replaced with paper mills and chemical operations.\n",
        "type": [
            "riot"
        ]
    },
    "112": {
        "link": "/wiki/Billy_Sinclair",
        "title": "Billy Sinclair",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Angola",
        "county": "West Feliciana Parish",
        "paragraph": "Billy Wayne Sinclair (born 1945) is a former prisoner at the Louisiana State Penitentiary (also known as Angola), convicted of first-degree murder and originally sentenced to death. His sentence was commuted to life in 1972. He became a notable journalist, known from 1978 for co-editing The Angolite with Wilbert Rideau; together they won some national journalism awards at the magazine, and were nominated for others. It published articles written by inmates at the prison.\nIn 1987 Sinclair cooperated in a federal investigation at the prison of pardons-for-sale during the administration of Governor Edwin Edwards. No charges were made against Edwards but Howard Marcellus, head of the pardon board under the Edwards administration, was convicted of bribery following a state investigation.[1] Sinclair was moved to isolation in other secure prison quarters because his cooperation put him at risk from other inmates. With support from some law enforcement organizations, he was paroled in 2006 to the state of Texas. He had married in 1982 by proxy and lives in Houston with his wife. He works as a paralegal.\nIn 1963 Sinclair pleaded guilty to a sex offense involving a minor.  He pleaded guilty to one count of Carnal Knowledge of a Juvenile, Louisiana Revised Statutes 14:80 (commonly called \"statutory rape\" in other states) and served one year in state prison for this sex offense. He was 18 years of age in 1963; the juvenile girl was 16.\nIn 1965 Sinclair at the age of 20 was convicted of killing James C. Bodden during a robbery attempt in Baton Rouge, Louisiana; he was sentenced to death in 1966. Sinclair had robbed a convenience store at gunpoint. When he fled, he was pursued by Bodden, a store employee. Sinclair turned and fatally shot Bodden while trying to escape.\n",
        "type": [
            "robber",
            "killing",
            "rape",
            "robbery",
            "murder"
        ]
    },
    "113": {
        "link": "/wiki/Montrell_Jackson",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "year": "2016",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\nThe shooting occurred during a period of unrest in Baton Rouge, though it is unclear if the events are related.[11] Baton Rouge was experiencing ongoing protests following the officer-involved killing of Alton Sterling less than two weeks before on July 5.[12][13] On July 7, the FBI's New Orleans field office issued a warning about \"threats to law enforcement and potential threats to the safety of the general public\" stemming from the death of Sterling.[14] Within the previous week, four suspects were arrested in connection with an alleged plot to kill Baton Rouge police officers, which was described as a credible threat by law enforcement officials.[12][15] Ten days earlier, five police officers were killed in a mass shooting in Dallas.[6]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "114": {
        "link": "/wiki/Jeff_Doucet",
        "title": "Gary Plauché",
        "date": "October 23, 2014(2014-10-23) (aged 68) Baton Rouge, Louisiana, U.S.",
        "year": "2014",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nLeon Gary Plauché (November 10, 1945 – October 23, 2014) was an American man known for publicly killing Jeff Doucet, who had kidnapped, raped, and molested Plauché's prepubescent son, Jody. The killing occurred on Friday, March 16, 1984, and was captured on camera by a local news crew. For the fatal shooting, Plauché was given a seven-year suspended sentence with five years' probation and 300 hours of community service and received no prison time. The case received wide publicity because some people questioned whether Plauché should have been charged with murder or let off. Plauché contended that he was in the right, and that anyone in a similar position would have taken the same action.[1]\nGary Plauché lived in Baton Rouge, Louisiana. He was separated from his wife, June, at the time of the shooting. During 1983 and 1984, his 11-year-old son, Jody Plauché, was taking karate lessons with an instructor, 25-year-old Jeffrey Doucet, who had been sexually abusing the boy for at least a year. In February 1984, Doucet kidnapped Jody and took him to a motel in Anaheim, California, where he sexually assaulted and molested him. Police searched the country for Jody, and he was eventually found after Doucet allowed the boy to place a collect call to his mother from the motel.[2] California police raided the motel and arrested Doucet without incident.[3]\n",
        "type": [
            "killing",
            "kidnapped",
            "rape",
            "assault",
            "murder",
            "shooting"
        ]
    },
    "115": {
        "link": "/wiki/St._Bernard_Parish_massacre",
        "title": "St. Bernard Parish, Louisiana",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "St. Bernard Parish",
        "county": "Saint Bernard Parish",
        "paragraph": "\nSt. Bernard Parish (French: Paroisse de Saint-Bernard; Spanish: Parroquia de San Bernardo) is a parish in the U.S. state of Louisiana. The parish seat and largest community is Chalmette.[2] The parish was formed in 1807.[3] St. Bernard Parish is part of the New Orleans–Metairie metropolitan statistical area; the parish is located southeast of the city of New Orleans and comprises the Chandeleur Islands and Chandeleur Sound in the east.\nSt. Bernard was the fastest growing parish in Louisiana from 2010 to 2020,[4] increasing from a population of 35,897 in the 2010 census to 43,764 in 2020.[5][6] It remains at less than two-thirds of its 2000 population of 67,229, prior to Hurricane Katrina.\n",
        "type": []
    },
    "116": {
        "link": "/wiki/Lorilei",
        "title": "Lorilei",
        "date": "",
        "year": "new 2003",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "Lorilei: A Meditation on Loss is a 2003 play by Tom Wright and Nicholas Harrington, based on a capital murder trial in Louisiana, United States.[1]\nThe play tells the true story of Lorilei Guillory, whose six-year-old son, Jeremy, was murdered in 1992 in Iowa, Louisiana, by a man with schizophrenia.[2] During the second trial of the man convicted of the crime, Ricky Langley, Guillory testified for the defendant, stating her opinion that he was mentally ill at the time of the offence and should not be sentenced to die.[3][4] The retrial ended in a verdict of diminished capacity, rather than the original death sentence.[4]\nA solo performance, the play is presented as a narrative constructed from the transcripts of the trial.[5] It explores Guillory's struggle with the loss of her young child but also her compassion for the man who killed him.[5]\n",
        "type": [
            "murder"
        ]
    },
    "117": {
        "link": "/wiki/Sean_Vincent_Gillis",
        "title": "Sean Vincent Gillis",
        "date": "",
        "year": "new 1994",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Sean Vincent Gillis (born June 24, 1962) is an American serial killer and sex offender who stalked and murdered eight Louisiana women between 1994 and 2004 in the Baton Rouge Metro and surrounding areas. He was arrested without incident at his residence on Burgin Ave at 1:30 a.m. on April 29, 2004. In his initial arrest, he was charged with three counts of first degree murder and three counts of ritualistic acts in the murders of 29-year-old Katherine Hall, 45-year-old Johnnie Mae Williams and 43-year-old Donna Bennett Johnston. Gillis confessed to the murders with little coercion and then informed investigators about five other women whom he had murdered.[1]\nGillis was born June 24, 1962, in Baton Rouge and was raised in southern Louisiana. He was the son of Yvonne and Norman Gillis. His father abandoned the family soon after his birth. Gillis was raised by his mother and his grandparents.[2]\nA more violent side of Gillis' personality began to surface during adolescence, behaving with anger and rage. A neighbor once reported that \"she heard a loud banging noise at 3 a.m. and saw Gillis in his front yard, beating ruthlessly on some garbage cans.\"[2]\n",
        "type": [
            "murder"
        ]
    },
    "118": {
        "link": "/wiki/Rusty_Hamer",
        "title": "Rusty Hamer",
        "date": "January 18, 1990(1990-01-18) (aged 42) DeRidder, Louisiana, U.S.",
        "year": "1990",
        "location": "",
        "state": "Louisiana",
        "place": "DeRidder",
        "county": "Beauregard Parish",
        "paragraph": "\nRussell Craig \"Rusty\" Hamer (February 15, 1947 – January 18, 1990) was an American stage, film and television actor. He is best known for portraying Rusty Williams, the wisecracking son of entertainer Danny Williams (Danny Thomas), on the ABC/CBS situation comedy Make Room for Daddy (later retitled The Danny Thomas Show), from 1953 to 1964. He reprised the role in three reunion specials and the sequel series, Make Room for Granddaddy, which aired on ABC from 1970 to 1971.\nBorn in Tenafly, New Jersey,[1] Hamer was the youngest of three sons of Arthur Walter John Hamer, Sr., a men's shirt salesman and Dorothy Hamer (née Chretien), a former silent film actress of Maltese heritage.[2] He had two elder brothers, John and Walter.[3] As a child, Hamer was nicknamed \"Rusty\" as a derivative of his first name Russell, but also because of his red hair and freckles.[4]\n",
        "type": []
    },
    "119": {
        "link": "/wiki/Thomas_Lee_Ward",
        "title": "Thomas Lee Ward",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Thomas Lee Ward (c. 1936 – May 16, 1995) was an American murderer. He was tried, convicted, and executed by lethal injection in Louisiana for the murder of his stepfather-in-law Wilbert John Spencer.\nOn the night of June 22, 1983, Ward arrived by bus in New Orleans, Louisiana from California, where he had just been released from jail after serving 60 days for molesting his 10-year-old daughter. He went to the residence of Lydia and John Spencer, the mother and stepfather of his estranged wife, Linda. Ward's wife and children were also staying at the house. Ward was allowed into the house to visit his children. He asked and was allowed to bathe and freshen up. Ward learned that his wife had begun receiving welfare and the family was having some trouble with one of the daughters. Ward later claimed that this upset him, but rather than saying or doing anything rash, he left the house.\nHe then went to a local bar where he drank vodka and beer and \"hit up\" with cocaine. Ward returned to the house at approximately 5:30 a.m. the next morning, asking to see his children one last time. After visiting with the children he gave his wife his address and phone number in New York City and then went into the bedroom of his wife's mother and stepfather. He pulled out a gun, pointed it at Wilbert John Spencer and said \"I am sorry, John, I have to kill you.\" He then shot Spencer once at close range. As Lydia Spencer reached for her husband, Ward shot her in the stomach. When she turned around, he shot her in the back. She then ran for the door, trying to get out of the house. Ward followed her, striking her with three more shots. Linda Ward and her brother, Ernest Scott, heard the shooting and ran from the house to get help from the neighbors.\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "120": {
        "link": "/wiki/Carl_Weiss",
        "title": "Carl Weiss",
        "date": "September 8, 1935",
        "year": "1935",
        "location": "",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "Carl Austin Weiss Sr. (December 6, 1906 – September 8, 1935) was an American physician from Baton Rouge, Louisiana, who assassinated U.S. Senator Huey Long at the Louisiana State Capitol on September 8, 1935.\nWeiss was born in Baton Rouge to physician Carl Adam Weiss and the former Viola Maine. Weiss's father was a prominent ophthalmologist who had once treated Senator Long.[1] His family was Catholic; his father was of German descent, and his mother had French and Irish ancestry.[2][3] Weiss was educated in local schools and graduated from St. Vincent's Academy.[citation needed] He then obtained his bachelor's degree in 1925 from Louisiana State University in Baton Rouge. He did postgraduate work in Vienna, Austria, and was thereafter awarded internships in Vienna and at Bellevue Hospital in New York City. In 1932, he returned to Baton Rouge to enter private practice with his father. He was president of the Louisiana Medical Society in 1933 and a member of the Kiwanis International.[4]\nIn 1933, Weiss married Yvonne Louise Pavy (1908–1963) of Opelousas, the seat of St. Landry Parish. The couple had one son, Carl Austin Weiss Jr., who was born in 1934, shortly before his father's death, and he died August 2, 2019.[5] Pavy was the daughter of Judge Benjamin Henry Pavy (1874–1943) and Ida Veazie (died 1941). The Pavy family was part of an anti-Long political faction. Judge Pavy's brother Felix Octave Pavy (1879–1962), a physician in Leonville and Opelousas, had run for lieutenant governor in 1928 on an intraparty ticket, and had been defeated[6] by Paul N. Cyr, a Jeanerette dentist who was endorsed by Long.\n",
        "type": []
    },
    "121": {
        "link": "/wiki/St._John_Richardson_Liddell",
        "title": "St. John Richardson Liddell",
        "date": "February 14, 1870 (1870-02-15) (aged 54) New Orleans, Louisiana",
        "year": "1870",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "St. John Richardson Liddell (September 6, 1815 – February 14, 1870) was a prominent Louisiana planter who served as a general in the Confederate States Army during the American Civil War. He was an outspoken proponent of Southern emancipation of slaves. Following the war, Liddell had a prominent feud with a former Confederate officer, Charles Jones, who eventually murdered Liddell near his home in 1870.\nLiddell was born to a wealthy plantation family near Woodville, Mississippi. He was a schoolmate of future Confederate President Jefferson Davis, whom he would interact with several times during the early years of the Civil War on behalf of fellow general Albert Sidney Johnston.\nHe attended the United States Military Academy from 1834 to 1835, but resigned prior to graduating. Liddell then moved to Catahoula Parish and established his own prosperous plantation, \"Llanada,\" near Harrisonburg, Louisiana. His famous feud with Charles Jones, known as the Jones-Liddell feud, which eventually led to his death, began in the 1850s.\n",
        "type": [
            "murder"
        ]
    },
    "122": {
        "link": "/wiki/George_A._Waggaman",
        "title": "George A. Waggaman",
        "date": "March 31, 1843(1843-03-31) (aged 60–61) New Orleans, Louisiana, U.S.",
        "year": "1843",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "George Augustus Waggaman (1782 – March 31, 1843) was a United States Senator from Louisiana. Born in Caroline County, Maryland, he completed preparatory studies under private tutors, studied law, and was admitted to the bar in Caroline County in 1811. He served in the War of 1812 under General Andrew Jackson at New Orleans and settled in Baton Rouge, Louisiana, commencing the practice of law in 1813. He was attorney general of the third district of Louisiana in 1813, judge of the third judicial circuit court in 1818, and assistant judge of the criminal court in New Orleans in 1819. He was interested in sugarcane growing and held the office of Secretary of State of Louisiana from 1830 to 1831.\nWaggaman was elected as an anti-Jacksonian to the U.S. Senate to fill the vacancy caused by the resignation of Edward Livingston and served from November 15, 1831, to March 4, 1835. He resumed the practice of law in New Orleans and again engaged in sugar cane planting. He participated as a principal in a duel with the former mayor of New Orleans, Denis Prieur, a political adversary, and received injuries from which he died in New Orleans in 1843; interment was in Girod Street Cemetery.\nIn 1840, Waggaman's daughter Christine eloped with a young Canadian lawyer, John Sandfield Macdonald, who made regular trips to Washington on behalf of the government of Upper Canada as Queen's messenger. She joined Macdonald in Upper Canada. He would go on to be joint Premier of the Province of Canada and the first Premier of Ontario.[1]\n",
        "type": []
    },
    "123": {
        "link": "/wiki/Louisiana_Correctional_Institute_for_Women",
        "title": "Louisiana Correctional Institute for Women",
        "date": "",
        "year": "",
        "location": "7205 Highway 74, St. Gabriel, LA 70776Temporary main facility:Jetson Youth Center15200 Old Scenic Highway (at US Hwy 61) Baker, LA 70714 (physical address)",
        "state": "Louisiana",
        "place": "St. Gabriel",
        "county": "Iberville Parish",
        "paragraph": "Louisiana Correctional Institute for Women (LCIW) is a prison for women with its permanent pre-2016 facility located in St. Gabriel, Louisiana. It is the only female correctional facility of the Louisiana Department of Public Safety and Corrections. Elayn Hunt Correctional Center is immediately west of LCIW.[1] LCIW includes the state's female death row.[2] As of 2017[update] the prison has temporarily moved due to flooding that occurred in August 2016, and its prisoners are housed in other prisons. The administration is temporarily located in the former Jetson Youth Center near Baker.   By 2021 the Baker area address was given for the prison on the LCIW website.[3]\nIn 1961 the Louisiana Correctional Institute for Women opened on the grounds of a former prison farm camp. Female inmates were moved from the Louisiana State Penitentiary (Angola) to LCIW.[4] A 200 bed dormitory intended to alleviate an overcrowding of female prisoners was scheduled to open in the northern hemisphere spring of 1995.[5] In 1995 the state received federal approval for its plan to double-bunk inmates. That way the state could transfer state-sentenced female prisoners who were held in parish jails to the women's prison.[6] The television special 900 Women: Inside St. Gabriel's Prison is about the women inside the facility.[7]\nIn August 2016 the facility, which had 985 prisoners,[8] experienced flooding, ranging from 8 in (20.3 cm) \nto 3 ft (0.91 m).[9] LCIW, the only state-operated prison to receive flooding during that incident, temporarily closed.[8] It was the first time in state history that the whole population of a particular prison was evacuated to other facilities.[10] The chapel and one other building did not flood.\n",
        "type": []
    },
    "124": {
        "link": "/wiki/Lynchings_of_Mer_Rouge,_Louisiana",
        "title": "Lynchings of Mer Rouge, Louisiana",
        "date": "\nDisappeared on August 24, 1922\nBodies discovered on December 24, 1922\n",
        "year": "1922",
        "location": "Mer Rouge, Morehouse Parish, Louisiana",
        "state": "Louisiana",
        "place": "Mer Rouge",
        "county": "Morehouse Parish",
        "paragraph": "\nFilmore Watt Daniels and Thomas F. Richards were lynched in Mer Rouge, Morehouse Parish, Louisiana by black robed Ku Klux Klan members on August 24, 1922. According to the United States Senate Committee on the Judiciary they were the 47th and 48th of 61 lynchings during 1922 in the United States.[1] There were five lynchings in the state of Louisiana and of the 61 lynchings they were 2 of 6 white victims.[2]\nThe Ku Klux Klan was extremely powerful in Louisiana since its revival in 1915. By 1924, there were thousands of Klan members in Louisiana, with each member paying $10 ($150 in 2022) to join.[3] In 1922, Louisiana Governor John M. Parker pleaded with J. Edgar Hoover (then Assistant Director of the Bureau of Investigation) to help him as he wrote, \"the Ku Klux Klan has grown so powerful in my state that it effectively controls the northern half. It has already kidnapped, tortured, and killed two people who opposed it…and it has threatened many more.\"[3]\n",
        "type": [
            "lynching",
            "kidnapped",
            "torture",
            "riot"
        ]
    },
    "125": {
        "link": "/wiki/Gus_Bailey",
        "title": "Gus Bailey",
        "date": "November 28, 1988(1988-11-28) (aged 37) New Orleans, Louisiana",
        "year": "1988",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Augustus Bailey (February 18, 1951 – November 28, 1988) was an American basketball player.\nBorn in Gibson, North Carolina, Bailey played collegiately for the University of Texas at El Paso.\nHe was selected by the Houston Rockets in the 2nd round (23rd pick overall) of the 1974 NBA draft and by the San Diego Conquistadors in the second round of the 1974 ABA Draft.[1]\n",
        "type": [
            "murder"
        ]
    },
    "126": {
        "link": "/wiki/2021_Grambling_State_University_shooting",
        "title": "List of school shootings in the United States (2000–present)",
        "date": "",
        "year": "2000",
        "location": "",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "\nSchool shootings in the United States have occurred at K–12 public and private schools, as well as at colleges and universities, and on school buses. Excluded from this list are the following:\nShootings by school staff, where the only victims are other employees, are covered at workplace killings.\n",
        "type": [
            "shooting",
            "killing"
        ]
    },
    "127": {
        "link": "/wiki/Derrick_Todd_Lee",
        "title": "Derrick Todd Lee",
        "date": "January 21, 2016(2016-01-21) (aged 47) Zachary, Louisiana, U.S.",
        "year": "2016",
        "location": "",
        "state": "Louisiana",
        "place": "Zachary",
        "county": "East Baton Rouge Parish",
        "paragraph": "Derrick Todd Lee (November 5, 1968 – January 21, 2016), also known as The Baton Rouge Serial Killer, was an American serial killer. Between 1992 and 2003, Lee murdered seven women in the Baton Rouge area.[1]\nPrior to his murder charges, Lee had been arrested for stalking women and watching them in their homes. Despite this, he was initially overlooked by police, because they incorrectly believed the killer was white. Lee was linked by DNA tests to the deaths of seven women in the Baton Rouge and Lafayette areas in Louisiana, and in 2004 was convicted, in separate trials, of the murders of Geralyn DeSoto and Charlotte Murray Pace. The Pace trial resulted in a death sentence.\nNewspapers suggested Lee was responsible for other unsolved murders in the area, but the police lacked DNA evidence to prove these connections. After Lee's arrest, it was discovered that another serial killer, Sean Vincent Gillis, was operating in the Baton Rouge area during the same time as Lee.\n",
        "type": [
            "murder"
        ]
    },
    "128": {
        "link": "/wiki/Frank_Clancy_(sheriff)",
        "title": "Frank Clancy (sheriff)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nFrank Clancy was sheriff and alleged American Mafia associate.\nAn old time political boss,[citation needed] Clancy had recently appeared before the Kefauver Committee and had testified that he had allowed organized crime figures to place 5,000 slot machines in his parish. It was also claimed he had earned a percentage of gambling casinos operated by acting New Orleans crime family boss Carlos Marcello, in which he maintained the right to hire employees below management position. Although Clancy's testimony did implicate Marcelo, it had relatively little impact on his gambling operations.\nClancy had apparently been talking to federal authorities regarding gambling operations in Louisiana but following an attempt on his life he soon stopped cooperating with authorities.\n",
        "type": [
            "murder"
        ]
    },
    "129": {
        "link": "/wiki/Lil_Snupe",
        "title": "Lil Snupe",
        "date": "July 20, 2013; 9 years ago (2013-07-20) 4:00 a.m. (CDT)",
        "year": "2013",
        "location": "Winnfield, Louisiana, U.S.",
        "state": "Louisiana",
        "place": "Winnfield",
        "county": "Winn Parish",
        "paragraph": "Addarren Ross (/ˈædærən/; July 13, 1995 – July 20, 2013), known professionally as Lil Snupe, was an American rapper and songwriter from Winnfield, Louisiana signed to American rapper Meek Mill's record label Dream Chasers Records. His death at a young age marked several hip-hop musicians and made him the subject of numerous musical tributes and documentaries.\nAddarren Ross was born on July 13, 1995[2] in Jonesboro, Louisiana.[3] Ross was raised in Jonesboro primarily by his mother Denesha Chester. His father, Charlie Brown, was incarcerated for most of his life and at the time of his death, his father was released.\nAccording to testimony by a family friend, Lil Snupe's mother had him when she was approximately 14 or 15 years old.[4] According to accounts by Lil Snupe's mother Denesha Ross, the rapper struggled in school and was expelled three times.[5]\n",
        "type": []
    },
    "130": {
        "link": "/wiki/Gavin_Eugene_Long",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "year": "2016",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\nThe shooting occurred during a period of unrest in Baton Rouge, though it is unclear if the events are related.[11] Baton Rouge was experiencing ongoing protests following the officer-involved killing of Alton Sterling less than two weeks before on July 5.[12][13] On July 7, the FBI's New Orleans field office issued a warning about \"threats to law enforcement and potential threats to the safety of the general public\" stemming from the death of Sterling.[14] Within the previous week, four suspects were arrested in connection with an alleged plot to kill Baton Rouge police officers, which was described as a credible threat by law enforcement officials.[12][15] Ten days earlier, five police officers were killed in a mass shooting in Dallas.[6]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "131": {
        "link": "/wiki/Messy_Mya",
        "title": "Messy Mya",
        "date": "November 14, 2010(2010-11-14) (aged 22) New Orleans, LA",
        "year": "2010",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "Messy Mya (born Anthony Barré, December 15, 1987 – November 14, 2010) was an American rapper from New Orleans, Louisiana.\nHe was most known for the controversy regarding his voice being sampled in Beyoncé's \"Formation\".[1] Barré was shot & killed leaving his girlfriend's baby shower in November 2010, New Orleans' 7th ward.[2][3][4]\n",
        "type": [
            "murder"
        ]
    },
    "132": {
        "link": "/wiki/Nicolas_Chauvin_de_La_Fr%C3%A9ni%C3%A8re",
        "title": "Nicolas Chauvin de La Frénière",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Montréal",
        "county": "Orleans Parish",
        "paragraph": "Nicolas Chauvin de La Frénière, the younger, (died 26 October 1769) was a son of Nicolas Chauvin, Sieur de La Frenière, the elder, who was born 1675 in Montréal, and died in 1748 in New Orleans, Orleans Parish, Louisiana.[1]\nThe younger La Frénière was an Attorney General of French Louisiana. He was one of the ringleaders of the Louisiana Rebellion of 1768, the others being Joseph Milhet, Jean-Baptiste Noyan, Pierre Caresse and Pierre Marquis. The rebellion succeeded in driving Antonio de Ulloa, the Spanish Governor of Louisiana out of New Orleans. However, the ringleaders, de La Frénière were later arrested and subsequently executed on 26 October 1769 by firing squad.[2]\nAccording to the A History of Louisiana (1909):\n",
        "type": []
    },
    "133": {
        "link": "/wiki/Antoinette_Frank",
        "title": "Antoinette Frank",
        "date": "",
        "year": "new 1995",
        "location": "",
        "state": "Louisiana",
        "place": "St. Gabriel",
        "county": "Iberville Parish",
        "paragraph": "\nAntoinette Renee Frank (born April 30, 1971) is a former officer of the New Orleans Police Department (NOPD) who, on March 4, 1995, committed a violent armed robbery at a restaurant which resulted in the killing of two members of the Vietnamese-American family who ran the establishment, and fellow NOPD officer Ronald A. Williams II. She was aided by her probable lover, drug dealer Rogers Lacaze. Frank currently resides at the Louisiana Correctional Institute for Women in St. Gabriel, Louisiana, the only woman on the state's death row.\nAntoinette Frank applied to the New Orleans Police Department (NOPD) in early 1993. According to author Chuck Hustmyre, Frank was caught lying on several sections of her employment application and failed two standard psychiatric evaluations, with psychiatrist Philip Scurria advising against her hiring. Despite this, Frank got a second chance to apply. The NOPD was chronically short-handed; at the time, its officers were paid less than in similarly sized cities, it was losing officers faster than they could be replaced, and the ranks had been decimated by several arrests for murder and drug activity. Many potential applicants were shut out due to a requirement that all officers be residents of New Orleans – a requirement that was only changed in 2014. NOPD officials also thought having more African-Americans like Frank on the force would ease longstanding racial tensions in the majority-black city. She was hired on February 7, 1993, and graduated from the police academy on February 28.\n",
        "type": [
            "robber",
            "murder",
            "robbery",
            "killing"
        ]
    },
    "134": {
        "link": "/wiki/Soulja_Slim",
        "title": "Soulja Slim",
        "date": "November 26, 2003(2003-11-26) (aged 26) Gentilly, New Orleans, Louisiana, U.S.",
        "year": "2003",
        "location": "",
        "state": "Louisiana",
        "place": "Gentilly",
        "county": "Orleans Parish",
        "paragraph": "James Adarryl Tapp Jr. (September 9, 1977 – November 26, 2003),[1] better known by his stage name Soulja Slim, was an American rapper and songwriter. He is perhaps best known for featuring on the U.S. number one hit \"Slow Motion\".[2]\nJames A'Darryl Tapp Jr. was born in New Orleans on September 9, 1977, to James and Linda Tapp. He was raised in the Magnolia Projects in New Orleans and attended Cohen Senior High School before dropping out of school in the 11th grade. He began selling drugs, as well as forming an addiction to heroin and cocaine. By 1993, he was rapping as \"Magnolia Slim\" in venues and block parties in the projects.[3] His first recordings, however, would be on Parkway Pumpin', an independent label run by legendary producer KLC and also featuring 39 Posse, Fiend, Mac, Mystikal Mike (later Mystikal), Mr. Serv-On and Da Hound. Soulja Slim's solo debut was Soulja Fa Lyfe was released in 1994 by Parkway Pumpin' and Hype Enough Records. The album did well, selling 90,000 units independently. In 1995, he released the four-song EP The Dark Side by Hype Enough Records.[4]\nIn the same year, the song \"You Got It\" appeared on a No Limit Records double-CD compilation Down South Hustlers: Bouncin' and Swingin' . In 1998, Tapp, now calling himself Soulja Slim, released Give It 2 'Em Raw by No Limit Records with his single and his music video \"From What I Was Told\" and a single called \"Street Life\". The album debuted at number 13 on the Billboard 200 and sold 82,000 in the first week.[5] At that time, Soulja Slim was convicted of armed robbery and incarcerated.[1] He reappeared three years later with Streets Made Me, which was again released on the No Limit label. From there, he started his own label, Cut Throat Comitty Records and released Years Later in late 2002. In 2003, he released Years Later...A Few Months After, his last album before his death. The album featured the song \"I'll Pay for It\". In 2003, he also collaborated with fellow New Orleans rapper Juvenile to make the song \"Slow Motion\". The song was released on Juvenile's album Juve the Great and reached the number one spot on the Billboard Hot 100. It was Soulja Slim and Juvenile's first number one hit, and as the song was released after Soulja Slim's death he became only the sixth artist to have a posthumous number one song.\n",
        "type": [
            "robber",
            "murder",
            "robbery"
        ]
    },
    "135": {
        "link": "/wiki/Brumfield_v._Cain",
        "title": "Brumfield v. Cain",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Brumfield",
        "county": "Washington Parish",
        "paragraph": "Brumfield v. Cain, 576 U.S. 305 (2015), was a United States Supreme Court case in which the Court held that because Brumfield satisfied 28 U.S.C. § 2254(d)(2)’s requirements,[1] he was entitled to have his Atkins v. Virginia[2] claim considered on the merits in federal court.\nKevan Brumfield (born January 7, 1973)[3] was sentenced to death for the January 7, 1993 murder of off-duty Baton Rouge police officer Betty Smothers. Brumfield and his accomplice, Henri Broadway (born September 7, 1970),[3] shot and killed Officer Smothers while she was escorting the manager of a grocery store to the bank.[4] Smothers was the mother of Warrick Dunn, who later became a running back for the Tampa Bay Buccaneers and the Atlanta Falcons.\nBrumfield had an IQ score of 75, had a fourth-grade reading level, had been treated at psychiatric hospitals as a child, had a learning disability, and had been placed in special education classes.[4] The lower courts denied Brumfield an Atkins hearing and sentenced him to death.[4]\n",
        "type": [
            "murder"
        ]
    },
    "136": {
        "link": "/wiki/George_Floyd_protests_in_Louisiana",
        "title": "George Floyd protests in Louisiana",
        "date": "May 28, 2020 – September 2020",
        "year": "2020",
        "location": "Louisiana, United States",
        "state": "Louisiana",
        "place": "Alexandria",
        "county": "Rapides Parish",
        "paragraph": "\nThis is a list of George Floyd protests in Louisiana, United States.\nOn May 31, dozens of protesters walked peacefully through downtown Alexandria chanting for \"justice, peace, and equality.\"[3] On June 2, another crowd held a protest at the Rapides Parish Courthouse, and on June 3, several hundred protesters marched to the Alexandria Public Safety Complex.[4]\n",
        "type": [
            "riot"
        ]
    },
    "137": {
        "link": "/wiki/Charles_Sallier",
        "title": "Charles Sallier",
        "date": "",
        "year": "",
        "location": "",
        "state": "Louisiana",
        "place": "Lake Charles",
        "county": "Calcasieu Parish",
        "paragraph": "Lake Charles, Louisiana was named for Charles Sallier, an early settler of the area.\nMartin and Dela LeBleu were among the first to settle near Lake Charles, in the area called LeBleu Settlement. They arrived in Lake Charles in 1781 from Bordeaux, France, and settled approximately six miles east of present-day Lake Charles, Louisiana. Soon after, many immigrants began arriving in the area to settle. Among them was Charles Anselm Sallier.[1]\nCharles Sallier moved to Lake Charles and married the LeBleus' daughter, Catherine. They settled near Lake Charles (the lake) and had six children. As legend tells it, one day Charles Sallier thought that Catherine was having an affair with the famous pirate, Jean Lafitte. In rage, he shot at his wife and assumed she was dead. In guilt and regret, Charles ran off. However, Catherine had survived the shot by only a simple piece of jewelry – her brooch. It is rumored that Catherine's brother, Arsene, and Lafitte gave chase to Sallier and he was never heard from again.\n",
        "type": []
    },
    "138": {
        "link": "/wiki/March_14,_1891_New_Orleans_lynchings",
        "title": "March 14, 1891 New Orleans lynchings",
        "date": "March 14, 1891",
        "year": "1891",
        "location": "New Orleans, Louisiana, U.S.",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nThe March 14, 1891, New Orleans lynchings were the murders of 11 Italian Americans and immigrants in New Orleans, Louisiana, by a mob for their alleged role in the murder of police chief David Hennessy after some of them had been acquitted at trial. It was the largest single mass lynching in American history.[2][3][note 1] Most of the lynching victims accused in the murder had been rounded up and charged due to their Italian ethnicity.[6]\nThe lynching took place the day after the trial of nine of the nineteen men indicted in Hennessy's murder. Six of these defendants were acquitted, and a mistrial was declared for the remaining three because the jury failed to agree on their verdicts. There was a widespread belief in the city that Italian-American organized crime was responsible for the killing of the police chief, in a period of anti-Italian sentiment and rising crime. Italian-American voters were also known to prefer the scandal plagued city political machine to the new Reform Democrat Mayor, whose own role in inciting the violence that followed may well have been an attempt to misuse government power for the repression of his political opponents\n",
        "type": [
            "lynching",
            "riot",
            "murder",
            "killing"
        ]
    },
    "139": {
        "link": "/wiki/2016_shooting_of_Baton_Rouge_police_officers",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "year": "2016",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\nThe shooting occurred during a period of unrest in Baton Rouge, though it is unclear if the events are related.[11] Baton Rouge was experiencing ongoing protests following the officer-involved killing of Alton Sterling less than two weeks before on July 5.[12][13] On July 7, the FBI's New Orleans field office issued a warning about \"threats to law enforcement and potential threats to the safety of the general public\" stemming from the death of Sterling.[14] Within the previous week, four suspects were arrested in connection with an alleged plot to kill Baton Rouge police officers, which was described as a credible threat by law enforcement officials.[12][15] Ten days earlier, five police officers were killed in a mass shooting in Dallas.[6]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "140": {
        "link": "/wiki/Dinerral_Shavers",
        "title": "Dinerral Shavers",
        "date": "December 28, 2006(2006-12-28) (aged 25) New Orleans, Louisiana",
        "year": "2006",
        "location": "",
        "state": "Louisiana",
        "place": "New Orleans",
        "county": "Orleans Parish",
        "paragraph": "\nDinerral Jevone \"Dick\" Shavers (March 19, 1981 — December 28, 2006) was an American jazz drummer and educator from New Orleans, Louisiana, who was best known as a member of the Hot 8 Brass Band.\nShavers was a founding member of the Hot 8 Brass Band.  He also taught music at L.E. Rabouin Career Magnet High School and created music programs for disadvantaged local youths. He appeared in the 2006 Spike Lee documentary film When the Levees Broke discussing the devastation of his family home in the Lower 9th Ward following Hurricane Katrina.\n",
        "type": [
            "murder"
        ]
    },
    "141": {
        "link": "/wiki/Coushatta_massacre",
        "title": "Coushatta massacre",
        "date": "August 1874",
        "year": "1874",
        "location": "Coushatta, Louisiana",
        "state": "Louisiana",
        "place": "",
        "county": "",
        "paragraph": "The Coushatta massacre (1874) was an attack by members of the White League, a white supremacist paramilitary organization composed of white Southern Democrats, on Republican officeholders and freedmen in Coushatta, the parish seat of Red River Parish, Louisiana.  They assassinated six white Republicans and five to 20 freedmen who were witnesses.[1][2]\nThe White League had organized to restore white supremacy by driving Republicans out of Louisiana, disrupting their political organizing, and intimidating or murdering freedmen.[3]  Like the Red Shirts and other \"White Line\" organizations, they were described as \"the military arm of the Democratic Party.\"\nIn the period after the American Civil War, Marshall H. Twitchell, a Union veteran from Vermont who had led United States Colored Troops, passed an administrative examination and came to Red River Parish, Louisiana to become an agent for the Freedmen's Bureau.  He married Adele Coleman, a young local woman. Her family taught him about cotton farming. In 1870, Twitchell was elected as a Republican to the Louisiana State Senate. He appointed his brother and three brothers-in-law (the latter natives of the parish) to local positions, including sheriff, tax assessor and clerk of court.  Twitchell worked to promote education and to extend public representation and civil rights to the former slaves, known as freedmen.[1]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "142": {
        "link": "/wiki/Brad_Garafola",
        "title": "2016 shooting of Baton Rouge police officers",
        "date": "July 17, 2016 (2016-07-17) 8:42 – c. 8:48 a.m. (CDT)",
        "year": "2016",
        "location": "Baton Rouge, Louisiana, United States",
        "state": "Louisiana",
        "place": "Baton Rouge",
        "county": "East Baton Rouge Parish",
        "paragraph": "\nOn July 17, 2016, Gavin Eugene Long shot six police officers in Baton Rouge, Louisiana in an ambush attack,[8] in the wake of the shooting of Alton Sterling. Three died and three were hospitalized, one critically; of the officers who died, two were members of the Baton Rouge Police Department, while the third worked for the East Baton Rouge Parish Sheriff's Office.[9] Long, who associated himself with organizations linked to black separatism and the sovereign citizen movement,[10] was shot and killed by a SWAT officer during a shootout with police at the scene.\nThe shooting occurred during a period of unrest in Baton Rouge, though it is unclear if the events are related.[11] Baton Rouge was experiencing ongoing protests following the officer-involved killing of Alton Sterling less than two weeks before on July 5.[12][13] On July 7, the FBI's New Orleans field office issued a warning about \"threats to law enforcement and potential threats to the safety of the general public\" stemming from the death of Sterling.[14] Within the previous week, four suspects were arrested in connection with an alleged plot to kill Baton Rouge police officers, which was described as a credible threat by law enforcement officials.[12][15] Ten days earlier, five police officers were killed in a mass shooting in Dallas.[6]\n",
        "type": [
            "murder",
            "shooting",
            "killing",
            "mass shooting"
        ]
    },
    "143": {
        "link": "/wiki/Gus_Kallio",
        "title": "Gus Kallio",
        "date": "March 2, 1962Monroe, Louisiana",
        "year": "1962",
        "location": "",
        "state": "Louisiana",
        "place": "Canada",
        "county": "East Baton Rouge Parish",
        "paragraph": "Gustav Kallio (May 17, 1891 – March 2, 1962) was a Finnish born professional wrestler known under the ring name Gus Kallio or Gust Kallio. Kallio's wrestling career peaked in the 1920s and 1930s where he was known as the \"King of the Welterweights\" and later on \"King of the Middleweights\" as he held multiple world titles in those two weight divisions.\nGustav Kallio was born as August Hassinen in 1891 in Karttula, Finland.[6] He immigrated to the United States with his brother Issac Hassinen in 1913[6][7] when both were in their early 20s. Issac moved on to Canada, while Gus stayed in the US wrestling under the name Gus Kallio.\nKallio was about 15 years old when Kallio and his father attended a professional wrestling event that featured Billy Sandow, a successful middleweight wrestler that participated in Barnstorming tours. Seeing the success of the relatively small Sandow inspired Kallio to become a wrestler himself.[3] Kallio made his debut in 1916 under the name \"Gus Kallio\" (some placed he was billed as \"Gust Kallio\") and began competing in the Welterweight division,[5] a weight class with a top weight limit of 155 lb (70 kg). Kallio's conditioning earned him the nickname \"the Finnish strong boy\".[8] On October 3, 1921 Kallio defeated Jack Reynolds to win the National Wrestling Association's World Welterweight Championship.[9] Kallio retained the title through at least 1923, earning the nickname \"the Welterweight King\".[9][10] During the 1920s Kallio often travelled around the United States, facing regional champions such as the Navy champion Jack Rich, Royal Van Dusen or Canadian Champion .[10] On August 7, 1928, Kallio became the top Middleweight in the world, defeating Charlie Fisher to become the World Middleweight Champion in two and a half hour long match.[11] Kallio later proved his incredible condition when he wrestled Henry Jones in a three-hour match before winning the bout.[12]\n",
        "type": []
    }
}