{
    "0": {
        "link": "/wiki/Charles_Thurber",
        "title": "Charles Thurber",
        "date": "",
        "year": "",
        "location": "",
        "state": "North Dakota",
        "place": "Grand Forks",
        "county": "Grand Forks County",
        "paragraph": "Charles Thurber was a black man lynched in Grand Forks, North Dakota on October 24, 1882.[1] A plaque was installed in 2020 to memorialize Thurber,[2] whose lynching took place on the St. Paul, Minneapolis and Manitoba Railway (later becoming the Great Northern Railway) bridge over the Red River between Grand Forks, North Dakota and East Grand Forks, Minnesota.[3] \nThurber was accused of raping two white women, one the wife of a railroad worker and the other described as a \"Norwegian servant girl.\" According to one of the illustrated North Dakota Mysteries and Oddities books, at least one of Thurber's accusers may have recanted her story.\nThe lynching was described in the Daily Herald (which is now the Grand Forks Herald) in articles that are quite shocking to modern readers.\nFor example, at one point the headline writer used poetry, as follows:\n",
        "type": [
            "lynching"
        ]
    },
    "1": {
        "link": "/wiki/Sophia_Eberlein",
        "title": "Sophia Eberlein",
        "date": "1931Harvey, North Dakota",
        "year": "1931",
        "location": "",
        "state": "North Dakota",
        "place": "Harvey",
        "county": "Wells County",
        "paragraph": "Sophia Eberlein, (1889–1931), was a German from Russia emigrant beaten to death by her second husband Jacob Bentz in her home in Harvey, North Dakota.  According to author William Jackson, the ghost of Sophie might be haunting a library built on this location.[1]\nSophia Eberlein was born in the Russian Empire and emigrated to the United States. She married Hugo Eberlein, a well-known Harvey businessman, and had two daughters, Lillian and Alice. After Hugo's death in 1928, Sophia married Bentz. One night Bentz bludgeoned Sophia to death while she slept. He did his best to clean up the scene of the crime and tried to make Sophie's death look like a car accident. However, when Sophia's daughter Lillian came home for the funeral, she found blood in the house and reported her findings to the police. Bentz admitted the crime during the investigation and was sentenced to life in prison. He died in 1944 in the state penitentiary.[2]\nIn 1990 a new library was built on the site of the former Eberlein house. According to author William Jackson, the librarian's office is built directly over the site where Eberlein's bedroom was and librarians report cold chills and other oddities.[2]\n",
        "type": [
            "murder"
        ]
    },
    "2": {
        "link": "/wiki/Capital_punishment_in_North_Dakota",
        "title": "Capital punishment in North Dakota",
        "date": "",
        "year": "",
        "location": "",
        "state": "North Dakota",
        "place": "Cass County",
        "county": "Cass County",
        "paragraph": "\nCapital punishment was abolished in the U.S. state of North Dakota in 1973.[1] Historically, a total of eight people have been executed in North Dakota, including one execution prior to North Dakota attaining statehood.\nAccording to the North Dakota Penal Code, the imposing of sentences was handed to a jury, with the suggested punishment for first-degree murder being death by hanging or life imprisonment. Until 1903 executions were carried out in public. The first private execution was that of John Rooney, who was hanged inside the Cass County prison on October 17, 1905. Rooney was the last person executed in North Dakota. In 1915, the death penalty was abolished for ordinary murder, commuting the death sentence of Joe Milo, who was convicted of double murder in course of a robbery.[2] It remained for treason and murder committed by an inmate already serving a life sentence, however, nobody was executed for these offenses until the death penalty was finally abolished in 1973.\nNo federal executions have ever taken place in North Dakota. On February 8, 2007, Alfonso Rodriguez, Jr. was sentenced to death for the kidnapping and murder of Dru Sjodin and is now the only person on federal death row for a crime committed in North Dakota.[3] Because Rodriguez took Sjodin's corpse across state lines, he was eligible for federal prosecution, and therefore for the death penalty.[4] U.S. District Judge Ralph R. Erickson arranged that Rodriguez would be executed according to South Dakota rules.[5] Rodriguez was the first person in North Dakota to receive a death sentence in over a century.[6]\n",
        "type": [
            "murder",
            "robbery",
            "robber",
            "kidnapping"
        ]
    },
    "3": {
        "link": "/wiki/Dru_Sjodin",
        "title": "Murder of Dru Sjodin",
        "date": "November 22, 2003(2003-11-22) (aged 22) Grand Forks, North Dakota, United States",
        "year": "2003",
        "location": "",
        "state": "North Dakota",
        "place": "Grand Forks",
        "county": "Grand Forks County",
        "paragraph": "\nDru Katrina Sjodin (September 26, 1981 – c. November 22, 2003) was an American woman who was abducted from the Columbia Mall parking lot in Grand Forks, North Dakota, by Alfonso Rodriguez Jr., on November 22, 2003.[1] Her disappearance and murder garnered great media coverage throughout the United States and prompted the creation of the Dru Sjodin National Sex Offender Public Registry.\nAt 4:00 p.m. on Saturday, November 22, 2003, Sjodin, a 22-year-old college student at the University of North Dakota and Gamma Phi Beta sorority member, finished her shift at the Victoria's Secret store located in the Columbia Mall in Grand Forks, North Dakota.[2] After shopping for and purchasing a new purse from Marshall Field's, Sjodin left the mall and began walking to her 1994 Oldsmobile Cutlass.[3] During this time, Sjodin was speaking with her boyfriend, Chris Lang, on her cell phone. Four minutes into their conversation, Lang reports Sjodin was saying \"Okay, okay,\" before the call abruptly ended.[4] Lang suspected that the call was just dropped and because Sjodin didn't give any sense of urgency, Lang thought nothing of it.[5] About three hours later, Lang received another call from her cell phone, but heard only static and the sound of buttons being pressed.[2] It was reported by authorities this second phone call originated somewhere near Fisher, Minnesota,[6] but that has remained unsubstantiated. With this second call and Sjodin not showing up at her other job at the El Roco nightclub, there was concern for her whereabouts.[7]\nA week later, on December 1, a suspect, 50-year-old registered level-3 sex offender Alfonso Rodriguez Jr. (born February 18, 1953),[8] was arrested in connection with Sjodin's disappearance.[2]\n",
        "type": [
            "murder"
        ]
    },
    "4": {
        "link": "/wiki/George_Floyd_protests_in_North_Dakota",
        "title": "George Floyd protests in North Dakota",
        "date": "May 30, 2020 – June 7, 2020",
        "year": "2020",
        "location": "North Dakota, United States",
        "state": "North Dakota",
        "place": "North Dakota North Dakota",
        "county": "Morton County",
        "paragraph": "\nThis is a list of protests in North Dakota related to the murder of George Floyd.\nHundreds gathered to share solidarity for the life of George Floyd at Peace Park on May 30. A witness said she saw the passenger of a pickup truck displaying a Confederate Flag and Trump 2020 regalia point a gun at the protesters.[3]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "5": {
        "link": "/wiki/Zip_to_Zap",
        "title": "Zip to Zap",
        "date": "May 9–11, 1969",
        "year": "1969",
        "location": "Mainly in Zap, North Dakota",
        "state": "North Dakota",
        "place": "Zap",
        "county": "Mercer County",
        "paragraph": "Students\nPolice\nChuck Stroup\n",
        "type": [
            "riot"
        ]
    },
    "6": {
        "link": "/wiki/Jacob_Bentz",
        "title": "Sophia Eberlein",
        "date": "1931Harvey, North Dakota",
        "year": "1931",
        "location": "",
        "state": "North Dakota",
        "place": "Harvey",
        "county": "Wells County",
        "paragraph": "Sophia Eberlein, (1889–1931), was a German from Russia emigrant beaten to death by her second husband Jacob Bentz in her home in Harvey, North Dakota.  According to author William Jackson, the ghost of Sophie might be haunting a library built on this location.[1]\nSophia Eberlein was born in the Russian Empire and emigrated to the United States. She married Hugo Eberlein, a well-known Harvey businessman, and had two daughters, Lillian and Alice. After Hugo's death in 1928, Sophia married Bentz. One night Bentz bludgeoned Sophia to death while she slept. He did his best to clean up the scene of the crime and tried to make Sophie's death look like a car accident. However, when Sophia's daughter Lillian came home for the funeral, she found blood in the house and reported her findings to the police. Bentz admitted the crime during the investigation and was sentenced to life in prison. He died in 1944 in the state penitentiary.[2]\nIn 1990 a new library was built on the site of the former Eberlein house. According to author William Jackson, the librarian's office is built directly over the site where Eberlein's bedroom was and librarians report cold chills and other oddities.[2]\n",
        "type": [
            "murder"
        ]
    },
    "7": {
        "link": "/wiki/Lynching_of_Charles_Bannon",
        "title": "Lynching of Charles Bannon",
        "date": "",
        "year": "new 1931",
        "location": "",
        "state": "North Dakota",
        "place": "Haven",
        "county": "Morton County",
        "paragraph": "The lynching of Charles Bannon took place in the US state of North Dakota on January 29, 1931. The self-confessed killer of a family of six, Bannon was taken from the jail in Schafer and hanged from a bridge, becoming the last victim of a lynching in the state.\nCharles Bannon, aged 22, was a hired hand on the Haven family farm just north of Schafer. The family consisted of the parents and four children, the youngest of whom was two months old. They had been there for over ten years and apparently were well off. After February 9, 1930, no member of the family had been seen. Bannon stayed on the farm, telling the neighbors that the Havens had left and he was renting from them. Together with his father he took care of the livestock, staying there until the fall. In October they began selling property and crops, raising suspicion among the neighbors, and the father left for Oregon, allegedly to search for the Havens. In December, Charles was arrested and charged with grand larceny, and during the investigation it was discovered that the Havens had been murdered.[1]\nHavens soon admitted guilt, giving first a statement and then two confessions, in which the details changed slightly. He confessed to having accidentally killed one of the children, and then killing all the others out of fear. He claimed his father had been innocent, but the father was also arrested, in Oregon, and moved back to North Dakota as an alleged accomplice.[1]\n",
        "type": [
            "murder",
            "killing",
            "lynching"
        ]
    },
    "8": {
        "link": "/wiki/Matthew_Mechtel",
        "title": "2006 United States House of Representatives election in North Dakota",
        "date": "",
        "year": "2006",
        "location": "",
        "state": "North Dakota",
        "place": "",
        "county": "",
        "paragraph": "Earl Pomeroy\nDemocratic–NPL\nEarl Pomeroy\nDemocratic–NPL\nThe 2006 U.S. House of Representatives election for the state of North Dakota's at-large congressional district was held November 7, 2006. The incumbent, Democratic-NPL Congressman Earl Pomeroy was re-elected to his eighth term, defeating Republican candidate Matt Mechtel.\n",
        "type": []
    },
    "9": {
        "link": "/wiki/Murder_of_Amanda_Froistad",
        "title": "Murder of Amanda Froistad",
        "date": "",
        "year": "new 1995",
        "location": "",
        "state": "North Dakota",
        "place": "",
        "county": "",
        "paragraph": "\nIn 1995, Larry Froistad murdered his five-year-old daughter, Amanda Froistad. After he set their North Dakota home on fire while she was inside, Larry confessed to the crime on an email list with two hundred members. Only a few reported him. This incident is an example of an online version of the bystander effect.[1]\nIn addition, the incident was a notable failure of child welfare.[2] Though a therapist reported that Larry had sexually abused Amanda; the authorities of South Dakota, where the therapist practiced, and of North Dakota, where Amanda lived, did not coordinate with each other and failed to protect her.\n",
        "type": [
            "murder",
            "arson"
        ]
    },
    "10": {
        "link": "/wiki/John_Rooney_(murderer)",
        "title": "John Rooney (murderer)",
        "date": "",
        "year": "new 1902",
        "location": "",
        "state": "North Dakota",
        "place": "Fargo",
        "county": "Cass County",
        "paragraph": "\nJohn Rooney (1880 – 17 October 1905) was an American convicted murderer who was the last person executed by North Dakota.\nOn 26 August 1902, a farm worker named Harold Sweet was shot and killed during a robbery near the Chicago, Milwaukee & St. Paul Railroad tracks on the west side of Fargo, North Dakota. Rooney was arrested and charged with first degree murder. In January 1903, Rooney was convicted by a jury and on 31 March 1903, he was sentenced to death by hanging.\n",
        "type": [
            "murder",
            "robbery",
            "robber"
        ]
    },
    "11": {
        "link": "/wiki/List_of_people_executed_in_North_Dakota",
        "title": "List of people executed in North Dakota",
        "date": "",
        "year": "",
        "location": "",
        "state": "North Dakota",
        "place": "",
        "county": "",
        "paragraph": "\nThe following is a list of people executed by the U.S. state of North Dakota from 1885 to 1905.\nCapital punishment was abolished in North Dakota in 1973.[1] Only 8 people were ever executed in North Dakota, all via hanging.[2]\n",
        "type": []
    }
}