{
    "0": {
        "link": "/wiki/Pierre_Colas",
        "title": "Pierre Colas",
        "date": "August 26, 2008(2008-08-26) (aged 32) Nashville, Tennessee USA",
        "year": "2008",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Pierre Robert Colas (January 13, 1976 – August 26, 2008) was a German anthropologist, archaeologist and epigrapher. As a Mayanist scholar who investigated the pre-Columbian Maya civilization of ancient Mesoamerica, Colas was well known for his contributions to the study of the Maya writing system, and his archaeological work on cave sites used by the Maya. His analysis of onomastics—personal naming practices and titles of rank—in Classic-era Maya inscriptions was the first major publication of its kind. Colas also conducted ethnographic studies and surveys among contemporary Maya communities living in Belize. In Europe, he had close involvement with the organisation of academic conferences and workshops on the Maya, as a workshop tutor, presenter of original papers, and editor of several conference proceedings and reports.[1]\nSince 2006 Colas held a position as assistant professor in the Anthropology Department of the College of Arts and Science at Vanderbilt University, Nashville, Tennessee.[2]\nOn the evening of August 26, 2008 Dr. Colas was shot dead in his Nashville home. He was 32 years old.[3]\n",
        "type": []
    },
    "1": {
        "link": "/wiki/Lynching_of_Ephraim_Grizzard",
        "title": "Lynching of Ephraim Grizzard",
        "date": "April 30, 1892",
        "year": "1892",
        "location": "Woodland Street Bridge, Nashville, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "\nEphraim Grizzard and Henry Grizzard were African-American brothers who were lynched in Middle Tennessee in April 1892 as suspects in the assaults on two white sisters. Henry Grizzard was hanged by a white mob on April 24 near the house of the young women in Goodlettsville, Tennessee. \nEphraim and another brother, John Grizzard, had been arrested and taken to jail in Nashville, along with two other suspects. John Grizzard and another detainee were released because there was no evidence that they had been involved in the alleged assaults. However, on April 30, a white mob estimated to number as many as 10,000 overpowered the police guards and took Ephraim Grizzard from the jail. He was dragged through the streets to the Woodland Street Bridge, where he was hanged. Members of the mob then shot his dead body more than two hundred times. \n",
        "type": [
            "assault",
            "lynching",
            "murder"
        ]
    },
    "2": {
        "link": "/wiki/James_Antonio_Barnes",
        "title": "James Antonio Barnes",
        "date": "",
        "year": "new 1988",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "James Antonio Barnes (born April 27, 1944) is an American serial killer who attacked five prostitutes around Memphis, Tennessee from August to November 1988, killing three and wounding two others in what he claimed to be orders from his other personalities. Although considered a suspect in a total of seven killings, he was only convicted of his confirmed crimes and sentenced to 40 years imprisonment.\nLittle is known about Barnes' early life. Born on April 27, 1944, in Detroit, Michigan, he was regularly mistreated by his alcoholic parents, with Barnes claiming that his mother had attempted to miscarry by ingesting a quantity of drugs. In another instance, he had been put in a sack and lowered into a well as punishment for misbehaving.[1] He started exhibiting signs of mental illness early in his life, and had to be treated in various institutions around Michigan, Tennessee and Missouri for depression, hallucinations and drug abuse. In between these treatments, Barnes committed a variety of petty crimes, with his most notable conviction being for a bank robbery committed in Detroit.\nAfter being released from prison, Barnes found employment as a factory worker for a General Motors plant, but was laid off after company sales went down. Left without a home or any close living relatives, he decided to move to Memphis, Tennessee, settling in the Knightwoods neighborhood of Parkway Village.[1]\n",
        "type": [
            "robbery",
            "murder",
            "killing",
            "robber"
        ]
    },
    "3": {
        "link": "/wiki/Payne_v._Tennessee",
        "title": "Payne v. Tennessee",
        "date": "",
        "year": "new 1987",
        "location": "",
        "state": "Tennessee",
        "place": "Payne",
        "county": "Robertson County",
        "paragraph": "Payne v. Tennessee, 501 U.S. 808 (1991), was a United States Supreme Court case which held that testimony in the form of a victim impact statement is admissible during the sentencing phase of a trial and, in death penalty cases, does not violate the Cruel and Unusual Punishment Clause of the Eighth Amendment.[1] Payne narrowed two of the Courts' precedents: Booth v. Maryland (1987) and South Carolina v. Gathers (1989).\nPervis Tyrone Payne (born March 1, 1967) was the defendant in this trial prosecuted in Tennessee. According to his criminal conviction, on Saturday, June 27, 1987, he attempted to rape an acquaintance of his, Charisse Christopher, and murdered her and her two-year-old daughter, Lacie Jo. Neighbors alleged they heard noises and yelling, and called the police. Upon arriving, a police officer \"immediately encountered Payne who was leaving the apartment building, so covered in blood that he appeared to be 'sweating blood'\".\nThe defendant, in contrast, said that he was in the building on a visit to his girlfriend and hearing screams from the room of the murder victims he went in to help. Payne and many other witnesses saw a man leaving the crime scene shortly before Payne arrived. He had found the knife still stuck in the throat of Charisse and pulled it out. He fled when he saw police arrive.\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "4": {
        "link": "/wiki/Steel_Arm_Dickey",
        "title": "Steel Arm Dickey",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Etowah",
        "county": "McMinn County",
        "paragraph": "Claude \"Steel Arm\" Dickey (June 2, 1896 – March 11, 1923) was a Negro leagues pitcher for the first Negro Southern League and  Negro National League. Researchers currently believe his real name is Claude Dickey, based on census records and World War I draft registration cards. Newspaper reports show he appears as Walter Claude, John Claude, and Jean Claude. Many reports simply call him Steel Arm Dickey.\nDickey had a short career, dying at the age of 26 in Etowah, Tennessee.\nAccording to his death certificate, Dickey was killed after he was shot by a pistol. News reports later noted Dickey was killed by a knife. Either way, the medical examiner noted he died from a loss of blood, that he was wounded in the neck, and there was extensive damage to his esophagus. He also ruled the death a homicide. The informant appears to be a family member, Martin Dickey.\n",
        "type": []
    },
    "5": {
        "link": "/wiki/Lynching_of_Joseph_Upchurch",
        "title": "Lynching of Joseph Upchurch",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Paris",
        "county": "Henry County",
        "paragraph": "Joseph Upchurch was an African-American man who was lynched by a mob near Paris, Tennessee, on June 17, 1927.[1]\nAccording to the Memphis Evening Appeal, Paris sheriff D. T. Caldwell was at Joseph Upchurch's house (in the northwest part of Henry County, Tennessee) on June 17, 1927, after being told by his relatives that he had been acting \"queerly\". The paper said \"Upchurch is said to have been mentally unbalanced and threatened other negroes of the neighborhood\", and when Caldwell attempted to arrest him, Upchurch shot him. Caldwell died soon thereafter, and a deputy locked Upchurch in a cabin. At the time the report was printed, Upchurch was still in the cabin; the deputy hadn't tried to move him to town because of the threat of mob violence, but a group of deputies was supposedly on the way to retrieve him.[2]\nThe New York Times reported the next day on the events, and said that a mob of some 50 men had arrived at the cabin in which Upchurch was locked, and shot him. The cabin \"was riddled with bullets by the posse\".[3]\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "6": {
        "link": "/wiki/Houston_v._State",
        "title": "Houston v. State",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "Houston v. State, 583 S.W.2d 267 (1980), was a case decided by the Supreme Court of Tennessee that held that \"repeated shots or blows\" was sufficient circumstantial evidence to prove premeditation and deliberation for first degree murder.[1]\nHouston was overruled by the case State v. Brown, which required more evidence than repeated blows to show deliberation.[2]\nText of Houston v. State (1980) is available from: Google Scholar  Justia \n",
        "type": [
            "murder"
        ]
    },
    "7": {
        "link": "/wiki/Battle_of_Athens_(1946)",
        "title": "Battle of Athens (1946)",
        "date": "August 1–2, 1946",
        "year": "1946",
        "location": "Athens, Tennessee, United States35°26′31″N 84°35′31″W﻿ / ﻿35.442°N 84.592°W﻿ / 35.442; -84.592Coordinates: 35°26′31″N 84°35′31″W﻿ / ﻿35.442°N 84.592°W﻿ / 35.442; -84.592",
        "state": "Tennessee",
        "place": "Athens",
        "county": "McMinn County",
        "paragraph": "\n\nRebellion victory\n",
        "type": []
    },
    "8": {
        "link": "/wiki/Karen_Howell",
        "title": "Lillelid murders",
        "date": "",
        "year": "new 1997",
        "location": "",
        "state": "Tennessee",
        "place": "Greene County",
        "county": "Greene County",
        "paragraph": "\nThe Lillelid murders refers to a criminal case in Greene County, Tennessee, United States, where three members of the Lillelid family were murdered on April 6, 1997. Vidar Lillelid (aged 34), Delfina Lillelid (aged 28), and their daughter Tabitha (aged 6), and son Peter (aged 2) were shot on a deserted rural road near Baileyton during a carjacking committed by a group of youths. Vidar and Delfina were found dead at the scene, while Tabitha died after being transported to the hospital. Peter survived, but, as a result of the shooting, was left with disabilities.[1] Six young people from Kentucky, including two minors, were convicted of felony murder for the deaths of Vidar, Delfina, and Tabitha Lillelid, with all six perpetrators receiving three life sentences, and an additional sentence of 25 years each for the attempted murder of Peter Lillelid.[2]\nVidar Lillelid grew up in Bergen, Norway, and in 1985 moved to United States. In 1989, Lillelid married Delfina Zelaya, a first-generation Honduran-American from New York City, whom he had met through their common involvement in the Jehovah's Witnesses denomination.[citation needed]. By 1997, the Lillelids had two children: 6-year-old daughter Tabitha (1990-1997) and 2-year-old son Peter (b.1995).\n",
        "type": [
            "murder",
            "kidnapping",
            "shooting"
        ]
    },
    "9": {
        "link": "/wiki/Vanessa_Coleman",
        "title": "Murders of Channon Christian and Christopher Newsom",
        "date": "January 6, 2007",
        "year": "2007",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nCoordinates: 35°59′28″N 83°54′27″W﻿ / ﻿35.99113°N 83.907514°W﻿ / 35.99113; -83.907514\nChannon Gail Christian, aged 21, and Hugh Christopher Newsom Jr., aged 23, were from Knoxville, Tennessee, United States. They were kidnapped on the evening of January 6, 2007, when Christian's vehicle was carjacked. The couple were taken to a rental house. Both of them were raped, tortured, and murdered.[1][2][3] Four males and one female were arrested, charged, and convicted in the case. In 2007, a grand jury indicted Letalvis Darnell Cobbins, Lemaricus Devall Davidson, George Geovonni Thomas, and Vanessa Lynn Coleman on counts of kidnapping, robbery, rape, and murder.[4][5][6][7][8] Also in 2007, Eric DeWayne Boyd was indicted by a federal grand jury of being an accessory to a carjacking, resulting in serious bodily injury to another person, and misprision of a felony.[8] In 2018, Boyd was indicted on state-level charges of kidnapping, robbery, rape, and murder.[9]\nFour of the five defendants (Eric Boyd, Letalvis Cobbins, Lemaricus Davidson, and George Thomas) had multiple prior felony convictions.[10] After a jury trial, Davidson was convicted and sentenced to death by lethal injection.[11][12] Cobbins and Thomas were convicted and sentenced to life in prison without parole.[13][14][15][16] Vanessa Coleman was convicted of facilitating the crimes and sentenced to 53 years.[17] Eric Boyd was convicted at the federal level and sentenced to 18 years in federal prison for being an accessory after the fact to carjacking.[18][19] He was convicted on state level charges over a decade later in 2019.[20]\n",
        "type": [
            "torture",
            "rape",
            "kidnapped",
            "robbery",
            "theft",
            "murder",
            "kidnapping",
            "robber"
        ]
    },
    "10": {
        "link": "/wiki/Tommy_Burks",
        "title": "Tommy Burks",
        "date": "October 19, 1998(1998-10-19) (aged 58) Cookeville, Tennessee, U.S.",
        "year": "1998",
        "location": "",
        "state": "Tennessee",
        "place": "Cookeville",
        "county": "Putnam County",
        "paragraph": "Fred Thomas Burks (May 22, 1940 – October 19, 1998) was a farmer and Democratic Party politician in Tennessee, United States. He served in the Tennessee House of Representatives from 1970 until 1978, and in the Tennessee State Senate from 1978 until his assassination in 1998.[1]\nBorn in Cookeville, Tennessee, Burks was one of the most conservative Democrats in the state legislature. He opposed the teaching of evolution in school science classes (twice introducing legislation to restrict its teaching), legal abortion, gambling, and a state lottery. His views seemed to have been very popular and in line with a large number of voters within his rural district.\nBurks was an energetic legislator who almost never missed a floor or committee session. It is reported that he would on some occasions arrive at a session having already gotten up on his farm, delivered a load of hogs to Knoxville (approximately 90 miles east of his home) and then driven to the State Capitol in Nashville (100 miles west of his home and 190 miles west of Knoxville). Despite the 100-mile distance, and unlike most legislators from parts of the state a considerable distance from Nashville, Burks made it a practice to go home to his district and his farm almost every night, even during legislative sessions.\n",
        "type": [
            "murder"
        ]
    },
    "11": {
        "link": "/wiki/Lynching_of_Ed_Johnson",
        "title": "Lynching of Ed Johnson",
        "date": "",
        "year": "new 1906",
        "location": "",
        "state": "Tennessee",
        "place": "Chattanooga",
        "county": "Hamilton County",
        "paragraph": "\nOn March 19, 1906, Ed Johnson, a young African American man, was murdered by a lynch mob in his home town of Chattanooga, Tennessee. He had been sentenced to death for the rape of Nevada Taylor, but Justice John Marshall Harlan of the United States Supreme Court had issued a stay of execution. To prevent delay or avoidance of execution, a mob broke into the jail where Johnson was held, and abducted and lynched him from the Walnut Street Bridge.\nDuring Johnson's incarceration there was much public interest in the case, and many people, including court officers, feared a possible lynch attempt.[1] The day after his murder saw widespread strikes among the black community in Chattanooga. Two thousand people attended his funeral the following day.[2]\n",
        "type": [
            "lynching",
            "murder",
            "rape"
        ]
    },
    "12": {
        "link": "/wiki/Coal_Creek_War",
        "title": "Coal Creek War",
        "date": "April 1891 – August 1892",
        "year": "1891",
        "location": "Tennessee, United States",
        "state": "Tennessee",
        "place": "Anderson County",
        "county": "Anderson County",
        "paragraph": "The Coal Creek War was an early 1890s armed labor uprising in the southeastern United States that took place primarily in Anderson County, Tennessee. This labor conflict ignited during 1891 when coal mine owners in the Coal Creek watershed began to remove and replace their company-employed, private coal miners then on the payroll with convict laborers leased out by the Tennessee state prison system.\nThese former wage-earning Coal Creek coal miners repeatedly attacked and burned both state prison stockades and mine properties, all while releasing hundreds of the state convict laborers from their bondage to the mine companies. Many of these same Coal Creek coal miners were also wounded or killed in small-arms skirmishes during the Coal Creek War, along with dozens of Tennessee state militiamen.\nOne historian describes the Coal Creek War as \"one of the most dramatic and significant episodes in all American labor history.\"[1]\n",
        "type": [
            "riot"
        ]
    },
    "13": {
        "link": "/wiki/Lynching_of_Eliza_Woods",
        "title": "Lynching of Eliza Woods",
        "date": "",
        "year": "new 1886",
        "location": "",
        "state": "Tennessee",
        "place": "Jackson",
        "county": "Madison County",
        "paragraph": "\nEliza Woods was an African-American woman who was lynched on 19 August 1886 in Jackson, Tennessee, after being accused of poisoning and killing her employer, Jessie Woolen.[1]\nWoods had been Woolen's cook. When it was found that Woolen's stomach contained arsenic and that Woods had a box of rat poison at home, it was concluded that she was responsible for the death.[2] A crowd of 1,000 was reportedly present when Woods was dragged from the jail and hanged naked in front of the courthouse. Bullets were then shot into her body.  This lynching was notable both for the gender of the victim and the biracial participation of the crowd.  Three years later, in 1889, Woolen's husband confessed that he had killed his wife.[3]\n",
        "type": [
            "lynching",
            "murder",
            "killing"
        ]
    },
    "14": {
        "link": "/wiki/Dolly_Stark",
        "title": "Dolly Stark",
        "date": "",
        "year": "new 1909",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "Monroe Randolph Stark (January 19, 1885 – December 1, 1924) was a college baseball coach and professional baseball player who coached the Mississippi A&M Aggies, now known as the Mississippi State Bulldogs to a 22–4 record in 1909.[1] He then went on to play shortstop for the Cleveland Naps and Brooklyn Dodgers from 1909 to 1912.[2]\nStark was killed by gunfire in Memphis, Tennessee[3] and is buried at Elmwood Cemetery in Memphis.[4]\n      National champion  \n      Postseason invitational champion  \n\n      Conference regular season champion   \n      Conference regular season and conference tournament champion\n\n      Division regular season champion\n      Division regular season and conference tournament champion\n\n      Conference tournament champion\n",
        "type": [
            "murder"
        ]
    },
    "15": {
        "link": "/wiki/James_Holt_Clanton",
        "title": "James Holt Clanton",
        "date": "August 27, 1871(1871-08-27) (aged 44) Knoxville, Tennessee",
        "year": "1871",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "James Holt Clanton (January 8, 1827 – September 27, 1871) was an American soldier, lawyer, legislator, and was later also a Confederate combatant. He enlisted in the United States Army for service during the Mexican–American War, and later was a Confederate Army brigadier general during the American Civil War. Following the war he returned to practicing law and later was murdered in a private feud in Tennessee.\nClanton was born in 1827 in Columbia County, Georgia,[1] a son of Nathaniel Holt Clanton. In 1835 the family relocated to Macon County, Alabama, where Clanton was raised and educated. Later he attended the University of Alabama located in Tuscaloosa, but he did not graduate. Clanton chose instead to join the U.S. Army and participate in the war with Mexico.\nIn 1846, Clanton first enlisted for six months as a private in the company of Capt. Rush Elmore, which belonged to Col. Bailie Peyton's regiment. When that term expired, Clanton joined the company of Capt. Preston Brooks of the Palmetto Regiment. Clanton and his regiment reached Mexico City following the September 1847 battle and after the occupation there had ended he returned home to Alabama.\n",
        "type": [
            "murder"
        ]
    },
    "16": {
        "link": "/wiki/Murder_of_Blair_Adams",
        "title": "Murder of Blair Adams",
        "date": "July 11, 1996(1996-07-11) (aged 31) Knoxville, Tennessee, U.S.",
        "year": "1996",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Robert Dennis Blair Adams (December 28, 1964 – July 11, 1996) was a Canadian man found murdered in a parking lot of an under-construction hotel off Interstate 40 outside of Knoxville, Tennessee, United States. His murder remains unsolved.[1]\nOn July 5, 1996, Blair Adams, a resident of Surrey, British Columbia, Canada, withdrew most of his money from his bank account and emptied his safe deposit box of cash, jewelry, gold, and platinum.[2][3] He then attempted to enter the United States via ferry from Victoria, British Columbia, to Seattle, Washington.[2] Immigration officials flagged Adams as a possible drug courier due to the large amount of cash he had with him. Once he was found to have convictions on drug and assault charges he was denied entry.[4]\nIn the early morning hours of July 9, Adams was discovered by Canadian border patrol officers attempting to cross the border on foot at the Pacific Highway Border Crossing.[1] Officials noted Adams had scratches covering his legs and hands.[1] Adams matched the description of a man implicated in an automobile theft, and the vehicle had been discovered abandoned near the Pacific Highway Border Crossing; however, he denied involvement and was freed on lack of evidence.[1]\n",
        "type": [
            "assault",
            "murder",
            "theft"
        ]
    },
    "17": {
        "link": "/wiki/Marcia_Trimble",
        "title": "Murder of Marcia Trimble",
        "date": "February 25, 1975 (1975-02-26) (aged 9) Nashville, Tennessee",
        "year": "1975",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Marcia Virginia Trimble was a nine-year-old girl who disappeared on February 25, 1975, while delivering Girl Scout Cookies in the affluent Green Hills area of Nashville, Tennessee, United States. Her body was discovered thirty-three days later on Easter Sunday, near the Trimble family home. She had been sexually assaulted. During the early years of their inquiry into the assault and murder, the police persisted in investigating one particular suspect, finally charging him in 1979, but he was released in 1980 for lack of evidence.\nIn 2008, thirty-three years after the killing, Jerome Sydney Barrett – not the person police had pursued in the 1970s – was charged with Trimble's assault and murder after DNA evidence recovered from her remains linked him to the crime. Barrett had been arrested just days after Trimble's disappearance on suspicion of an unrelated sexual assault, and was still in jail when Trimble's body was found. Despite this and his convictions for attacks on other women and children, police had not investigated him in relation to the murder. On July 18, 2009, a jury convicted him for the killing, and he was sentenced to forty-four years in prison.\nTrimble's murder occurred soon after two other crimes linked to Barrett:\n",
        "type": [
            "assault",
            "murder",
            "killing"
        ]
    },
    "18": {
        "link": "/wiki/Uk_Thang",
        "title": "Collierville Kroger shooting",
        "date": "September 23, 2021 (2021-09-23) c. 1:30 – c. 1:34 p.m. (CDT)",
        "year": "2021",
        "location": "240 New Byhalia Road, Collierville, Tennessee, US",
        "state": "Tennessee",
        "place": "Collierville",
        "county": "Shelby County",
        "paragraph": "\nThe Collierville Kroger shooting was a mass shooting that occurred on September 23, 2021, at a Kroger grocery store in Collierville, Tennessee. One person was killed and 13 others were injured before the gunman, identified as 29-year-old Uk Thang, committed suicide by gunshot. Thang was working at the store as a third-party vendor.[2][3] It was the second shooting in 2021 to occur at a Kroger-owned property; the first occurred at a King Soopers store in Boulder, Colorado, in March.[4]\nOn the day of the shooting, the gunman, Uk Thang, got into an altercation with another Kroger employee and was asked to leave at 7:00 a.m. He returned to his apartment and later left at 12:30 p.m. After calling his brother at 1:30 p.m. to tell him he would never see him again, Thang returned to the store and opened fire with two pistols and a rifle that he brought with him.[1] At the time of the shooting, 44 employees and a number of customers were inside the building.[5]\n",
        "type": [
            "murder",
            "shooting",
            "mass shooting"
        ]
    },
    "19": {
        "link": "/wiki/Sedley_Alley",
        "title": "Murder of Suzanne Marie Collins",
        "date": "July 12, 1985(1985-07-12) (aged 19) Millington, Tennessee",
        "year": "1985",
        "location": "",
        "state": "Tennessee",
        "place": "Millington",
        "county": "Shelby County",
        "paragraph": "Suzanne Marie Collins was a United States Marine Corps Lance Corporal who was tortured, raped, and murdered in 1985. At the time of her murder she was stationed at Naval Support Activity Mid-South in Millington, Tennessee. Collins was a student undergoing training at the base, and was scheduled to graduate from avionics training on the day of her murder. She is buried in Arlington National Cemetery. Suzanne Collins was the daughter of Jack and Trudy Collins. She graduated from John R. Lewis High School in Springfield, Virginia.\nOn the evening of July 11, 1985, Suzanne Marie Collins was abducted while jogging on the base, and was taken to nearby Edmund Orgill Park. There, the kidnapper severely beat Collins, fracturing her skull, before repeatedly shoving a tree limb up her vagina with enough force to penetrate her abdomen and tear one of her lungs. The autopsy would state that Collins died from blunt force trauma to the head and internal hemorrhaging from the tree limb.[1] The kidnapper then ditched the body and fled the scene.\nTwo Marines jogging near where Collins was abducted heard her scream and ran toward the sound. However, as they reached the scene, they saw a car leaving the area. They reported to base security and accompanied officers on a tour of the base, looking for the car. Unsuccessful, they returned to their barracks, but soon the Marines were called back to the security office. There they identified Sedley Alley's car, which had been stopped by officers. Alley and his wife gave statements to the base security personnel accounting for their whereabouts. The security personnel were satisfied with Alley's story, and Alley and his wife returned to their on-base housing. The two Marine witnesses returned to the security office shortly after Alley and his wife departed. The Marines disputed the couple's version of events, citing that the loud, distinct sounds made by the muffler on Alley's car matched those sounds they had heard prior to and during Collins' abduction. The security personnel indicated that since no one had yet been reported missing, there was nothing more that could be done. The Marines were thanked for their assistance and told to return to their barracks.[1]\n",
        "type": [
            "murder",
            "rape",
            "torture"
        ]
    },
    "20": {
        "link": "/wiki/Edmund_Zagorski",
        "title": "Edmund Zagorski",
        "date": "April 23, 1983",
        "year": "1983",
        "location": "",
        "state": "Tennessee",
        "place": "Robertson County",
        "county": "Robertson County",
        "paragraph": "\nEdmund George Zagorski (December 27, 1954 – November 1, 2018)[1] was an American convicted murderer from Michigan who was executed by the state of Tennessee for the 1983 murders of John Dotson and Jimmy Porter in Robertson County. Zagorski lured the two men into a wooded hunting ground under the pretense of selling them 100 lb (45 kg) of marijuana before shooting them and slitting their throats.[2]\nThe state of Tennessee made multiple attempts to execute Zagorski over the course of almost a decade. Ultimately, he became the first inmate legally executed by electrocution in almost six years in the United States on November 1, 2018.[3][4]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "21": {
        "link": "/wiki/Christopher_Newsom",
        "title": "Murders of Channon Christian and Christopher Newsom",
        "date": "January 6, 2007",
        "year": "2007",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nCoordinates: 35°59′28″N 83°54′27″W﻿ / ﻿35.99113°N 83.907514°W﻿ / 35.99113; -83.907514\nChannon Gail Christian, aged 21, and Hugh Christopher Newsom Jr., aged 23, were from Knoxville, Tennessee, United States. They were kidnapped on the evening of January 6, 2007, when Christian's vehicle was carjacked. The couple were taken to a rental house. Both of them were raped, tortured, and murdered.[1][2][3] Four males and one female were arrested, charged, and convicted in the case. In 2007, a grand jury indicted Letalvis Darnell Cobbins, Lemaricus Devall Davidson, George Geovonni Thomas, and Vanessa Lynn Coleman on counts of kidnapping, robbery, rape, and murder.[4][5][6][7][8] Also in 2007, Eric DeWayne Boyd was indicted by a federal grand jury of being an accessory to a carjacking, resulting in serious bodily injury to another person, and misprision of a felony.[8] In 2018, Boyd was indicted on state-level charges of kidnapping, robbery, rape, and murder.[9]\nFour of the five defendants (Eric Boyd, Letalvis Cobbins, Lemaricus Davidson, and George Thomas) had multiple prior felony convictions.[10] After a jury trial, Davidson was convicted and sentenced to death by lethal injection.[11][12] Cobbins and Thomas were convicted and sentenced to life in prison without parole.[13][14][15][16] Vanessa Coleman was convicted of facilitating the crimes and sentenced to 53 years.[17] Eric Boyd was convicted at the federal level and sentenced to 18 years in federal prison for being an accessory after the fact to carjacking.[18][19] He was convicted on state level charges over a decade later in 2019.[20]\n",
        "type": [
            "torture",
            "rape",
            "kidnapped",
            "robbery",
            "theft",
            "murder",
            "kidnapping",
            "robber"
        ]
    },
    "22": {
        "link": "/wiki/Lynching_of_George_and_Ed_Hartley",
        "title": "Lynching of George and Ed Hartley",
        "date": "October 20, 1922",
        "year": "1922",
        "location": "Camden, Benton County, Tennessee",
        "state": "Tennessee",
        "place": "Camden",
        "county": "Benton County",
        "paragraph": "Ed and his son George Hartley were lynched in Camden, Benton County, Tennessee by a mob on October 20, 1922. According to the United States Senate Committee on the Judiciary they were the 54th and 55th of 61 lynchings during 1922 in the United States.[1] The two were the only lynchings in the state of Tennessee and of the 61 lynchings they were 2 of 6 white victims.[2]\nEd and his son George Hartley were being held in connection with the manslaughter of Connie Hartley, nephew of Ed Hartley in Benton County, Tennessee. On February 20, 1922, Connie Hartley and his father John Hartley were cutting wood ties near Harmon Creek when they were fired upon.[3]  Connie \"Con\" Hartley was killed instantly. His father, John Hartley, was seriously wounded and was on death's door for several days. On September 22, 1922, Ed and George were convicted of voluntary manslaughter in the Benton County circuit court. During the same trial, Vuid Hartley (the son of Ed Hartley) and Bill Conley (a local boy) were acquitted of the voluntary manslaughter charge.[4] [5]\nOn October 20, 1922, Ed and George Hartley were in the Benton County jail, in Camden, filing a motion for a new trial.[4]\n",
        "type": [
            "lynching",
            "riot"
        ]
    },
    "23": {
        "link": "/wiki/Matthew_Winkler_(minister)",
        "title": "Matthew Winkler (minister)",
        "date": "22 March 2006(2006-03-22) (aged 31) Selmer, Tennessee, U.S.",
        "year": "2006",
        "location": "",
        "state": "Tennessee",
        "place": "Selmer",
        "county": "McNairy County",
        "paragraph": "Matthew Brian Winkler (November 21, 1974 – March 22, 2006) was a minister who was the victim in a high-profile murder case in 2006.[1][2]\nWinkler was raised in Woodbury, Tennessee; Huntingdon, Tennessee; and  Decatur, Alabama. He attended college at Freed-Hardeman University in Henderson, Tennessee in 1990s and moved to Selmer, Tennessee after he got married. He had three daughters named Patricia, then 8; Mary Alice, then 6; Brianna, then 1, whose custody was given to their mother later.[3]\nWinkler was serving as the pulpit minister at the Fourth Street Church of Christ in Selmer, Tennessee, at the time of his death. Members of his congregation found him dead inside his home after he failed to appear at the church for a Wednesday-night service he was to lead on March 22, 2006. He had been shot in the back.[4]\n",
        "type": [
            "murder"
        ]
    },
    "24": {
        "link": "/wiki/Shannon_Street_massacre",
        "title": "Shannon Street massacre",
        "date": "January 11–13, 1983 (1983-01-11 – 1983-01-13)",
        "year": "1983",
        "location": "2239 Shannon Street,  Memphis, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "The Shannon Street massacre refers to a shootout that occurred at a house on Shannon Street in Memphis, Tennessee on January 12, 1983. Police officers Ray Schwill and Bobby Hester were called to the house after which a confrontation ensued and Hester was taken hostage by men inside the house. After a 30 hour standoff, Memphis Police officers stormed the house and opened fire, killing all seven captors, after which Hester was found beaten to death. The police's handling of the incident was controversial and led to changes in Memphis police procedure.[1][2]\nOn January 11, 1983, Memphis police were called to 2239 Shannon Street to investigate an alleged purse snatching. Inside the home was Lindberg Sanders-- a man with a history of mental illness and who called himself \"Black Jesus\"-- and thirteen other men who were his followers. Sanders harbored a strong hatred for law enforcement and had told his followers that the world would end on January 10, 1983. \nOfficers Ray Schwill and Bobby Hester responded to the call. Seven cultists fled the house at this point, but were later captured. Upon arrival, Schwill and Hester were ambushed by the remaining men in the house. Schwill sustained a gunshot wound to the face and escaped, but Hester was taken hostage. Schwill radioed for help and police quickly surrounded the house.[2][3][4]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "25": {
        "link": "/wiki/SmileDirectClub_shooting",
        "title": "SmileDirectClub",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "SmileDirectClub is a teledentistry company. The company was co-founded in 2014 by Jordan Katzman and Alex Fenkell. It is based in Nashville, Tennessee.[3][4]\nSmileDirectClub produces 3D-printed clear aligners.[5] SmileDirectClub aligners are a competitor of traditional braces and clear alignment companies like Invisalign.[6]\nCommunication with licensed orthodontic professionals and other SmileDirectClub staff takes place virtually. Impression kits are sent to customers, after which teeth molds are reviewed by dentists or orthodontists who oversee the treatment process. The company reportedly works with 225 licensed professionals.[7]\n",
        "type": []
    },
    "26": {
        "link": "/wiki/Martin_Frankel",
        "title": "Martin Frankel",
        "date": "",
        "year": "new 1999",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "Martin R. \"Marty\" Frankel (born 1954)[1] is an American financial criminal who conducted a series of investment frauds in the late 20th century, causing hundreds of millions of dollars in losses.  He was caught in 1999, and in 2004 was sentenced to 200 months in prison based on over $200 million in proven losses to insurance companies he bought then looted their actuarial reserves; the sentence was reaffirmed in 2006.[4]\nMarty Frankel was born to Leon and Tilly Frankel in 1954; he was Leon's fourth child and Tilly's second, and was raised as Jewish.  He attended the University of Toledo but never graduated.[1][6]\nFrankel used astrology to make financial trading decisions. In addition, he usually could not bring himself to actually make trades, causing trouble for him with the brokerage firms he worked for.  After being fired by his boss John Schulte in 1986, Schulte's wife and brokerage partner, Sonia, left the marriage to join Frankel as his business and life partner.[7] Frankel set up Winthrop Capital using the phony name of James Spencer.  He also set up The Frankel Fund with Douglas Maxwell, but remained reluctant to buy or hold his chosen investments.[1][7]\n",
        "type": [
            "new looting"
        ]
    },
    "27": {
        "link": "/wiki/Eric_Dewayne_Boyd",
        "title": "Murders of Channon Christian and Christopher Newsom",
        "date": "January 6, 2007",
        "year": "2007",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nCoordinates: 35°59′28″N 83°54′27″W﻿ / ﻿35.99113°N 83.907514°W﻿ / 35.99113; -83.907514\nChannon Gail Christian, aged 21, and Hugh Christopher Newsom Jr., aged 23, were from Knoxville, Tennessee, United States. They were kidnapped on the evening of January 6, 2007, when Christian's vehicle was carjacked. The couple were taken to a rental house. Both of them were raped, tortured, and murdered.[1][2][3] Four males and one female were arrested, charged, and convicted in the case. In 2007, a grand jury indicted Letalvis Darnell Cobbins, Lemaricus Devall Davidson, George Geovonni Thomas, and Vanessa Lynn Coleman on counts of kidnapping, robbery, rape, and murder.[4][5][6][7][8] Also in 2007, Eric DeWayne Boyd was indicted by a federal grand jury of being an accessory to a carjacking, resulting in serious bodily injury to another person, and misprision of a felony.[8] In 2018, Boyd was indicted on state-level charges of kidnapping, robbery, rape, and murder.[9]\nFour of the five defendants (Eric Boyd, Letalvis Cobbins, Lemaricus Davidson, and George Thomas) had multiple prior felony convictions.[10] After a jury trial, Davidson was convicted and sentenced to death by lethal injection.[11][12] Cobbins and Thomas were convicted and sentenced to life in prison without parole.[13][14][15][16] Vanessa Coleman was convicted of facilitating the crimes and sentenced to 53 years.[17] Eric Boyd was convicted at the federal level and sentenced to 18 years in federal prison for being an accessory after the fact to carjacking.[18][19] He was convicted on state level charges over a decade later in 2019.[20]\n",
        "type": [
            "torture",
            "rape",
            "kidnapped",
            "robbery",
            "theft",
            "murder",
            "kidnapping",
            "robber"
        ]
    },
    "28": {
        "link": "/wiki/Murder_of_Holly_Bobo",
        "title": "Murder of Holly Bobo",
        "date": "",
        "year": "new 2011",
        "location": "",
        "state": "Tennessee",
        "place": "Darden",
        "county": "Henderson County",
        "paragraph": "\nHolly Lynn Bobo (October 12, 1990 – c. April 13, 2011) was an American woman who disappeared on April 13, 2011, from her family home in Darden, Tennessee. She was last seen alive by her brother, Clint, shortly before 8 a.m., walking into the woods outside her home with a man wearing camouflage. In September 2014, Bobo's partial remains were found in northern Decatur County, and her death was ruled a homicide via a gunshot to the back of the head.[2][3]\nSix men have been arrested for varying degrees of involvement in the murder. However, only three of the six have been prosecuted.[4] Most of the arrests were made on the basis of a confession by a man with an intellectual disability named John Dylan Adams, who told police he saw his brother, Zach, and another friend, Jason Autry, with Bobo at his brother's home after her kidnapping. It is unknown what led police to question Dylan about Bobo's disappearance.[5] Dylan, Zach, and Autry were charged with especially aggravated kidnapping, first-degree murder and rape.[6] Of the other three men arrested, charges against two were dropped, and one committed suicide without any charges being filed against him.\n",
        "type": [
            "murder",
            "rape",
            "kidnapping"
        ]
    },
    "29": {
        "link": "/wiki/Bob_Baird",
        "title": "Bob Baird",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Robert Allen Baird (January 16, 1940 – April 11, 1974) was an American professional baseball player, a left-handed pitcher who appeared in eight total games in Major League Baseball over parts of two seasons with the Washington Senators (1962–1963). Born in Knoxville, Tennessee, Baird stood 6 feet 4 inches (1.93 m) tall and weighed 195 pounds (88 kg). He attended Carson Newman College.\nBaird had a six-year (1962–1967) professional career. The Senators, then a two-year-old expansion team, brought Baird up for an audition during the September of his first year in pro ball, 1962, and gave him three starts. Then, the following September, they called him up again and used him in five games, three as a starter. But Baird went winless in four decisions. In 221⁄3 MLB innings pitched, he allowed 25 hits, 15 bases on balls, and 18 earned runs. He fanned ten. Baird appeared in 148 games in minor league baseball, where he fashioned a 47–46 record and a 3.99 earned run average.\nAfter baseball, Baird was a traveling salesman for a Cincinnati-based company.[1] Baird died in Chattanooga, Tennessee, at age 34, nine days after he was shot by a woman who was charged with his murder.[2] He is interred in Lynnhurst Cemetery in Knoxville.[3]\n",
        "type": [
            "murder",
            "arson"
        ]
    },
    "30": {
        "link": "/wiki/Natasha_Cornett",
        "title": "Natasha Cornett",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Natasha Wallen Cornett (born January 26, 1979) is an American criminal currently serving a sentence of life without parole at the Debra K. Johnson Rehabilitation Center in Nashville for her involvement in the Lillelid murders.  \nIn her book The Scarred Heart: Understanding and Identifying Kids Who Kill, forensic psychologist Helen Smith considers Natasha Cornett's troubled life as a warning of the failures of the school, mental health, and criminal justice systems in preventive treatment.[1]\nCornett was born into poverty in rural Pike County, located in Eastern Kentucky.  Cornett's mother, Madonna Wallen, was not married to her biological father, a local policeman named Roger Burgess with whom Madonna was having an affair. When Natasha was a toddler, Madonna left her husband, Ed Wallen, and raised Natasha alone as a single mother[2] in a ram-shackle trailer[3] located in the outskirts of Pikeville, Kentucky.  It is believed Natasha received little or no parental support (financial or social) from either her biological father or Madonna's ex-husband, whose name had been entered on her birth certificate.[2] According to Tennessee court records, she grew up with \"the lack of a father figure, and an irresponsible mother\".[4]  By junior high school, Cornett was alienated from most of her fellow pupils because of her unconventional behavior.  She suffered from anorexia and was diagnosed with bipolar disorder, which went largely untreated due to lack of health insurance.[2]  By the time she entered high school, Cornett was being openly harassed and bullied by other students for her uncommon dress and conduct. Pleas for help by her were ignored by unsympathetic school authorities.[3] Sometime during her freshman year of high school, Cornett dropped out.[2]\n",
        "type": [
            "murder"
        ]
    },
    "31": {
        "link": "/wiki/Idris_Abdus-Salaam",
        "title": "2020 Knox County stabbing",
        "date": "7 April 2020 (2020-04-07) c. 7 a.m. (UTC-4:00)",
        "year": "2020",
        "location": "7210 Strawberry Plains PikeKnoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knox County",
        "county": "Knox County",
        "paragraph": "The 2020 Knox County stabbing occurred on April 7, 2020, shortly before 7 a.m. Eastern Standard Time, when Idris Abdus-Salaam stabbed to death three women and injured another at a Pilot truck stop a few miles east of Knoxville, Tennessee, located at 7210 Strawberry Plains Pike. Abdus-Salaam was then shot and killed by a responding police officer on the scene.[1]\nA man armed with a knife inside a Pilot truck rest stop followed store manager Joyce Whaley, 57, into the woman's bathroom, launching the start of a stabbing rampage. He stabbed Whaley 11 times, killing her, and then left the washroom to attack other patrons at the station. He stabbed to death Patricia Denise Nibbe, who was nearby the washroom door - and then began to stab Nettie R. Spencer, 41.\nOthers at the scene began to react to the attack, and attempted to intervene against the assailant, with one person reportedly spraying the attacker with a fire extinguisher as Spencer managed to leave through the front door of the station. The assailant chased Spencer outside and began attacking her again, killing her. He then launched himself at the nearby car of customer Dessa Hutchison, who had left the station earlier in response to the attack, and fled to the driver's seat of her vehicle to call 911. The attacker pulled Hutchison from her car, repeatedly stabbing her while she was still on the line with police operators. The attacker then left her car, and began wandering around the station's parking lot.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "32": {
        "link": "/wiki/Tojo_Yamamoto",
        "title": "Tojo Yamamoto",
        "date": "February 19, 1992(1992-02-19) (aged 65) [1]Hermitage, Tennessee, United States[1]",
        "year": "1992",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "\nHarold Watanabe (January 6, 1927 – February 19, 1992) was an American professional wrestler, better known by his ring name Tojo Yamamoto.\nWatanabe was born in Hawaii in 1927 to a Japanese father and an American mother. He served in the United States Marine Corps and worked as a judo instructor.[2]\n",
        "type": []
    },
    "33": {
        "link": "/wiki/People%27s_Grocery_lynchings",
        "title": "People's Grocery lynchings",
        "date": "",
        "year": "new 1892",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nThe People's Grocery lynchings occurred on March 9, 1892, in Memphis, Tennessee, when black grocery owner Thomas Moss and two of his workers, Will Stewart and Calvin McDowell, were lynched by a white mob while in police custody.  The lynchings occurred in the aftermath of a fight between whites and blacks and two subsequent shooting altercations in which two white police officers were wounded.[1]\nThe store was located just outside Memphis in a neighborhood called the \"Curve\".[2] Opened in 1889, the People's Grocery was a cooperative venture run along corporate lines and owned by 11 prominent African Americans, including postman Thomas Moss, a friend of Ida B. Wells.[3][4]\n",
        "type": [
            "lynching",
            "murder",
            "shooting"
        ]
    },
    "34": {
        "link": "/wiki/Al_Jackson_Jr.",
        "title": "Al Jackson Jr.",
        "date": "October 1, 1975(1975-10-01) (aged 39) Memphis, Tennessee, U.S.",
        "year": "1975",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nAlbert J. Jackson Jr.[1] (November 27, 1935 – October 1, 1975) was an American drummer, producer, and songwriter. He was a founding member of Booker T. & the M.G.'s, a group of session musicians who worked for Stax Records and produced their own instrumentals. Jackson was affectionately dubbed \"The Human Timekeeper\" for his drumming ability. He was inducted into the Memphis Music Hall of Fame in 2015, and the Rock and Roll Hall of Fame as a member of Booker T. & the M.G.'s in 1992.\nJackson's father, Al Jackson Sr., led a jazz/swing dance band in Memphis, Tennessee. The young Jackson started drumming at an early age and began playing on stage with his father's band in 1940, at the age of five. He later played in producer and trumpeter Willie Mitchell's band and at the same time was holding down a chair in the popular Ben Branch Band.\n",
        "type": [
            "murder"
        ]
    },
    "35": {
        "link": "/wiki/Lynching_of_Thomas_Williams",
        "title": "Lynching of Thomas Williams",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "Thomas Williams was an African-American man who was lynched by a mob in Memphis, Tennessee, on September 28, 1927.[1]\nJohn R. Steelman, who wrote his PhD dissertation on \"mob action in the South\", listed Williams as one of the cases, wrote: \"'The bullet-riddled body of Thomas Williams, alleged to have attacked a fifty-year old white woman, was found in Pleasant Union Churchyard, two miles from the scene of the crime' - near Memphis.\"[2]\nCoordinates: 35°07′03″N 89°58′16″W﻿ / ﻿35.11750°N 89.97111°W﻿ / 35.11750; -89.97111\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "36": {
        "link": "/wiki/Lynching_of_Ell_Persons",
        "title": "Lynching of Ell Persons",
        "date": "",
        "year": "new 1917",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nEll Persons was a black man who was lynched on 22 May 1917, after he was accused of having raped and decapitated a 15-year-old white girl, Antoinette Rappel, in Memphis, Tennessee, United States. He was arrested and was awaiting trial when he was captured by a lynch party, who burned him alive and scattered his remains around town, throwing his head at a group of African Americans. A large crowd attended his lynching, which had the atmosphere of a carnival. No one was charged as a result of the lynching, which was described as one of the most vicious in American history, but it did play a part in the foundation of the Memphis chapter of the NAACP.[1]\nDescribed as \"[i]nnocent, pure, pretty, by turns playful and pensive\" and as someone who \"must have reminded many readers of their own daughters, nieces, or cousins\", Rappel was a student at Treadwell School in Memphis. On the morning of 30 April 1917, she left for school and did not return; on 2 May 1917 a newspaper published a story which said she left to join the war, a story her mother, Mrs Wood, reportedly believed. Later, Rappel was found dead, with evidence she had been raped, in woods near Macon Road and half a mile from the home of Persons,[n 1] a nearly fifty-year-old woodcutter. She had been decapitated with an axe. At the scene, they found a white coat, a white handkerchief, and axe dents in the ground. After the arrests of several black men, the police brought in Persons, and subjected him to brutal treatment for 24 hours, after which the police said he confessed to the murder. Sheriff Mike Tate, Deputy Sheriff M.W. Palmer, City Detectives C. A. Brunner and J. W. Hoyle alternated with rapid fire questions that led to the confession.[2] Eager to prove Persons' guilt, Mike Tate, Shelby County sheriff, ordered that Rappel's body be exhumed so that they could look at her pupils, because the authorities thought that a photograph of the pupils could be used to show the last image seen by a person who had died, a theory developed by Alphonse Bertillon, a French biometrics researcher of that time. Despite being told by eye specialists that it would be impossible, the authorities said they saw Persons in Rappel's pupils—which showed a \"frozen expression of horror\"—and he was taken to Tennessee State Prison in Nashville to await arraignment and trial.[3] Deputy Sheriff Palmer along with Detectives Brunner and Hoyle encountered angry mobs at nearly every city along the way before they safely reached Nashville via train and placed Persons in custody.[4]\n",
        "type": [
            "lynching",
            "murder",
            "rape"
        ]
    },
    "37": {
        "link": "/wiki/Mark_Capps",
        "title": "Mark Capps",
        "date": "January 5, 2023(2023-01-05) (aged 54) Hermitage, Tennessee",
        "year": "2023",
        "location": "",
        "state": "Tennessee",
        "place": "Hermitage",
        "county": "Davidson County",
        "paragraph": "\nMark Capps (December 14, 1968 – January 5, 2023) was an American sound engineer and music producer from Nashville, Tennessee.[1] He shared the Grammy Award for Best Polka Album in 2005, 2006, and 2007 for engineering albums by Jimmy Sturr & His Orchestra.[2]\nCapps was part of a well-established musical family in Nashville. His father was Grand Ole Opry house band guitarist Jimmy Capps. He worked with country, gospel, and pop artists throughout his career.[1]\n",
        "type": []
    },
    "38": {
        "link": "/wiki/Mark_Linkous",
        "title": "Mark Linkous",
        "date": "March 6, 2010 (aged 47) Knoxville, Tennessee, US",
        "year": "2010",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Mark Linkous /ˈlɪŋkəs/ (September 9, 1962 – March 6, 2010) was an American singer, songwriter and musician, best known as leader of Sparklehorse. He was also known for his collaborations with such notable artists as Tom Waits, PJ Harvey, Daniel Johnston, Cracker, Radiohead, Black Francis, Julian Casablancas, Nina Persson, David Lynch, Fennesz, Danger Mouse, and Sage Francis.[1]\nA member of the 1980s indie band the Dancing Hoods, Linkous moved with the group from his native Virginia to New York City and later Los Angeles in hopes of achieving mainstream success. By 1988, the band had failed to land a major record label deal, and they disbanded with Linkous returning to Virginia, where he began writing songs under various monikers.[2]\nBy 1995, he created a project named Sparklehorse, of which he would remain the only permanent member. The band released a quartet of critically acclaimed albums on Capitol Records: Vivadixiesubmarinetransmissionplot, Good Morning Spider, It's a Wonderful Life, and on Astralwerks records: Dreamt for Light Years in the Belly of a Mountain. Linkous lived the last years of his life in Hayesville, North Carolina, where he established Static King Studio. He died by suicide in Knoxville, Tennessee on March 6, 2010.[3][4]\n",
        "type": []
    },
    "39": {
        "link": "/wiki/2016_Great_Smoky_Mountains_wildfires",
        "title": "2016 Great Smoky Mountains wildfires",
        "date": "",
        "year": "2016",
        "location": "Great Smoky Mountains National Park, Sevier County, Tennessee, United States",
        "state": "Tennessee",
        "place": "Sevier County",
        "county": "Sevier County",
        "paragraph": "The 2016 Great Smoky Mountains wildfires, also known as the Gatlinburg wildfires,[1] were a complex of wildfires which began in late November 2016. Some of the towns most impacted were Pigeon Forge and Gatlinburg, both near Great Smoky Mountains National Park. The fires claimed at least 14 lives,[5][6] injured 190,[7] and is one of the largest natural disasters in the history of Tennessee.[8][9][10][11][12][13][excessive citations]\nBy December 12, the fires had burned more than 10,000 acres (15 square miles) inside the national park, and 6,000 acres in other parts of the area. At least 14,000 area residents and tourists were forced to evacuate, while over 2,000 buildings were damaged and/or destroyed.[7]\nOne of the largest wildfires was the Chimney Tops 2 Fire, which burned more than 10,000 acres, and closed the Chimney Tops Trail.[14]\n",
        "type": [
            "murder",
            "arson",
            "mass murder"
        ]
    },
    "40": {
        "link": "/wiki/Travis_Reinking",
        "title": "Nashville Waffle House shooting",
        "date": "April 22, 2018",
        "year": "2018",
        "location": "Waffle House 3571 Murfreesboro Pike, Antioch, Nashville, Tennessee",
        "state": "Tennessee",
        "place": "Antioch",
        "county": "Davidson County",
        "paragraph": "\nOn April 22, 2018, a mass shooting occurred at a Waffle House restaurant in the Antioch neighborhood[1] of Nashville, Tennessee, United States, when 29-year-old Travis Jeffrey Reinking fatally shot four people and injured two others with an AR-15 style rifle.[6] Another two people were injured by broken glass.[7] Reinking was rushed by an unarmed customer, James Shaw Jr., who wrestled the rifle away and stopped the shooting spree.  Reinking was captured on April 23, ending a 34-hour manhunt.[8][9][5]\nDue to severe schizophrenia, Reinking was initially found incompetent to stand trial and committed to a mental hospital for treatment.[10] Later that decision was changed and Reinking was put on trial for four counts of first degree premeditated murder on January 31, 2022.  He was convicted of the charges on February 4, 2022.\n",
        "type": [
            "murder",
            "shooting",
            "mass shooting"
        ]
    },
    "41": {
        "link": "/wiki/Paul_Dennis_Reid",
        "title": "Paul Dennis Reid",
        "date": "November 1, 2013(2013-11-01) (aged 55) Nashville, Tennessee, U.S.",
        "year": "2013",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Paul Dennis Reid, Jr. (November 12, 1957 – November 1, 2013[1]), also known as \"The Fast Food Killer\",[2] was an American serial killer, convicted and sentenced to death for seven murders during three fast-food restaurant robberies in Metropolitan Nashville, Tennessee and Clarksville, Tennessee between the months of February and April 1997. At the time of the murders, Reid lived with roommate Brian Fozzard at a boarding house, and he was on parole from a 1983 conviction in Texas on charges relating to the aggravated armed robbery of a Houston steakhouse. He had served seven years of a 20-year sentence, and was paroled in 1990.[3] Originally from Richland Hills, Texas, a suburb of Fort Worth,[3] Reid went to Nashville to pursue a career as a country music singer.[4]\nOn the morning of February 16, 1997, Reid entered a Captain D's on Lebanon Road in the Donelson neighborhood of Nashville, Tennessee before opening, under the guise of applying for a job. Once inside, he forced employee Sarah Jackson, 16, and the manager, Steve Hampton, 25, into the restaurant's cooler. Reid forced the two to lie face down on the floor and then shot them execution style. Money, including large amounts of change, was found missing from the cash register. Reid used the cash from this robbery as a down payment on a car two days later.[citation needed]\nOn the evening of March 23, 1997 at a McDonald's on Lebanon Road in the Hermitage neighborhood of Nashville (located 3.4 miles (5.5 km) northeast of the Captain D's), Reid approached four employees as they exited the store after closing. At gunpoint, he forced them back into the restaurant. Reid shot three employees to death execution style in the storeroom: Andrea Brown, 17; Ronald Santiago, 27; and Robert A. Sewell.[5]\n",
        "type": [
            "robbery",
            "robberies",
            "murder",
            "robber"
        ]
    },
    "42": {
        "link": "/wiki/John_Hunt_Morgan",
        "title": "John Hunt Morgan",
        "date": "September 4, 1864(1864-09-04) (aged 39) Greeneville, Tennessee, U.S.",
        "year": "1864",
        "location": "",
        "state": "Tennessee",
        "place": "Greeneville",
        "county": "Greene County",
        "paragraph": "\nJohn Hunt Morgan (June 1, 1825 – September 4, 1864) was an American soldier who served as a Confederate general in the American Civil War of 1861–1865. \nIn April 1862, Morgan raised the 2nd Kentucky Cavalry Regiment (CSA) and fought in the Battle of Shiloh (April 6 to 7, 1862) in  Tennessee. He next launched a costly raid in  Kentucky, which encouraged Confederate General Braxton Bragg's invasion of that state in August 1862. He also attacked the supply lines of Union General William Rosecrans. \n",
        "type": []
    },
    "43": {
        "link": "/wiki/Sean_Patrick_Goble",
        "title": "Sean Patrick Goble",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Asheboro",
        "county": "Williamson County",
        "paragraph": "\nSean Patrick Goble (born November 1, 1966), known as The Interstate Killer, is an American serial killer. A former truck driver, Goble kidnapped and murdered at least three women along highways in North Carolina and Tennessee during the winter of 1995.[1] In addition authorities in ten other states investigated him for numerous other killings committed during the late 1980s and early 1990s. While he was cleared in some of those cases, as of today, his true victim count remains unknown.[2]\nSean Patrick Goble was born in Asheboro, North Carolina on November 1, 1966, the son of Kenneth and Erma Goble. At some point during his childhood, his family moved to Illinois. The first major event to happen in his life occurred at age 6, when his father raped a 10-year-old girl during a home invasion in Rockford.[3] Young Sean was sitting in his dad's vehicle outside of the crime scene during the attack.[3] Kenneth was charged with the crime and was sentenced to serve four to 20-years in prison. He was released after four years. As for Sean, he, his mother and sister continued to live in Rockford where he attended Auburn High School.[3] In 1984, he dropped out during his senior year. Two years later, his father, who was now living in New Mexico, was charged with raping a 6-year-old there, for which he was sent back to prison, being released sometime in 1994.[3] Sean Goble joined the army and later got married, fathering a son. His marriage later fell apart and Sean moved to North Carolina in 1988, and began working as a truck driver in 1991.[4] At 225 pounds and 6-foot 3 inches, Goble described himself as a ladies man.[5]\n",
        "type": [
            "murder",
            "killing",
            "kidnapped",
            "rape"
        ]
    },
    "44": {
        "link": "/wiki/United_States_v._Shipp",
        "title": "United States v. Shipp",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Shipp",
        "county": "Hickman County",
        "paragraph": "United States v. Shipp, 203 U.S. 563 (1906) (along with decisions at 214 U.S. 386 (1909), and 215 U.S. 580 (1909)), were rulings of the Supreme Court of the United States with regard to Sheriff Joseph F. Shipp and five others of Chattanooga, Tennessee, having \"in effect aided and abetted\" the lynching of Ed Johnson.[1] They were held in contempt of court and sentenced to imprisonment. It remains the only Supreme Court criminal trial in history.\nEd Johnson, a black man, had been convicted in Hamilton County, Tennessee, of the rape of a white woman on February 11, 1906 and sentenced to death.  On March 3, 1906, Johnson's lawyer Noah W. Parden filed a writ of habeas corpus, alleging that his constitutional rights had been violated.  Specifically, Parden alleged that all blacks had been systematically excluded from both the grand jury considering the original indictment against him and the trial jury considering his case. He further argued that he had been substantively denied the right to counsel, as his lawyer at the time had been too intimidated by the threats of mob violence to file motions for a change of venue, a continuance, or a new trial, all of which could be reasonably expected under the circumstances. Parden asserted Johnson was thus about to be deprived of his life without due process.[2]\nParden's petition was initially denied on March 10, 1906, and Johnson was remanded to the custody of Hamilton County Sheriff Joseph F. Shipp, with the stipulation for Johnson to be given 10 days to file further appeals.[3]  His appeal to the Supreme Court was granted by Justice Harlan on March 17 and subsequently by the entire court on March 19. However, despite being advised of the ruling by telegram on that date and the case and the ruling being given full coverage by Chattanooga's evening newspapers that day, Shipp and his chief jailer nonetheless allowed a mob to enter the Hamilton County Jail and to lynch Johnson on the city's Walnut Street Bridge.\n",
        "type": [
            "lynching",
            "rape"
        ]
    },
    "45": {
        "link": "/wiki/Faron_Young",
        "title": "Faron Young",
        "date": "December 10, 1996(1996-12-10) (aged 64) Nashville, Tennessee, U.S.",
        "year": "1996",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "\nFaron Young (February 25, 1932 – December 10, 1996) was an American country music producer, musician, and songwriter from the early 1950s into the mid-1980s. Hits including \"If You Ain't Lovin' (You Ain't Livin')\" and \"Live Fast, Love Hard, Die Young\" marked him as a honky-tonk singer in sound and personal style; and his chart-topping singles \"Hello Walls\" and \"It's Four in the Morning\" showed his versatility as a vocalist. Known as the Hillbilly Heartthrob, and following a singing cowboy film role as the Young Sheriff, Young's singles charted for more than 30 years. In failing health, he died by suicide at 64 in 1996.[1] Young is a member of the Country Music Hall of Fame.\nYoung was born in Shreveport, Louisiana, the youngest of six children of Harlan and Doris Young. He grew up on a dairy farm that his family operated outside the city. Young began singing at an early age, imagining a career as a pop singer. However, after he joined some friends watching Hank Williams perform with nine encores on the Louisiana Hayride, Young switched to country music instead. He performed at the local Optimist Club and was discovered by Webb Pierce, who brought him to star on the Hayride in 1951, then broadcast on KWKH-AM. He graduated from Fair Park High School that year and attended Centenary College of Louisiana.\n",
        "type": []
    },
    "46": {
        "link": "/wiki/Lillelid_murders",
        "title": "Lillelid murders",
        "date": "",
        "year": "new 1997",
        "location": "",
        "state": "Tennessee",
        "place": "Greene County",
        "county": "Greene County",
        "paragraph": "\nThe Lillelid murders refers to a criminal case in Greene County, Tennessee, United States, where three members of the Lillelid family were murdered on April 6, 1997. Vidar Lillelid (aged 34), Delfina Lillelid (aged 28), and their daughter Tabitha (aged 6), and son Peter (aged 2) were shot on a deserted rural road near Baileyton during a carjacking committed by a group of youths. Vidar and Delfina were found dead at the scene, while Tabitha died after being transported to the hospital. Peter survived, but, as a result of the shooting, was left with disabilities.[1] Six young people from Kentucky, including two minors, were convicted of felony murder for the deaths of Vidar, Delfina, and Tabitha Lillelid, with all six perpetrators receiving three life sentences, and an additional sentence of 25 years each for the attempted murder of Peter Lillelid.[2]\nVidar Lillelid grew up in Bergen, Norway, and in 1985 moved to United States. In 1989, Lillelid married Delfina Zelaya, a first-generation Honduran-American from New York City, whom he had met through their common involvement in the Jehovah's Witnesses denomination.[citation needed]. By 1997, the Lillelids had two children: 6-year-old daughter Tabitha (1990-1997) and 2-year-old son Peter (b.1995).\n",
        "type": [
            "murder",
            "kidnapping",
            "shooting"
        ]
    },
    "47": {
        "link": "/wiki/Jocques_Clemmons",
        "title": "Shooting of Jocques Clemmons",
        "date": "February 10, 2017 (2017-02-10)",
        "year": "2017",
        "location": "James A. Cayce Homes parking lot, East Nashville, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "East Nashville",
        "county": "Davidson County",
        "paragraph": "Jocques Clemmons, a 31-year-old, was fatally shot on February 10, 2017 in Nashville, Tennessee, United States, after a traffic stop where Clemmons pulled out a gun, leading to a confrontation with Joshua Lippert, a 32-year-old police officer. After an investigation, the Davidson County District Attorney declined to prosecute Lippert on any charges, a decision that was protested by several groups. After reviews at several levels of the Nashville Police and Tennessee Bureau of Investigation's work and reports, the U.S. Department of Justice closed the case in August 2017.\nClemmons ran a stop sign and stopped in the parking lot of the James A. Cayce Homes. He got out of the car and was armed. His gun fell to the ground during the altercation with Lippert. Clemmons picked up the weapon before Lippert shot him, once in the abdomen, once in the hip and twice in the back as he tried to run away.\nOn May 11, 2017, the district attorney of Davidson County, Glenn Funk, decided not to prosecute Lippert. The decision prompted criticisms from the NAACP, the ACLU and Black Lives Matter, and protesters gathered outside the residence of then Nashville Mayor Megan Barry.\n",
        "type": [
            "shooting"
        ]
    },
    "48": {
        "link": "/wiki/State_v._Anderson",
        "title": "State v. Anderson",
        "date": "",
        "year": "new 1859",
        "location": "",
        "state": "Tennessee",
        "place": "Tenn.",
        "county": "Shelby County",
        "paragraph": "State v. Anderson, 2 Tenn. 6 (1804), was a case decided by the Tennessee Supreme Court that held that the intent to kill necessary to distinguish murder from manslaughter need only to be formed a moment before the act.[1]\nAnderson was decided before murder was separated by statute into first and second degrees, but the timing analysis was affirmed in the 1859 opinion Lewis v. State.[2]\n",
        "type": [
            "murder"
        ]
    },
    "49": {
        "link": "/wiki/McMinnville_Opera_House",
        "title": "McMinnville Opera House",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "McMinnville",
        "county": "Warren County",
        "paragraph": "The McMinnville Opera House, also known as Hawchins Opera House, was a landmark structure in McMinnville, Tennessee, that was destroyed by fire in 2008.[1]\nBuilt in September 1888, by African American entrepreneur William Hawchins. The building had businesses on the first floor, the main opera house on the second, and Mr. Hawchins' apartment on the third. The building was beautifully decorated with many ornaments, and a metropolitan opera house look for its time. This building helped the growth of McMinnville, making the town become known as a \"Cultural Center\".\nThe opera house eventually went as the times went on, therefore, citizens tore off the exterior Victorian ornaments off the building turning the building into shops. Later in the 20th century, the building served as King's Department Store.\n",
        "type": [
            "arson"
        ]
    },
    "50": {
        "link": "/wiki/Gentry_Crowell",
        "title": "Gentry Crowell",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Chestnut Mound",
        "county": "Smith County",
        "paragraph": "Gentry Crowell (December 10, 1932 – December 20, 1989) was a Tennessee secretary of state  whose office was a target of investigation in Operation Rocky Top. Crowell committed suicide during the investigation.[1]\nCrowell was born December 10, 1932, in Chestnut Mound, Smith County, Tennessee.  A Democrat, he served in the Tennessee House of Representatives from 1969 to 1977 (86th to 89th Tennessee General Assemblies), serving at various times as chairman of the General Welfare Committee, Rules Committee, and the House Democratic Caucus.[1][2] He was first elected secretary of state by the state legislature in 1977, took office that year, and continued in that position until his death, having been re-elected by the legislature in 1981, 1985, and 1989.[1]\nIn January 1979, while serving as secretary of state, Crowell witnessed Governor Ray Blanton's signature on the pardons and commutations of prison sentences that Blanton notoriously issued shortly before leaving office.  While signing the documents, Blanton stated, \"this takes guts,\" to which Crowell responded, \"some people have more guts than they've got brains.\"[3]\n",
        "type": []
    },
    "51": {
        "link": "/wiki/Floyd_Ray_Cook_shootings_and_manhunt",
        "title": "Floyd Ray Cook shootings and manhunt",
        "date": "October 24–30, 2015",
        "year": "2015",
        "location": "Cumberland County, Kentucky, Putnam County, Tennessee",
        "state": "Tennessee",
        "place": "Cumberland County",
        "county": "Cumberland County",
        "paragraph": "The Floyd Ray Cook manhunt started on Saturday afternoon, October 24, 2015, and lasted nearly a week, when 62-year-old Floyd Ray Cook of Lebanon, Kentucky shot a City of Algood, TN officer who had stopped to help Cook in Putnam County, Tennessee believing him to be a stranded motorist and ended 12:20 a.m. early Friday morning, October 30, 2015, when Floyd Cook was shot and killed in Cumberland County, Kentucky, 7 miles south of Burkesville on U.S. Route 61.[1] The agencies involved were the FBI, U.S. Marshals, Kentucky State Police, Tennessee Bureau of Investigation, and local police officers. Helicopters and thermal-heat detecting technology were used in this massive manhunt.[2]\nAfter an August bench warrant for \"failure to appear\" in court over a methamphetamines charge was issued by a Circuit Judge from Hardin County, Kentucky, months went by as Floyd Cook hovered under the radar as a wanted man, until Saturday, October 24, 2015.\nOn that Saturday afternoon, in Algood, Tennessee, a small town on Interstate 40 midway between Nashville and Knoxville, Ahscari Valencia, an Algood police officer, stopped to help a black Ford F-150 believing the occupants to be stranded.[3]\n",
        "type": [
            "shooting"
        ]
    },
    "52": {
        "link": "/wiki/Oscar_Franklin_Smith",
        "title": "Oscar Franklin Smith",
        "date": "",
        "year": "new 2022",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "\nOscar Franklin Smith (born March 25, 1950[1]) is an American man convicted of capital murder in Tennessee and sentenced to death.[1] Smith has maintained innocence and was scheduled to be executed on April 21, 2022, however, his execution was temporarily reprieved by Governor Bill Lee due to an oversight in the preparation for lethal injection.[2]\nOn October 1, 1989, Smith's estranged wife, Judy Robird Smith, and her sons Chad Burnett and Jason Burnett were murdered in Nashville, Tennessee.[3] Judy was shot in the neck and stabbed several times.[3] Chad was shot in the left eye, upper chest, and left torso.[3] Jason was stabbed in the neck and abdomen.[3] An awl was recovered at the scene, but the gun and knife were never recovered.[4]\n",
        "type": [
            "murder"
        ]
    },
    "53": {
        "link": "/wiki/Henry_Lee_Jones",
        "title": "Henry Lee Jones",
        "date": "",
        "year": "new 2002",
        "location": "",
        "state": "Tennessee",
        "place": "Cleveland",
        "county": "Bradley County",
        "paragraph": "Henry Lee Jones (born August 23, 1963) is an American criminal and serial killer who has been sentenced to death on multiple occasions for the murders of three people in Tennessee and Florida in August 2003. In addition to these crimes, he remains the prime suspect in a fourth killing dating back to 2002, and possibly other murders.\nHenry Lee Jones was born on August 23, 1963, in Cleveland, Mississippi. Little is known about his upbringing, but later on in life, Jones claimed that he grew up without a father and was regularly beaten with various objects by older relatives. At some point during his teens, he moved to Fort Lauderdale, Florida, where he soon would delve into a life of crime and serve several prison sentences for minor offenses.\nOn October 3, 1981, the then-18-year-old Jones and a 19-year-old accomplice named Jackie Johnson went to the Johnny Harris Pontiac car dealership in Fort Lauderdale, where they planned to steal a car. After they were presented with several models by 45-year-old salesman Joseph Giovanni, they picked a tan 1976 Pontiac Grand Prix and asked to go on a test drive with it.[1] Jones drove the car while Giovanni sat next to him and Johnson sat in the back, and after some time, the pair held Giovanni at gunpoint. After finding a deserted area, all three got out of the car, whereupon Jones and Johnson robbed Giovanni and forced him into the trunk. They then picked up Jones' girlfriend, 17-year-old Annie Mae Robbins, and drove around for two hours until they found an orange grove, where they left Giovanni behind and sped away.[1]\n",
        "type": [
            "robbery",
            "murder",
            "killing",
            "robber"
        ]
    },
    "54": {
        "link": "/wiki/Redhead_murders",
        "title": "Redhead murders",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "\nThe Redhead murders is the media epithet used to refer to a series of unsolved homicides of redheaded females in the United States between October 1978 and 1992, believed to have been committed by an unidentified male serial killer. The murders believed to be related have occurred in states including Tennessee, Arkansas, Kentucky, Mississippi, Pennsylvania, and West Virginia.[1][2][3] The murders may have continued until 1992.[4][5][6] The victims, many remaining unidentified for years, were usually women with reddish hair, whose bodies were abandoned along major highways in the United States. Officials believe that the women were likely hitchhiking or may have engaged in sex work.[3][7]\nAuthorities are unsure how many people were responsible for these murders, if they were all performed by the same perpetrator(s), and how many victims there have been.[8] It is believed that there may have been a total of five to fourteen victims.[3][9][10] Of the presumed victims, four were identified by November 2018.[11][8][12][13] The suspect was informally called the \"Bible Belt Strangler\" in 2018, because of the territory where the bodies were found.\n",
        "type": [
            "murder"
        ]
    },
    "55": {
        "link": "/wiki/Robert_Glen_Coe",
        "title": "Robert Glen Coe",
        "date": "September 1, 1979",
        "year": "1979",
        "location": "",
        "state": "Tennessee",
        "place": "Greenfield",
        "county": "Weakley County",
        "paragraph": "Robert Glen Coe (April 15, 1956 – April 19, 2000) was an American murderer who was convicted of the 1979 rape and murder of eight-year-old Cary Ann Medlin in Greenfield, Tennessee.[1][2] He was executed for the crime in 2000, becoming the first person to be executed in Tennessee in forty years.[3]\nCoe was born on April 15, 1956, in Hickman, Kentucky. He grew up in a low-income family and attended Gleason School in Gleason, Weakley County, Tennessee. Coe's father would regularly get drunk and masturbate in front of Coe and his younger sister. He also forced the pair to watch him engage in sex acts with his oldest daughter.[4]\nOn September 1, 1979, Cary Ann Medlin and her stepbrother were riding their bicycles in the neighborhood near their home in Greenfield, Tennessee. Robert Coe pulled up next to them and began to talk to them, acting as if he knew Cary's father and needed directions to his house. Cary got into Coe's car to help him, and she was never seen alive again. As soon as she was reported missing, friends and neighbors in the close-knit community began a massive search to locate Cary or the man whose car she was last seen in. The following day, her body was found at the end of a road on the outskirts of town. An autopsy revealed that she had been sexually assaulted.[5]\n",
        "type": [
            "assault",
            "murder",
            "rape"
        ]
    },
    "56": {
        "link": "/wiki/Morgan_County_Correctional_Complex",
        "title": "Morgan County Correctional Complex",
        "date": "",
        "year": "",
        "location": "541 Wayne Cotton Morgan Drive  Wartburg, Tennessee",
        "state": "Tennessee",
        "place": "Wartburg",
        "county": "Morgan County",
        "paragraph": "Morgan County Correctional Complex (MCCX) is a maximum security prison in unincorporated Morgan County, near Wartburg, Tennessee, operated by the Tennessee Department of Correction. It opened in 1980. An expansion completed in 2009 increased its capacity to 2,500 prisoners. The prison is accredited by the American Correctional Association. The current warden is Mike Parris.[1]\nWhen the Brushy Mountain Correctional Complex closed in June 2009, its functions and most inmates and staff were transferred to the Morgan County Correctional Complex.[2][3]\nCoordinates: 36°06′48″N 84°32′21″W﻿ / ﻿36.11333°N 84.53917°W﻿ / 36.11333; -84.53917\n",
        "type": []
    },
    "57": {
        "link": "/wiki/Colleen_Slemmer",
        "title": "Christa Pike",
        "date": "January 12, 1995",
        "year": "1995",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Christa Gail Pike (born March 10, 1976) is an American convicted murderer, and the youngest woman to be sentenced to death in the United States during the post-Furman period.[1] She was 20 when convicted of the torture murder of her classmate Colleen Slemmer, which she committed at age 18.\nPike lived a troubled life and dropped out of high school. She joined the Job Corps, a government program aimed at helping low-income youth by offering vocational training and career skills, and attended the now-closed Job Corps center in Knoxville, Tennessee. Pike began dating a man a year her junior named Tadaryl Shipp. Together, they developed interest in the occult and devil worship.[2]\nChrista became jealous of her friend, university student 19-year-old Colleen Slemmer, who she thought was trying to \"steal\" her boyfriend from her; friends of Slemmer denied the accusations. Along with friend Shadolla Peterson, 18, Pike planned to lure Slemmer to an isolated, abandoned steam plant near the University of Tennessee campus.[2]\n",
        "type": [
            "murder",
            "torture"
        ]
    },
    "58": {
        "link": "/wiki/Nicholas_Todd_Sutton",
        "title": "Nicholas Todd Sutton",
        "date": "February 20, 2020(2020-02-20) (aged 58) Riverbend Maximum Security Institution, Nashville, Tennessee, U.S.",
        "year": "2020",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Nicholas Todd Sutton (July 15, 1961 – February 20, 2020) was an American serial killer who was responsible for murdering two acquaintances and his own grandmother in North Carolina and Tennessee from August to December 1979. Convicted and sentenced to life imprisonment for these crimes, Sutton, among three others, later participated in a 1985 prison killing over drugs.[1] For this final crime, he was sentenced to death and executed in 2020 by electric chair.[1] Sutton is the most recent person to be executed in this manner.\nNicholas Todd Sutton was born on July 15, 1961 in Morristown, Tennessee. His mother abandoned him at birth, while his father, a mentally-ill and verbally abusive alcoholic, was constantly detained in either mental institutions or various jails.[2] As he grew up, Sutton was taught to use drugs by his father, leading to a drug addiction that would last up until his incarceration.[2]\nWhen he was still a teenager, Sutton's father died suddenly, leading to him being adopted by his widowed grandmother, Dorothy Virginia Sutton, a schoolteacher living in Lowland.[2] \"Nicky\", as he was nicknamed, eventually would drop out of school due to frequent fighting with classmates, leaving his grandmother to pay for his living expenses. Despite her good intentions, he often squandered the money on weekly purchases of cocaine and maintaining his pit bulls, and even resold a pickup truck and a land plot in North Carolina which his grandmother had given to him as a gift.[2]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "59": {
        "link": "/wiki/Killing_of_Daniel_Hambrick",
        "title": "Killing of Daniel Hambrick",
        "date": "",
        "year": "new 2018",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "On July 26, 2018, Daniel Edward Hambrick, a 25 year old African-American was shot and killed by officer Andrew Delke of the Nashville, Tennessee police department.[1]\nHambrick was shot after he began to run away from officer Delke. Delke was searching for a white Chevrolet Impala which he had attempted to pull over earlier that day. He saw a white car which he thought was the Impala, so he pulled alongside it. It was at this time that Hambrick began to run away while carrying a handgun. Delke then pursued Hambrick and gave him commands to drop the weapon. Hambrick refused to drop the weapon, Delke then fired four times with three of the shots striking Hembrick. He was hit in the back of the head, back, and left torso. Hambrick died shortly after the shooting.[1]\nDelke was placed on \"routine administrative leave,\" and the Tennessee Bureau of Investigation (TBI) began investigating the shooting.[2] There was no body camera, nor dash camera footage of the shooting.\n",
        "type": [
            "killing",
            "shooting"
        ]
    },
    "60": {
        "link": "/wiki/Antonio_King",
        "title": "SmileDirectClub",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "SmileDirectClub is a teledentistry company. The company was co-founded in 2014 by Jordan Katzman and Alex Fenkell. It is based in Nashville, Tennessee.[3][4]\nSmileDirectClub produces 3D-printed clear aligners.[5] SmileDirectClub aligners are a competitor of traditional braces and clear alignment companies like Invisalign.[6]\nCommunication with licensed orthodontic professionals and other SmileDirectClub staff takes place virtually. Impression kits are sent to customers, after which teeth molds are reviewed by dentists or orthodontists who oversee the treatment process. The company reportedly works with 225 licensed professionals.[7]\n",
        "type": []
    },
    "61": {
        "link": "/wiki/Cyntoia_Brown",
        "title": "Cyntoia Brown",
        "date": "August 7, 2004",
        "year": "2004",
        "location": "",
        "state": "Tennessee",
        "place": "Fort Campbell",
        "county": "Montgomery County",
        "paragraph": "Cyntoia Brown Long (née Brown; born January 29, 1988) is an American author and speaker who was convicted of murder and robbery at the age of 16. Brown, who was a victim of child sex trafficking at the time of the incident, claimed that Johnny Allen had paid her $150 to have sex with him, and that she feared for her life during their encounter, leading her to shoot him. Prosecutors argued that Brown killed Allen while he was sleeping in order to rob him. Brown was found guilty of robbing and murdering Allen and was sentenced to life imprisonment.\nShe would have been eligible for parole at the age of 67. After renewed interest in her case in 2013, Tennessee Governor Bill Haslam commuted her original sentence to 15 years and Brown was released on August 7, 2019.[1] Her story is detailed in the 2011 documentary Me Facing Life: Cyntoia's Story and in her memoir, Free Cyntoia: My Search for Redemption in the American Prison System. Her fight for freedom from prison is documented in the Netflix special Murder to Mercy: The Cyntoia Brown Story (2020).\nCyntoia Denise Brown was born at Fort Campbell, Kentucky, on January 29, 1988.[2] Her father is unknown. Her biological mother, Georgina Mitchell, drank alcohol during her pregnancy.[3] Brown's defense attorneys would later claim that this caused her to develop fetal alcohol spectrum disorder.[4] Following Brown's birth, Mitchell began to use crack cocaine.[5] Unable to care for her infant daughter, Mitchell placed the child up for adoption.[6]\n",
        "type": [
            "robbery",
            "murder",
            "robber"
        ]
    },
    "62": {
        "link": "/wiki/Barack_Obama_assassination_plot_in_Tennessee",
        "title": "Barack Obama assassination plot in Tennessee",
        "date": "",
        "year": "new 2008",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "\nThe Barack Obama assassination plot in Tennessee was a plot by Paul Schlesselman and Daniel Cowart to assassinate Barack Obama, who was then the 2008 Democratic Party presidential nominee. The two men, both Neo-Nazi white power skinheads, spoke of killing Obama during a planned murder spree of 88 African Americans in Tennessee (in reference to the Nazi slogan Heil Hitler), 14 of whom were to be beheaded (a reference to the Fourteen Words slogan), many of whom were young students at an unidentified, predominantly black school.\nSchlesselman and Cowart were arrested on October 22, 2008, and found to be in possession of several weapons. The men told authorities of their planned assassination and killing spree, and said they intended to rob a weapon store to obtain additional weapons and commit home robberies to help fund the operation. Although the United States Secret Service said they were taking the plot seriously, authorities were unsure how capable Schlesselman and Cowart were of carrying out the alleged plot. Both plotters pleaded guilty to various federal charges; Judge J. Daniel Breen of the United States District Court for the Western District of Tennessee sentenced Schlesselman to 10 years imprisonment on April 15, 2010, and Cowart to 14 years in prison on October 22, 2010.\n",
        "type": [
            "killing",
            "terrorist",
            "robberies",
            "murder",
            "robber",
            "terrorism"
        ]
    },
    "63": {
        "link": "/wiki/Lynching_of_Ballie_Crutchfield",
        "title": "Lynching of Ballie Crutchfield",
        "date": "",
        "year": "new 1901",
        "location": "",
        "state": "Tennessee",
        "place": "Rome",
        "county": "Smith County",
        "paragraph": "\nOn March 15, 1901, an African American woman named Ballie Crutchfield was lynched by a white mob in Rome, Tennessee. The mob had tried to murder her brother, earlier that night, but was unsuccessful and took vengeance on his sister, whom they bound, shot, and threw in a creek.[1]\nThe week before the murder, rumors spread that a wallet containing $120, which a white man in Rome had lost, had been found by a Black child who had given it to a Black man, William Crutchfield. Being accused of theft, Crutchfield was quickly arrested and thrown in jail. A white mob sprang him from jail but he escaped as they tried to lynch him. When they couldn't find him, the mob took vengeance on Crutchfield's sister. She was taken out of town, and with her hands tied behind her back she was shot and thrown into a creek.[2]\n",
        "type": [
            "lynching",
            "murder",
            "theft"
        ]
    },
    "64": {
        "link": "/wiki/Murder_of_Kerrick_Majors",
        "title": "Murder of Kerrick Majors",
        "date": "April 26, 1987 (aged 14) East Nashville, Tennessee, U.S.",
        "year": "1987",
        "location": "",
        "state": "Tennessee",
        "place": "East Nashville",
        "county": "Davidson County",
        "paragraph": "On April 26, 1987, Kerrick Majors, a 14-year-old African-American boy, was tortured and murdered during a racially-motivated hate crime by three white drifters in East Nashville, Tennessee.[1] Majors was attacked by the trio after he and his friends accidentally broke a $2 vase at a flea market.[2] Majors was kidnapped, tortured, beaten, and stabbed to death, while his attackers yelled racial slurs at him.[1][3] His body was found the following day.[4]\nDonald Ray Middlebrooks, Tammy Middlebrooks, and Robert Brewington, all white, were convicted of his murder. Donald Middlebrooks was sentenced to death, while Tammy Middlebrooks and Brewington received life sentences.[5] The police were criticized for their handling of the case and were accused of being racially biased.[6][7] Majors' family later sued the Metro government and said the police's slow response to Majors' disappearance led to his death.[8]\nThe case was notable due to its brutal nature, alleged racial bias from the police, and because it marked a rare occasion in which a white person received a death sentence for murdering a black person.[9][10] Middlebrooks was scheduled to be executed in December 2022, but his execution was later suspended.[11][12][13] If executed, Middlebrooks will be the first white person in modern Tennessee history to be executed for killing a black person.[14][15]\n",
        "type": [
            "murder",
            "killing",
            "kidnapped",
            "torture"
        ]
    },
    "65": {
        "link": "/wiki/Doublehead",
        "title": "Doublehead",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Chickamauga",
        "county": "Hamilton County",
        "paragraph": "Doublehead (1744–1807) or Incalatanga (Tal-tsu'tsa, ᏔᎵᏧᏍᎦ in Cherokee), was one of the most feared warriors of the Cherokee during the Cherokee–American wars. Following the peace treaty at the Tellico Blockhouse in 1794, he served as one of the leaders of the Chickamauga Cherokee (or \"Lower Cherokee\"), and he was chosen as the leader of  Chickamauga (taking on the title Chuqualataque) in 1802.[1]\nIt is thought that Doublehead's father was Great Eagle (or Willenewa), a nephew of Chief Old Hop and a cousin of Chief Attakullakulla (or Little Carpenter)[citation needed]. He was a brother of Old Tassel,  \"First Beloved Man\" of the Overhill Cherokee. Two of his relatives, Tahlonteeskee and John Jolly, were also leaders among the Chickamauga and both later became Principal Chiefs of the Cherokee Nation. Doublehead's last wife was Nancy Drumgoole. Their youngest son, Bird Doublehead, was only twelve years old at the time of Doublehead's assassination.\nLiving in the Overhill Towns on the Little Tennessee River, he sporadically took part in the campaigns of Dragging Canoe as they were under a flag of truce during an embassy to the State of Franklin in 1788, until the murder of his brother, and another pacifist chief, Abraham of Chilhowee. Thereafter, he became one of the most vicious fighters and most capable leaders of the Cherokee during war.\n",
        "type": [
            "murder"
        ]
    },
    "66": {
        "link": "/wiki/John_Donelson",
        "title": "John Donelson",
        "date": "1785 (aged 66–67)",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Franklin County",
        "county": "Franklin County",
        "paragraph": "John Donelson (1718–1785) was an American frontiersman, ironmaster, politician, city planner, and explorer. After founding and operating what became Washington Iron Furnace in Franklin County, Virginia for several years, he moved with his family to Middle Tennessee. It was on the developing frontier.\nThere, together with James Robertson, Donelson co-founded the frontier settlement of Fort Nashborough. This later developed as the city of Nashville, Tennessee.\nDonelson and his wife Rachel had eleven children, four of them girls. Their tenth, daughter Rachel,\nmarried Andrew Jackson who was elected United States president in 1828.\n",
        "type": []
    },
    "67": {
        "link": "/wiki/Mel_Street",
        "title": "Mel Street",
        "date": "October 21, 1978(1978-10-21) (aged 43) Hendersonville, Tennessee, United States",
        "year": "1978",
        "location": "",
        "state": "Tennessee",
        "place": "Hendersonville",
        "county": "Sumner County",
        "paragraph": "\nKing Malachi \"Mel\" Street (October 21, 1935 – October 21, 1978)[1] was an American country music singer who had 13 top-20 hits on the Billboard country charts.\nStreet was born near Grundy, Virginia, United States.[2][3] Publications cite his year of birth as 1933, although his family maintains that he was born in 1935 and his gravestone gives the year as 1936.[4][5]\nHe began performing on western Virginia and West Virginia radio shows at the age of sixteen.[6] Street subsequently worked as a radio tower electrician in Ohio,[6] and as a nightclub performer in the Niagara Falls, New York area.[1] He moved back to West Virginia in 1963 to open an auto body shop.[7]\n",
        "type": []
    },
    "68": {
        "link": "/wiki/Bob_Welch_(musician)",
        "title": "Bob Welch (musician)",
        "date": "June 7, 2012(2012-06-07) (aged 66) Antioch, Tennessee, U.S.",
        "year": "2012",
        "location": "",
        "state": "Tennessee",
        "place": "Antioch",
        "county": "Davidson County",
        "paragraph": "Robert Lawrence Welch Jr. (August 31, 1945 – June 7, 2012) was an American musician who was a member of Fleetwood Mac from 1971 to 1974. He had a successful solo career in the late 1970s. His singles included \"Hot Love, Cold World\", \"Ebony Eyes\", \"Precious Love\", \"Hypnotized\", and his signature song, \"Sentimental Lady\".\nWelch was born in Hollywood, California, into a show business family. His father, Robert L. Welch Sr., was a producer and screenwriter at Paramount Pictures, producing films starring Bob Hope and Bing Crosby. Welch Sr. produced the 25th Annual Academy Awards TV special in 1953 and The Thin Man TV series from 1958 to 1959. Bob's mother, Templeton Fox, was a singer and actress who worked with Orson Welles' Mercury Theatre in Chicago and appeared in TV and movies from 1962 to 1979.\nWelch learned clarinet in his childhood, switching to guitar in his early teens. His interests were jazz, rhythm and blues, and rock music. He was accepted into Georgetown University, but instead moved to Paris, planning to attend the Sorbonne. Welch told People in a 1979 interview that, in Paris, \"I mostly smoked hash with bearded guys five years older\" and spent most of his time \"sitting in the Deux Magots café\". He returned to Southern California, where he briefly studied French at the University of California, Los Angeles[1] but did not complete a degree.\n",
        "type": []
    },
    "69": {
        "link": "/wiki/Lynching_of_Cordie_Cheek",
        "title": "Lynching of Cordie Cheek",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Maury County",
        "county": "Maury County",
        "paragraph": "Cordie Cheek (1916 – 1933) was a 17-year-old[1] African-American youth who was lynched by a white mob in Maury County, Tennessee near the county seat of Columbia. After being falsely accused of raping a young white girl, Cheek was released from jail when the grand jury did not indict him, due to lack of evidence. The county magistrate and two other men from Maury County abducted Cheek from Nashville, where he was staying with relatives near Fisk University, took him back to the county, and turned him over to a lynch mob. The mob mutilated the youth and murdered him by hanging.\nCordie Cheek lived with his parents in Glendale, a small community just south of the county seat of Columbia in Maury County.[2] Cordie's mother Tenny \"worked for many years as a cook, maid, midwife, and nurse\" for the Moores, a white family who lived nearby.  Tenny arranged for her son to help doing chores around the Moore household.[2] Henry Carl Moore, nineteen years old in the winter of 1933, was two years older than Cordie. Friction began to develop between the two young men and, on one occasion, they had come to blows after a dispute over payment due to Cordie and his mother.\nOn November 16, 1933, Cheek was chopping wood for the Moores. As he brought a load into the house, he accidentally collided with Henry's twelve-year-old sister, tearing her dress. Incensed, Henry paid his younger sister one dollar to claim that Cordie had tried to rape her.\n",
        "type": [
            "lynching",
            "murder",
            "rape"
        ]
    },
    "70": {
        "link": "/wiki/Lynching_of_Jim_McIlherron",
        "title": "Lynching of Jim McIlherron",
        "date": "February 12, 1918",
        "year": "1918",
        "location": "Estill Springs, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Springs",
        "county": "Macon County",
        "paragraph": "Jim McIlherron was an African-American man who was tortured and executed by a lynch mob on February 12, 1918, in Estill Springs, Tennessee. McIlherron was lynched in retaliation for shooting and killing two white men after a fight broke out.\nWalter White wrote a report on the lynching for the May 1918 issue of the NAACP magazine The Crisis.[1][2]\nIt was also covered by the York Daily Record and The New York Times in February 1918.[3][4]\n",
        "type": [
            "torture",
            "killing",
            "shooting",
            "murder",
            "lynching"
        ]
    },
    "71": {
        "link": "/wiki/Philip_Trenary",
        "title": "Philip Trenary",
        "date": "September 27, 2018 (aged 64) Memphis, Tennessee, U.S.",
        "year": "2018",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "Philip Hartley Trenary (August 1, 1954 – September 27, 2018) was an American businessman and civic leader who was the CEO and president of the Greater Memphis Chamber of Commerce and a former CEO of Pinnacle Airlines.\nPhilip Hartley Trenary was born on August 1, 1954, in Pawhuska, Oklahoma, the son of May Ruth and Buck Trenary.[1][2]\nHe grew up nearby in Shidler, Oklahoma.[2] He learned to fly a plane before he learned to drive a car.[2]\n",
        "type": [
            "murder"
        ]
    },
    "72": {
        "link": "/wiki/Sam_Y._Parker",
        "title": "Sam Y. Parker",
        "date": "",
        "year": "new 1906",
        "location": "",
        "state": "Tennessee",
        "place": "Helenwood",
        "county": "Scott County",
        "paragraph": "\nSamuel Epps Young Parker (May 12, 1880 – July 5, 1906) was a college football and baseball player for the Tennessee Volunteers of the University of Tennessee.[1] He was a member of Chi Delta.[2] On the football team he was a fullback.  Nash Buckingham selected Parker All-Southern in 1904.[3]\nParker was shot by lawyer James E. Fulton on July 5, 1906 as he stepped off a train in Helenwood. Fulton alleged his wife had been having an affair with Parker.[4] Fulton later also died from a gunshot.[5]\n\n",
        "type": [
            "murder"
        ]
    },
    "73": {
        "link": "/wiki/Phil_King_(American_football)",
        "title": "Phil King (American football)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Dyersburg",
        "county": "Dyer County",
        "paragraph": "Philip Edgar King (June 22, 1936 – January 18, 1973) was an American football running back in the National Football League for the New York Giants, Pittsburgh Steelers, and the Minnesota Vikings.  He played college football at Vanderbilt University (1955–57) and was drafted in the first round (twelfth overall) of the 1958 NFL Draft. He was nicknamed \"The Chief\" due to his Native American heritage.\nPhil King  was a starting running back at Vanderbilt. He was one of the top SEC conference backs and played in five NFL championship games in six seasons with the New York Giants. He was (All-State), basketball and baseball at Dyersburg (TN) High School.\nAt Vanderbilt King played for Coach Art Guepe, missed his entire freshman season due to a back injury, in 1955 his sophomores year he gained 628 rushing yards (6.4 yards per carry). He was named Third Team All-SEC and All-South by International News Service.\nIn the 1955 season the Commodores played in the Gator Bowl (27-13 win over Auburn), Vanderbilt football's first-ever postseason game. King scored a touchdown but a penalty on the play wiped it out. King also played defensive back. A Vanderbilt press release wrote about King, \"In the broken field King flashes his quick, elusive speed of the deer, but at the line of scrimmage he uses the crunching power of the buffalo. On defense he cuts down a runner with the sudden slash of a bear, or leaps to snare a pass out of the air with the keenness of the eagle.\"\n",
        "type": []
    },
    "74": {
        "link": "/wiki/Knoxville_Unitarian_Universalist_church_shooting",
        "title": "Knoxville Unitarian Universalist church shooting",
        "date": "July 27, 2008 (2008-07-27)  (EDT)",
        "year": "2008",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nThe Tennessee Valley Unitarian Universalist Church Shooting was a mass shooting that occurred on July 27, 2008[2] when an unemployed Tennessee truck driver named Jim David Adkisson went on a shooting rampage at the Tennessee Valley Unitarian Universalist Church in Knoxville, Tennessee. Adkisson opened fire on members of the congregation during a church youth performance, killing two people and wounding six others before he was restrained by church members; according to police, he had planned to keep shooting until the police arrived and killed him.[3][4]\nA letter, or \"manifesto,\" found in his vehicle after the shooting attributed his motivation for the rampage as a hatred of liberals, Democrats, African Americans, and homosexuals.[5] In the letter he also described what he believed to be the cult-like atmosphere of the church. Adkisson pled guilty to two counts of murder and received a sentence of life in prison without parole.[3]\nThe Unitarian Universalist church hosted a youth performance of Annie Jr. Some 200 people were watching the performance by 25 children when Adkisson entered the church and opened fire on the audience. 60-year-old Greg McKendry, a longtime church member and usher who deliberately stood in front of the gunman to protect others, was killed at the scene. A 61-year-old woman, Linda Kraeger, died from wounds suffered during the attack later that night. Kraeger was a member of Westside Unitarian Universalist Church in Farragut.[6]\n",
        "type": [
            "murder",
            "killing",
            "shooting",
            "mass shooting"
        ]
    },
    "75": {
        "link": "/wiki/Perry_March",
        "title": "Murder of Janet March",
        "date": "August 15, 1996 (1996-08-15)",
        "year": "1996",
        "location": "Forest Hills, Tennessee, United States",
        "state": "Tennessee",
        "place": "Forest Hills",
        "county": "Davidson County",
        "paragraph": "\nOn August 29, 1996, Janet Gail March, (née  Levine February 20, 1963 [1] – August 15, 1996), a  children's book illustrator from the Nashville suburb of Forest Hills, Tennessee, United States, was reported missing to police by her family. Her husband, Perry March, a lawyer, told police he had last seen his wife when she left the house on the night of August 15, two weeks earlier, following an argument. He claimed she had packed her bags for a 12-day vacation at an unknown location and driven away. She was never seen alive by anyone else afterwards.\nJanet's car was found at a nearby apartment complex a week after the police report, apparently having been there for some time. Other evidence began to suggest that Perry had fabricated some evidence of his wife's supposed motive for departure, and attempted to tamper with or destroy other items that might have provided evidence. Police soon reclassified the case as a homicide, despite the absence of Janet's body, and named Perry as a suspect. Shortly afterwards he moved back to his native Chicago area with the couple's two children. After his in-laws won visitation, he fled with the children to Mexico, where his father, Arthur, a former U.S. Army pharmacist, had retired. The case received attention in the national media, where it was the subject of two segments on the CBS News program 48 Hours.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "76": {
        "link": "/wiki/Signal_Mountain_murders",
        "title": "Signal Mountain murders",
        "date": "",
        "year": "new 1988",
        "location": "",
        "state": "Tennessee",
        "place": "Chattanooga",
        "county": "Hamilton County",
        "paragraph": "The Signal Mountain murders refers to a widely publicized case in 1988 involving the shootings of Richard Mason, Kenneth Griffith, and Earl Smock near Chattanooga, Tennessee. The men were missing and being searched for by their relatives when they did not return home. These relatives followed a blood path to the bodies off Big Fork Road and later found the victims' ATVs in a separate location. Their bullet-riddled bodies and ATVs were found in the woods of Signal Mountain near Roberts Mill Road. The three men had been riding along trails, portions of which crossed private property, with the intention of going swimming. \nThe owners of the land were Frank Casteel and his wife, Susie. When Frank noticed more and more people intruding on his land he consulted a police officer who advised him to keep a logbook of everyone he witnessed.  Frank had a run in with the three men and wrote it down, though never mentioned anything of murder. The men were later found dead and Casteel was a prime suspect. At the time Frank had a mistress, Mrs. Marie Hill, to whom Casteel’s wife sent his logbook in hopes that Mrs. Hill would leave him.[1] Mrs. Hill turned in the logbook to the police for evidence. Although there was no mention of violent behavior in the book and no physical evidence to support Casteel’s conviction, he was sentenced to life in prison. An appeal was made and eventually given an opportunity to overturn Casteel’s conviction in 2001.[2] The attorneys said there was no hard evidence that clearly identifies Casteel as the murderer.[3] In 2003 Frank Casteel was found guilty again for the triple homicide and returned to prison.[4] Casteel died in prison in May 2019 at the age of 71.[5]\nIn 2020, Casteel's son Franklin Trever Casteel authored a book on the subject. [6]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "77": {
        "link": "/wiki/Martin_Luther_King_Jr.",
        "title": "Martin Luther King Jr.",
        "date": "April 4, 1968(1968-04-04) (aged 39) Memphis, Tennessee, U.S.",
        "year": "1968",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\n\nCampaigns\n",
        "type": [
            "murder"
        ]
    },
    "78": {
        "link": "/wiki/Lee_Emerson_(musician)",
        "title": "Lee Emerson (musician)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Lee Emerson Bellamy (May 15, 1927 – December 2, 1978) was an American music singer and songwriter. As Lee Emerson, he was manager for Marty Robbins, Bobby Helms, Jimmy C. Newman, and George Jones[1] He also was a songwriter for Robbins along with Joe Babcock and Jim Glaser.[2][3][4][5][6][7]\nHe was shot and killed by business associate and fellow songwriter  Barry Sadler, who was sentenced to 30 days in a Nashville workhouse for the killing.[8]\n\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "79": {
        "link": "/wiki/Assassination_of_Martin_Luther_King_Jr.",
        "title": "Assassination of Martin Luther King Jr.",
        "date": "April 4, 1968; 54 years ago (1968-04-04) 6:01 p.m. (CST (UTC–6) )",
        "year": "1968",
        "location": "Lorraine MotelMemphis, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nCity of Memphis\nCity of Nashville\n",
        "type": [
            "murder"
        ]
    },
    "80": {
        "link": "/wiki/Capital_punishment_in_Tennessee",
        "title": "Capital punishment in Tennessee",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "Capital punishment is a legal punishment in Tennessee.\nWhen the prosecution seeks the death penalty, the sentence is decided by the jury and must be unanimous.\nIn case of a hung jury during the penalty phase of the trial, a life sentence is issued, even if only a single juror opposed death (there is no retrial).[1]\n",
        "type": []
    },
    "81": {
        "link": "/wiki/Janet_March",
        "title": "Murder of Janet March",
        "date": "August 15, 1996 (1996-08-15)",
        "year": "1996",
        "location": "Forest Hills, Tennessee, United States",
        "state": "Tennessee",
        "place": "Forest Hills",
        "county": "Davidson County",
        "paragraph": "\nOn August 29, 1996, Janet Gail March, (née  Levine February 20, 1963 [1] – August 15, 1996), a  children's book illustrator from the Nashville suburb of Forest Hills, Tennessee, United States, was reported missing to police by her family. Her husband, Perry March, a lawyer, told police he had last seen his wife when she left the house on the night of August 15, two weeks earlier, following an argument. He claimed she had packed her bags for a 12-day vacation at an unknown location and driven away. She was never seen alive by anyone else afterwards.\nJanet's car was found at a nearby apartment complex a week after the police report, apparently having been there for some time. Other evidence began to suggest that Perry had fabricated some evidence of his wife's supposed motive for departure, and attempted to tamper with or destroy other items that might have provided evidence. Police soon reclassified the case as a homicide, despite the absence of Janet's body, and named Perry as a suspect. Shortly afterwards he moved back to his native Chicago area with the couple's two children. After his in-laws won visitation, he fled with the children to Mexico, where his father, Arthur, a former U.S. Army pharmacist, had retired. The case received attention in the national media, where it was the subject of two segments on the CBS News program 48 Hours.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "82": {
        "link": "/wiki/Meriwether_Lewis",
        "title": "Meriwether Lewis",
        "date": "October 11, 1809(1809-10-11) (aged 35) Hickman County, Tennessee, U.S. (now near Hohenwald, Tennessee)",
        "year": "1809",
        "location": "",
        "state": "Tennessee",
        "place": "Hickman County",
        "county": "Hickman County",
        "paragraph": "\nMeriwether Lewis (August 18, 1774 – October 11, 1809) was an American explorer, soldier, politician, and public administrator, best known for his role as the leader of the Lewis and Clark Expedition, also known as the Corps of Discovery, with William Clark.\nTheir mission was to explore the territory of the Louisiana Purchase, establish trade with, and sovereignty over the natives near the Missouri River, and claim the Pacific Northwest and Oregon Country for the United States before European nations. They also collected scientific data, and information on indigenous nations.[1] President Thomas Jefferson appointed him Governor of Upper Louisiana in 1806.[2][3] He died of gunshot wounds in what was either a murder or suicide, in 1809. \nMeriwether Lewis was born August 18, 1774,[5] on Locust Hill Plantation in Albemarle County, Colony of Virginia, in the present-day community of Ivy.[6] He was the son of William Lewis,[7] of Welsh ancestry, and Lucy Meriwether,[8] of English ancestry. After his father died of pneumonia in November 1779, he moved with his mother and stepfather Captain John Marks to Georgia.[9] They settled along the Broad River in the Goosepond Community within the Broad River Valley in Wilkes County (now Oglethorpe County). He was also the great-great-grandson of David Crawford, a prominent Virginia Burgess and militia colonel.[10][11]\n",
        "type": [
            "murder"
        ]
    },
    "83": {
        "link": "/wiki/2012_Bain_murder-kidnappings",
        "title": "2012 Bain murder-kidnappings",
        "date": "May 10, 2012(2012-05-10) (aged 35) New Albany, Mississippi, U.S.",
        "year": "2012",
        "location": "",
        "state": "Tennessee",
        "place": "Whiteville",
        "county": "Hardeman County",
        "paragraph": "\nOn April 27, 2012, Jo Ann Bain and her eldest daughter were murdered in Whiteville, Tennessee and the woman's two younger daughters were kidnapped by Adam Christopher Mayes, an Alpine, Mississippi man who had known the family for many years. On May 9, 2012, Mayes was added to the FBI Ten Most Wanted Fugitives, having replaced James \"Whitey\" Bulger on the list. The following day, he and the two girls were spotted in a heavily wooded area; during the capture attempt, Mayes reportedly shot himself in the head and later died from his wounds.[2] The two girls were rescued unharmed.\nOn August 9, 2013, in a plea bargain agreement, Mayes' wife, Teresa, pleaded guilty to two counts of second-degree murder and two counts of especially aggravated kidnapping and was sentenced to 35 years, minus the 460 days she had already spent in prison. His mother, Mary Mayes, pleaded guilty to two counts of especially aggravated kidnapping and was sentenced to 13 1/2 years.[3][4]\n",
        "type": [
            "murder",
            "kidnapped",
            "kidnapping"
        ]
    },
    "84": {
        "link": "/wiki/Philip_Workman",
        "title": "Philip Workman",
        "date": "August 5, 1981",
        "year": "1981",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "Philip Ray Workman (June 1, 1953 – May 9, 2007) was a death row inmate executed in Tennessee on May 9, 2007.[1] He was convicted in 1982 for the murder of a police officer following a robbery of a Wendy's restaurant in Memphis, Tennessee, and sentenced to death by lethal injection.\nBorn on June 1, 1953 at Fort Campbell, Kentucky, Workman grew up with his parents on various Army bases. He later joined the Army. Shortly after his 1973 discharge, Workman was sentenced to 5 years in prison in Georgia for burglary and drug possession. He served 25 months.[2] Workman also had a prior conviction for aggravated assault.[3]\nIn 1981, at 28 years old, Workman was living with his wife and 8-year-old daughter in Columbus, Georgia and was heavily addicted to cocaine.[2]  That summer, he hitchhiked to Memphis where, on August 5, 1981, he robbed a Wendy's restaurant with a .45 caliber semi-automatic pistol.\n",
        "type": [
            "assault",
            "robbery",
            "burglary",
            "murder",
            "robber"
        ]
    },
    "85": {
        "link": "/wiki/Wayne_Mills_(singer)",
        "title": "Wayne Mills (singer)",
        "date": "November 23, 2013(2013-11-23) (aged 44) Nashville, Tennessee",
        "year": "2013",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "\nJerald Wayne Mills (August 17, 1969 – November 23, 2013) was an American country musician, known for touring with the Wayne Mills Band for over 15 years and playing alongside Blake Shelton, Jamey Johnson and 2006 American Idol winner, Taylor Hicks.[1][2] During his career, Mills released five studio albums (with a sixth unreleased) and two live albums. He also had seven Top 20 singles in Europe from 2008 to 2010, including a chart-topper in Belgium in 2009.[3]\nDuring his education at Wallace State Junior College in Hanceville, Mills played baseball and later at The University of Alabama football. He had a Bachelor of Science degree in Education.[3]\n",
        "type": []
    },
    "86": {
        "link": "/wiki/Winston_Wiser",
        "title": "Winston Wiser",
        "date": "March 31, 1961(1961-03-31) (aged 51) Shelbyville, Tennessee",
        "year": "1961",
        "location": "",
        "state": "Tennessee",
        "place": "Shelbyville",
        "county": "Bedford County",
        "paragraph": "Winston Wiser (1910–1961) was a Tennessee Walking Horse trainer from Shelbyville, Tennessee, who won five World Grand Championships on three separate horses.\nWiser was born in Bedford County, Tennessee on January 23, 1910, to James Daniel Wiser and Laura Ferrell Wiser. He later married Katherine Morris. The couple had 3 children,[1] including a daughter, Judy, who also became a horse trainer and won the World Grand Championship in 1976.[2]\nWiser began his career training horses on his family's farm in  Wartrace, Tennessee, where his stables, Wiser's Walking Horse Stables, were later located.[3] Wiser won a total of 5 World Grand Championships at the Tennessee Walking Horse National Celebration in his career, beginning with the mare Black Angel in 1943.[4] Wiser trained and partly owned the stallion Merry Go Boy, who was bred by Wiser's brother Archie. Shown by Winston Wiser, Merry Go Boy won the Weanling Colt class in the 1943 Celebration. The next year he was the Yearling Colt winner, and was the Three-Year-Old World Champion in 1946. The same year Wiser showed him in the World Grand Championship for the first time, but the pair were defeated by Midnight Sun. Wiser and Merry Go Boy returned to the World Grand Championship in 1947 and won. They repeated the following year, which was the first time the Celebration was held on its specifically-built Celebration Grounds in Shelbyville.[5] Wiser won his fourth World Grand Championship on Go Boy's Shadow, a son of Merry Go Boy, in 1955. The next year, 1956, he and Go Boy's Shadow won the class again. It proved to be Wiser's final championship before his death.[6] Wiser remains the only person ever to win 5 World Grand Championships in the Tennessee Walking Horse industry.[7]\n",
        "type": []
    },
    "87": {
        "link": "/wiki/Frank_Faulkinberry",
        "title": "Frank Faulkinberry",
        "date": "May 13, 1933(1933-05-13) (aged 45) Tennessee",
        "year": "1933",
        "location": "",
        "state": "Tennessee",
        "place": "Lincoln County",
        "county": "Lincoln County",
        "paragraph": "Frank Albert Faulkinberry (November 27, 1887 – May 13, 1933) was an American football, basketball, and baseball player and coach.\nFrank was born on November 27, 1887 in Lincoln County, Tennessee to Christopher Columbus Faulkinberry and Sarah Ellen Caple.\nFaulkinberry was a tackle on the Sewanee Tigers, thrice selected All-Southern.[1] His play was once called \"a thing to marvel at.\"[2]  He is a tackle on Sewanee's all-time second team.[3] He was nominated though not selected for an Associated Press All-Time Southeast 1869-1919 era team.[4]  As a player, he stood some 6'4\", 198 pounds. At Sewanee he was a member of Phi Delta Theta. Faulkinberry is a member of both the Sewanee Athletics Hall of Fame[5] and the Blue Raiders Hall of Fame, having coached for years the Middle Tennessee Blue Raiders in both men and women's sports.[3] He was also a Latin professor. Faulkinberry Drive on the Middle Tennessee State campus is named in his honor.  Faulkinberry was inducted into the Sewanee Athletics Hall of Fame in 2014.[6]\n",
        "type": []
    },
    "88": {
        "link": "/wiki/List_of_people_executed_in_Tennessee",
        "title": "List of people executed in Tennessee",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "\nThis is a list of people executed in Tennessee. Until 1913, there were no records of the numbers or names of the people who were executed.\n",
        "type": []
    },
    "89": {
        "link": "/wiki/Johnny_Mitchell_Allen",
        "title": "Cyntoia Brown",
        "date": "August 7, 2004",
        "year": "2004",
        "location": "",
        "state": "Tennessee",
        "place": "Fort Campbell",
        "county": "Montgomery County",
        "paragraph": "Cyntoia Brown Long (née Brown; born January 29, 1988) is an American author and speaker who was convicted of murder and robbery at the age of 16. Brown, who was a victim of child sex trafficking at the time of the incident, claimed that Johnny Allen had paid her $150 to have sex with him, and that she feared for her life during their encounter, leading her to shoot him. Prosecutors argued that Brown killed Allen while he was sleeping in order to rob him. Brown was found guilty of robbing and murdering Allen and was sentenced to life imprisonment.\nShe would have been eligible for parole at the age of 67. After renewed interest in her case in 2013, Tennessee Governor Bill Haslam commuted her original sentence to 15 years and Brown was released on August 7, 2019.[1] Her story is detailed in the 2011 documentary Me Facing Life: Cyntoia's Story and in her memoir, Free Cyntoia: My Search for Redemption in the American Prison System. Her fight for freedom from prison is documented in the Netflix special Murder to Mercy: The Cyntoia Brown Story (2020).\nCyntoia Denise Brown was born at Fort Campbell, Kentucky, on January 29, 1988.[2] Her father is unknown. Her biological mother, Georgina Mitchell, drank alcohol during her pregnancy.[3] Brown's defense attorneys would later claim that this caused her to develop fetal alcohol spectrum disorder.[4] Following Brown's birth, Mitchell began to use crack cocaine.[5] Unable to care for her infant daughter, Mitchell placed the child up for adoption.[6]\n",
        "type": [
            "robbery",
            "murder",
            "robber"
        ]
    },
    "90": {
        "link": "/wiki/Allen-White_School",
        "title": "Allen-White School",
        "date": "",
        "year": "",
        "location": "100 Allen Extension StreetWhiteville, TennesseeUnited States",
        "state": "Tennessee",
        "place": "Whiteville",
        "county": "Hardeman County",
        "paragraph": "The Allen-White School, also known as Hardeman County Training School, was a Rosenwald school in Whiteville, Tennessee, United States, that is listed on the National Register of Historic Places.\nThe school was started in 1905 as Hardeman County Training School, a school for African Americans that held classes in a Masonic lodge building. The school was led by Jessie C. Allen, who is one of the two men that Allen-White School was later named for. Circa 1918–1920, the school's own building was built on donated land with a $4000 bank loan obtained by the school's trustees, matched by a $4000 donation from the Julius Rosenwald Fund.[2][3]\nThe school's second namesake, J.H. White, became school principal in the 1928–1929 school year. In 1930 the school added a junior high school program and in 1932 it expanded to include the four grades of high school. The school's first high school class graduated in 1933.[2][4] Allen-White was Hardeman County's only high school for African Americans and enrolled students from throughout the county; some students boarded in Whiteville in order to attend.[4][5]\n",
        "type": [
            "arson"
        ]
    },
    "91": {
        "link": "/wiki/Burnette_Chapel_shooting",
        "title": "Burnette Chapel shooting",
        "date": "September 24, 2017 11:15 a.m.",
        "year": "2017",
        "location": "The Burnette Chapel Church of Christ, Antioch, Tennessee",
        "state": "Tennessee",
        "place": "Antioch",
        "county": "Davidson County",
        "paragraph": "\nA mass shooting occurred on September 24, 2017, when a gunman opened fire at the Burnette Chapel Church of Christ in Antioch, Tennessee, part of the Greater Nashville area, killing one person and injuring six others.\nThe perpetrator was identified as Emanuel Kidega Samson, a 25-year-old native of Sudan.[2] Samson was arrested after getting into an altercation with a bystander, and charged with first-degree murder and 43 other charges.[2] The suspect indicated that the attack was an act of revenge for the 2015 Charleston church shooting.\n",
        "type": [
            "murder",
            "killing",
            "shooting",
            "mass shooting"
        ]
    },
    "92": {
        "link": "/wiki/Joseph_Edison_Walker",
        "title": "Joseph Edison Walker",
        "date": "July 28, 1958(1958-07-28) (aged 79) Memphis, Tennessee, USA",
        "year": "1958",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nJoseph Edison Walker (March 31, 1879 – July 28, 1958) was a leading African American physician, businessman and religious leader.  After graduating from college and medical school, he practiced as a doctor in Mississippi, where he was born and reared. He also became president of a bank and an insurance company serving blacks. In 1920 he moved with his family to Memphis, Tennessee for more opportunities.\nWith associates he founded the Universal Life Insurance Company in 1923, which became one of the largest black-owned insurance companies in the nation under his leadership through 1952.  With his son, in 1946 he founded Tri-State Bank, also of Memphis. He also founded the Mississippi Boulevard Christian Church, a congregation of the Christian Church (Disciples of Christ) in Memphis.\n",
        "type": []
    },
    "93": {
        "link": "/wiki/Dan_Leahy_(baseball)",
        "title": "Dan Leahy (baseball)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Daniel C. Leahy (August 8, 1870 – December 30, 1903) was a shortstop in Major League Baseball. He played two games for the Philadelphia Phillies in 1896.\nLeahy was born in Nashville, Tennessee. He started his professional baseball career in 1894, with the Lynchburg Hill Climbers of the Virginia League. In 1895, he hit .309 and was acquired by the Phillies. He played in a doubleheader on September 2, going 2 for 6 at the plate.\nLeahy played in the minor leagues until 1900. He was shot to death in 1903,[1] at the age of 33.\n",
        "type": []
    },
    "94": {
        "link": "/wiki/2015_Chattanooga_shootings",
        "title": "2015 Chattanooga shootings",
        "date": "July 16, 2015 (2015-07-16) c. 10:45 – c. 11:15 a.m.[1]",
        "year": "2015",
        "location": "Military installations in Chattanooga, Tennessee",
        "state": "Tennessee",
        "place": "Chattanooga",
        "county": "Hamilton County",
        "paragraph": "On July 16, 2015, Muhammad Youssef Abdulazeez opened fire on two military installations in Chattanooga, Tennessee. He first committed a drive-by shooting at a recruiting center, then traveled to a U.S. Navy Reserve center and continued firing, where he was killed by police in a gunfight.[citation needed] Four Marines died on the spot. A Navy sailor, a Marine recruiter, and a police officer were wounded; the sailor died from his injuries two days later.[citation needed]\nOn December 16, following an investigation, former Federal Bureau of Investigation (FBI)  director James B. Comey said that the shootings were \"motivated by foreign terrorist organization propaganda.\"\nThe shootings began shortly after 10:30 a.m. at the Armed Forces Career Center in a strip mall located on Lee Highway. The Center recruited personnel for branches of the United States military, including the U.S. Army, the U.S. Air Force, and the Tennessee National Guard. There, Abdulazeez fired 30 to 45 shots[7] into the office from inside a silver rental Ford Mustang convertible,[8] wounding a U.S. Marine. He then escaped and led members of the Chattanooga Police Department on a seven-mile pursuit.[9] At the time of the first shooting, only seven people, including the wounded Marine, were inside the recruiting center.[7]\n",
        "type": [
            "terrorist",
            "murder",
            "shooting",
            "mass shooting"
        ]
    },
    "95": {
        "link": "/wiki/Vanderbilt_rape_case",
        "title": "Vanderbilt rape case",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "\nThe Vanderbilt rape case is a criminal case of sexual assault that occurred on June 23, 2013, in Nashville, Tennessee, in which four Vanderbilt University football players carried an unconscious 21-year-old female student into a dorm room, gang-raped and sodomized her, photographed and videotaped her, and one urinated on her face.[1][2][3][4][5]\nThree of the rapists were convicted, and received prison sentences ranging from 15 years, the minimum allowed by Tennessee law for their crimes, to 17 years. The fourth player accepted a plea deal which included 10 years' probation, and did not receive any jail time.\nOn June 23, 2013, four Vanderbilt Commodores football team players, Brandon Vandenburg, Cory Lamont Batey, Brandon E. Banks, and Jaborian \"Tip\" McKenzie carried an unconscious 21-year-old female student into a dorm room in the school's Gilette House dorm. They gang-raped and sodomized her, slapped her, inserted their fingers in her, and sat on her face as she was on the floor in a 32-minute attack.[6][7][1][8][2][9] They took over 40 graphic photos, and took videos of the rape with the cell phones of Vandenburg, Batey, and Banks.[10][9] The victim (who is white) told the court that after Batey (who is black) raped her, he urinated on her face while saying she deserved what he was doing to her because of the color of her skin, saying what sources reported was \"That’s for 400 years of slavery, you bitch.\"[11][9]\n",
        "type": [
            "assault",
            "rape",
            "sex crime"
        ]
    },
    "96": {
        "link": "/wiki/Barry_Winchell",
        "title": "Murder of Barry Winchell",
        "date": "July 6, 1999; 23 years ago (1999-07-06)",
        "year": "1999",
        "location": "Fort Campbell, Kentucky , U.S.",
        "state": "Tennessee",
        "place": "Fort Campbell",
        "county": "Montgomery County",
        "paragraph": "On July 6, 1999, Barry Winchell, a 21-year old infantry soldier in the United States Army, was murdered while he slept, outside of his barracks by fellow soldier Calvin Glover for dating a transgender woman, Calpernia Addams, after a physical altercation between the two. The murder became a point of reference in the ongoing debate about the policy known as \"Don't ask, don't tell\", which did not allow U.S. military gays, bisexuals, and lesbians to be open about their sexual orientation.\nA native of Missouri, Winchell enlisted in the Army in 1997 and was transferred in 1998 to Fort Campbell, Kentucky. As a Private First Class, he was assigned to the 2nd Battalion 502nd Infantry of the 101st Airborne Division. While stationed there, he received a Dear John letter from his high school sweetheart.\nWinchell later accompanied his roommate, Spc. Justin Robert Fisher, 25, and other soldiers for an excursion to Nashville's downtown bars. In 1999, Fisher and others took Winchell to a Nashville club, The Connection, which featured transgender performers, where Winchell met a trans woman showgirl named Calpernia Addams.[1] The two began to date. Fisher began to spread rumors of the relationship at Ft. Campbell. Winchell then became a target of harassment which his superiors did almost nothing to stop.[2]\n",
        "type": [
            "murder"
        ]
    },
    "97": {
        "link": "/wiki/Crystal_Sturgill",
        "title": "Lillelid murders",
        "date": "",
        "year": "new 1997",
        "location": "",
        "state": "Tennessee",
        "place": "Greene County",
        "county": "Greene County",
        "paragraph": "\nThe Lillelid murders refers to a criminal case in Greene County, Tennessee, United States, where three members of the Lillelid family were murdered on April 6, 1997. Vidar Lillelid (aged 34), Delfina Lillelid (aged 28), and their daughter Tabitha (aged 6), and son Peter (aged 2) were shot on a deserted rural road near Baileyton during a carjacking committed by a group of youths. Vidar and Delfina were found dead at the scene, while Tabitha died after being transported to the hospital. Peter survived, but, as a result of the shooting, was left with disabilities.[1] Six young people from Kentucky, including two minors, were convicted of felony murder for the deaths of Vidar, Delfina, and Tabitha Lillelid, with all six perpetrators receiving three life sentences, and an additional sentence of 25 years each for the attempted murder of Peter Lillelid.[2]\nVidar Lillelid grew up in Bergen, Norway, and in 1985 moved to United States. In 1989, Lillelid married Delfina Zelaya, a first-generation Honduran-American from New York City, whom he had met through their common involvement in the Jehovah's Witnesses denomination.[citation needed]. By 1997, the Lillelids had two children: 6-year-old daughter Tabitha (1990-1997) and 2-year-old son Peter (b.1995).\n",
        "type": [
            "murder",
            "kidnapping",
            "shooting"
        ]
    },
    "98": {
        "link": "/wiki/Earl_Van_Dorn",
        "title": "Earl Van Dorn",
        "date": "May 7, 1863(1863-05-07) (aged 42) Spring Hill, Tennessee",
        "year": "1863",
        "location": "",
        "state": "Tennessee",
        "place": "Spring Hill",
        "county": "Maury County",
        "paragraph": "\nIndian Wars\nSeminole Wars\nComanche Wars\nAmerican Civil War\nEarl Van Dorn (September 17, 1820 – May 7, 1863) started his military career as a United States Army officer but joined Confederate forces in 1861 after the Civil War broke out. He was a major general when he was killed in a private conflict.\n",
        "type": []
    },
    "99": {
        "link": "/wiki/Keith_Westmoreland",
        "title": "Keith Westmoreland",
        "date": "June 19, 2002(2002-06-19) (aged 55) Kingsport, Tennessee, U.S.",
        "year": "2002",
        "location": "",
        "state": "Tennessee",
        "place": "Kingsport",
        "county": "Sullivan County",
        "paragraph": "B. Keith Westmoreland (August 26, 1946 – June 19, 2002) was an American businessman and Republican politician from Tennessee.\nBorn in Kingsport, Tennessee, Westmoreland served in the United States Air Force. He went to University of Tennessee and Walters State Community College and then received his bachelor's degree in criminal justice from East Tennessee State University.\nWestmoreland worked in the Sullivan County, Tennessee sheriff department and then as served as Sullivan County, Tennessee County Executive from 1986 to 1990. He then served in the Tennessee House of Representatives as a Republican from 1993 to 2002.\n",
        "type": []
    },
    "100": {
        "link": "/wiki/Memphis_riots_of_1866",
        "title": "Memphis riots of 1866",
        "date": "May 1–3, 1866",
        "year": "1866",
        "location": "Memphis, Tennessee, United States35.1495° N, 90.0490° W",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "European Americans\nAfrican Americans\nThe Memphis massacre of 1866[1] was a series of violent events that occurred from May 1 to 3, 1866 in Memphis, Tennessee. The racial violence was ignited by political and social racism following the American Civil War, in the early stages of Reconstruction.[2] After a shooting altercation between white policemen and black veterans recently mustered out of the Union Army, mobs of white residents and policemen rampaged through black neighborhoods and the houses of freedmen, attacking and killing black soldiers and civilians and committing many acts of robbery and arson.\n",
        "type": [
            "killing",
            "arson",
            "shooting",
            "robbery",
            "riot",
            "robber"
        ]
    },
    "101": {
        "link": "/wiki/Suzanne_Marie_Collins",
        "title": "Murder of Suzanne Marie Collins",
        "date": "July 12, 1985(1985-07-12) (aged 19) Millington, Tennessee",
        "year": "1985",
        "location": "",
        "state": "Tennessee",
        "place": "Millington",
        "county": "Shelby County",
        "paragraph": "Suzanne Marie Collins was a United States Marine Corps Lance Corporal who was tortured, raped, and murdered in 1985. At the time of her murder she was stationed at Naval Support Activity Mid-South in Millington, Tennessee. Collins was a student undergoing training at the base, and was scheduled to graduate from avionics training on the day of her murder. She is buried in Arlington National Cemetery. Suzanne Collins was the daughter of Jack and Trudy Collins. She graduated from John R. Lewis High School in Springfield, Virginia.\nOn the evening of July 11, 1985, Suzanne Marie Collins was abducted while jogging on the base, and was taken to nearby Edmund Orgill Park. There, the kidnapper severely beat Collins, fracturing her skull, before repeatedly shoving a tree limb up her vagina with enough force to penetrate her abdomen and tear one of her lungs. The autopsy would state that Collins died from blunt force trauma to the head and internal hemorrhaging from the tree limb.[1] The kidnapper then ditched the body and fled the scene.\nTwo Marines jogging near where Collins was abducted heard her scream and ran toward the sound. However, as they reached the scene, they saw a car leaving the area. They reported to base security and accompanied officers on a tour of the base, looking for the car. Unsuccessful, they returned to their barracks, but soon the Marines were called back to the security office. There they identified Sedley Alley's car, which had been stopped by officers. Alley and his wife gave statements to the base security personnel accounting for their whereabouts. The security personnel were satisfied with Alley's story, and Alley and his wife returned to their on-base housing. The two Marine witnesses returned to the security office shortly after Alley and his wife departed. The Marines disputed the couple's version of events, citing that the loud, distinct sounds made by the muffler on Alley's car matched those sounds they had heard prior to and during Collins' abduction. The security personnel indicated that since no one had yet been reported missing, there was nothing more that could be done. The Marines were thanked for their assistance and told to return to their barracks.[1]\n",
        "type": [
            "murder",
            "rape",
            "torture"
        ]
    },
    "102": {
        "link": "/wiki/Joseph_Risner",
        "title": "Lillelid murders",
        "date": "",
        "year": "new 1997",
        "location": "",
        "state": "Tennessee",
        "place": "Greene County",
        "county": "Greene County",
        "paragraph": "\nThe Lillelid murders refers to a criminal case in Greene County, Tennessee, United States, where three members of the Lillelid family were murdered on April 6, 1997. Vidar Lillelid (aged 34), Delfina Lillelid (aged 28), and their daughter Tabitha (aged 6), and son Peter (aged 2) were shot on a deserted rural road near Baileyton during a carjacking committed by a group of youths. Vidar and Delfina were found dead at the scene, while Tabitha died after being transported to the hospital. Peter survived, but, as a result of the shooting, was left with disabilities.[1] Six young people from Kentucky, including two minors, were convicted of felony murder for the deaths of Vidar, Delfina, and Tabitha Lillelid, with all six perpetrators receiving three life sentences, and an additional sentence of 25 years each for the attempted murder of Peter Lillelid.[2]\nVidar Lillelid grew up in Bergen, Norway, and in 1985 moved to United States. In 1989, Lillelid married Delfina Zelaya, a first-generation Honduran-American from New York City, whom he had met through their common involvement in the Jehovah's Witnesses denomination.[citation needed]. By 1997, the Lillelids had two children: 6-year-old daughter Tabitha (1990-1997) and 2-year-old son Peter (b.1995).\n",
        "type": [
            "murder",
            "kidnapping",
            "shooting"
        ]
    },
    "103": {
        "link": "/wiki/Josiah_M._Anderson",
        "title": "Josiah M. Anderson",
        "date": "November 8, 1861(1861-11-08) (aged 53) Whitwell, Tennessee",
        "year": "1861",
        "location": "",
        "state": "Tennessee",
        "place": "Pikeville",
        "county": "Bledsoe County",
        "paragraph": "Josiah McNair Anderson (November 29, 1807 – November 8, 1861) was an American slave owner,[1] politician and a member of the United States House of Representatives for Tennessee's 3rd congressional district.\nAnderson was born near Pikeville, Tennessee in Bledsoe County on November 29, 1807. He attended the common schools, studied law, was admitted to the bar, and commenced practice in Jasper, Tennessee.\nFrom 1833 to 1837, Anderson was a member of the Tennessee House of Representatives, serving as speaker. He was a member of the Tennessee Senate from 1843 to 1845, serving as its presiding officer.[2]\n",
        "type": [
            "murder"
        ]
    },
    "104": {
        "link": "/wiki/Bobby_Hester",
        "title": "Shannon Street massacre",
        "date": "January 11–13, 1983 (1983-01-11 – 1983-01-13)",
        "year": "1983",
        "location": "2239 Shannon Street,  Memphis, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "The Shannon Street massacre refers to a shootout that occurred at a house on Shannon Street in Memphis, Tennessee on January 12, 1983. Police officers Ray Schwill and Bobby Hester were called to the house after which a confrontation ensued and Hester was taken hostage by men inside the house. After a 30 hour standoff, Memphis Police officers stormed the house and opened fire, killing all seven captors, after which Hester was found beaten to death. The police's handling of the incident was controversial and led to changes in Memphis police procedure.[1][2]\nOn January 11, 1983, Memphis police were called to 2239 Shannon Street to investigate an alleged purse snatching. Inside the home was Lindberg Sanders-- a man with a history of mental illness and who called himself \"Black Jesus\"-- and thirteen other men who were his followers. Sanders harbored a strong hatred for law enforcement and had told his followers that the world would end on January 10, 1983. \nOfficers Ray Schwill and Bobby Hester responded to the call. Seven cultists fled the house at this point, but were later captured. Upon arrival, Schwill and Hester were ambushed by the remaining men in the house. Schwill sustained a gunshot wound to the face and escaped, but Hester was taken hostage. Schwill radioed for help and police quickly surrounded the house.[2][3][4]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "105": {
        "link": "/wiki/Lester_Eugene_Siler",
        "title": "Lester Eugene Siler",
        "date": "",
        "year": "new 2004",
        "location": "",
        "state": "Tennessee",
        "place": "Campbell County",
        "county": "Campbell County",
        "paragraph": "Lester Eugene Siler, a convicted drug dealer in the United States, was beaten and tortured by Campbell County, Tennessee police during an interrogation at his home, during which officers attempted to coerce Siler to sign a consent form giving them permission to search his home without a warrant.\nOn July 8, 2004, police officers entered the house of Siler and tortured him using various methods, including applying electricity to his genitalia.  Upon arrival, the officers asked his wife, Jenny, and son, Austin, to leave. Before the torture, however, Siler's wife set up an audio recorder which captured a large portion of the incident.\nFive officers, Gerald David Webber, Samuel R. Franklin, Joshua Monday, Shayne Green, and William Carroll were convicted in federal court of the beatings and attempted cover-up. They received prison sentences ranging from 51 to 72 months.[1][2]\n",
        "type": [
            "torture"
        ]
    },
    "106": {
        "link": "/wiki/Lindberg_Sanders",
        "title": "Shannon Street massacre",
        "date": "January 11–13, 1983 (1983-01-11 – 1983-01-13)",
        "year": "1983",
        "location": "2239 Shannon Street,  Memphis, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "The Shannon Street massacre refers to a shootout that occurred at a house on Shannon Street in Memphis, Tennessee on January 12, 1983. Police officers Ray Schwill and Bobby Hester were called to the house after which a confrontation ensued and Hester was taken hostage by men inside the house. After a 30 hour standoff, Memphis Police officers stormed the house and opened fire, killing all seven captors, after which Hester was found beaten to death. The police's handling of the incident was controversial and led to changes in Memphis police procedure.[1][2]\nOn January 11, 1983, Memphis police were called to 2239 Shannon Street to investigate an alleged purse snatching. Inside the home was Lindberg Sanders-- a man with a history of mental illness and who called himself \"Black Jesus\"-- and thirteen other men who were his followers. Sanders harbored a strong hatred for law enforcement and had told his followers that the world would end on January 10, 1983. \nOfficers Ray Schwill and Bobby Hester responded to the call. Seven cultists fled the house at this point, but were later captured. Upon arrival, Schwill and Hester were ambushed by the remaining men in the house. Schwill sustained a gunshot wound to the face and escaped, but Hester was taken hostage. Schwill radioed for help and police quickly surrounded the house.[2][3][4]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "107": {
        "link": "/wiki/Michael_Mullins_(serial_killer)",
        "title": "Michael Mullins (serial killer)",
        "date": "",
        "year": "new 1999",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nMichael Mullins (born June 28, 1961) is an American serial killer who murdered three women in Memphis, Tennessee between 1999 and 2012, and unsuccessfully tried to kill a fourth woman in Knoxville, Tennessee. He was arrested for the final murder in 2012, and his DNA was uploaded into a database which linked him to the three other crimes, after which he made a full confession and was given multiple life sentences without the possibility of parole.[1]\nMullins was born in Memphis on June 28, 1961, one of seven children.[2] For first few years of his life, he lived with his mother Ida, before he moved to West Memphis to live with his father. According to some, there is evidence that Mullins was illiterate. Mullins had failed first grade, and throughout his school years he was frequently absent. On IQ tests, he scored an average of between 59 and 69.[2] Mullins eventually dropped out of school in 1977, when he was in his ninth-grade year. Allegedly, three years later Mullins mother was shot and killed in front of him, with him saying she died in his arms. However, there are no records of her death according to the Memphis police department.[2] Mullins father, however, had died around this time in an unrelated incident.[2]\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    "108": {
        "link": "/wiki/Son_Bonds",
        "title": "Son Bonds",
        "date": "August 31, 1947(1947-08-31) (aged 38) Dyersburg, Tennessee, United States",
        "year": "1947",
        "location": "",
        "state": "Tennessee",
        "place": "Dyersburg",
        "county": "Dyer County",
        "paragraph": "Abraham John Bond Jr.,[2] known as Son Bonds (March 16, 1909 – August 31, 1947),[3] was an American country blues guitarist, singer and songwriter. He was a working associate of Sleepy John Estes and Hammie Nixon. He was similar to Estes in his guitar-playing style. According to the music journalist Jim O'Neal, \"the music to one of Bonds's songs, 'Back and Side Blues' (1934), became a standard blues melody when Sonny Boy Williamson I, from nearby Jackson, Tennessee, used it in his classic \"Good Morning, School Girl\".[1] The best-known of Bonds's other works are \"A Hard Pill to Swallow\" and \"Come Back Home.\"[3]\nBonds was born in Brownsville, Tennessee.[1] He was also billed on records as \"Brownsville\" Son Bonds and Brother Son Bonds.[4][5]\nSleepy John Estes, in his earlier recordings, was backed by Yank Rachell (mandolin) or Hammie Nixon (harmonica), but by the late 1930s he was accompanied in the recording studio by either Bonds or Charlie Pickett (guitar).[6] Bonds also backed Estes on a couple of recording sessions in 1941.[7] In return, either Estes or Nixon played on every one of Bonds's own recordings.[1] In the latter part of his career, Bonds played the kazoo as well as the guitar on several tracks.[8]\n",
        "type": []
    },
    "109": {
        "link": "/wiki/Zaevion_Dobson",
        "title": "Zaevion Dobson",
        "date": "December 17, 2015(2015-12-17) (aged 15) Knoxville, Tennessee, U.S.",
        "year": "2015",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nZaevion William Dobson (June 28, 2000 – December 17, 2015) was a school football player at Fulton High School in Knoxville, Tennessee. He became the recipient of the Arthur Ashe Courage Award, for shielding three girls from gunfire.\nZaevion William Dobson was born on June 28, 2000, in Knoxville, Tennessee, to parents Zenobia Dobson and Lionell Kimber.[1] Dobson has two brothers, Zackelyn Dobson and Markastin Taylor.[2] He was a football player wearing the number 24 at Fulton High School, playing for the Falcons.[2]\n",
        "type": [
            "murder"
        ]
    },
    "110": {
        "link": "/wiki/Lynching_of_Samuel_Bierfield",
        "title": "Lynching of Samuel Bierfield",
        "date": "August 15, 1868",
        "year": "1868",
        "location": "Franklin, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Franklin",
        "county": "Williamson County",
        "paragraph": "Samuel A. Bierfield (? - August 15, 1868) is believed to be the first Jew lynched in the United States. Bierfield and his African-American clerk, Lawrence Bowman, were confronted in Bierfield's store in Franklin, Tennessee and fatally shot on August 15, 1868 by a group of masked men. The killers were believed to belong to a local chapter of the Ku Klux Klan, which had emerged as an insurgent force in the state in 1866. Bierfield's murder was reported by both The New York Times and the Nashville Union and Dispatch.\nAs was typical in such cases, no one was ever convicted of the crime. One man was arrested for Bierfield's murder but was released by the judge after seven witnesses provided an alibi for him.[1][2][3] The lynching followed months of increasing political violence locally the year before, including the July 1867 attacks on black Union League members in what was called the Franklin Riot. An estimated 25 to 30 blacks were wounded and three died as a result of that incident, together with one white Conservative. \nRacial and political violence had increased in the area during 1867, especially after African Americans were granted the franchise from the state legislature in February 1867. Many former Confederates were still temporarily disenfranchised and resented their loss of political power. \n",
        "type": [
            "lynching",
            "murder",
            "riot"
        ]
    },
    "111": {
        "link": "/wiki/Dean_Mullins",
        "title": "Lillelid murders",
        "date": "",
        "year": "new 1997",
        "location": "",
        "state": "Tennessee",
        "place": "Greene County",
        "county": "Greene County",
        "paragraph": "\nThe Lillelid murders refers to a criminal case in Greene County, Tennessee, United States, where three members of the Lillelid family were murdered on April 6, 1997. Vidar Lillelid (aged 34), Delfina Lillelid (aged 28), and their daughter Tabitha (aged 6), and son Peter (aged 2) were shot on a deserted rural road near Baileyton during a carjacking committed by a group of youths. Vidar and Delfina were found dead at the scene, while Tabitha died after being transported to the hospital. Peter survived, but, as a result of the shooting, was left with disabilities.[1] Six young people from Kentucky, including two minors, were convicted of felony murder for the deaths of Vidar, Delfina, and Tabitha Lillelid, with all six perpetrators receiving three life sentences, and an additional sentence of 25 years each for the attempted murder of Peter Lillelid.[2]\nVidar Lillelid grew up in Bergen, Norway, and in 1985 moved to United States. In 1989, Lillelid married Delfina Zelaya, a first-generation Honduran-American from New York City, whom he had met through their common involvement in the Jehovah's Witnesses denomination.[citation needed]. By 1997, the Lillelids had two children: 6-year-old daughter Tabitha (1990-1997) and 2-year-old son Peter (b.1995).\n",
        "type": [
            "murder",
            "kidnapping",
            "shooting"
        ]
    },
    "112": {
        "link": "/wiki/James_Earl_Ray",
        "title": "James Earl Ray",
        "date": "April 4, 1968",
        "year": "1968",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nJames Earl Ray (March 10, 1928 – April 23, 1998) was an American fugitive convicted for assassinating Martin Luther King Jr. at the Lorraine Motel in Memphis, Tennessee, on April 4, 1968. After this, Ray was on the run and was captured in the UK. Ray was convicted in 1969 after entering a guilty plea—thus forgoing a jury trial and the possibility of a death sentence—and was sentenced to 99 years of imprisonment.\nRay was born on March 10, 1928, in Alton, Illinois, the son of Lucille Ray (née Maher) and George Ellis Ray. He had Irish, Scottish and Welsh ancestry and had a Catholic upbringing.[1]\n",
        "type": [
            "robbery",
            "murder",
            "robber",
            "burglary"
        ]
    },
    "113": {
        "link": "/wiki/Naomi_Judd",
        "title": "Naomi Judd",
        "date": "April 30, 2022(2022-04-30) (aged 76) Leiper's Fork, Tennessee, U.S.[1]",
        "year": "2022",
        "location": "",
        "state": "Tennessee",
        "place": "Judds",
        "county": "Cocke County",
        "paragraph": "\nNaomi Judd (born Diana Ellen Judd; January 11, 1946 – April 30, 2022)[3][4][5] was an American singer and actress. In 1980, she and her daughter Wynonna (born Christina Claire) formed the duo known as The Judds, which became a very successful country music act, winning five Grammy Awards and nine Country Music Association awards. The Judds ceased performing in 1991 after Naomi was diagnosed with hepatitis; while Wynonna continued to perform as a solo artist, she occasionally reunited with her mother for tours as The Judds. Naomi struggled with mental health issues throughout her life. She died from a self-inflicted gunshot wound on April 30, 2022, the day before she and Wynonna were inducted into the Country Music Hall of Fame.[6]\nJudd was born to Pauline Ruth \"Polly\" (née Oliver) and Charles Glen Judd on January 11, 1946, in Ashland, Kentucky.[7] Her father owned a gas station.[7] Her brother Brian died of leukemia in 1965 at the age of 17;[8] Naomi Judd's first child, Christina Claire Ciminella (later Wynonna Judd), was born when Judd was 18.[9] Her first daughter was given the last name Ciminella after Michael Ciminella, the man who Judd quickly married after being abandoned by her boyfriend and Wynonna's biological father, Charles Jordan.[10] After the birth of her second daughter, Ashley (1968), who later became a film and stage actress, and the end of her marriage to Ciminella, Judd brought up both daughters as a single parent, first attending nursing school at California's College of Marin while living in nearby Lagunitas, California,[11] and later beginning a successful singing career with daughter Wynonna.[12] When she reverted to her maiden name following her divorce, she also took the opportunity to change her name, Diana, which she did not think fit \"her own spiritual, rural Kentucky conception of her true heritage\", and decided to pay homage to the Biblical figure Naomi, finding resonance in her story of moving to another land and eventually being left without a husband raising two women.[7][13]\n",
        "type": []
    },
    "114": {
        "link": "/wiki/2022_Chattanooga_shooting",
        "title": "2022 Chattanooga shooting",
        "date": "June 5, 2022 (2022-06-05)",
        "year": "2022",
        "location": "Chattanooga, Tennessee",
        "state": "Tennessee",
        "place": "Chattanooga",
        "county": "Hamilton County",
        "paragraph": "\nOn June 5, 2022, two people were killed and 14 others were injured in a mass shooting in Chattanooga, Tennessee. Another person was killed fleeing the shooting and two were injured by vehicles while fleeing.[3][4]\nResponding officers arrived at around 2:42 am  at a reported shooting near a night club. They found multiple victims, immediately began first aid and secured the scene.[5] Victims sustained injuries from gunfire and from fleeing the scene, with fourteen struck by gunfire and three struck by vehicles while attempting to flee. Three were confirmed dead, two by gunshots and one by being hit by a vehicle, with fourteen injured.[6]\n",
        "type": [
            "mass shooting",
            "shooting"
        ]
    },
    "115": {
        "link": "/wiki/Lorenzen_Wright",
        "title": "Lorenzen Wright",
        "date": "July 19, 2010(2010-07-19) (aged 34) Memphis, Tennessee, U.S.",
        "year": "2010",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nLorenzen Vern-Gagne Wright (November 4, 1975 – July 19, 2010) was an American professional basketball player for 13 seasons in the National Basketball Association. He was drafted seventh overall in the 1996 NBA draft by the Los Angeles Clippers and played for the Atlanta Hawks, Memphis Grizzlies, Sacramento Kings, and Cleveland Cavaliers.\nWright went missing on July 18, 2010, and was found shot to death 10 days later. In December 2017, his ex-wife Sherra Wright-Robinson was charged with facilitating his murder; a year and a half later, she pled guilty. Her friend, Billy Ray Turner, was convicted of first-degree murder, conspiracy to commit first-degree murder, and attempted first-degree murder in March 2022, and received a life sentence in prison.[1] Widespread coverage of his disappearance, as well as his status as a popular Memphis figure, led to the prosecution of his murder being highly publicized in Memphis.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "116": {
        "link": "/wiki/James_S._Alban",
        "title": "James S. Alban",
        "date": "April 7, 1862(1862-04-07) (aged 52) Battle of ShilohHardin County, Tennessee",
        "year": "1862",
        "location": "",
        "state": "Tennessee",
        "place": "Jefferson County",
        "county": "Jefferson County",
        "paragraph": "James Shane Alban (October 30, 1809 – April 7, 1862) was an American lawyer, Wisconsin pioneer, and Union Army colonel in the American Civil War.  He died leading the 18th Wisconsin Infantry Regiment at the Battle of Shiloh.  He also served as a member of the Wisconsin State Senate.\nAlban was born in Jefferson County, Ohio, to William and Elizabeth Alban.[1] At age 8, his family moved to Stark County, Ohio, where he worked in farming, received a common education, and read law.[2]\nAlban married Amanda Harris in 1833 and they had five children together.  Alban moved west with his young family in 1836, first stopping near Chicago, then moving into the Wisconsin Territory, in 1838.  They traveled through Dane County and stopped near the site of what is now Sauk City to watch the negotiations between the United States and the Winnebago which would ultimately lead to the Winnebago ceding all land east of the Mississippi.  Before the treaty went into effect, Alban took his family across the frozen Wisconsin River into what was still Winnebago territory.  On December 20, 1838, the Alban family settled in the south end of the Sauk Prairie. The Albans are considered to be the first \"white\" family to settle in the county, and their daughter, Elizabeth, was said to be the first \"white\" child born in the county.[2][3]\n",
        "type": []
    },
    "117": {
        "link": "/wiki/Killing_of_Larry_Payne",
        "title": "Killing of Larry Payne",
        "date": "",
        "year": "new 1968",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "Larry Payne was a sixteen-year old African American teenager who was killed following a march in support of the Memphis sanitation strike on Thursday, March 28, 1968, in Memphis, Tennessee.[1] He was the only fatality on that day although the New Pittsburgh Courier reported 60 injured and 276 arrested.[2]\nMartin Luther King Jr. called Payne's mother, Lizzie Payne, on the phone to console her after her son's killing by Patrolman Leslie Dean Jones.[3]\nConflicting accounts describe the looting that occurred in tandem with the march on Thursday March 28, 1968 that led to a city-wide curfew and Mayor Loeb calling the Tennessese National Guard. According to multiple witnesses, as Payne emerged from a basement in the Fowler Homes housing development, police officer Leslie Dean Jones pressed the barrel of a sawed-off shotgun into Payne's stomach and fired, killing him.[4] Payne reportedly had his hands up prior to his killing and had asked the officer not to shoot.[5][6] Jones later claimed that Payne was holding a large butcher knife when he emerged from the basement, a statement denied by witnesses to the killing.[7] The Shelby County grand jury did not press charges, and the Department of Justice declared that there was insufficient evidence to prosecute Jones when investigating him for civil rights abuses.[8]\n",
        "type": [
            "killing",
            "looting"
        ]
    },
    "118": {
        "link": "/wiki/Murder_of_Janet_March",
        "title": "Murder of Janet March",
        "date": "August 15, 1996 (1996-08-15)",
        "year": "1996",
        "location": "Forest Hills, Tennessee, United States",
        "state": "Tennessee",
        "place": "Forest Hills",
        "county": "Davidson County",
        "paragraph": "\nOn August 29, 1996, Janet Gail March, (née  Levine February 20, 1963 [1] – August 15, 1996), a  children's book illustrator from the Nashville suburb of Forest Hills, Tennessee, United States, was reported missing to police by her family. Her husband, Perry March, a lawyer, told police he had last seen his wife when she left the house on the night of August 15, two weeks earlier, following an argument. He claimed she had packed her bags for a 12-day vacation at an unknown location and driven away. She was never seen alive by anyone else afterwards.\nJanet's car was found at a nearby apartment complex a week after the police report, apparently having been there for some time. Other evidence began to suggest that Perry had fabricated some evidence of his wife's supposed motive for departure, and attempted to tamper with or destroy other items that might have provided evidence. Police soon reclassified the case as a homicide, despite the absence of Janet's body, and named Perry as a suspect. Shortly afterwards he moved back to his native Chicago area with the couple's two children. After his in-laws won visitation, he fled with the children to Mexico, where his father, Arthur, a former U.S. Army pharmacist, had retired. The case received attention in the national media, where it was the subject of two segments on the CBS News program 48 Hours.[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "119": {
        "link": "/wiki/Collierville_Kroger_shooting",
        "title": "Collierville Kroger shooting",
        "date": "September 23, 2021 (2021-09-23) c. 1:30 – c. 1:34 p.m. (CDT)",
        "year": "2021",
        "location": "240 New Byhalia Road, Collierville, Tennessee, US",
        "state": "Tennessee",
        "place": "Collierville",
        "county": "Shelby County",
        "paragraph": "\nThe Collierville Kroger shooting was a mass shooting that occurred on September 23, 2021, at a Kroger grocery store in Collierville, Tennessee. One person was killed and 13 others were injured before the gunman, identified as 29-year-old Uk Thang, committed suicide by gunshot. Thang was working at the store as a third-party vendor.[2][3] It was the second shooting in 2021 to occur at a Kroger-owned property; the first occurred at a King Soopers store in Boulder, Colorado, in March.[4]\nOn the day of the shooting, the gunman, Uk Thang, got into an altercation with another Kroger employee and was asked to leave at 7:00 a.m. He returned to his apartment and later left at 12:30 p.m. After calling his brother at 1:30 p.m. to tell him he would never see him again, Thang returned to the store and opened fire with two pistols and a rifle that he brought with him.[1] At the time of the shooting, 44 employees and a number of customers were inside the building.[5]\n",
        "type": [
            "murder",
            "shooting",
            "mass shooting"
        ]
    },
    "120": {
        "link": "/wiki/Greene%E2%80%93Jones_War",
        "title": "Greene–Jones War",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Hawkins County",
        "county": "Hawkins County",
        "paragraph": "The Greene–Jones War was an Appalachian Mountain clan feud in the United States reputed to be second only to that of the Hatfield–McCoy feud in scale, duration, and number of people killed. At least sixteen people, including one child, were killed during the course of the feud, and many others were seriously injured.[1] The feud took place primarily in the border areas of Hawkins County (formerly part of Sullivan County, North Carolina, one of the earliest Tennessee counties and said to have a large Melungeon population), Washington County, Claiborne County, Hancock County, Tennessee (created when Hawkins County, Tennessee was subdivided), and Lee County, Virginia, not far from Cumberland Gap, the narrow Appalachian Mountain pass sometimes called The Wilderness Road leading into Kentucky.\nMost of the history of this feud is found in family records, particularly in a self-published small-edition book by Alton Lee Greene, a genealogist who lived in Sanger, Texas. Alton Lee Greene (a 20th-century descendant of the feuding families) traced the genealogy of the descendants of American colonist Judge William Greene, a judge in the Court of Common Pleas who was born in Lincolnshire, England in 1671 and died in 1722 in Hunterdon County, New Jersey.[2] Judge Greene married Joanna \"Hannah\" Reeder, the daughter of John Reeder and Joanna  Burroughs Reeder, who was born in 1699 in Newtown, Long Island, New York.  Judge William Greene and Hannah settled in the area of Ewing, New Jersey and built the William Green House (Ewing Township, New Jersey), now on the National Historic Register and located on the campus of The College of New Jersey. Despite fund-raising efforts, the old farmhouse near where the troops of George Washington's crossing of the Delaware River once rested during the Revolutionary War, has never been fully restored.[3]\nJudge William Greene and Joanna Reeder Greene were the great-grandparents of Jeremiah Greene, who along with other Greene relatives migrated to an area near Rowan, North Carolina (a vast county of indefinite boundaries formed in 1753), where they formed a community called The Jersey Settlement by joining West Jersey residents who left New Jersey due to their unwillingness to adhere to the demands of Colonel Daniel Coxe, an English Colonial landowner and physician. Disgusted by Coxe's rampant political corruption, the Greene family settled near the Yadkin River in North Carolina and started the Jersey Settlement Meeting House, now on the National Historic Register. Jeremiah's family migrated to the Jersey Settlement and then to Hancock County, Tennessee, where his descendants figured prominently in the Greene–Jones War.[4]\n",
        "type": [
            "riot"
        ]
    },
    "121": {
        "link": "/wiki/Lynching_of_David_Jones",
        "title": "Lynching of David Jones",
        "date": "March 25, 1872; 150 years ago (1872-03-25) 9pm",
        "year": "1872",
        "location": "Public Square, Nashville, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "David Jones was an African-American man who was lynched in Nashville, Tennessee on March 25, 1872 after being arrested as a suspect in a killing. He was mortally wounded while in jail, shot twice in the back while resisting white mob members who came to take him out; the whites pulled him into the Public Square and hanged him from a post outside the police station, with a crowd of an estimated 2,000 in attendance. The sheriff interrupted the hanging and took Jones down. Taken back to the jail, Jones died of his injuries on April 9, 1872.\nDavid Jones, an African-American man, was accused of murdering white man Henry Murray, who died in March 1872. Jones was arrested and taken to the county jail in Nashville.[1][2]\nAt 7pm on March 25, 1872, a mob met outside the Maxwell House Hotel in Downtown Nashville.[1] By 9pm, they walked to the jail, where they broke into Jones's cell, shot him twice when he resisted, and put a halter around his head.[1] They took him to the public square and hanged him on the gas post outside the police station.[1] A crowd of 2,000 onlookers surrounded Jones.[1] Sheriff Donaldson interrupted the hanging, taking Jones down from the post and carrying him back to the police station.[1][2] The crowd dispersed at 10pm.[1]\n",
        "type": [
            "lynching",
            "murder",
            "killing"
        ]
    },
    "122": {
        "link": "/wiki/2011_Memphis_serial_murders",
        "title": "2011 Memphis serial murders",
        "date": "",
        "year": "2011",
        "location": "",
        "state": "Tennessee",
        "place": "South Memphis",
        "county": "Shelby County",
        "paragraph": "\nThe 2011 Memphis serial murders were a series of attacks between January 27 and February 26, 2011, in which four women, all sex workers, were shot in South Memphis, Tennessee; three of them died. Memphis authorities have publicly stated that the murders are likely to have been perpetrated by a sole man, and that this man may also have committed a fourth murder in 2015, but no arrests have yet been made.[1]\nBeginning on January 27, 2011, South Memphis was struck by a series of seemingly random shootings targeting female prostitutes. At around 2:15 a.m. that day, the body of 31-year-old Tamakia McKinney was found near Mt. Carmel Cemetery; she had been shot to death. McKinney, a mother of two, had no known arrests for prostitution, but her family stated that they had known she was a prostitute and had told her husband.[1] At around 12:05 p.m. on February 20, a woman flagged down a police vehicle and led them to the body of 28-year-old Jessica Lewis, which was inside Mt. Carmel Cemetery; also a prostitute, she too had been shot to death.[2]\n",
        "type": [
            "murder",
            "shooting"
        ]
    },
    "123": {
        "link": "/wiki/Steve_McNair",
        "title": "Steve McNair",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Baltimore",
        "county": "Cocke County",
        "paragraph": "\nStephen LaTreal McNair (February 14, 1973 – July 4, 2009),[2] nicknamed \"Air McNair\",[3][4] was an American football quarterback who played in the National Football League (NFL) for 13 seasons, primarily with the Houston / Tennessee Oilers / Titans franchise. He also played for the Baltimore Ravens.[5]\nMcNair played college football at Alcorn State University in Lorman, Mississippi, where he won the 1994 Walter Payton Award as the top player in NCAA Division I-AA. He was drafted third overall by the Titans (then known as the Houston Oilers) in 1995, becoming the team's regular starting quarterback in 1997, their first season in Tennessee (though he started six games over the prior two seasons in Houston), and remained the starting quarterback for the Titans through 2005. After the 2005 season, McNair was traded to the Baltimore Ravens, with whom he played for two seasons before retiring.[6]\n",
        "type": [
            "murder"
        ]
    },
    "124": {
        "link": "/wiki/Tommy_Boyce",
        "title": "Boyce and Hart",
        "date": "November 23, 1994(1994-11-23) (aged 55) Nashville, Tennessee, U.S.",
        "year": "1994",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "\nSidney Thomas \"Tommy\" Boyce (September 29, 1939 – November 23, 1994) and Bobby Hart (born Robert Luke Harshman; February 18, 1939) were a prolific American duo of singer-songwriters. In addition to three top-40 hits as artists, the duo is well known for its songwriting for The Monkees.\nHart's father was a church minister and he himself served in the Army after leaving high school. Upon discharge, he travelled to Los Angeles seeking a career as a singer. Boyce was separately pursuing a career as a songwriter. After being rejected numerous times, Boyce took his father's suggestion to write a song called \"Be My Guest\" for rock and roll star Fats Domino. He waited six hours at Domino's hotel room to present him with the demo, and got Domino to promise to listen to the song.[1] The song hit No. 8 in the US and No. 11 in the UK, becoming Domino's biggest hit there in several years, and sold over a million copies.[2] Boyce also found success as the co-writer, with Curtis Lee, of Lee's 1961 hits \"Pretty Little Angel Eyes\" and \"Under the Moon of Love\".[3]\n",
        "type": []
    },
    "125": {
        "link": "/wiki/Old_Tassel",
        "title": "Old Tassel",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Chickamauga",
        "county": "Hamilton County",
        "paragraph": "Old Tassel Reyetaeh (sometimes Corntassel) (Cherokee language: Utsi'dsata), (died 1788), was \"First Beloved Man\" (the equivalent of a regional Cherokee chief) of the Overhill Cherokee after 1783, when the United States gained independence from Great Britain. He worked to try to keep the Cherokee people of the Overhill region out of the Cherokee–American wars being fought between the European-American frontiersmen and the Chickamauga band warriors led by  Dragging Canoe.  He was murdered in 1788 along with another chief at Chilhowee by white settlers under a flag of truce. \nOld Tassel's brothers were the warriors Pumpkin Boy and Doublehead. His maternal nephew was John Watts, known as \"Young Tassel.\" \nOld Tassel became \"First Beloved Man\" of the Overhill Cherokee in 1783, after the tribal elders removed his predecessor, The Raven of Chota (also known as Savanukah).  An advocate of peace, Old Tassel strove—with only some success—to keep the people of the Overhill towns out of the Cherokee–American wars being fought between the white settlers and the Chickamauga band, in what are now the eastern Tennessee and southeastern Kentucky regions. He was known as the Great Orator.\n",
        "type": [
            "murder"
        ]
    },
    "126": {
        "link": "/wiki/Jennifer_Hyatte",
        "title": "Kingston courthouse shooting",
        "date": "",
        "year": "new 1974",
        "location": "",
        "state": "Tennessee",
        "place": "Kingston",
        "county": "Roane County",
        "paragraph": "The Kingston courthouse shooting was a fatal shooting that took place on August 9, 2005, at the Roane County Courthouse in Kingston, Tennessee, United States. It resulted in the death of a Tennessee Department of Correction transport officer, and the wounding of another officer. The perpetrator, Jennifer Forsyth Hyatte (born February 11, 1974), began shooting immediately after her husband, George, pleaded guilty to a robbery charge in the courthouse. \nJennifer Hyatte is currently serving a life sentence without the possibility of parole. George Hyatte pleaded guilty to first-degree murder in the shooting in 2009 and was sentenced to life in prison as part of a plea bargain to avoid the death penalty.[1]\nAt approximately 10:00 a.m., after a court hearing, Tennessee Department of Corrections transport officer Wayne \"Cotton\" Morgan was fatally shot three times by Jennifer Forsyth Hyatte, whose husband, George Hyatte, pleaded guilty to a charge of robbery. Officer Morgan and his partner were loading prisoners into a transport van after a court appearance, when Jennifer Forsythe Hyatte drove up and opened fire with a handgun, striking Officer Morgan three times in the abdomen. Officer Morgan's partner returned fire as the escaping prisoner climbed inside his wife's vehicle. Jennifer Forsythe Hyatte was a former nurse at a prison where George Hyatte had been an inmate. She had been fired after she was found sneaking food to George. \n",
        "type": [
            "robbery",
            "murder",
            "robber",
            "shooting"
        ]
    },
    "127": {
        "link": "/wiki/Edward_W._Carmack",
        "title": "Edward W. Carmack",
        "date": "November 9, 1908(1908-11-09) (aged 50) Nashville, Tennessee, U.S.",
        "year": "1908",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Edward Ward Carmack (November 5, 1858 – November 9, 1908) was an attorney, newspaperman, and political figure who served as a U.S. Senator from Tennessee from 1901 to 1907.\nFollowing his political service, and after an unsuccessful run for Governor of Tennessee, he became editor of the one-year-old Nashville Tennessean.  He was shot to death on November 9, 1908, over a feud precipitated by Duncan Brown Cooper for his editorial comments in the paper.\nCarmack was born in Sumner County, Tennessee.  He attended The Webb School, then at Culleoka, Tennessee.  He studied law and was admitted to the bar in 1878 and began practicing in Columbia, Tennessee.  He served as Columbia city attorney in 1881, and was elected to the Tennessee House of Representatives in 1884.\n",
        "type": []
    },
    "128": {
        "link": "/wiki/Billy_Ray_Irick",
        "title": "Billy Ray Irick",
        "date": "April 15, 1985",
        "year": "1985",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nWilliam Ray Irick (/ˈaɪrɪk/ EYE-rik, August 26, 1958 – August 9, 2018) was an American convicted murderer from Tennessee who was sentenced to death and executed for the 1985 murder of 7-year-old Paula Dyer in Knoxville. Irick, then aged 26, had been living with Dyer's family for over a year, and was babysitting five of the family's children (including Paula) on the night of the girl's murder. Irick was the first inmate executed in Tennessee in almost a decade.[1]\nIrick was born on August 26, 1958, in Knoxville, Tennessee. He allegedly suffered extensive abuse from his family from a young age, including one incident where a neighbor witnessed Irick's father clubbing him with a piece of lumber. His mental health was reportedly first questioned in March 1965, when he was 6. A psychological evaluation was subsequently performed at the request of his school's principal, owing to his \"extreme behavioral problems.\"[2][3]\n",
        "type": [
            "murder"
        ]
    },
    "129": {
        "link": "/wiki/Lynchings_of_Mer_Rouge,_Louisiana",
        "title": "Lynchings of Mer Rouge, Louisiana",
        "date": "\nDisappeared on August 24, 1922\nBodies discovered on December 24, 1922\n",
        "year": "1922",
        "location": "Mer Rouge, Morehouse Parish, Louisiana",
        "state": "Tennessee",
        "place": "Mer Rouge",
        "county": "Shelby County",
        "paragraph": "\nFilmore Watt Daniels and Thomas F. Richards were lynched in Mer Rouge, Morehouse Parish, Louisiana by black robed Ku Klux Klan members on August 24, 1922. According to the United States Senate Committee on the Judiciary they were the 47th and 48th of 61 lynchings during 1922 in the United States.[1] There were five lynchings in the state of Louisiana and of the 61 lynchings they were 2 of 6 white victims.[2]\nThe Ku Klux Klan was extremely powerful in Louisiana since its revival in 1915. By 1924, there were thousands of Klan members in Louisiana, with each member paying $10 ($150 in 2022) to join.[3] In 1922, Louisiana Governor John M. Parker pleaded with J. Edgar Hoover (then Assistant Director of the Bureau of Investigation) to help him as he wrote, \"the Ku Klux Klan has grown so powerful in my state that it effectively controls the northern half. It has already kidnapped, tortured, and killed two people who opposed it…and it has threatened many more.\"[3]\n",
        "type": [
            "lynching",
            "torture",
            "kidnapped",
            "riot"
        ]
    },
    "130": {
        "link": "/wiki/Charles_Barr",
        "title": "Charles Barr",
        "date": "August 20, 1926(1926-08-20) (aged 22–23) Tennessee State Prison, Nashville, Tennessee, U.S.",
        "year": "1926",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Charles Barr (1903 – August 20, 1926), known as The Petting Party Bandit, was an American serial killer who attacked couples at lovers' lanes in Memphis, Tennessee from January to May 1923, killing three and wounding one. For his crimes, he was convicted, sentenced to death and subsequently executed at the Tennessee State Prison in 1926.[1]\nLittle is known about Barr's early life. He was born in Memphis in 1903, the only son of a Baptist minister.[1] As an adult, he married a woman named Luada and the couple lived happily in the city, with Charles working as a chauffeur and house servant for the Van Fossan family, where he was treated decently and regarded as a honest worker.[2] Despite his reputation, Barr wished for a more lavish lifestyle, believing the quickest way to do so was to turn to robberies.\nOn January 27, 1923, Barr borrowed a car from a friend and drove to an isolated road near Memphis, which was known as a local lovers' lane. There, he came across 21-year-old salesman Duncan Waller from Mayfield, Kentucky and his mistress, Ruth McElwaine Tucker of Bowling Green.[3] He parked the car near them and approached them on foot, and upon reaching the automobile, he pulled out a .25 caliber pistol and shot Waller, killing him instantly. Frightened, Tucker leaped out of the car and sprinted towards a nearby field, but Barr caught up with her, raped her and then shot her as well.[4] After killing her, he stole the woman's jewelry and valuables before returning to the car and doing the same to Waller, and then fleeing the area. Their bodies were later discovered by a milkman doing his daily routine. Despite the police's and local citizen's detective agencies attempts to solve the case, nobody was arrested for the crime at the time.[4]\n",
        "type": [
            "robberies",
            "robber",
            "killing",
            "rape"
        ]
    },
    "131": {
        "link": "/wiki/2022_Memphis_shootings",
        "title": "2022 Memphis shootings",
        "date": "September 7, 2022 c. 12:56 a.m. – 8:58 p.m. (CDT)",
        "year": "2022",
        "location": "Memphis, Tennessee, United States",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nOn September 7, 2022, three people were killed and three others were injured after a gunman went on a shooting spree in Memphis, Tennessee, United States. The attack was livestreamed on Facebook Live.[1]\nThe shootings began at around 12:56 a.m., when a man was found fatally shot on Lyndale Avenue.[1] At 4:38 p.m., another man was found fatally shot on South Parkway East. Video surveillance showed that the gunman had fired multiple shots. Two minutes later, a woman with multiple gunshots to the leg was found at the intersection of Norris Road and Interstate 240. The gunman fled in a sedan eastbound on Norris Road.[2]\n",
        "type": [
            "shooting"
        ]
    },
    "132": {
        "link": "/wiki/Lation_Scott",
        "title": "Lation Scott",
        "date": "December 2, 1917(1917-12-02) (aged 23) Dyersburg, Tennessee, United States",
        "year": "1917",
        "location": "",
        "state": "Tennessee",
        "place": "Dyersburg",
        "county": "Dyer County",
        "paragraph": "\nLation (Ligon) Scott (December 25, 1893 – December 2, 1917) was an African American lynching victim suspected of raping a white woman in Dyer County, Tennessee. Scott was tortured, mutilated and burned alive by a mob on Sunday, December 2, 1917 in downtown Dyersburg.\nScott was born in Holly Springs, Mississippi on December 25, 1893. He was married and had a three-year-old child but lived apart from his wife. Scott registered for the World War I draft on June 5, 1917, and described his occupation as farming. He was described on the form as tall and slender.[N 1]\n",
        "type": [
            "lynching",
            "murder",
            "torture"
        ]
    },
    "133": {
        "link": "/wiki/Nashville_Waffle_House_shooting",
        "title": "Nashville Waffle House shooting",
        "date": "April 22, 2018",
        "year": "2018",
        "location": "Waffle House 3571 Murfreesboro Pike, Antioch, Nashville, Tennessee",
        "state": "Tennessee",
        "place": "Antioch",
        "county": "Davidson County",
        "paragraph": "\nOn April 22, 2018, a mass shooting occurred at a Waffle House restaurant in the Antioch neighborhood[1] of Nashville, Tennessee, United States, when 29-year-old Travis Jeffrey Reinking fatally shot four people and injured two others with an AR-15 style rifle.[6] Another two people were injured by broken glass.[7] Reinking was rushed by an unarmed customer, James Shaw Jr., who wrestled the rifle away and stopped the shooting spree.  Reinking was captured on April 23, ending a 34-hour manhunt.[8][9][5]\nDue to severe schizophrenia, Reinking was initially found incompetent to stand trial and committed to a mental hospital for treatment.[10] Later that decision was changed and Reinking was put on trial for four counts of first degree premeditated murder on January 31, 2022.  He was convicted of the charges on February 4, 2022.\n",
        "type": [
            "murder",
            "shooting",
            "mass shooting"
        ]
    },
    "134": {
        "link": "/wiki/Barry_Sadler",
        "title": "Barry Sadler",
        "date": "November 5, 1989(1989-11-05) (aged 49) Murfreesboro, Tennessee, U.S.",
        "year": "1989",
        "location": "",
        "state": "Tennessee",
        "place": "Murfreesboro",
        "county": "Rutherford County",
        "paragraph": "Barry Allen Sadler (November 1, 1940 – November 5, 1989) was an American soldier, singer/songwriter, and author. Sadler served as a Green Beret medic, achieving the rank of Staff Sergeant. He served in the Vietnam War from late December 1964 to late May 1965. Most of his work has a military theme, and he is best known for his patriotic \"Ballad of the Green Berets,\" a #1 hit in 1966. He died at age 49 after being shot in the head in Guatemala City.\nSadler was born in Carlsbad, New Mexico, the second son of John Sadler and Bebe Littlefield of Phoenix, Arizona. According to Sadler's autobiography, I'm A Lucky One, his father developed a successful plumbing and electrical business in Carlsbad and owned several farms in the area. He describes his mother as managing restaurants and bars, and at times, games in casinos.\nThe family relocated often. His parents divorced when Sadler was five, and his father died not long after at age 36 from a rare form of nervous system cancer. His mother moved her family around as she worked at temporary jobs in Arizona, California, Colorado, New Mexico, and Texas.\n",
        "type": [
            "riot"
        ]
    },
    "135": {
        "link": "/wiki/Maurice_Mays",
        "title": "Knoxville riot of 1919",
        "date": "August 30–31, 1919",
        "year": "1919",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "The Knoxville riot of 1919 was a race riot that took place in the American city of Knoxville, Tennessee, on August 30–31, 1919. The riot began when a lynch mob stormed the county jail in search of Maurice Mays, a biracial man who had been accused of murdering a white woman. Unable to find Mays, the rioters looted the jail and fought a pitched gun battle with the residents of a predominantly black neighborhood. The Tennessee National Guard, which at one point fired two machine guns indiscriminately into this neighborhood, eventually dispersed the rioters.[1][2][3] At the end of August 1919 the Great Falls Daily Tribune reported four killed in a \"race war riot\"[4] while the Washington Times reported \"Scores dead.\"[5] Other newspapers placed the death toll at just two, though eyewitness accounts suggest it was much higher.[1]\nThe Riot of 1919 was one of several violent racial incidents that occurred during the so-called Red Summer when race riots plagued cities across the United States.  The riot was one of the worst racial episodes in Knoxville's history and shattered the city's vision of itself as a racially tolerant Southern town.[6] After the riot, many black residents left Knoxville, and racial violence continued to flare up sporadically in subsequent years.[1]\nIn the decades following the Civil War, Knoxville was considered by both black and white residents to be one of the few racially tolerant cities in the South. It was one of the few where black citizens could vote, hold public office, and serve as police officers.[1] In 1918, Charles W. Cansler (1871–1953), one of the city's leading African-American citizens, wrote to the governor of Tennessee, \"In no place in the world can there be found better relations existing between the races than here in our own county of Knox. No race riots have ever disgraced our city and no mob has ever vented its fury here upon any Negro victim.\"[1]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "136": {
        "link": "/wiki/Channon_Christian",
        "title": "Murders of Channon Christian and Christopher Newsom",
        "date": "January 6, 2007",
        "year": "2007",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nCoordinates: 35°59′28″N 83°54′27″W﻿ / ﻿35.99113°N 83.907514°W﻿ / 35.99113; -83.907514\nChannon Gail Christian, aged 21, and Hugh Christopher Newsom Jr., aged 23, were from Knoxville, Tennessee, United States. They were kidnapped on the evening of January 6, 2007, when Christian's vehicle was carjacked. The couple were taken to a rental house. Both of them were raped, tortured, and murdered.[1][2][3] Four males and one female were arrested, charged, and convicted in the case. In 2007, a grand jury indicted Letalvis Darnell Cobbins, Lemaricus Devall Davidson, George Geovonni Thomas, and Vanessa Lynn Coleman on counts of kidnapping, robbery, rape, and murder.[4][5][6][7][8] Also in 2007, Eric DeWayne Boyd was indicted by a federal grand jury of being an accessory to a carjacking, resulting in serious bodily injury to another person, and misprision of a felony.[8] In 2018, Boyd was indicted on state-level charges of kidnapping, robbery, rape, and murder.[9]\nFour of the five defendants (Eric Boyd, Letalvis Cobbins, Lemaricus Davidson, and George Thomas) had multiple prior felony convictions.[10] After a jury trial, Davidson was convicted and sentenced to death by lethal injection.[11][12] Cobbins and Thomas were convicted and sentenced to life in prison without parole.[13][14][15][16] Vanessa Coleman was convicted of facilitating the crimes and sentenced to 53 years.[17] Eric Boyd was convicted at the federal level and sentenced to 18 years in federal prison for being an accessory after the fact to carjacking.[18][19] He was convicted on state level charges over a decade later in 2019.[20]\n",
        "type": [
            "torture",
            "rape",
            "kidnapped",
            "robbery",
            "theft",
            "murder",
            "kidnapping",
            "robber"
        ]
    },
    "137": {
        "link": "/wiki/Byron_Looper",
        "title": "Byron Looper",
        "date": "June 26, 2013(2013-06-26) (aged 48) Morgan County Correctional Complex, Wartburg, Tennessee, U.S.",
        "year": "2013",
        "location": "",
        "state": "Tennessee",
        "place": "Wartburg",
        "county": "Morgan County",
        "paragraph": "Byron (Low Tax) Looper (born Byron Anthony Looper; September 15, 1964 – June 26, 2013) was a Democratic turned Republican politician in Tennessee and convicted murderer. In order to advance his political career, he legally changed his middle name from \"Anthony\" to \"(Low Tax)\". After being convicted for the October 1998 murder of his election opponent, incumbent Tennessee State Senator Tommy Burks, he was given a life sentence in prison. He died in prison in 2013.\nByron Looper was born in Cookeville, Tennessee. He spent most of his childhood in Georgia, where his father, Aaron Looper, was a school superintendent.[1]\nLooper attended the U.S. Military Academy at West Point from 1983 to 1985, but he was given an honorable discharge following what he said was a serious knee injury. After being discharged, he moved to Georgia, where he attended the University of Georgia and worked for the state legislature after graduation.[1][2][3]\n",
        "type": [
            "murder"
        ]
    },
    "138": {
        "link": "/wiki/Thomas_K._Harris",
        "title": "Thomas K. Harris",
        "date": "March 18, 1816(1816-03-18) (aged 38–39)",
        "year": "1816",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "\nsoldier\nThomas K. Harris (c. 1777 – March 18, 1816) was an American politician who represented Tennessee in the United States House of Representatives.\n",
        "type": [
            "murder"
        ]
    },
    "139": {
        "link": "/wiki/Lynching_of_Amos_Miller",
        "title": "Lynching of Amos Miller",
        "date": "August 10, 1888 about 10 a.m.",
        "year": "1888",
        "location": "Williamson County Courthouse, Franklin, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Franklin",
        "county": "Williamson County",
        "paragraph": "\nAmos Miller was a 23-year-old African-American man who was lynched from the balcony of the Williamson County Courthouse in Franklin, Tennessee, on August 10, 1888.\nMiller was accused of raping  Mrs. Scott, a 50-year-old white woman, near Santa Fe[1] in Maury County on June 9[2] or 10, 1888.[3] Miller worked as a farmhand on the Scott farm in Maury County; the Scotts had a daughter.[2] Miller, who was 23 years old, was described by The Daily American as \"a heavy-built, very dark negro\".[2]\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "140": {
        "link": "/wiki/Young_Dolph",
        "title": "Young Dolph",
        "date": "November 17, 2021; 14 months ago (2021-11-17) 12:22 p.m. (CST)",
        "year": "2021",
        "location": "Memphis, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nAdolph Robert Thornton Jr. (July 27, 1985 – November 17, 2021), better known by his stage name Young Dolph, was an American rapper. In 2016, he released his debut studio album, King of Memphis, which peaked at number 49 on the Billboard 200 chart.[3][4] He was featured on O.T. Genasis's hit single \"Cut It\", which peaked at number 35 on the Billboard Hot 100. Young Dolph's seventh album, Rich Slave, was released in 2020 and became his highest-charting project, debuting at number four on the Billboard 200.\nOn November 17, 2021, he was shot and killed in Memphis, Tennessee.\n",
        "type": [
            "murder"
        ]
    },
    "141": {
        "link": "/wiki/Genero_Espinosa_Dorantes",
        "title": "Genero Espinosa Dorantes",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Genero Edgar Espinosa Dorantes (born June 19, 1970[1] in Pachuca, Hidalgo, Mexico) is a Mexican criminal, who was the 477th fugitive listed on the FBI Ten Most Wanted Fugitives list.[2]\nHe was wanted by the FBI[3] for his alleged participation in the burning, beating, torture and murder of his four-year-old stepson in Nashville, Tennessee, in February 2003. He was considered armed and extremely dangerous. The FBI offered a reward of up to $100,000 for information leading directly to the arrest of Genero Espinosa Dorantes. On February 25, 2006, he was arrested[4] in Tijuana, Baja California, Mexico. He was sentenced on July 8, 2006 and is currently incarcerated at the Northwest Correctional Complex, which is located in Tiptonville, Tennessee. He will be eligible for parole on December 12, 2064.[1]\n",
        "type": [
            "murder",
            "torture"
        ]
    },
    "142": {
        "link": "/wiki/Central_High_School_shooting",
        "title": "Central High School (Knoxville, Tennessee)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Central High School is a public high school located at 5321 Jacksboro Pike in the Fountain City neighborhood of Knoxville, Tennessee, operated by the Knox County school system.The school's athletic teams are nicknamed the Bobcats, and its colors are red and black.\nCentral was formerly located at what is now Gresham Middle School in the heart of Fountain City, which, in the 1960s, was the largest unincorporated community in Tennessee.  Its name is something of a misnomer, because it was never located near the center of Knoxville, even when Fountain City was annexed into Knoxville in the early 1960s.  The northernmost high school in Knoxville before the annexation of Fountain City was Fulton, and in the county, Powell, Karns, and Halls high schools were farther north.\nOn August 21, 2008, 15-year-old student Jamar Siler entered the school cafeteria and approached student Ryan McDonald sitting at a lunch table. Siler fatally shot McDonald, and was arrested by authorities a short time later. The two had been in previous altercations, the details of which were not released to the general public. Siler was then taken into custody.\n",
        "type": []
    },
    "143": {
        "link": "/wiki/2019_Sumner_County_murders",
        "title": "2019 Sumner County murders",
        "date": "April 27, 2019",
        "year": "2019",
        "location": "Sumner County, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Sumner County",
        "county": "Sumner County",
        "paragraph": "The Sumner County Slayings was a mass murder which occurred on or before April 27, 2019, when eight bodies were discovered at multiple locations in Sumner County, Tennessee.[1] There was one sole survivor who was in critical condition but survived the injuries.[2][3] The case was the worst mass murder in Tennessee in 20 years.[4]\nOn April 17 a headless body was found (who was later identified as Jim Dunn) at a burned out cabin.[3] This was just the start to the massacre which took place 10 days later when police responded to multiple crime scenes finding four members of Cummins family slayed in their home at Charles Brown Road.[5] They discovered another deceased victim on Luby Brown Road. Two more victims were discovered the next day and a victim who survived her wounds. One of the deceased victims was a 12-year-old girl who was partially nude but no sexual assault occurred. All the victim deaths were caused by blunt force trauma to the head.[4]\nCummins was going to be arrested in the upcoming days before the bodies were found due to a violation of probation of not having a mental health evaluation. A warrant was in the works.[6] After the murders, Cummins was a suspect due to not being seen and his family's untimely deaths. Cummins was later spotted and shot after he was cornered near a creek by multiple police officers. However, his trial was delayed many time due to COVID. On June 9, 2022, he was found fit to stand trial. His trial will start April 2023.[7]\n",
        "type": [
            "assault",
            "murder",
            "mass murder"
        ]
    },
    "144": {
        "link": "/wiki/Lemaricus_Davidson",
        "title": "Murders of Channon Christian and Christopher Newsom",
        "date": "January 6, 2007",
        "year": "2007",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nCoordinates: 35°59′28″N 83°54′27″W﻿ / ﻿35.99113°N 83.907514°W﻿ / 35.99113; -83.907514\nChannon Gail Christian, aged 21, and Hugh Christopher Newsom Jr., aged 23, were from Knoxville, Tennessee, United States. They were kidnapped on the evening of January 6, 2007, when Christian's vehicle was carjacked. The couple were taken to a rental house. Both of them were raped, tortured, and murdered.[1][2][3] Four males and one female were arrested, charged, and convicted in the case. In 2007, a grand jury indicted Letalvis Darnell Cobbins, Lemaricus Devall Davidson, George Geovonni Thomas, and Vanessa Lynn Coleman on counts of kidnapping, robbery, rape, and murder.[4][5][6][7][8] Also in 2007, Eric DeWayne Boyd was indicted by a federal grand jury of being an accessory to a carjacking, resulting in serious bodily injury to another person, and misprision of a felony.[8] In 2018, Boyd was indicted on state-level charges of kidnapping, robbery, rape, and murder.[9]\nFour of the five defendants (Eric Boyd, Letalvis Cobbins, Lemaricus Davidson, and George Thomas) had multiple prior felony convictions.[10] After a jury trial, Davidson was convicted and sentenced to death by lethal injection.[11][12] Cobbins and Thomas were convicted and sentenced to life in prison without parole.[13][14][15][16] Vanessa Coleman was convicted of facilitating the crimes and sentenced to 53 years.[17] Eric Boyd was convicted at the federal level and sentenced to 18 years in federal prison for being an accessory after the fact to carjacking.[18][19] He was convicted on state level charges over a decade later in 2019.[20]\n",
        "type": [
            "torture",
            "rape",
            "kidnapped",
            "robbery",
            "theft",
            "murder",
            "kidnapping",
            "robber"
        ]
    },
    "145": {
        "link": "/wiki/William_Scott_Day",
        "title": "William Scott Day",
        "date": "February 4, 2006(2006-02-04) (aged 54) West Tennessee State Penitentiary, Henning, Tennessee, U.S.",
        "year": "2006",
        "location": "",
        "state": "Tennessee",
        "place": "Henning",
        "county": "Lauderdale County",
        "paragraph": "William Scott Day (October 21, 1951 – February 4, 2006) was an American prison escapee and later spree killer who killed at least six people in five states during his 39 days on the run between December 1986 and January 1987. He was convicted and sentenced to life imprisonment on one count in Tennessee, and the other charges were dropped altogether.[1]\nWilliam Scott Day was born on an American military installation in Japan on October 21, 1951, while his family was residing there. From an early age, he showed signs of remarkable intelligence and an affinity for reading authors such as Oscar Wilde, Walt Whitman and Barbara W. Tuchman.[2] After the death of his father during his teens, Day moved to Michigan, where he enlisted in the Marine Corps and was stationed at a boot camp near Flat Rock. While there, he deserted his position and went to the city, where he was later arrested for attempting to rape and kidnap a woman. Day was convicted of this crime and given a 7-year term, served initially at the Richard A. Handlon Correctional Facility and later transferred to the Ionia Correctional Facility, successfully escaping once before being paroled in 1974.[2]\nBetween 1976 and 1982, Day was repeatedly arrested and incarcerated for various offenses including heroin possession, theft, kidnapping and writing bad checks, successfully escaping on one occasion. In late 1982, Day escaped from yet another prison camp in Caro, and thereafter kidnapped an 80-year-old woman, whom he robbed and then tied to a tree.[2] He was arrested and given an additional 7-year sentence, which he was to serve at the Michigan State Prison in Jackson. However, as he suffered from depression, Day was transferred for temporary treatment at the Center For Forensic Psychiatry in Ypsilanti.[3] During his stay, he was described as a model patient who frequently played chess with employees and even helped break up assaults by other patients. Through these activities, he became friendly with 36-year-old security worker Thomas Frederick Fortunato, a veteran employee of 14 years who was assigned to the center's C-43 ward, which was notorious for housing violent inmates.[4]\n",
        "type": [
            "assault",
            "rape",
            "kidnapped",
            "theft",
            "murder",
            "kidnapping"
        ]
    },
    "146": {
        "link": "/wiki/Knoxville_riot_of_1919",
        "title": "Knoxville riot of 1919",
        "date": "August 30–31, 1919",
        "year": "1919",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "The Knoxville riot of 1919 was a race riot that took place in the American city of Knoxville, Tennessee, on August 30–31, 1919. The riot began when a lynch mob stormed the county jail in search of Maurice Mays, a biracial man who had been accused of murdering a white woman. Unable to find Mays, the rioters looted the jail and fought a pitched gun battle with the residents of a predominantly black neighborhood. The Tennessee National Guard, which at one point fired two machine guns indiscriminately into this neighborhood, eventually dispersed the rioters.[1][2][3] At the end of August 1919 the Great Falls Daily Tribune reported four killed in a \"race war riot\"[4] while the Washington Times reported \"Scores dead.\"[5] Other newspapers placed the death toll at just two, though eyewitness accounts suggest it was much higher.[1]\nThe Riot of 1919 was one of several violent racial incidents that occurred during the so-called Red Summer when race riots plagued cities across the United States.  The riot was one of the worst racial episodes in Knoxville's history and shattered the city's vision of itself as a racially tolerant Southern town.[6] After the riot, many black residents left Knoxville, and racial violence continued to flare up sporadically in subsequent years.[1]\nIn the decades following the Civil War, Knoxville was considered by both black and white residents to be one of the few racially tolerant cities in the South. It was one of the few where black citizens could vote, hold public office, and serve as police officers.[1] In 1918, Charles W. Cansler (1871–1953), one of the city's leading African-American citizens, wrote to the governor of Tennessee, \"In no place in the world can there be found better relations existing between the races than here in our own county of Knox. No race riots have ever disgraced our city and no mob has ever vented its fury here upon any Negro victim.\"[1]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "147": {
        "link": "/wiki/Pulaski_riot",
        "title": "Pulaski riot",
        "date": "January 7, 1868",
        "year": "1868",
        "location": "Pulaski, Tennessee",
        "state": "Tennessee",
        "place": "Pulaski",
        "county": "Giles County",
        "paragraph": "White mob\nThe Pulaski riot was a race riot that occurred in Pulaski, Tennessee on January 7, 1868. While the riot appeared to be based in a trade dispute of the previous summer between Calvin Lamberth, a white man, and Calvin Carter, an African American, it was provoked when Lamberth shot a friend of Carter's over rumored comments about the former's black mistress. \nAfter Lamberth shot Carter's friend, Whitlock Fields, numerous other armed whites came from nearby houses and attacked Carter and seven other black men at a nearby black-owned grocery store. Although the constable arranged a ceasefire, after the freedmen gathered at the door of the store, some eighteen whites rushed and shot at them at close range. They murdered one man, mortally wounded another, and injured four. No white was injured or prosecuted. The incident was investigated by the Freedmen's Bureau office of Nashville, Tennessee.\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "148": {
        "link": "/wiki/DeAndre_Kpana-Quamoh",
        "title": "DeAndre Kpana-Quamoh",
        "date": "May 22, 2016(2016-05-22) (aged 18) Nashville, Tennessee",
        "year": "2016",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "1500m:4:51.30(2015)(Murfreesboro, Tennessee)\nDeAndre Tejan Kpana-Quamoh (March 17, 1998 – May 22, 2016) was a high school track & field star at East Nashville Magnet School.[1][2] He qualified for the 2014, 2015, and 2016 TSSAA track state championships but was fatally shot five days prior to the 2016 state track meet, just days after his high school graduation.[3][4][5]\nDeAndre Kpana-Quamoh was born on March 17, 1998 at Vanderbilt University Medical Center to Samuel Christopher Kpana-Quamoh and his wife Terrice (née Ramey).[1][4][6] The family has roots in the African city of Freetown, Sierra Leone where relative Joseph Kpana-Quamoh attended Albert Academy before immigrating to America and earning degrees from Lipscomb University and Fisk University.[7]\n",
        "type": []
    },
    "149": {
        "link": "/wiki/Battle_of_Depot_Street",
        "title": "Battle of Depot Street",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "The Battle of Depot Street was a municipal dispute and riot that took place in Knoxville, Tennessee, United States, on March 1, 1897.[1]  The incident began with a disagreement between city officials and Knox County officials over whether or not the Citizens Railway Company, led by William Gibbs McAdoo, had the authority to build streetcar tracks along Depot Street, sparking a standoff between city police and county sheriff's deputies.  During the struggle, both McAdoo and his rival, C.C. Howell, along with the mayor, chief of police, fire chief, and over 200 workers, were arrested by one side or the other.  One person was killed and several injured in accompanying mob violence.[2]\nThe incident was the culmination of a two-year struggle between McAdoo and Howell for control of Knoxville's streetcar system.  McAdoo had gained control of the bulk of the system in the early 1890s, and successfully converted the system to electric power.[2]  This conversion proved costly, however, and his company was forced into bankruptcy.  A syndicate led by Howell purchased most of the company's assets, but McAdoo maintained control of several routes,[1] and the two filed suits and countersuits as they attempted to outposition the other.  After this incident, McAdoo left Knoxville, and Howell consolidated the city's streetcar lines.[3]\nKnoxville's first streetcar company, the Knoxville Street Railway, was organized in the mid-1870s, and used streetcars pulled by mules or horses.[1]  In 1887, William Gibbs McAdoo (1862–1941), then a young attorney, organized the Elmwood Street Railway Company, which used streetcars that were steam-powered instead of horse-drawn.  Three years later, McAdoo reorganized the company as the Rapid Transit Company, which became the first in the city to use electric-powered streetcars.[1]\n",
        "type": [
            "riot"
        ]
    },
    "150": {
        "link": "/wiki/Elbert_Williams",
        "title": "Elbert Williams",
        "date": "June 20, 1940(1940-06-20) (aged 31) Brownsville, Tennessee, U.S.",
        "year": "1940",
        "location": "",
        "state": "Tennessee",
        "place": "Brownsville",
        "county": "Haywood County",
        "paragraph": "Elbert Williams (October 15, 1908 – June 20, 1940) was an African-American civil rights leader from Brownsville, Tennessee who was killed by unknown persons.[1][2] He was one of the five charter members of the NAACP branch in Brownsville.[1][3][2] Killed in 1940, Williams is the first known NAACP member to be lynched for his civil rights activities.[1][2][4]\nNo prosecution was undertaken at the time by state or federal authorities because of lack of evidence, although law enforcement officials were reportedly complicit in Williams's arrest and release to persons unknown. Under a 2018 civil rights cold case law, Williams's case was reopened in August 2018 for renewed investigation by the state.\nWilliams was born in 1908 in rural Haywood County, Tennessee to a sharecropper family.[1][3][2] His parents were Mary Green and Albert Williams.[2] His grandfather had been a slave[3] Williams attended classes through eighth grade at public schools, although there were no buildings for black elementary students.[2]\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "151": {
        "link": "/wiki/Emanuel_Kidega_Samson",
        "title": "Burnette Chapel shooting",
        "date": "September 24, 2017 11:15 a.m.",
        "year": "2017",
        "location": "The Burnette Chapel Church of Christ, Antioch, Tennessee",
        "state": "Tennessee",
        "place": "Antioch",
        "county": "Davidson County",
        "paragraph": "\nA mass shooting occurred on September 24, 2017, when a gunman opened fire at the Burnette Chapel Church of Christ in Antioch, Tennessee, part of the Greater Nashville area, killing one person and injuring six others.\nThe perpetrator was identified as Emanuel Kidega Samson, a 25-year-old native of Sudan.[2] Samson was arrested after getting into an altercation with a bystander, and charged with first-degree murder and 43 other charges.[2] The suspect indicated that the attack was an act of revenge for the 2015 Charleston church shooting.\n",
        "type": [
            "murder",
            "killing",
            "shooting",
            "mass shooting"
        ]
    },
    "152": {
        "link": "/wiki/Jason_Bryant",
        "title": "Lillelid murders",
        "date": "",
        "year": "new 1997",
        "location": "",
        "state": "Tennessee",
        "place": "Greene County",
        "county": "Greene County",
        "paragraph": "\nThe Lillelid murders refers to a criminal case in Greene County, Tennessee, United States, where three members of the Lillelid family were murdered on April 6, 1997. Vidar Lillelid (aged 34), Delfina Lillelid (aged 28), and their daughter Tabitha (aged 6), and son Peter (aged 2) were shot on a deserted rural road near Baileyton during a carjacking committed by a group of youths. Vidar and Delfina were found dead at the scene, while Tabitha died after being transported to the hospital. Peter survived, but, as a result of the shooting, was left with disabilities.[1] Six young people from Kentucky, including two minors, were convicted of felony murder for the deaths of Vidar, Delfina, and Tabitha Lillelid, with all six perpetrators receiving three life sentences, and an additional sentence of 25 years each for the attempted murder of Peter Lillelid.[2]\nVidar Lillelid grew up in Bergen, Norway, and in 1985 moved to United States. In 1989, Lillelid married Delfina Zelaya, a first-generation Honduran-American from New York City, whom he had met through their common involvement in the Jehovah's Witnesses denomination.[citation needed]. By 1997, the Lillelids had two children: 6-year-old daughter Tabitha (1990-1997) and 2-year-old son Peter (b.1995).\n",
        "type": [
            "murder",
            "kidnapping",
            "shooting"
        ]
    },
    "153": {
        "link": "/wiki/Tom_T._Hall",
        "title": "Tom T. Hall",
        "date": "August 20, 2021(2021-08-20) (aged 85) Franklin, Tennessee, U.S.",
        "year": "2021",
        "location": "",
        "state": "Tennessee",
        "place": "Franklin",
        "county": "Williamson County",
        "paragraph": "\nThomas Hall (May 25, 1936 – August 20, 2021), known professionally as Tom T. Hall and informally nicknamed \"the Storyteller,\"[2] was an American country music singer-songwriter and short-story author. He wrote 12 No. 1 hit songs, with 26 more that reached the Top 10, including the No. 1 international pop crossover hit \"Harper Valley PTA\" and \"I Love\", which reached No. 12 on the Billboard Hot 100. He is included in Rolling Stone's list of 100 Greatest Songwriters.\nHall was born in Tick Ridge, seven miles from Olive Hill, Kentucky, on May 25, 1936.[3][4] As a teenager, he organized a band called the Kentucky Travelers that performed before movies for a traveling theater.[4] Hall enlisted in the U.S. Army in 1957, serving in Germany.[5][6] While in the service, he performed over the Armed Forces Radio Network and wrote comic songs about army experiences.[4] Following his discharge in 1961, he used G.I. Bill education benefits to enroll at Roanoke College where he worked as a disc jockey.[7] His early career included being an announcer at WRON, a local radio station in Ronceverte, West Virginia. Hall was also an announcer at WMOR (1330 AM) in Morehead and WGOH (1370 AM) in Grayson, both in Kentucky. Hall was also an announcer at WSPZ, which later became WVRC Radio in Spencer, West Virginia, in the 1960s.[8]\n",
        "type": []
    },
    "154": {
        "link": "/wiki/Julius_Morgan",
        "title": "Julius Morgan",
        "date": "July 13, 1916(1916-07-13) (aged 21–22) Tennessee State Prison, Nashville, Tennessee, U.S.",
        "year": "1916",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "\n\nJulius Morgan (c. 1894  – July 13, 1916) was an American criminal who was the first prisoner executed by the electric chair in Tennessee, after being convicted for the rape of a twenty-year-old woman. He claimed to have served one year in an Arkansas prison for assault before escaping to Tennessee. Morgan unsuccessfully sought clemency from the Tennessee Supreme Court and Governor Thomas Clarke Rye before admitting his guilt at his execution.\n",
        "type": [
            "assault",
            "rape"
        ]
    },
    "155": {
        "link": "/wiki/Richland_High_School_shooting",
        "title": "Richland High School shooting",
        "date": "November 15, 1995  (CST)",
        "year": "1995",
        "location": "Lynnville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Lynnville",
        "county": "Giles County",
        "paragraph": "The Richland High School shooting was a school shooting that occurred on Wednesday, November 15, 1995,[1] in Lynnville, Tennessee, a small community located in Giles County. Seventeen-year-old James Ellison \"Jamie\" Rouse, a senior student at the school, killed one teacher and one student, and seriously wounded another teacher.[2]\nRouse used a .22-calibre Remington Viper semi-automatic rifle,[3] which he hid behind bushes before driving to retrieve his friend. His friend Stephen Abbot drove Jamie Rouse the rest of the way to Richland High School. He parked the car outside the school, and Rouse entered through the north entrance hallway. Inside the hallway he confronted teachers Carolyn Yancey and Carolyn Foster.[4]\nHe then shot both teachers in the head in the view of over fifty students in the hallway. He then aimed his rifle at football coach Ron Shirey; however, he missed and fatally shot freshman Diane Collins in the throat. He was then tackled by a male student and an agriculture teacher, who forcibly took the rifle away from him. Carolyn Foster was killed by a gunshot wound to the head, while Carolyn Yancey survived in serious condition.[2]\n",
        "type": [
            "murder",
            "killing",
            "shooting"
        ]
    },
    "156": {
        "link": "/wiki/Julie_Hayden_(teacher)",
        "title": "Julie Hayden (teacher)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Spring Hill",
        "county": "Maury County",
        "paragraph": "\nJulie Hayden (c. 1857 – August 21, 1874), sometimes Julia Hayden, was an American seventeen-year-old Black school teacher murdered by members of the White Man's League within days of starting a teaching position at a school for Black children in Tennessee.\nHayden grew up in Spring Hill in Maury County, Tennessee.[1][2] She attended Central Tennessee College in Nashville, a teachers' college for Black students.[1]\n",
        "type": [
            "murder"
        ]
    },
    "157": {
        "link": "/wiki/Bruce_Mendenhall",
        "title": "Bruce Mendenhall",
        "date": "",
        "year": "new 2007",
        "location": "",
        "state": "Tennessee",
        "place": "Crawford County",
        "county": "Overton County",
        "paragraph": "Bruce D. Mendenhall (born April 14, 1951) is a convicted American murderer and serial killer. He was arrested in Tennessee in July 2007 – and found guilty in 2010[2] – for the June 26, 2007 murder of Sara Hulbert. The body was found by the security guard on duty that night. A long haul trucker, his truck was found to contain the blood of numerous other murdered or missing women.[2]  He has been charged with the murders of three other women at truck stops in Alabama, Indiana and Tennessee.[3] He is still under investigation for murders in Georgia, Illinois, New Mexico, Oklahoma, and Texas.\nMendenhall grew up in Crawford County, Illinois. He was married with two daughters.[4]\nA resident of Albion, Illinois, Mendenhall was arrested at the TA truck stop on Interstate 24 in Nashville, Tennessee on July 12, 2007[5] after Detective Sgt. Pat Postiglione spotted a truck that matched surveillance footage from the night Sara Nicole Hulbert was murdered at the same truck stop.[6] Upon inspection of the vehicle, a large quantity of bloody clothing and identification and personal effects of an Indianapolis woman, who went missing the day before, was found in a plastic sack along with blood spots scattered around the inside of his cab to include the steering wheel and even on his hands when arrested[7] and Mendenhall was taken into custody.[3] Police catalogued 300 items from the truck including a rifle, knives, handcuffs, latex gloves, several weapons cartridges, black tape, a nightstick, and sex toys.[8] Sampling of these items turned up the DNA of five different women. On August 2, 2007, Mendenhall waived his right to a preliminary hearing.[7]\n",
        "type": [
            "murder"
        ]
    },
    "158": {
        "link": "/wiki/Hattie_Cotton_Elementary_School_bombing",
        "title": "Hattie Cotton Elementary School bombing",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "The Hattie Cotton Elementary School bombing on September 10, 1957 was a destructive bombing by pro-segregationists of an elementary school in Nashville, Tennessee shortly after it admitted its first African American student in the midst of the Civil Rights Movement.[1] The school is now known as Hattie Cotton STEM Magnet Elementary School, and focuses on science, technology, engineering and math for students in grades kindergarten through four.[2]\nHattie Cotton Elementary School opened September 1, 1950 at 1033 W. Greenwood Ave. in East Nashville. Built by George E. Reese and designed by Marr & Holman architectural firm,[3] the school was located west of Gallatin Pike to help students avoid the highway.[4]\nThe school is named after Hattie R. Cotton — a Nashville educator who taught the chairman of the city board of education, William Hume, and the school's architect, Joseph W. Holman. She was named a regular teacher in 1905 and became the city's academic supervisor in 1919. She died two years after her retirement in 1926.[3]\n",
        "type": []
    },
    "159": {
        "link": "/wiki/David_%22Stringbean%22_Akeman",
        "title": "David \"Stringbean\" Akeman",
        "date": "November 10, 1973(1973-11-10) (aged 58) Ridgetop, Tennessee, U.S.",
        "year": "1973",
        "location": "",
        "state": "Tennessee",
        "place": "Ridgetop",
        "county": "Robertson County",
        "paragraph": "\nDavid Akeman (June 17, 1915[1] – November 10, 1973)[2] better known as Stringbean (or String Bean), was an American singer-songwriter, musician, comedian, and semiprofessional baseball player[3] best known for his role as a main cast member on the hit television show Hee Haw and as a member of the Grand Ole Opry. Akeman was well-known for his \"old-fashioned\" banjo-picking style, careful mix of comedy and music, and his memorable stage wardrobe (which consisted of a long nightshirt tucked into a pair of short blue jeans belted around his knees — giving him the comical appearance of a very tall man with stubby legs). Akeman and his wife were shot and murdered by burglars in their rural Tennessee home near Ridgetop in 1973.\nBorn in Annville, Jackson County, Kentucky, United States,[2] Akeman came from a musical family, including his father, James Akeman, who played the banjo at local dances.[4] He got his first banjo when he was 12 years old in exchange for a pair of prize bantam chickens.[5] Akeman began playing at local dances and gained a reputation as a musician, but the income was not enough to live on. He joined the Depression-era Civilian Conservation Corps, building roads and planting trees.\n",
        "type": [
            "murder"
        ]
    },
    "160": {
        "link": "/wiki/Laron_Williams",
        "title": "Laron Williams",
        "date": "July 7, 1985(1985-07-07) (aged 35–36) Hubbard Hospital, Nashville, Tennessee, U.S.",
        "year": "1985",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Laron Ronald Williams (1949 – July 7, 1985) was an American serial killer. Originally convicted in the 1977 murder of a prostitute in Nashville, Tennessee and suspected in at least two similar killings, Williams later escaped from prison and murdered a police officer and a priest within days of one another in 1981.[1] He was separately sentenced to death for both murders, but was killed by fellow inmates on death row in 1985 before he could be executed.[2]\nMuch of Williams' early life is shrouded in mystery. During an interview on death row, he said that he was born somewhere outside of the United States in 1949, the second of six children of a father serving in the Army.[3] Williams claimed that he saw little of his father when he was little, as he  was serving in Korea, but after the war ended, he returned and the family moved to Louisiana.[3] Williams told that he entered high school in a town called \"Newardton\", a presumably fictitious location as no records of such a place existing in the state have been located, before moving to Southern California. While there, he finished high school and supposedly spent a year and a half in college studying psychology, but again, he refused to disclose the exact location.[3] During the 1970s, he drifted around various parts of the country before permanently settling in Chicago, Illinois.[3]\nCirca August or early October 1977, Williams went to stay at a friend's apartment at the Pagoda Garden Apartments in Nashville.[4] On October 18, he solicited the services of a 19-year-old prostitute, Terra Wedlaw, who had arrived in the city just two months earlier from Tampa, Florida.[4] The pair went to the Capitol Park Inn to have sex, but after they had finished, Williams strangled her and fled the premises. Just a few weeks later, he was arrested on murder charges by local authorities, after the woman's birth certificate was found in his possession.[4] While he awaited his trial, it was publicly announced that Williams was a suspect in two similar murders that had occurred in Nashville: the strangulation murders of prostitute Mary Jo Corn (alias Larisa Ann Marsay) and bank teller Bessie Wallace, both 24.[4] Both women were found nude and strangled in areas near the city, their hands and feet tied with rope, and each was killed months within one another. As the killings were similar to that of Wedlaw, authorities suspected that Williams was their killer, and he was also under investigation for other similar murders in places such as Atlanta and Columbus, Georgia; Portland, Oregon; Washington and his residence in Chicago.[4]\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    "161": {
        "link": "/wiki/Kingston_courthouse_shooting",
        "title": "Kingston courthouse shooting",
        "date": "",
        "year": "new 1974",
        "location": "",
        "state": "Tennessee",
        "place": "Kingston",
        "county": "Roane County",
        "paragraph": "The Kingston courthouse shooting was a fatal shooting that took place on August 9, 2005, at the Roane County Courthouse in Kingston, Tennessee, United States. It resulted in the death of a Tennessee Department of Correction transport officer, and the wounding of another officer. The perpetrator, Jennifer Forsyth Hyatte (born February 11, 1974), began shooting immediately after her husband, George, pleaded guilty to a robbery charge in the courthouse. \nJennifer Hyatte is currently serving a life sentence without the possibility of parole. George Hyatte pleaded guilty to first-degree murder in the shooting in 2009 and was sentenced to life in prison as part of a plea bargain to avoid the death penalty.[1]\nAt approximately 10:00 a.m., after a court hearing, Tennessee Department of Corrections transport officer Wayne \"Cotton\" Morgan was fatally shot three times by Jennifer Forsyth Hyatte, whose husband, George Hyatte, pleaded guilty to a charge of robbery. Officer Morgan and his partner were loading prisoners into a transport van after a court appearance, when Jennifer Forsythe Hyatte drove up and opened fire with a handgun, striking Officer Morgan three times in the abdomen. Officer Morgan's partner returned fire as the escaping prisoner climbed inside his wife's vehicle. Jennifer Forsythe Hyatte was a former nurse at a prison where George Hyatte had been an inmate. She had been fired after she was found sneaking food to George. \n",
        "type": [
            "robbery",
            "murder",
            "robber",
            "shooting"
        ]
    },
    "162": {
        "link": "/wiki/George_Floyd_protests_in_Tennessee",
        "title": "George Floyd protests in Tennessee",
        "date": "May 28, 2020 – June 12, 2020",
        "year": "2020",
        "location": "Tennessee, United States",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "\n\nThe murder of George Floyd on May 25, 2020 triggered a wave of protests throughout Tennessee in late May and early June 2020.\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    "163": {
        "link": "/wiki/Harvey_Hendrick",
        "title": "Harvey Hendrick",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Mason",
        "county": "Tipton County",
        "paragraph": "Harvey \"Gink\" Hendrick[1] (November 9, 1897 – October 29, 1941) was an American Major League Baseball player who played for several different teams during an eleven-year career.\nBorn near Mason, Tennessee on November 9, 1897 to Richard T. and Nannie Harvey Hendrick, Hendrick went to elementary school in Brownsville, Tennessee.[2] Hendrick attended preparatory school at Fitzgerald & Clarke School in Tullahoma, Tennessee; also attended by the likes of Vanderbilt football greats Lynn Bomar and Hek Wakefield. He then attended Vanderbilt University, playing football and baseball for the Commodores. He was a favored target of Jess Neely on the football team.\nHe signed with the Memphis Chicks after graduating from Vanderbilt, but was released from the team before playing a game. He began his professional career with the Chattanooga Lookouts in 1921, and had a .274 batting average in 141 games. He followed that up the following year with a .311 batting average in 134 games for the Galveston Sand Crabs.[2] During the offseason, shortly after being signed by the Boston Red Sox, Hendrick was traded to the New York Yankees with George Pipgras for Al DeVormer. He made his major league debut with the Yankees in 1923, where he had a .273 batting average in 37 games and had one at-bat in the 1923 World Series.[3]\n",
        "type": []
    },
    "164": {
        "link": "/wiki/Tadaryl_Shipp",
        "title": "Christa Pike",
        "date": "January 12, 1995",
        "year": "1995",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Christa Gail Pike (born March 10, 1976) is an American convicted murderer, and the youngest woman to be sentenced to death in the United States during the post-Furman period.[1] She was 20 when convicted of the torture murder of her classmate Colleen Slemmer, which she committed at age 18.\nPike lived a troubled life and dropped out of high school. She joined the Job Corps, a government program aimed at helping low-income youth by offering vocational training and career skills, and attended the now-closed Job Corps center in Knoxville, Tennessee. Pike began dating a man a year her junior named Tadaryl Shipp. Together, they developed interest in the occult and devil worship.[2]\nChrista became jealous of her friend, university student 19-year-old Colleen Slemmer, who she thought was trying to \"steal\" her boyfriend from her; friends of Slemmer denied the accusations. Along with friend Shadolla Peterson, 18, Pike planned to lure Slemmer to an isolated, abandoned steam plant near the University of Tennessee campus.[2]\n",
        "type": [
            "murder",
            "torture"
        ]
    },
    "165": {
        "link": "/wiki/Federal_Express_Flight_705",
        "title": "Federal Express Flight 705",
        "date": "April 7, 1994",
        "year": "1994",
        "location": "",
        "state": "Tennessee",
        "place": "Memphis",
        "county": "Shelby County",
        "paragraph": "\nOn April 7, 1994, Federal Express Flight 705, a McDonnell Douglas DC-10-30 cargo jet carrying electronics equipment across the United States from Memphis, Tennessee, to San Jose, California, was involved in a hijack attempt by Auburn R. Calloway, who the prosecution argued was trying to commit suicide. Calloway, a Federal Express employee, was facing possible dismissal for lying about his flight hours. He boarded the scheduled flight as a deadhead passenger carrying a guitar case concealing several hammers and a speargun. He tried to switch off the aircraft's cockpit voice recorder (CVR) before takeoff and, once airborne, kill the crew with hammers so their injuries would appear consistent with an accident rather than a hijacking. The CVR, though, was switched back on by the flight engineer, believing that he had neglected to turn it on.[3]\nCalloway intended to use the speargun as a last resort. He planned to crash the aircraft hoping that he would appear to be an employee killed in an accident. He sought to let his family collect on a $2.5 million life insurance policy provided by Federal Express.[3] Calloway's efforts to kill the crew were unsuccessful. Despite severe injuries, the crew fought back, subdued Calloway, and landed the aircraft safely.\n",
        "type": [
            "hijacking"
        ]
    },
    "166": {
        "link": "/wiki/Highlander_Research_and_Education_Center_fire",
        "title": "Highlander Research and Education Center",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "New Market",
        "county": "Jefferson County",
        "paragraph": "The Highlander Research and Education Center, formerly known as the Highlander Folk School, is a social justice leadership training school and cultural center in New Market, Tennessee. Founded in 1932 by activist Myles Horton, educator Don West, and Methodist minister James A. Dombrowski, it was originally located in the community of Summerfield in Grundy County, Tennessee, between Monteagle and Tracy City. It was featured in the 1985 documentary film, You Got to Move. Much of the history was documented in the book Or We'll All Hang Separately: The Highlander Idea by Thomas Bledsoe.\nHighlander provides training and education for emerging and existing movement leaders throughout the South, Appalachia, and the world. Some of Highlander's earliest contributions were during the labor movement in Appalachia and throughout the Southern United States. During the 1950s, it played a critical role in the American Civil Rights Movement. It trained civil rights leader Rosa Parks prior to her historic role in the Montgomery bus boycott, as well as providing training for many other movement activists, including members of the Student Nonviolent Coordinating Committee (SNCC), Septima Clark, Anne Braden, Martin Luther King Jr., James Bevel, Hollis Watkins, Bernard Lafayette, Ralph Abernathy and John Lewis in the mid- and-late 1950s. Backlash against the school's involvement with the Civil Rights Movement led to the school's closure by the state of Tennessee in 1961. Staff reorganized and moved to Knoxville, Tennessee, where they rechartered Highlander under the name \"Highlander Research and Education Center.\" Highlander has been in its current (and longest consecutive) home in New Market, Tennessee, since 1971. Highlander's archives reside at the Wisconsin Historical Society and the Louis Round Wilson Library at the University of North Carolina at Chapel Hill.\nThe Highlander Folk School was originally established in Grundy County, Tennessee, on land donated for this purpose by educator Lilian Wyckoff Johnson.[1] When Highlander was founded in 1932, the United States was in the midst of the Great Depression. Workers in all parts of the country were met with major resistance by employers when they tried to organize labor unions, especially in the South. Against that backdrop, Horton, West and Dombrowski created the Highlander School \"to provide an educational center in the South for the training of rural and industrial leaders, and for the conservation and enrichment of the indigenous cultural values of the mountains.\" Horton was influenced by observing rural adult education schools in Denmark started in the 19th century by Danish Lutheran Bishop N. F. S. Grundtvig.[2] During the 1930s and 1940s, the school's main focus was labor education and the training of labor organizers. In the 1930s, Myra Page taught here.[3]\n",
        "type": []
    },
    "167": {
        "link": "/wiki/Hamilton_Love",
        "title": "Hamilton Love",
        "date": "May 2, 1922(1922-05-02) (aged 46) Nashville, Tennessee, U.S.",
        "year": "1922",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Henry Hamilton Love (December 27, 1875 – May 2, 1922) was a lumberman, sportswriter and humorist who lived in Nashville, Tennessee. He was known as the \"Daddy of the Nashville lumberman\" and was the first president of the Nashville Lumberman's Club.  Love wrote the Hardwood Code, a telegraphic code once used extensively in the lumber trade and that was urged by the Hardwood Manufacturer's Association of the United States.\nLove contributed articles covering the South to The Sporting News and Sporting Life. He was chairman of the local baseball committee and wrote several articles covering the Nashville Vols. He was also chair of the Nashville board of censorship of moving pictures and was active in the Rotary Club.\nHamilton Love was born on December 27, 1875, on his father's farm about three miles (4.8 km) from Nashville, Tennessee;[1] he was the youngest child of James Benton Love and Mary Elizabeth Plummer, and was named for his grandfather. Love's father James was a coal merchant and a member of the firm Love & Randle.[2]\n",
        "type": []
    },
    "168": {
        "link": "/wiki/Christa_Pike",
        "title": "Christa Pike",
        "date": "January 12, 1995",
        "year": "1995",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Christa Gail Pike (born March 10, 1976) is an American convicted murderer, and the youngest woman to be sentenced to death in the United States during the post-Furman period.[1] She was 20 when convicted of the torture murder of her classmate Colleen Slemmer, which she committed at age 18.\nPike lived a troubled life and dropped out of high school. She joined the Job Corps, a government program aimed at helping low-income youth by offering vocational training and career skills, and attended the now-closed Job Corps center in Knoxville, Tennessee. Pike began dating a man a year her junior named Tadaryl Shipp. Together, they developed interest in the occult and devil worship.[2]\nChrista became jealous of her friend, university student 19-year-old Colleen Slemmer, who she thought was trying to \"steal\" her boyfriend from her; friends of Slemmer denied the accusations. Along with friend Shadolla Peterson, 18, Pike planned to lure Slemmer to an isolated, abandoned steam plant near the University of Tennessee campus.[2]\n",
        "type": [
            "murder",
            "torture"
        ]
    },
    "169": {
        "link": "/wiki/Shooting_of_Jocques_Clemmons",
        "title": "Shooting of Jocques Clemmons",
        "date": "February 10, 2017 (2017-02-10)",
        "year": "2017",
        "location": "James A. Cayce Homes parking lot, East Nashville, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "East Nashville",
        "county": "Davidson County",
        "paragraph": "Jocques Clemmons, a 31-year-old, was fatally shot on February 10, 2017 in Nashville, Tennessee, United States, after a traffic stop where Clemmons pulled out a gun, leading to a confrontation with Joshua Lippert, a 32-year-old police officer. After an investigation, the Davidson County District Attorney declined to prosecute Lippert on any charges, a decision that was protested by several groups. After reviews at several levels of the Nashville Police and Tennessee Bureau of Investigation's work and reports, the U.S. Department of Justice closed the case in August 2017.\nClemmons ran a stop sign and stopped in the parking lot of the James A. Cayce Homes. He got out of the car and was armed. His gun fell to the ground during the altercation with Lippert. Clemmons picked up the weapon before Lippert shot him, once in the abdomen, once in the hip and twice in the back as he tried to run away.\nOn May 11, 2017, the district attorney of Davidson County, Glenn Funk, decided not to prosecute Lippert. The decision prompted criticisms from the NAACP, the ACLU and Black Lives Matter, and protesters gathered outside the residence of then Nashville Mayor Megan Barry.\n",
        "type": [
            "shooting"
        ]
    },
    "170": {
        "link": "/wiki/Harbison_v._Bell",
        "title": "Harbison v. Bell",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "Harbison v. Bell, 556 U.S. 180 (2009), was a decision by the Supreme Court of the United States that held that federal law gave indigent death row inmates the right to federally appointed counsel to represent them in post-conviction state clemency proceedings, when the state has declined to do so. Certiorari was granted by the Supreme Court on June 23, 2008.\nJustice Stevens delivered the judgment of the court, stating:\n§3599 authorizes federally appointed counsel to represent their clients in state clemency proceedings and entitles them to compensation for that representation. Accordingly, the judgment of the Court of Appeals is reversed.",
        "type": []
    },
    "171": {
        "link": "/wiki/Daryl_Holton",
        "title": "Daryl Holton",
        "date": "November 30, 1997",
        "year": "1997",
        "location": "",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "Daryl Keith Holton (November 23, 1961 – September 12, 2007)[1] was an American Gulf War veteran and convicted child murderer who was executed by electrocution by the state of Tennessee on September 12, 2007, in Riverbend Maximum Security Institution in Nashville.\nHolton, a Gulf War veteran, was 36 years old when he fatally shot his three young sons and their half-sister: Stephen Edward Holton (12), Brent Holton (10), Eric Holton (6), and Kayla Marie Holton (4) with a Chinese-made semi-automatic rifle on November 30, 1997, at the garage where he worked in Shelbyville, Tennessee. Holton was divorced, and his ex-wife had custody of the children. About an hour later, Holton turned himself in to the Shelbyville police; he told investigators that he had killed the children because \"families should stay together; a father should be with his children.\" He said he had also planned to kill his ex-wife and then himself, but had changed his mind.[2][3]\nAt his June 1999 trial, Holton declined to testify on his own behalf, although his attorney sought to convince the jury that Holton was mentally incompetent at the time of the killings. Witnesses for the defense testified that Holton showed signs of carbon monoxide poisoning, although they could not definitively conclude that he had been exposed to carbon monoxide. Psychiatrists for the state and the defense also testified that Holton had major depressive disorder and passive-aggressive personality disorder at the time of the murders. The jury rejected the insanity defense; Holton was found guilty and sentenced to death.[4]\n",
        "type": [
            "murder",
            "killing",
            "mass murder"
        ]
    },
    "172": {
        "link": "/wiki/Letalvis_Cobbins",
        "title": "Murders of Channon Christian and Christopher Newsom",
        "date": "January 6, 2007",
        "year": "2007",
        "location": "Knoxville, Tennessee, United States",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nCoordinates: 35°59′28″N 83°54′27″W﻿ / ﻿35.99113°N 83.907514°W﻿ / 35.99113; -83.907514\nChannon Gail Christian, aged 21, and Hugh Christopher Newsom Jr., aged 23, were from Knoxville, Tennessee, United States. They were kidnapped on the evening of January 6, 2007, when Christian's vehicle was carjacked. The couple were taken to a rental house. Both of them were raped, tortured, and murdered.[1][2][3] Four males and one female were arrested, charged, and convicted in the case. In 2007, a grand jury indicted Letalvis Darnell Cobbins, Lemaricus Devall Davidson, George Geovonni Thomas, and Vanessa Lynn Coleman on counts of kidnapping, robbery, rape, and murder.[4][5][6][7][8] Also in 2007, Eric DeWayne Boyd was indicted by a federal grand jury of being an accessory to a carjacking, resulting in serious bodily injury to another person, and misprision of a felony.[8] In 2018, Boyd was indicted on state-level charges of kidnapping, robbery, rape, and murder.[9]\nFour of the five defendants (Eric Boyd, Letalvis Cobbins, Lemaricus Davidson, and George Thomas) had multiple prior felony convictions.[10] After a jury trial, Davidson was convicted and sentenced to death by lethal injection.[11][12] Cobbins and Thomas were convicted and sentenced to life in prison without parole.[13][14][15][16] Vanessa Coleman was convicted of facilitating the crimes and sentenced to 53 years.[17] Eric Boyd was convicted at the federal level and sentenced to 18 years in federal prison for being an accessory after the fact to carjacking.[18][19] He was convicted on state level charges over a decade later in 2019.[20]\n",
        "type": [
            "torture",
            "rape",
            "kidnapped",
            "robbery",
            "theft",
            "murder",
            "kidnapping",
            "robber"
        ]
    },
    "173": {
        "link": "/wiki/Lynching_of_Jim_Taylor",
        "title": "Lynching of Jim Taylor",
        "date": "April 29, 1891",
        "year": "1891",
        "location": "Murfreesboro Road, Franklin, Tennessee, U.S.",
        "state": "Tennessee",
        "place": "Franklin",
        "county": "Williamson County",
        "paragraph": "\nJim Taylor was an African-American man who was lynched on April 30, 1891 in Franklin, Tennessee.\nJim Taylor was an African American man who lived and worked as a sharecropper on a farm owned by James Hodge, two miles from Franklin.[1] He was described as \"a very large negro\", who was \"feared by his own race and regarded as desperate\" by The Daily American,[1] and as \"a dangerous character\" by The Leaf-Chronicle.[2]\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "174": {
        "link": "/wiki/Ray_Treadaway",
        "title": "Ray Treadaway",
        "date": "",
        "year": "new 1930",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "Edgar Raymond Treadaway (October 31, 1907 – October 12, 1935) was a third baseman in Major League Baseball who played in six games late in the season for the 1930 Washington Senators.[1]\nTreadaway died at the age 27 on October 12, 1935, three months after being shot in the leg during a bar fight.\nThis biographical article relating to a baseball third baseman is a stub. You can help Wikipedia by expanding it.",
        "type": [
            "murder"
        ]
    },
    "175": {
        "link": "/wiki/Anthony_Blair_(criminal)",
        "title": "Anthony Blair (criminal)",
        "date": "September 26, 1879(1879-09-26) (aged 29–30) Hamblen County, Tennessee",
        "year": "1879",
        "location": "",
        "state": "Tennessee",
        "place": "Hamblen County",
        "county": "Hamblen County",
        "paragraph": "Anthony Blair (c. 1849 – September 26, 1879) was an African-American convicted for the murder of his 16-year-old stepdaughter Maggie Blair. He was executed by hanging, the first such execution to occur in Hamblen County, Tennessee.\nBlair lived with his stepdaughter Maggie in Washington County near Jonesborough. Maggie had left Blair's house and, from May 1879, lived and worked for William Donaldson in Hamblen County. She was described as very smart and industrious. Blair learned of her whereabouts and on July 29 went to Russellville, Tennessee, immediately making his way to the Donaldson residence. He entered the kitchen, where Maggie was preparing dinner with Mrs. Donaldson. Blair told Maggie that he had something to say to her and asked her to come outside the house. She refused, saying he could say what he had to say in front of Mrs. Donaldson. Around this time, William Donaldson rode up and Blair immediately left the house.[1]\nThe following night on Wednesday, Maggie went with others to the prayer meeting at the black church near Russellville. Returning, Blair passed on persons who had been to the church service. He headed on to Russellville after some conversation but after going a short distance, turned back and took another road where the young people, including Maggie, had taken. He overtook the party and immediately walked up to his stepdaughter, who was walking in the rear with a black boy named Taylor. Pushing Taylor away, he caught her hand and said: \"You must go home with me on the train tonight to your grandpa\", and pulled her along the road 150 to 200 yards, saying she should go. Maggie struggled to loosen herself from his grasp, saying she would rather die than go, whereupon he drew a pistol and shot her twice. She died the following Saturday, aged 16.[1]\n",
        "type": [
            "murder"
        ]
    },
    "176": {
        "link": "/wiki/Jamar_Siler",
        "title": "Central High School (Knoxville, Tennessee)",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "Central High School is a public high school located at 5321 Jacksboro Pike in the Fountain City neighborhood of Knoxville, Tennessee, operated by the Knox County school system.The school's athletic teams are nicknamed the Bobcats, and its colors are red and black.\nCentral was formerly located at what is now Gresham Middle School in the heart of Fountain City, which, in the 1960s, was the largest unincorporated community in Tennessee.  Its name is something of a misnomer, because it was never located near the center of Knoxville, even when Fountain City was annexed into Knoxville in the early 1960s.  The northernmost high school in Knoxville before the annexation of Fountain City was Fulton, and in the county, Powell, Karns, and Halls high schools were farther north.\nOn August 21, 2008, 15-year-old student Jamar Siler entered the school cafeteria and approached student Ryan McDonald sitting at a lunch table. Siler fatally shot McDonald, and was arrested by authorities a short time later. The two had been in previous altercations, the details of which were not released to the general public. Siler was then taken into custody.\n",
        "type": []
    },
    "177": {
        "link": "/wiki/Donald_Ray_Middlebrooks",
        "title": "Murder of Kerrick Majors",
        "date": "April 26, 1987 (aged 14) East Nashville, Tennessee, U.S.",
        "year": "1987",
        "location": "",
        "state": "Tennessee",
        "place": "East Nashville",
        "county": "Davidson County",
        "paragraph": "On April 26, 1987, Kerrick Majors, a 14-year-old African-American boy, was tortured and murdered during a racially-motivated hate crime by three white drifters in East Nashville, Tennessee.[1] Majors was attacked by the trio after he and his friends accidentally broke a $2 vase at a flea market.[2] Majors was kidnapped, tortured, beaten, and stabbed to death, while his attackers yelled racial slurs at him.[1][3] His body was found the following day.[4]\nDonald Ray Middlebrooks, Tammy Middlebrooks, and Robert Brewington, all white, were convicted of his murder. Donald Middlebrooks was sentenced to death, while Tammy Middlebrooks and Brewington received life sentences.[5] The police were criticized for their handling of the case and were accused of being racially biased.[6][7] Majors' family later sued the Metro government and said the police's slow response to Majors' disappearance led to his death.[8]\nThe case was notable due to its brutal nature, alleged racial bias from the police, and because it marked a rare occasion in which a white person received a death sentence for murdering a black person.[9][10] Middlebrooks was scheduled to be executed in December 2022, but his execution was later suspended.[11][12][13] If executed, Middlebrooks will be the first white person in modern Tennessee history to be executed for killing a black person.[14][15]\n",
        "type": [
            "murder",
            "killing",
            "kidnapped",
            "torture"
        ]
    },
    "178": {
        "link": "/wiki/Murders_of_Joel_and_Lisa_Guy",
        "title": "Murders of Joel and Lisa Guy",
        "date": "",
        "year": "new 2016",
        "location": "",
        "state": "Tennessee",
        "place": "Knoxville",
        "county": "Knox County",
        "paragraph": "\nOn November 26, 2016, 61-year-old Joel Guy Sr. and 55-year-old Lisa Guy were murdered and dismembered by their son, 28-year-old Joel Michael Guy Jr., in Knoxville, Tennessee, United States.[1][2] Guy Jr. stabbed his father at least 42 times, his mother at least 31 times. He was convicted of both murders in October 2020 and received a sentence of life imprisonment.[3]\nGuy Jr.'s parents were soon to retire and would stop providing money to their son; he was to receive a $500,000 life insurance policy if both were dead or missing.[4] The murder involved an elaborate plot to stab both parents, dismember and dissolve their remains, and clean and burn down some of the house, as well as frame the father for the crime.[citation needed] Guy Jr. was injured during the stabbing and left the partially dissolved remains in the house when he left to dress his wounds. Before he returned, police discovered the bloody scene upon performing a welfare check.[5] They also discovered a backpack containing a notebook detailing the plan; plastic bins with both parents' torsos and dismembered limbs dissolving in an acid-based solution of corrosive chemicals described by prosecutors as a \"diabolical stew of human remains\";[2] the father's severed hands on the floor; and the mother's head in a pot on the stove.[citation needed]\n",
        "type": [
            "murder"
        ]
    },
    "179": {
        "link": "/wiki/Lynching_of_Alfred_Blount",
        "title": "Lynching of Alfred Blount",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Chattanooga",
        "county": "Hamilton County",
        "paragraph": "\nOn February 9, 1893, Alfred Blount, an African American and a Chattanooga native, was taken from his jail cell in the county jail and brutally beaten, stabbed, and hanged from the Walnut Street Bridge in Chattanooga, Tennessee.[1] Blount was charged with assault of a woman by the name of Mrs. M. A. Moore. Moore, 51 and widowed, claimed she was cleaning her house when a man entered through her back door requesting food. Moore, assuming it was a neighbor of hers, invited the man in and called out to her African-American house boy Sam to bring the man some food.[1] Upon realizing Sam's absence, Moore herself went into the kitchen to prepare food before reporting being grabbed by the arm and attacked by the man. After hitting the man with her hand, Moore fainted and laid unconscious in her house before recalling the incident to her neighbor, Mrs. DeRochement.[1]\nSheriff Skillern sent out a team of searchers to identify and arrest the suspected attacker. Within roughly half an hour of the report, Moore gave a physical description of her attacker and a search began. Blount was arrested shortly thereafter and imprisoned in the county jail.[1]\n",
        "type": [
            "assault",
            "lynching",
            "murder"
        ]
    },
    "180": {
        "link": "/wiki/Riverbend_Maximum_Security_Institution",
        "title": "Riverbend Maximum Security Institution",
        "date": "",
        "year": "",
        "location": "Nashville, Tennessee",
        "state": "Tennessee",
        "place": "Nashville",
        "county": "Davidson County",
        "paragraph": "The Riverbend Maximum Security Institution (RMSI) is a prison in Nashville, Tennessee, operated by the Tennessee Department of Correction. The prison opened in 1989 and replaced its 100-year-old neighbor, the Tennessee State Penitentiary.  RMSI, which is made up by 20 different buildings, sits on 132 acres (0.53 km2) located off Cockrill Bend Boulevard in Nashville, TN. Riverbend's designated capacity is 714 offenders. Of that number, 480 are classified as high risk.\nThe prison's overall mission is to ensure the safety of the public, departmental employees and inmates by managing high-risk male offenders. Warden Mays oversees a staff of nearly 400 people, including administrative workers, correctional officers, unit managers and medical personnel.\nEducation programs at the prison include GED and Adult Basic Education. There are also vocational classes available for printing, commercial cleaning, industrial maintenance, cabinet making/millwork and computer information systems. TRICOR, the prison industry, also manages a data entry plant and print shop at the prison.  Inmates not involved in academic vocation, or industry programs are required to work in support service roles throughout the facility.\n",
        "type": []
    },
    "181": {
        "link": "/wiki/Rader_v._State",
        "title": "Rader v. State",
        "date": "",
        "year": "new 1880",
        "location": "",
        "state": "Tennessee",
        "place": "Tenn.",
        "county": "Shelby County",
        "paragraph": "Rader v. State, 73 Tenn. 610 (1880), was a case decided by the Tennessee Supreme Court that held that to fulfill requirement of deliberation for first degree murder the purpose to kill may be formed a mere moment before the act, but deliberation does require some length of time for cool reflection free from excitement or passion.[1]\nW.H. Rader killed W.T. Thomas in December 1879 in Bristol, Tennessee in a store owned by J.M. Barker. Rader and Thomas worked together in Barker's store, and there was a dispute over a 30¢ box of shirt collars Rader had asked Thomas to give him on credit. The two fought with knives, and Rader fatally wounded Thomas on the neck, in full view of witnesses. Rader was convicted of first degree murder and sentenced to life imprisonment. He appealed on a number of bases, and obtained a new trial because the Supreme Court found that the State had failed to prove the deliberation and premeditation required to sustain a conviction for first degree murder.[2]\n",
        "type": [
            "murder"
        ]
    },
    "182": {
        "link": "/wiki/House_v._Bell",
        "title": "House v. Bell",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Luttrell",
        "county": "Union County",
        "paragraph": "House v. Bell, 547 U.S. 518 (2006), is a United States Supreme Court case challenging the permissibility of new DNA forensic evidence that becomes available post-conviction, in capital punishment appeals when those claims have defaulted pursuant to state law.[1]  The Court found that admitting new DNA evidence was in line with Schlup v. Delo (1995),[2] which allows cases to be reopened in light of new evidence.\nIn 1985, Carolyn Muncey was bludgeoned to death in Luttrell, Tennessee, near Knoxville.  Her body was found on an embankment the following day.  Paul Gregory House, who was a friend of the Munceys, was charged with the murder.  House was on parole and had a prior aggravated sexual assault conviction in Utah.[3]  Based on circumstantial evidence that House was spotted near the embankment, that blood consistent with that of the victim was found on House's jeans, and that semen consistent with House's was found on the victim's nightgown and underwear, House was found guilty at trial with aggravating factors that qualified him for capital punishment.\nThe Tennessee Supreme Court affirmed House's conviction and sentence, describing the evidence against House as \"circumstantial\" but \"quite strong.\"  Later, in a state trial court, House filed a pro se petition for post-conviction relief, arguing that he received ineffective assistance of counsel at trial and objecting to certain jury instructions. At a hearing before the same judge who conducted the trial, the court dismissed the petition, deeming House's trial counsel adequate and overruling House's other objections. On appeal House's attorney renewed only the jury-instructions argument and the Tennessee Court of Criminal Appeals affirmed, and both the Tennessee Supreme Court and the Supreme Court of the United States denied review.\n",
        "type": [
            "assault",
            "murder"
        ]
    },
    "183": {
        "link": "/wiki/Lynching_of_Samuel_Smith",
        "title": "Lynching of Samuel Smith",
        "date": "December 15, 1924",
        "year": "1924",
        "location": "Frank Hill Road, Nolensville, Tennessee",
        "state": "Tennessee",
        "place": "Nolensville",
        "county": "Williamson County",
        "paragraph": "Samuel Smith was a 15-year-old African-American youth who was lynched by a white mob, hanged and shot in Nolensville, Tennessee, on December 15, 1924. No one was ever convicted of the lynching.\nSmith's memory was honored in June 2017 with a plaque at St. Anselm Episcopal Church in Nashville; two other lynching victims from Nashville have also been memorialized there.\nNolensville is about 22 miles from Nashville. At 1 a.m. on December 13, 1924, a white grocer named Ike Eastwood reportedly heard noises outside his house, grabbed a gun, and found an African-American man, Jim Smith, in his garage. He thought Smith was stealing spark plugs from his car.[1][2] Eastwood shot Smith, but the man was joined by his nephew, Samuel Smith, age 15, who shot and wounded Eastwood. The grocer fired back, wounding the younger Smith as well.[1]\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "184": {
        "link": "/wiki/Campbell_County_Jane_Doe_(1985)",
        "title": "Redhead murders",
        "date": "",
        "year": "1985",
        "location": "",
        "state": "Tennessee",
        "place": "",
        "county": "",
        "paragraph": "\nThe Redhead murders is the media epithet used to refer to a series of unsolved homicides of redheaded females in the United States between October 1978 and 1992, believed to have been committed by an unidentified male serial killer. The murders believed to be related have occurred in states including Tennessee, Arkansas, Kentucky, Mississippi, Pennsylvania, and West Virginia.[1][2][3] The murders may have continued until 1992.[4][5][6] The victims, many remaining unidentified for years, were usually women with reddish hair, whose bodies were abandoned along major highways in the United States. Officials believe that the women were likely hitchhiking or may have engaged in sex work.[3][7]\nAuthorities are unsure how many people were responsible for these murders, if they were all performed by the same perpetrator(s), and how many victims there have been.[8] It is believed that there may have been a total of five to fourteen victims.[3][9][10] Of the presumed victims, four were identified by November 2018.[11][8][12][13] The suspect was informally called the \"Bible Belt Strangler\" in 2018, because of the territory where the bodies were found.\n",
        "type": [
            "murder"
        ]
    },
    "185": {
        "link": "/wiki/Campbell_County_High_School_shooting",
        "title": "Campbell County High School shooting",
        "date": "November 8, 2005 2:11 p.m. (EST)",
        "year": "2005",
        "location": "Jacksboro, Tennessee, United States",
        "state": "Tennessee",
        "place": "Jacksboro",
        "county": "Campbell County",
        "paragraph": "A school shooting occurred on November 8, 2005 at Campbell County Comprehensive High School in Jacksboro, Tennessee, United States, when a 15-year-old[1] freshman student shot the school principal and two assistant principals. One assistant principal, Ken Bruce, died as a result of the shooting.\nEarlier in the day, school principal Gary Seale received information that student Kenneth Bartley, Jr. was armed with a handgun. The incident began when Seale confronted Bartley inside the administration office. Then Bartley brandished his .22-caliber pistol and reportedly said, \"Yes, it's real. I'll show you. I never liked you anyway,\" and shot Seale. He later shot assistant principals Ken Bruce and Jim Pierce.[2] Bartley was soon disarmed by another teacher inside the office. Seale and Pierce were transported by helicopter to the University of Tennessee Medical Center, while Bruce was treated at St. Mary's Hospital in LaFollette. Bruce was later pronounced dead from his wounds, while both Seale and Pierce were seriously wounded.[3] When questioned, Bartley said that the gun belonged to his father, and he had stolen it to take to school with the intention of trading it for OxyContin.[4]\nAfter the shooting, all students were evacuated from class and Campbell County police used Alsatian police dogs to search the premises of Campbell County High School. The school was closed for the rest of the week and was reopened the following Monday.\n",
        "type": [
            "murder",
            "killing",
            "shooting"
        ]
    },
    "186": {
        "link": "/wiki/Bob_Schultz",
        "title": "Bob Schultz",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Louisville",
        "county": "Blount County",
        "paragraph": "Robert Duffy Schultz (November 27, 1923 – March 31, 1979) was an American professional baseball player. A left-handed pitcher, his career extended for 11 seasons (1946–56), including a full season (1952) and parts of three others in Major League Baseball as a member of the Chicago Cubs, Pittsburgh Pirates and Detroit Tigers. Nicknamed \"Bullet Bob\", Schultz stood 6 feet 3 inches (1.91 m) tall and weighed 200 pounds (91 kg). The native of Louisville, Kentucky, served in the United States Army Air Forces during World War II.[1]\nSchultz came to the Major Leagues at age 27 after posting seasons of 20, 16 and 25 victories in minor league baseball.[2] His 25-win season in 1950 was especially noteworthy as it came with the Nashville Vols of the Class AA Southern Association, who played their home games in a hitter's paradise called Sulphur Dell. Schultz lost only six decisions and finished second in the league in earned run average (2.68), just one one-hundredth of a point behind ERA champion Marv Rotblatt (2.67).[3] Schultz broke camp with the 1951 Cubs out of spring training and appeared in 17 games — ten as a starting pitcher — during the season's early months, but he was sent back to the minors after his last start July 13, when he was knocked out of the box after only one full inning in a start against the Brooklyn Dodgers.[4]\nSchultz spent the entire 1952 campaign with the Cubs, working in 29 games and winning six of nine decisions. In his finest outing, September 14 at Braves Field, Schultz pitched a ten-inning complete game victory over the Boston Braves, allowing only two runs and six hits — and winning the game for himself with an RBI double.[5] It would be his ninth and final victory in Major League Baseball.\n",
        "type": [
            "murder"
        ]
    },
    "187": {
        "link": "/wiki/Lynching_of_Henry_Choate",
        "title": "Lynching of Henry Choate",
        "date": "",
        "year": "",
        "location": "",
        "state": "Tennessee",
        "place": "Columbia",
        "county": "Maury County",
        "paragraph": "Henry Choate was an African-American man who was lynched by a mob in Columbia, Tennessee, on November 13, 1927.[1] Accused of having attacked a white girl, he was taken to the Columbia jail, from which a mob numbering hundreds of people sprang him. They killed him there, dragged him through the city behind a car, and than hanged the body from the courthouse.\nHenry Choate was eighteen years old when he was murdered. He was working on a road construction project in Coffee County, Tennessee, and went to Columbia on Armistice Day to visit his grandfather, Henry Clay Harlan, who was 85 years old, born into slavery, and lived about seven miles west of Columbia. During that visit a young white girl claimed she had been attacked by a young Black man. The sheriff of Maury County, Sam Wiley, brought in a pack of bloodhounds. Choate was arrested and put in the county jail, and the sheriff's wife, Mrs. Wiley, alerted the \"Negro cook of the jail\", Mrs. Ella Gant, that a group of men were going to come and kill Choate. Gant brought him cigarettes and told him the news, and that he should pray; he said he knew this was going to happen, but didn't pray and remained proud. When the mob came, Mrs. Wiley hid the keys and told the mob she wasn't going see \"an innocent boy hung\". But when a man started pounding at the jail door with a hammer, and the use of dynamite was threatened, she procured the key.[2] The mob, some 250 men,[3] opened the jail, got Choate out, and someone hit him with a hammer on the head. They then tied him to a truck (he had apparently died already) and dragged him through the streets, and up into the courthouse.[2] There he was hanged, from the second story of the County Courthouse in Columbia, which was still decorated for Armistice Day.[4]\nCoordinates: 35°36′54″N 87°2′40″W﻿ / ﻿35.61500°N 87.04444°W﻿ / 35.61500; -87.04444\n",
        "type": [
            "lynching",
            "murder"
        ]
    },
    "188": {
        "link": "/wiki/Benton_fireworks_disaster",
        "title": "Benton fireworks disaster",
        "date": "May 27, 1983 (1983-05-27)",
        "year": "1983",
        "location": "1278 Welcome Valley Road, Benton, Tennessee",
        "state": "Tennessee",
        "place": "Benton",
        "county": "Benton County",
        "paragraph": "\nThe Benton fireworks disaster was an industrial disaster that occurred on May 27, 1983, on a farm near Benton, Tennessee. A powerful explosion at an unlicensed fireworks factory producing illegal fireworks killed eleven and injured one, revealing the existence of the factory for the first time to law enforcement and the public. The initial explosion was heard more than 20 mi (32 km) away.\nThe event gained national attention, covered by multiple media outlets, and triggered a two-year federal investigation that eventually led to the conviction of 21 people including the owner of the factory, a man who was considered to be the mastermind, and several others from multiple states who conspired to manufacture, transport, and/or allow the fireworks manufactured at the operation to be transported. Investigators determined the factory to have been the largest and most profitable known illegal fireworks operation in US history.[1][2] The disaster was the deadliest event in US history involving illegal fireworks.[3]\n",
        "type": []
    }
}