[
    {
        "link": "/wiki/Michiyo_Fukaya",
        "title": "Michiyo Fukaya",
        "date": "",
        "year": "",
        "location": "",
        "state": "Vermont",
        "place": "",
        "county": "",
        "paragraph": "Michiyo Fukaya (25 April 1953 – 9 July 1987), also known as Michiyo Cornell, was a feminist poet and activist whose work played an important part in the lesbian and Asian American communities.[1] In 1979, Fukaya gave a speech entitled \"Living in Asian America: An Asian American Lesbian's Address Before the Washington Monument\" at the First National Third World Lesbian and Gay Conference.[2] Drawing a parallel between the oppression of men and women in Third World countries to the oppression experienced by lesbian and gay Asian Americans, she acknowledged they both stemmed from white racism.[3] Fukaya called attention to both racism in the lesbian and gay movement as well as heterosexism in the growing Asian American community.[4] Fukaya's writing appeared in publications such as Azalea: A Magazine by Third World Lesbians. Her poetry and prose is collected in A Fire Is Burning, It Is In Me: The Life and Writing of Michiyo Fukaya.[5][6]\nMichiyo suffered from depression for a significant part of her life and had a difficult time living as an Asian-American lesbian and single mother in Vermont. As a result, she committed suicide with a gunshot wound to the head on 9 July 1987 at only 34 years of age.[7]\n",
        "type": []
    },
    {
        "link": "/wiki/Edwin_Everett_Codman",
        "title": "Edwin Everett Codman",
        "date": "April 29, 1955(1955-04-29) (aged 79) Dorset, Vermont, United States",
        "year": "1955",
        "location": "",
        "state": "Vermont",
        "place": "Dorset",
        "county": "Bennington County",
        "paragraph": "\nEdwin Everett Codman (December 19, 1875 – April 29, 1955) was an American sculptor. His work was part of the sculpture event in the art competition at the 1932 Summer Olympics.[1] Codman committed suicide by shooting himself in 1955, after suffering from cancer for 2 years.[1]\n\n",
        "type": [
            "shooting"
        ]
    },
    {
        "link": "/wiki/Donald_DeMag",
        "title": "Donald DeMag",
        "date": "December 8, 1954(1954-12-08) (aged 31) Vermont State Prison, Windsor, Vermont, U.S.",
        "year": "1954",
        "location": "",
        "state": "Vermont",
        "place": "Windsor,",
        "county": "Windsor County",
        "paragraph": "Donald DeMag (December 15, 1922 – December 8, 1954) was the last person executed by the U.S. state of Vermont.\nDonald Edward DeMag was born in Burlington, Vermont on December 15, 1922.[1]\nPrior to his death sentence, DeMag had been sentenced to life imprisonment after being convicted of murder, and had escaped and been recaptured while trying to enter Canada.[2]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Murder_of_Michelle_Gardner-Quinn",
        "title": "Murder of Michelle Gardner-Quinn",
        "date": "",
        "year": "new 2006",
        "location": "",
        "state": "Vermont",
        "place": "Richmond",
        "county": "Chittenden County",
        "paragraph": "Michelle Gardner-Quinn (January 28, 1985 – October 2006) was an undergraduate at the University of Vermont who was kidnapped on October 7, 2006. Her body was later found along a road in the neighboring town of Richmond on October 13.\nIn the early morning hours of October 7, Gardner-Quinn was walking home in Burlington, Vermont to her campus dormitory after a night out with friends. She borrowed a cell phone from a passerby, Brian Rooney, to call an acquaintance. A jewelry store surveillance camera captured Gardner-Quinn walking east with Rooney at approximately 2:34 am. Six days later, her body was found by hikers near Huntington Gorge in Richmond, Vermont. An autopsy revealed she had been sexually assaulted, beaten and strangled.\nAt a press conference on October 13, police announced that they had found Gardner-Quinn's body and arrested Brian L. Rooney (born June 27, 1970) on separate charges unrelated to the case.  Rooney, a construction worker with several prior arrests, is facing charges from neighboring Caledonia County that pertain to sexual assault and lewd conduct with a child. Federal charges were filed against Rooney as of 1998. He had also been charged with lewd and lascivious conduct with a minor in Essex County, about 80 miles east of Burlington, and with sexual assault on a minor and on an 18-year-old woman. Rooney is believed to have used an ether-soaked cloth to subdue and incapacitate the woman. A former girlfriend with whom he had a child has said that he threatened to kill her on numerous occasions. According to court documents, Rooney is believed to have three children with as many mothers.\n",
        "type": [
            "murder",
            "assault",
            "kidnapped",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/Alfred_H._Conrad",
        "title": "Alfred H. Conrad",
        "date": "October 18, 1970(1970-10-18) (aged 46) Peacham, Vermont",
        "year": "1970",
        "location": "",
        "state": "Vermont",
        "place": "Peacham",
        "county": "Caledonia County",
        "paragraph": "Alfred Haskell Conrad (January 2, 1924 – October 18, 1970)[1] was a distinguished professor of economics at Harvard University and City College of New York. He belonged to the quantitative economic current called new economic history, or cliometrics.\nConrad attended Brooklyn Boys High and in 1947 graduated from Harvard College. There he completed a doctorate in economics in 1954 and later taught in the economics department and in the business school.\nIn 1958 he co-authored \"The Economics of Slavery in the Antebellum South\", in the Journal of Political Economy, with John R. Meyer. Using rigorous statistics, the authors concluded that the view that slavery would have disappeared without the American Civil War was \"a romantic hypothesis which will not stand against the facts\". This study anticipated Time on the Cross by Robert Fogel and Stanley Engerman, which reached the same conclusion.[2]\n",
        "type": []
    },
    {
        "link": "/wiki/Emeline_Meaker",
        "title": "Emeline Meaker",
        "date": "March 30, 1883(1883-03-30) (aged 44) Vermont State PrisonWindsor County, Vermont",
        "year": "1883",
        "location": "",
        "state": "Vermont",
        "place": "Vermont State",
        "county": "Washington County",
        "paragraph": "Emeline Lucy Meaker (sometimes reported as Lucy Emeline Meaker) (June 1838 – March 30, 1883) was the first woman who was legally executed by Vermont.  In 1883, Meaker was convicted of and hanged for the murder of her husband's niece Alice in Duxbury, Vermont.\nSometime in the spring of 1879, a child welfare worker approached Meaker and her husband to ask if they would consider taking Mr. Meaker's eight-year-old niece, Alice and her brother, Henry, into their home, as the children were living in an overcrowded orphanage.[1][2] Mr. Meaker was offered a stipend of US$400 (equivalent to $11,633 in 2021) to care for Alice, and so he agreed. Emeline Meaker was not pleased with the arrangement and beat, starved, and otherwise mistreated Alice.[1][2]\nMeaker decided to kill Alice, and ordered her son Almon to get a lethal dose of strychnine from an apothecary. On April 23, 1880, Meaker and Almon seized Alice, placed a sack over the girl's head, and took her to a remote area outside Waterbury, Vermont, near what is now Little River State Park. When they arrived at a clearing by a stream, Almon handed the poison to his mother and she poured it into a drink which she gave to Alice. While Alice thrashed about in reaction to the strychnine poisoning, Meaker forcibly held her hand over Alice's mouth to keep the girl from crying out, keeping it there until Alice was dead, and then Almon and his mother buried Alice's body.[1][2]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Gary_Schaefer",
        "title": "Gary Schaefer",
        "date": "",
        "year": "",
        "location": "",
        "state": "Vermont",
        "place": "Springfield",
        "county": "Windsor County",
        "paragraph": "Gary Lee Schaefer (born 1951) is an American murderer, kidnapper, rapist and suspected serial killer thought to be responsible for the murders of three girls in Springfield, Vermont between 1979 and 1983. He confessed to two of these murders and remains a suspect in the third, but was convicted of only one and sentenced to a 30-year-to-life sentence.\nGary Lee Schaefer was born in 1951 in Allentown, Pennsylvania, one of several children born to Edwin and June Schaefer. Sometime during his childhood, the entire family moved to Springfield, Vermont, where they joined a closely-knit Christadelphian congregation based in the city.[1] From a young age, Schaefer was considered as an overtly quiet, yet very friendly and reliable child who constantly did what he was told without any objections.[2] While studying at the Springfield High School, he took part in the school's cross country running and track and field teams, where it was said that he showed a lot of athletic potential. After graduating in 1970, Schaefer enlisted in the Navy (Christadelphian churches do not allow their members to be recruited into the armed forces generally), where he served from April 1975 to 1981, being stationed at Naval Station Great Lakes; Orlando, Florida; Bethesda, Maryland; Newport, Rhode Island and Norfolk, Virginia.[3] Later on, it would be revealed that he was court-martialed for setting fire to his apartment, for which he served a 13-month sentence at a military facility in Norfolk.[4] He had married his wife Arlene while working at a hospital in Falmouth, Massachusetts, with whom he had two a daughter, Jodie, and a young son, who passed away from SIDS. She and Schaefer's living daughter later moved to North Charleston, South Carolina.[5]\nUpon his return to Springfield, Schaefer got a job as an auto mechanic at Soucy Motors, where he was described as a good employee who never created trouble.[2] In addition, he was also an active member of his church, working as a custodian and sometimes even giving sermons on the Bible to younger churchgoers,[6] and took care of his mother after his father passed away from cancer on April 10, 1982.[2] Accounts from friends and family report that favorite hobby outside of church duty was to cruise around town in his car, playing Styx songs.[3] Despite these positive qualities, Schaefer was still considered a loner, was divorced and still lived on the family farmhouse.[2]\n",
        "type": [
            "murder",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/Lucina_C._Broadwell",
        "title": "Lucina C. Broadwell",
        "date": "",
        "year": "new 1919",
        "location": "",
        "state": "Vermont",
        "place": "Barre",
        "county": "Washington County",
        "paragraph": "Lucina Courser Broadwell was murdered in Barre, Vermont, United States on May 4, 1919.[1]\nThe killing of a 29-year-old mother of three shocked and consumed the community of 17,000 during the summer and fall of 1919. Her death was considered \"one of the most horrendous crimes to take place in Vermont up to that time.\"[2] Mrs. Broadwell's body was buried in Johnson, Vermont, on May 7, 1919.[3] The case continues to inspire writers and theorists.\nLittle is known about Lucina Courser Broadwell's early life. Lucina was born on July 26, 1889.[1] She was raised by her parents, Mr. and Mrs. George Courser, in Johnson, Vermont.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    {
        "link": "/wiki/Michelle_Gardner-Quinn",
        "title": "Murder of Michelle Gardner-Quinn",
        "date": "",
        "year": "new 2006",
        "location": "",
        "state": "Vermont",
        "place": "Richmond",
        "county": "Chittenden County",
        "paragraph": "Michelle Gardner-Quinn (January 28, 1985 – October 2006) was an undergraduate at the University of Vermont who was kidnapped on October 7, 2006. Her body was later found along a road in the neighboring town of Richmond on October 13.\nIn the early morning hours of October 7, Gardner-Quinn was walking home in Burlington, Vermont to her campus dormitory after a night out with friends. She borrowed a cell phone from a passerby, Brian Rooney, to call an acquaintance. A jewelry store surveillance camera captured Gardner-Quinn walking east with Rooney at approximately 2:34 am. Six days later, her body was found by hikers near Huntington Gorge in Richmond, Vermont. An autopsy revealed she had been sexually assaulted, beaten and strangled.\nAt a press conference on October 13, police announced that they had found Gardner-Quinn's body and arrested Brian L. Rooney (born June 27, 1970) on separate charges unrelated to the case.  Rooney, a construction worker with several prior arrests, is facing charges from neighboring Caledonia County that pertain to sexual assault and lewd conduct with a child. Federal charges were filed against Rooney as of 1998. He had also been charged with lewd and lascivious conduct with a minor in Essex County, about 80 miles east of Burlington, and with sexual assault on a minor and on an 18-year-old woman. Rooney is believed to have used an ether-soaked cloth to subdue and incapacitate the woman. A former girlfriend with whom he had a child has said that he threatened to kill her on numerous occasions. According to court documents, Rooney is believed to have three children with as many mothers.\n",
        "type": [
            "murder",
            "assault",
            "kidnapped",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/George_R._Long",
        "title": "Lucina C. Broadwell",
        "date": "",
        "year": "new 1919",
        "location": "",
        "state": "Vermont",
        "place": "Barre",
        "county": "Washington County",
        "paragraph": "Lucina Courser Broadwell was murdered in Barre, Vermont, United States on May 4, 1919.[1]\nThe killing of a 29-year-old mother of three shocked and consumed the community of 17,000 during the summer and fall of 1919. Her death was considered \"one of the most horrendous crimes to take place in Vermont up to that time.\"[2] Mrs. Broadwell's body was buried in Johnson, Vermont, on May 7, 1919.[3] The case continues to inspire writers and theorists.\nLittle is known about Lucina Courser Broadwell's early life. Lucina was born on July 26, 1889.[1] She was raised by her parents, Mr. and Mrs. George Courser, in Johnson, Vermont.\n",
        "type": [
            "murder",
            "killing"
        ]
    },
    {
        "link": "/wiki/Howard_E._Armstrong",
        "title": "Howard E. Armstrong",
        "date": "",
        "year": "",
        "location": "",
        "state": "Vermont",
        "place": "Bennington",
        "county": "Bennington County",
        "paragraph": "Howard Edwin Armstrong (April 19, 1903 – October 7, 1983) was a public official in Vermont who served as Secretary of State for sixteen years.\nArmstrong was born in Bennington, Vermont on April 19, 1903,[1][2] the son of Marcus P. Armstrong (1864-1928) and Alice J. Cordes (1868-1953).[2]  He graduated from Bennington High School in 1922, and attended the University of Vermont from 1922 to 1923.[1]  He decided on a legal career, and studied law with Harry Chase of Bennington, and in the Ludlow office of William W. Stickney and John G. Sargent.[1]  Armstrong was admitted to the bar in 1926.[1]\nA Republican, Armstrong served as second assistant clerk of the Vermont House of Representatives in  1925, and was the House Clerk from 1927 to 1933.[3]  He was Secretary of Civil and Military Affairs (chief assistant) to Governor Charles Manley Smith in 1935.[3]  Armstrong served as the state Commissioner of Industries from 1936 to 1939, and Commissioner of Industrial Relations from 1939 to 1949.[3]\n",
        "type": []
    },
    {
        "link": "/wiki/Patrick_Villiers_Farrow",
        "title": "Patrick Villiers Farrow",
        "date": "June 15, 2009(2009-06-15) (aged 66) Castleton, Vermont, U.S.",
        "year": "2009",
        "location": "",
        "state": "Vermont",
        "place": "Castleton",
        "county": "Rutland County",
        "paragraph": "\nPatrick Villiers Farrow (November 27, 1942 – June 15, 2009) was an American sculptor and a peace and environmental activist.[1][2]\nFarrow was the son of actress Maureen O'Sullivan and writer-director-producer John Villiers Farrow. He had one older brother, Michael, and five younger siblings, including actresses Mia and Tisa, John, Prudence, and Stephanie. He grew up in Beverly Hills and went abroad to Spain and England.\n",
        "type": []
    },
    {
        "link": "/wiki/Brian_L._Rooney",
        "title": "Murder of Michelle Gardner-Quinn",
        "date": "",
        "year": "new 2006",
        "location": "",
        "state": "Vermont",
        "place": "Richmond",
        "county": "Chittenden County",
        "paragraph": "Michelle Gardner-Quinn (January 28, 1985 – October 2006) was an undergraduate at the University of Vermont who was kidnapped on October 7, 2006. Her body was later found along a road in the neighboring town of Richmond on October 13.\nIn the early morning hours of October 7, Gardner-Quinn was walking home in Burlington, Vermont to her campus dormitory after a night out with friends. She borrowed a cell phone from a passerby, Brian Rooney, to call an acquaintance. A jewelry store surveillance camera captured Gardner-Quinn walking east with Rooney at approximately 2:34 am. Six days later, her body was found by hikers near Huntington Gorge in Richmond, Vermont. An autopsy revealed she had been sexually assaulted, beaten and strangled.\nAt a press conference on October 13, police announced that they had found Gardner-Quinn's body and arrested Brian L. Rooney (born June 27, 1970) on separate charges unrelated to the case.  Rooney, a construction worker with several prior arrests, is facing charges from neighboring Caledonia County that pertain to sexual assault and lewd conduct with a child. Federal charges were filed against Rooney as of 1998. He had also been charged with lewd and lascivious conduct with a minor in Essex County, about 80 miles east of Burlington, and with sexual assault on a minor and on an 18-year-old woman. Rooney is believed to have used an ether-soaked cloth to subdue and incapacitate the woman. A former girlfriend with whom he had a child has said that he threatened to kill her on numerous occasions. According to court documents, Rooney is believed to have three children with as many mothers.\n",
        "type": [
            "murder",
            "assault",
            "kidnapped",
            "kidnapping"
        ]
    },
    {
        "link": "/wiki/Disappearance_of_Brianna_Maitland",
        "title": "Disappearance of Brianna Maitland",
        "date": "",
        "year": "new 1986",
        "location": "",
        "state": "Vermont",
        "place": "54′41″N",
        "county": "Franklin County",
        "paragraph": "\nCoordinates: 44°54′41″N 72°39′34″W﻿ / ﻿44.911307°N 72.659527°W﻿ / 44.911307; -72.659527\nBrianna Alexandra Maitland (born October 8, 1986; disappeared March 19, 2004) is an American teenager who disappeared after leaving her job at the Black Lantern Inn in Montgomery, Vermont. She was 17 years old at the time. Maitland's car was discovered the following day, backed into the side of an abandoned house about a mile (1.6 km) away from her workplace. She has not been seen or heard from since. Due to a confluence of circumstances, several days passed before Maitland's friends and family reported her missing.\nIn the days and weeks following her disappearance, numerous tips were investigated by state law enforcement, including a claim that Maitland was being held captive in a house occupied by local drug dealers of whom she was an acquaintance; however, none of the tips resulted in her discovery. An alleged 2006 sighting of Maitland at a casino in Atlantic City, New Jersey, brought renewed interest to the case, but the woman seen was never properly identified. In 2012, law enforcement investigated a possible connection between Maitland's disappearance and serial killer Israel Keyes, who committed numerous rapes and murders in Vermont, New York, and throughout the Pacific Northwest, but he was ultimately ruled out as a suspect by the FBI.\n",
        "type": [
            "murder",
            "rape"
        ]
    },
    {
        "link": "/wiki/Mary_Rogers_(murderer)",
        "title": "Mary Rogers (murderer)",
        "date": "December 8, 1905(1905-12-08) (aged 22) Windsor, Vermont",
        "year": "1905",
        "location": "",
        "state": "Vermont",
        "place": "Windsor",
        "county": "Windsor County",
        "paragraph": "Mary Mabel Bennett Rogers (March 9, 1883 – December 8, 1905) was the last woman legally executed by Vermont.[1] Rogers was hanged for the 1902 murder of her husband, Marcus Rogers.\nMary Mabel Bennett was born to Charles and Johanna Bennett. Her father was reportedly a mentally ill alcoholic who was unable to hold down a job.  As a result, he was abusive and tried to kill her a number of times.\nAt age 15, Mary Bennett married Marcus Rogers. She was noted for being immature and restless, and often stayed away from home when she was upset with her husband.[2]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/List_of_people_executed_in_Vermont",
        "title": "List of people executed in Vermont",
        "date": "",
        "year": "",
        "location": "",
        "state": "Vermont",
        "place": "",
        "county": "",
        "paragraph": "\n\n\nThe following is a list of people executed by the U.S. state of Vermont from 1778 to 1954.\nCapital punishment was abolished in Vermont in 1972.[1] From 1778-1954, 26 people were executed in Vermont, 21 by hanging and 5 by electrocution.[2] 24 of the executions were of males, while 2 were of females.[2]\n",
        "type": []
    },
    {
        "link": "/wiki/Elizabeth_Weatherup",
        "title": "Donald DeMag",
        "date": "December 8, 1954(1954-12-08) (aged 31) Vermont State Prison, Windsor, Vermont, U.S.",
        "year": "1954",
        "location": "",
        "state": "Vermont",
        "place": "Windsor,",
        "county": "Windsor County",
        "paragraph": "Donald DeMag (December 15, 1922 – December 8, 1954) was the last person executed by the U.S. state of Vermont.\nDonald Edward DeMag was born in Burlington, Vermont on December 15, 1922.[1]\nPrior to his death sentence, DeMag had been sentenced to life imprisonment after being convicted of murder, and had escaped and been recaptured while trying to enter Canada.[2]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Connecticut_River_Valley_Killer",
        "title": "Connecticut River Valley Killer",
        "date": "",
        "year": "",
        "location": "",
        "state": "Vermont",
        "place": "Saxtons River",
        "county": "Windham County",
        "paragraph": "The Connecticut River Valley Killer is the name given to an unidentified American serial killer believed to be responsible for a series of stabbing murders mostly in and around Claremont, New Hampshire and the Connecticut River Valley, primarily in the 1980s.\nIn the mid 1980s, three young women disappeared around Claremont. In 1985 and 1986, the skeletal remains of two of the women were recovered within a thousand feet of each other in a wooded area in Kelleyville, New Hampshire. The condition of the remains made the cause of death difficult to determine, but certain factors pointed to multiple stab wounds. Between the recovery of the first and second bodies, a 36-year-old woman was stabbed to death in a frenzied attack inside her home in Saxtons River, Vermont. Ten days later, the remains of the third missing woman were found; an autopsy again revealed evidence of multiple stab wounds.\nAt this point, investigators began examining prior homicides in the area and found two previous cases, in 1978 and 1981, that further reinforced the presence of a burgeoning serial killer. At the peak of the investigation, and after additional homicides and one non-fatal attack, investigators noted similarities in modus operandi, often-used dump sites, and specific wound patterns that linked many of the murders, suggesting a common perpetrator.\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Marcus_Rogers",
        "title": "Mary Rogers (murderer)",
        "date": "December 8, 1905(1905-12-08) (aged 22) Windsor, Vermont",
        "year": "1905",
        "location": "",
        "state": "Vermont",
        "place": "Windsor",
        "county": "Windsor County",
        "paragraph": "Mary Mabel Bennett Rogers (March 9, 1883 – December 8, 1905) was the last woman legally executed by Vermont.[1] Rogers was hanged for the 1902 murder of her husband, Marcus Rogers.\nMary Mabel Bennett was born to Charles and Johanna Bennett. Her father was reportedly a mentally ill alcoholic who was unable to hold down a job.  As a result, he was abusive and tried to kill her a number of times.\nAt age 15, Mary Bennett married Marcus Rogers. She was noted for being immature and restless, and often stayed away from home when she was upset with her husband.[2]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/George_Floyd_protests_in_Vermont",
        "title": "George Floyd protests in Vermont",
        "date": "May 30, 2020 – June 7, 2020",
        "year": "2020",
        "location": "Vermont, United States",
        "state": "Vermont",
        "place": "",
        "county": "",
        "paragraph": "\nThis is a list of protests in the U.S. State of Vermont related to the murder of George Floyd.\nOn June 5, about 300 people marched through the streets in support of Black Lives Matter and held a moment of silence for eight minutes and forty-six seconds to honor George Floyd.[3]\n",
        "type": [
            "murder",
            "riot"
        ]
    },
    {
        "link": "/wiki/Carl_Drega",
        "title": "Carl Drega",
        "date": "August 19, 1997",
        "year": "1997",
        "location": "",
        "state": "Vermont",
        "place": "Colebrook",
        "county": "Bennington County",
        "paragraph": "Carl Drega (January 19, 1935 – August 19, 1997) was an American spree killer who killed four people in Colebrook, New Hampshire, on August 19, 1997.\nDrega had several long-term disputes with town and state government officials over his property in Columbia since the early 1980s. Drega shot and killed two New Hampshire state troopers, a judge and a newspaper editor in Colebrook and wounded four other law enforcement officers before being shot to death in a gunfight with police in Bloomfield, Vermont.\nCarl Drega was born on January 19, 1935, in New Haven, Connecticut, to Polish immigrants.[1] He claimed to have served in the U.S. military during the Korean War.[1] Drega later worked in construction and lived in Manchester, New Hampshire, later moving into a home in Bow, New Hampshire, he built for himself and his wife Rita from 1969 to 1970.[1] However, Rita was diagnosed with cancer the following year and died in 1972.[1]\n",
        "type": [
            "murder"
        ]
    },
    {
        "link": "/wiki/Capital_punishment_in_Vermont",
        "title": "Capital punishment in Vermont",
        "date": "",
        "year": "",
        "location": "",
        "state": "Vermont",
        "place": "",
        "county": "",
        "paragraph": "\nCapital punishment in the state of Vermont ended in 1972 for all crimes due to Furman v. Georgia and has not been reinstated since. Vermont still has pre-Furman capital statutes on the books but these have been left unenforceable due to Furman. Most states changed their capital punishment laws to conform with Furman and Gregg v. Georgia, but the Vermont legislature has yet to do so, effectively abolishing the death penalty in the state.[1][2][3] The state last executed a prisoner, Donald DeMag, in 1954, after he received the sentence for a double robbery-murder he committed after escaping prison.\nAlthough DeMag was the last person executed by Vermont, he was not the last person to be sentenced to death by a Vermont court. Lionel Goyet, a soldier who was Absent Without Leave for the fifth time, robbed and killed a farmhand, and was sentenced to death in 1957.[4]  His sentence was commuted six months later,[5] and Goyet was conditionally pardoned in 1969.[6] He had no further problems with the law, and died of heart failure in 1980.[7]\nVermont still has a pre-Furman statute providing death by electrocution for treason, though the state's execution chamber has since closed.[8]\n",
        "type": [
            "murder",
            "robbery",
            "robber"
        ]
    },
    {
        "link": "/wiki/Crean_Brush",
        "title": "Crean Brush",
        "date": "",
        "year": "",
        "location": "",
        "state": "Vermont",
        "place": "Cumberland County",
        "county": "Chittenden County",
        "paragraph": "\nCrean Brush (c. 1725 – May 1778) was an 18th-century Irish-born Loyalist, \"Yorker\", and Tory from Cumberland County, New Hampshire Grants (present-day Vermont). He is remembered as one of the \"notorious Yorkers\" who resided for some time in eastern Vermont, and for his participation in Loyalist armies during the American Revolution.[1]\nCrean Brush was born in Dublin, Ireland, about the year 1725.[2] Educated for the bar, he held a military office prior to emigrating to the Thirteen Colonies in British America, reaching New York City before 1762. There he married his second wife, Margaret Montuzan.[1]\nBrush was first employed by the deputy secretary of the Province of New York, Goldsbrow Banyar, and in 1761 was licensed as an attorney in all of the king's courts in the province. It is supposed he became associated in this profession with John Kelly, who also figures in the Vermont records.[1] In New York, he found employment in the office of the Provincial Secretary.[2]\n",
        "type": []
    }
]